{
  "CoinDesk": [
    {
      "title": "Bitcoin Tops $111K, on Brink of Breaking Record High; Ether's 6% Jump Leads Major Cryptos",
      "link": "https://www.coindesk.com/markets/2025/07/09/bitcoin-tops-111k-on-brink-of-breaking-record-high-ethers-6-jump-leads-major-cryptos",
      "summary": ""
    },
    {
      "title": "Revolut Seeks $1B in New Funding at $65B Valuation: FT",
      "link": "https://www.coindesk.com/business/2025/07/09/revolut-seeks-1b-in-new-funding-at-65b-valuation-ft",
      "summary": ""
    },
    {
      "title": "Cathie Wood's ARK: Bitcoin's Bullish Momentum Slows as Long-Term Holder Stacks Hit Record",
      "link": "https://www.coindesk.com/markets/2025/07/09/cathie-woods-ark-bitcoins-bullish-momentum-slows-as-long-term-holder-stacks-hit-record",
      "summary": ""
    },
    {
      "title": "FLOKI Lists on Webull Pay, Unlocking Access to 24M Users Amid Volatile Trading",
      "link": "https://www.coindesk.com/markets/2025/07/09/floki-lists-on-webull-pay-unlocking-access-to-24m-users-amid-volatile-trading",
      "summary": ""
    },
    {
      "title": "Greece Makes First Crypto Seizure Tied to North Korea's $1.5B Bybit Hack",
      "link": "https://www.coindesk.com/business/2025/07/09/greece-makes-first-crypto-seizure-tied-to-north-koreas-15b-bybit-hack",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Chinese creditor challenges FTX motion to halt payouts in restricted countries",
      "link": "https://cointelegraph.com/news/creditor-objection-ftx-payouts-restricted-countries?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MmZmMDctZDVhZi03ZjRlLTkzZjEtZThmZjYxN2M2NTA0.jpg\" /></p><p>The motion to pause repayments to residents of certain countries has added a new wrinkle to the FTX saga.</p>"
    },
    {
      "title": "Donald Trump Jr. invests in social media-turned BTC treasury firm",
      "link": "https://cointelegraph.com/news/donald-trump-jr-social-media-turned-btc-treasury?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2YwYjQtNzg0My03OGY0LWE1YmQtMjNhMjc4ZDVlN2Ux.jpg\" /></p><p>The Thumzup Media Corporation provides a platform for influencers to market various products on social media to earn revenue.</p>"
    },
    {
      "title": "US debt rises to $36.6T: Will recession signals send Bitcoin back to $95K?",
      "link": "https://cointelegraph.com/news/us-debt-rises-to-36-6t-will-recession-signals-send-bitcoin-back-to-95k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2YwZmMtNGRkYy03NGFiLWIzODQtNzhiNWE5MzNmMjYx.jpg\" /></p><p>Bitcoin price hit new highs today, but surging US debt and concerning housing data raise fears of a recession-led Bitcoin drop toward $95,000.</p>"
    },
    {
      "title": "Trump family-backed business votes on making governance token tradable",
      "link": "https://cointelegraph.com/news/world-liberty-financial-voting-governance-token-tradable?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzExNTMtM2MxMy03YWMxLWEyYzAtNDEwYWFlNjg3ZTYy.jpg\" /></p><p>The proposal, which launched voting on Wednesday, had more than 99% support from roughly five billion tokens at the time of publication.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Greece recovers part of funds stolen in Bybit hack as its first crypto asset seizure",
      "link": "https://cryptoslate.com/greece-recovers-part-of-funds-stolen-in-bybit-hack-as-its-first-crypto-asset-seizure/",
      "summary": "<p>Greek authorities carried out the country’s first-ever crypto seizure after tracing funds linked to the record-breaking $1.4 billion hack of crypto exchange Bybit earlier this year. The Hellenic Anti-Money Laundering Authority issued a freezing order on a suspect wallet following a months-long investigation aided by blockchain analytics firm Chainalysis. The operation targeted funds allegedly stolen [&#8230;]</p> <p>"
    },
    {
      "title": "SEC Crypto Task Force head warns assets remain securities regardless of tokenization",
      "link": "https://cryptoslate.com/sec-crypto-task-force-head-warns-assets-remain-securities-regardless-of-tokenization/",
      "summary": "<p>Hester Peirce, head of the US Securities and Exchange Commission&#8217;s (SEC) Crypto Task Force, said that putting securities on a blockchain &#8220;does not have magical abilities to transform the nature of the underlying asset.&#8221; In a July 9 statement, Peirce emphasized that tokenized shares, notes, or entitlements &#8220;are still securities,&#8221; requiring issuers, intermediaries, and traders [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin hits fresh all-time high above $112k as traders parse new US tariff shock",
      "link": "https://cryptoslate.com/bitcoin-hits-fresh-all-time-high-above-112k-as-traders-parse-new-us-tariff-shock/",
      "summary": "<p>Bitcoin (BTC) reached a new all-time high of $112,040 on July 9, edging above the previous intraday peak of $111,917.37 recorded on May 22, TradingView data shows. The breakout arrived hours after President Donald Trump dispatched formal tariff letters to seven nations, unveiling duties of up to 30% that take effect Aug. 1. According to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitget latest CEX to expand into tokenized equity trading via xStocks integration",
      "link": "https://cryptoslate.com/bitget-latest-cex-to-expand-into-tokenized-equity-trading-via-xstocks-integration/",
      "summary": "<p>Bitget has rolled out tokenized stock trading on its Onchain platform, enabling crypto users to gain exposure to top global equities without relying on traditional brokerages. The move, announced on July 9, was made possible through an integration with Kraken&#8217;s recently launched xStocks infrastructure. The initial listings include tokenized versions of Tesla (TSLAx), Nvidia (NVDAx), [&#8230;]</p> <p>"
    },
    {
      "title": "US senators seek sanctions on El Salvador’s Nayib Bukele over Bitcoin misuse and human rights violations",
      "link": "https://cryptoslate.com/us-senators-seek-sanctions-on-el-salvadors-nayib-bukele-over-bitcoin-misuse-and-human-rights-violations/",
      "summary": "<p>A group of US Democratic senators has introduced a new bill to sanction El Salvador&#8217;s President Nayib Bukele and members of his administration. The legislation, titled the El Salvador Accountability Act (S.2058), was put forward by Senators Chris Van Hollen, Tim Kaine, and Alex Padilla. If passed, the bill would require President Donald Trump to [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Dogecoin To $3.94 This Cycle? This Chart Says It’s No Meme",
      "link": "https://www.newsbtc.com/news/dogecoin-to-3-94-this-cycle/",
      "summary": "In a monthly chart shared on July 8, crypto analyst Kevin (@Kev_Capital_TA) outlined a long-term bullish thesis for Dogecoin (DOGE), identifying a clear historical pattern that may signal the next major leg in its price trajectory. The focal point of the chart is the 1.618 Fibonacci extension—used as a key projection level—which Kevin implies is Dogecoin’s next major upside target. Based on the chart, this level corresponds to $3.94. History Says Dogecoin Will Hit $3.94 Dogecoin’s price action has followed a remarkably consistent macro-pattern across three major market phases. In each, DOGE formed a clear descending wedge, followed by an impulsive breakout and parabolic rally. These structures are annotated in yellow on the chart and preceded both the 2017 and 2021 bull runs. The most recent wedge breakout completed in November last year, with a retest of the breakout currently taking place. Kevin marks two historical Fibonacci extension levels that were reached following previous consolidations. Both peaked near the 1.618 Fibonacci extension of their respective bases—a common target for extended bullish moves in technical analysis. For the current structure, this places DOGE’s long-term Fibonacci target near $3.94, which would represent a roughly 2,218% move from the current price around $0.17. Related Reading: Chartist Slams Misleading Dogecoin Analysis: ‘Focus On This Instead’ Indicators further support the notion of a long-term base having formed. The RSI (Relative Strength Index) on the monthly chart has just reclaimed the neutral 50 zone, currently sitting at 50.39, a signal often interpreted as the transition from bearish to bullish control. In prior cycle, the monthly RSI always topped above 90. Notably, the monthly RSI is also in an uptrend since mid-2022, respecting the yellow trendline drawn by the analyst. A significant confluence comes from the Stochastic RSI, which has just completed a bottoming crossover in the oversold region. The last time this occurred, in early 2020, Dogecoin followed with a parabolic surge. This same dynamic now appears to be setting up again, echoing the previous cycle. Also noteworthy is the chart’s structural emphasis on 0.382 Fibonacci retracement support, currently plotted at $0.13778, from which Dogecoin appears to be bouncing. This aligns with the green supertrend support, suggesting a critical local floor has been found. Related Reading: The $1 Dogecoin Dream Is Alive: Chartist Lays Out Parabolic Scenario While the purple zones on the chart above $0.50 are not formal price targets, Kevin clarified in a response to a community member that they are key resistance zones—intermediary checkpoints before DOGE can make a full move toward its final Fibonacci extension. These zones span from approximately $1.00 to $1.20 as well as from $2.30 to $2.50, and eventually up toward the $3.94 range. Kevin emphasized that “as well as Dogecoin has done this cycle especially compared to other altcoins, it still has not even come close to what it is capable of. That will change in the right environment.” He further noted that Dogecoin has already seen a 10x move from its bear market low to the local highs, but believes “there’s still work to do” when the cycle of quantitative tightening by the US Federal Reserve ends. The chart and commentary triggered a strong community reaction. Users like @MonetaryRegimee declared “We always hit the 1.618,” to which Kevin replied, “Typically yes,” reinforcing his confidence in the fractal repetition. Others described the current price action as “the calm before the storm.” Whether Dogecoin ultimately fulfills its fractal-driven destiny toward $3.94 remains to be seen. But the historical technical symmetry laid out by Kevin’s chart offers a compelling case that DOGE’s long-term rally may be far from over. At press time, DOGE traded at $0.174. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Sei Network Unlocks Japan Market After Hitting $626M In TVL",
      "link": "https://www.newsbtc.com/altcoin/sei-network-unlocks-japan-market-after-hitting-626m-in-tvl/",
      "summary": "US traders and DeFi fans have turned their eyes to Sei Network (SEI) after its Total Value Locked (TVL) climbed past $626 million. That leap marks a huge rise from about $60 million at the start of 2024, showing a strong wave of new funds and fresh users staking assets on the chain. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 Sei Network TVL Rockets According to DeFiLlama, TVL on Sei surged from roughly $60 million in January 2024 to almost $700 million at its peak. That represents nearly a 10 × gain in just six months—growth most rival chains only manage in single‑digit or low double‑digit jumps of 10–50 % over the same stretch. Based on reports by crypto fans on X, this kind of TVL swing is very rare in today’s tight market. $SEI just set a new all-time high for Total Value Locked, climbing past $625 million. 📈 More capital flowing in, more on-chain activity picking up &#8211; the SEI ecosystem’s clearly pulling in fresh attention. pic.twitter.com/xqruXfoqVn — Kyledoops (@kyledoops) July 7, 2025 On‑Chain Activity Picks Up Crypto observer Kyledoops shared that daily transfers and smart‑contract calls on Sei have climbed steadily. “More capital is flowing in and on‑chain actions are rising,” he wrote. Some market observers say that some parts of the ecosystem saw 10–50 % jumps in TVL, with a few protocols posting even bigger gains. This buzz comes at a time when many DeFi projects are struggling to grow. Japan Approval Draws Investors Based on reports, a key boost arrived when Sei earned approval from the Japan Financial Services Agency. That nod gives it a regulated path into one of the world’s strictest crypto markets. Artemis Analytics noted that daily active addresses hit a two‑year high right after the JFSA greenlight. Institutions are said to be taking a closer look at trading and custody options in Tokyo. $SEI just received approval from Japan’s FSA It is required in Japan to be listed on exchanges so quite important. Once XRP received this, it had a HUGE rally 👀@SeiNetwork 🤝 — Gordon (@AltcoinGordon) July 4, 2025 Price Swings Test Support SEI’s token price more than doubled in June after a US government‑backed stablecoin pilot was announced and after SEI Labs proposed SIP‑3, a shift to an EVM‑only chain. Even with that jump, the coin still sits about 78 % below its March 2024 peak, trading around $0.26 today. Some technical analysts point to a chart floor at $0.25. A breach there could push SEI closer to $0.20, which would put pressure on holders who bought in at higher levels. Related Reading: 2% Of All XRP Is In His Hands — But Who Is He? Sei Price Forecast According to current projections, SEI is set to drop by 25% and reach $0.19 by August 8, 2025. Based on technical indicators, market sentiment remains Bullish while the Fear &#38; Greed Index sits at 66 (Greed). Over the last 30 days, SEI logged 17/30 (57%) green days and saw 19% price swings in that window. These figures suggest that short‑term dips could be sharp, but buyers may view lower prices as a chance to get in. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Pundit Says XRP’s Rise To $1,000 Will Happen A Lot Sooner Than Anticipated",
      "link": "https://www.newsbtc.com/analysis/xrp/xrps-to-1000-will-happen-soon/",
      "summary": "XRP might be currently trading around $2, but its path to double and four digits may be faster than imagined. Notably, a bold new forecast has shaken up the XRP community, as crypto analyst BarriC declared that the token could explode from $2 to $1,000 much faster than anyone expects. His comments have caused a bit of optimism among investors, many of whom are already eyeing a new all-time high as momentum builds following the cryptocurrency&#8217;s recent quarterly close above $2.25. XRP’s Rise To $1,000 Based On History Taking to the social media platform X, prominent analyst BarriC predicted that the XRP price will surge to $1,000 a lot sooner than most people anticipate. Notably, BarriC’s prediction of a surge draws on the cryptocurrency’s historical performance. Related Reading: Can The XRP Price Rally 1,538x To Reach $3,380? Shocking Prediction Back in 2017, XRP was trading at just $0.006 before launching into a parabolic bull run that took it as high as $3.40 by early 2018. Investors back then underestimated this move, and only a few were able to get in at the earliest. This $3.40 all-time high has been maintained by the altcoin for over seven years, but the situation might change very soon. The altcoin&#8217;s current price level, which is just above $2, is a mirror of that early accumulation phase. According to BarriC, investors today may similarly be underestimating how quickly XRP can move. “People buying XRP at $0.006 in 2017 weren’t expecting it to skyrocket to $3.80,” he wrote on X and suggested that a similar underestimation is happening today. Community Torn Between Hope And Doubt His claim, “XRP will skyrocket from $2 to $1,000 a lot sooner than people anticipate,” has been met with mixed reactions of both excitement and skepticism on the social media platform. Some community members were quick to support BarriC’s outlook, with one user responding, “XRP $1,400 is very realistic.” The statement was in reference to its 63,000% rise in the 2017-2018 bull run emphasized by BarriC. Another user commented that although XRP will definitely reach that price level, it won&#8217;t be very soon, and it will be &#8220;maybe sometime in 2030 to 2040.&#8221; Related Reading: Pundit Predicts XRP Price Will Surge 35,000% When These Two Things Happen Others, however, urged caution, pointing out that XRP is no longer an underdog. Unlike in 2017, XRP’s growth is now very much anticipated, which may dampen the element of surprise that helped its rally seven years ago. Another factor is the current state of the altcoin, along with the significant inflows that could lead to a rally of 63,000% from its current price level. One of the commenters noted that back in 2018, it was possible to invest as little as $6,000 and own as many as 1 million XRP tokens. Another community member noted that although XRP might not reach such an absurd price target, it is going to break out soon to around $10. At the time of writing, XRP is trading at $2.33, up by 2.6% in the past 24 hours. Reaching the $1,000 price target would translate to a 42,800% return from the current levels. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Is Dogecoin Prepping For Takeoff? Fib Reaction And Trend Support Say Yes",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-prepping-for-takeoff/",
      "summary": "Dogecoin may be gearing up for its next breakout. After holding firm near $0.17 on the weekly chart, DOGE recently bounced off key Fibonacci and trendline support, hinting at renewed bullish potential. With its 200‑week moving average offering steady support and price comfortably above the ascending channel, technicals suggest the setup is aligning. If the recent dip toward the 200 MA on the M15 chart proves to be a low-risk entry, this could set the stage for a retest of the $0.16490 resistance, and possibly more. Rejection At Resistance, But Technicals Still Favor Bulls In a recent analysis shared on X, Thomas Anderson presented a detailed breakdown of DOGE/USD price action across the M15 and M30 timeframes. According to the expert, Dogecoin is currently trading at $0.17043, and the price is facing rejection at the yellow horizontal resistance line around $0.16490. The price action shows consolidation just below this key level, signaling indecision among traders. Related Reading: Analysts Predict Major Dogecoin Price Rally After Breaking 50-Day Trendline Anderson pointed out that the 200 MA (red line) is acting as dynamic support from below, helping to anchor the price during the current consolidation phase. This moving average support provides bulls the foundation to regain control if momentum shifts in their favor. On the M30 chart, Anderson noted that the broader bullish structure remains intact, with DOGE price holding above the ascending trendline. This technical pattern suggests continued optimism for upward movement, provided the price does not break below key support areas. Thomas Anderson concluded that any pullback toward the 200 MA on the M15 timeframe could offer a buying opportunity, particularly for traders eyeing a retest of the $0.16490 resistance. Dogecoin Weekly Chart Echoes Elliott Theory’s Bullish Blueprint Taking a closer look at Dogecoin’s weekly chart, crypto analyst Andrew observed a notable long-term wave structure unfolding. He explained that over the past three years, DOGE has completed a five-wave impulse to the upside, which was followed by a typical ABC correction, consistent with Elliott Wave theory. Related Reading: Dogecoin (DOGE) Eyes Breakout — Can Bulls Unleash the Next Surge? Andrew further noted that price found a strong reaction at the 0.786 Fibonacci level, marked by a light blue line, which traces the retracement from the entire upward move. This reaction suggests that DOGE may have reached a critical support area, where buyers could begin stepping in. With this in mind, Andrew believes the current structure appears to be forming a larger 1-2 setup, which could lead to a powerful Wave 3 advance. If this pattern plays out, it may signal the start of a new bullish phase with the potential to break beyond previous highs. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "Ledger Offers a 30% Discount on Most Colors for Nano S Plus and Nano X Until July 15",
      "link": "https://www.newsbtc.com/crypto/30-discount-on-ledgers-nano-s-plus-and-nano-x-until-july-15/",
      "summary": "Ledger has announced a limited-time 30% discount on nearly all color models of its popular Nano S Plus and Nano X hardware wallets, valid through July 15. The promotion has drawn fresh attention to the company’s flagship products, widely regarded as industry benchmarks for secure crypto storage. Together, the Nano S Plus and Nano X boast 13,345 reviews, the majority of which are positive, underscoring the strong trust and satisfaction among users worldwide. But what makes Ledger such a popular hardware wallet? Ledger Wallet’s Blend of Security, Comfort, and Style – this is what makes them so attractive to its loyal fanbase and newbies alike. Ledger excels in the areas of security, comfort level, and overall style, but it’s the wallet’s security features that attract users. Ledger relies on a multi-layered security profile, with several noticeable features, like: ✅ The PIN code that secures the actual device to prevent unauthorized access is required to complete any transaction ✅ The 24-word phrase, which acts as the master key, secures your funds against any malicious access ✅ The trademark Blockchain Open Ledger Operating System (BOLOS), which isolates any installed apps from one another and the 24-word phrase from all apps and the operating system itself ✅ Secure Element Chip, the hardware component that keeps the private keys offline for a higher level of security Plus, Ledger’s Donjon team, which consists of seasoned hackers, is constantly testing the products’ security to identify any potential vulnerabilities. Their efforts are part of Ledger’s Bug Bounty program, which rewards anyone who finds security weaknesses in Bitcoin, showcasing the team’s commitment to continuous improvements in the security department. While security is the most important aspect, other features matter as well, like the comfort level associated with carrying and using the wallet. Ledger’s Nano S Plus and Nano X are the sleekest and most comfortable to use and wear, thanks to their slim builds. Nano S Plus consists of steel and plastic, weighing only 0.74 ounces, while Nano X is slightly larger, thanks to the lithium battery, reaching 1.19 ounces. The slim format makes them comfortable to wear, even as keychains if you always insist on having them with you. Finally, the color palette offers a final touch to the already unique style, imbuing the wallets with a modern vibe. Colors like emerald-green, sapphire-blue, and amethyst-purple come with a plus of personality and X factor. The Massive 30% Discount Ends on July 15 Ledger’s flash promotion (offering a 30% discount on its Nano S Plus and Nano X wallets) is set to end on July 15, giving buyers less than a week to take advantage. The deal aims to spotlight two of Ledger’s most widely used products, with a combined user base of around 7 million worldwide. Most color options are eligible, with only onyx-black and BTC-orange for the Nano X, and matte-black and BTC-orange for the Nano S Plus excluded from the promotion. Should You Buy the Ledger Wallet? Nobody can answer that for you, but if you’ve decided that the Ledger wallet meets your expectations in terms of security, style, and ease of use, and you want to buy it, buy it today. Or, at the very least, until July 15, when the current 30% promotion ends, because discounts like these don’t come often. Also, go to Ledger’s website and scroll through their offers. You’ll find a lot of products and accessories, based on your needs. Remember, this is not financial advice. Do your own research before buying any product."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Donald Trump Jr. Invests $4 Million in Bitcoin Treasury Company Thumzup Media",
      "link": "https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Donald-Trump-Jr.-Invests-4-Million-in-Bitcoin-Treasury-Company-Thumzup-Media.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media\" rel=\"nofollow\"> </a></p> <p>The social media firm, which reported just $151 in revenue last quarter, has drawn Trump Jr.’s interest after adopting a Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Myths Busted And Conflicts of Interest Noted at Senate Banking Crypto Market Structure Hearing",
      "link": "https://bitcoinmagazine.com/news/myths-busted-and-conflicts-of-interest-noted-at-senate-banking-crypto-market-structure-hearing",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Crypto-Market-Structure-Hearing-July-9-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/myths-busted-and-conflicts-of-interest-noted-at-senate-banking-crypto-market-structure-hearing\" rel=\"nofollow\"> </a></p> <p>U.S. senators and crypto specialists propose stipulations for digital asset market structure legislation while highlighting the reality of illicit financing on public blockchains and noting the Trump family’s crypto dealings.</p> <p>"
    },
    {
      "title": "Emirates Signs A Deal To Integrate Bitcoin And Crypto Payments",
      "link": "https://bitcoinmagazine.com/news/emirates-signs-a-deal-to-integrate-bitcoin-and-crypto-payments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Dubai-just-became-the-first-government-in-the-world-to-allow-people-to-pay-for-public-services-using-cryptocurrency-thanks-to-a-new-partnership-with-Crypto.com_.-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/emirates-signs-a-deal-to-integrate-bitcoin-and-crypto-payments\" rel=\"nofollow\"> </a></p> <p>Emirates has signed a memorandum of understanding with Crypto.com to integrate Bitcoin and crypto payments into its booking systems, marking a significant step toward mainstream adoption of Bitcoin in the travel industry. The agreement, signed in the presence of Emirates Chairman Sheikh Ahmed bin Saeed Al Maktoum, will enable customers to pay for flights using [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Expands Bitcoin Mining Operations to 750 PH/s, Targets 1.25 EH/s by Late Summer",
      "link": "https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Expands-Bitcoin-Mining-Operations-to-750-PHs-Targets-1.25-EHs-by-Late-Summer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer\" rel=\"nofollow\"> </a></p> <p>KULR Technology Group, Inc., a Bitcoin-first company focused on sustainable energy solutions, announced today the successful deployment of 3,570 Bitmain S19 XP 140T mining machines in Asuncion, Paraguay. This new infrastructure brings KULR’s total Bitcoin mining capacity to 750 petahash per second (PH/s), with a goal of reaching 1.25 exahash per second (EH/s) by late [&#8230;]</p> <p>"
    },
    {
      "title": "White Noise: Anonymous Nostr DMs and Encrypted Group Chat",
      "link": "https://bitcoinmagazine.com/news/white-noise-anonymous-nostr-dms-and-encrypted-group-chat",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Privacy-by-Design-Not-by-Policy-Horizontal.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/white-noise-anonymous-nostr-dms-and-encrypted-group-chat\" rel=\"nofollow\"> </a></p> <p>White Noise launches public alpha, integrating top of the line privacy encryption with Bitcoin powered messaging tech.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "AI Ghostwriting Is Creeping Into Science—Is That a Bad Thing?",
      "link": "https://decrypt.co/329426/ai-ghostwriting-creeping-science-bad-thing",
      "summary": "A new study of 15 million biomedical papers found telltale language patterns linked to ChatGPT, suggesting that AI tools are reshaping scientific writing far more than expected."
    },
    {
      "title": "'Just Salty': El Salvador President Bukele Mocks Senate Democrats Over Bitcoin Scrutiny",
      "link": "https://decrypt.co/329405/el-salvador-president-bukele-mocks-senate-democrats-bitcoin",
      "summary": "Senate Democrats want an investigation into Salvadoran president Nayib Bukele's use of crypto. The popular leader finds it hilarious."
    },
    {
      "title": "Bitcoin Surges to New All-Time High Price Above $112K",
      "link": "https://decrypt.co/329416/bitcoin-surges-all-time-high-price-above-112k",
      "summary": "The price of Bitcoin spiked to a new record price above $112,000 on Coinbase, continuing this year's trend of fresh peaks."
    },
    {
      "title": "Why a 'Mobile-First' Mentality Drove OpenSea's Latest Acquisition",
      "link": "https://decrypt.co/329360/why-mobile-first-mentality-drove-opensea-acquisition-rally",
      "summary": "Major NFT and token trading platform OpenSea will increase its mobile focus after acquiring the team behind crypto portfolio app Rally."
    },
    {
      "title": "Trump Ally Compares Crypto Industry Writing Its Own Rules to Spilled 'Urine Sample'",
      "link": "https://decrypt.co/329397/trump-ally-crypto-industry-regulation-spilled-urine-sample",
      "summary": "John Kennedy (R-LA) and other senators raised concerns about crypto market structure legislation during a Senate hearing Wednesday."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "SEC pushes back decision on in-kind creations and redemptions for BlackRock Ethereum ETF",
      "link": "https://cryptobriefing.com/sec-ethereum-etf-decision-delay/",
      "summary": "<p>The SEC's delay in approving in-kind processes for crypto ETFs may slow innovation and market efficiency in the digital asset space.</p> <p>"
    },
    {
      "title": "Bitcoin hits $112K new ATH after breaking past key resistance",
      "link": "https://cryptobriefing.com/bitcoin-hits-new-all-time-high-at-112k/",
      "summary": "<p>The surge in Bitcoin's value highlights increased institutional interest and regulatory optimism, but also underscores heightened market volatility.</p> <p>"
    },
    {
      "title": "Donald Trump Jr.-backed Thumzup to acquire Ether, XRP, Solana following board approval",
      "link": "https://cryptobriefing.com/bitcoin-treasury-strategy-trump-investment/",
      "summary": "<p>Thumzup's crypto expansion, despite financial losses, highlights a growing trend of Trump-affiliated ventures embracing digital assets.</p> <p>"
    },
    {
      "title": "Linda Yaccarino steps down as CEO of Elon Musk’s X ahead of Grok 4 launch",
      "link": "https://cryptobriefing.com/x-ceo-transition-grok-launch/",
      "summary": "<p>Yaccarino's departure may impact X's strategic direction, especially as it expands into AI and financial services, potentially altering its market position.</p> <p>"
    },
    {
      "title": "The Graph brings real time data streaming to TRON, providing builders with advanced blockchain insights",
      "link": "https://cryptobriefing.com/real-time-data-streaming-tron/",
      "summary": "<p>The Graph and TRON integration introduces real-time data streaming, enabling developers access to live blockchain insights and analytics.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Decoding Ethereum’s role as ‘a store of value’ – Can ETH hit $3.2K soon?",
      "link": "https://ambcrypto.com/decoding-ethereums-role-as-a-store-of-value-can-eth-hit-3-2k-soon/",
      "summary": "<img alt=\"Ethereum ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Benjamin-2025-07-09T135816.836.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ETH's speculative interest surpassed BTC - Can it boost prices?"
    },
    {
      "title": "AAVE flips Lido across ALL metrics – But is this just round one?",
      "link": "https://ambcrypto.com/aave-flips-lido-across-all-metrics-but-is-this-just-round-one/",
      "summary": "<img alt=\"AAVE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-4.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can Lido recover its lost dominance amid shrinking TVL and weakening structure?"
    },
    {
      "title": "How a new merger will support ReserveOne’s growing crypto reserves",
      "link": "https://ambcrypto.com/how-a-new-merger-will-support-reserveones-growing-crypto-reserves/",
      "summary": "<img alt=\"How a new merger will support ReserveOne&#039;s growing crypto reserves\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Benjamin-2025-07-09T172938.764.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Institutions continue to pile on crypto - Is yield the reason for the gold rush?"
    },
    {
      "title": "ICP coin price prediction: What rising commits and token accumulation reveal",
      "link": "https://ambcrypto.com/icp-coin-price-prediction-what-rising-commits-and-token-accumulation-reveal/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-09T134701.816_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ICP recorded 431.3 daily GitHub events, topping AI crypto development charts!"
    },
    {
      "title": "How Binance’s 37% Bitcoin volume share could affect BTC prices",
      "link": "https://ambcrypto.com/how-binances-37-bitcoin-volume-share-could-affect-btc-prices/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-09T114109.154-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Binance’s trading dominance and diverging metrics could determine whether Bitcoin accelerates or stalls."
    }
  ]
}