{
  "CoinDesk": [
    {
      "title": "Solana-Focused Upexi to Tokenize Shares; Added 56K SOL to Holdings",
      "link": "https://www.coindesk.com/business/2025/06/26/solana-focused-upexi-to-tokenize-shares-added-56k-sol-to-holdings",
      "summary": ""
    },
    {
      "title": "Crypto for Advisors: Crypto Hits Wall Street",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/25/crypto-for-advisors-crypto-hits-wall-street",
      "summary": ""
    },
    {
      "title": "AVAX Underperforms Broader Crypto Market as Short-Term 'Double Top' Pattern Emerges",
      "link": "https://www.coindesk.com/markets/2025/06/26/avax-underperforms-broader-crypto-market-as-short-term-double-top-pattern-emerges",
      "summary": ""
    },
    {
      "title": "NEAR Tumbles 5% as Altcoin Market Fails to Sustain Rally",
      "link": "https://www.coindesk.com/markets/2025/06/26/near-tumbles-5-as-altcoin-market-fails-to-sustain-rally",
      "summary": ""
    },
    {
      "title": "Real-World Asset Tokenization Market Has Grown Almost Fivefold in 3 Years",
      "link": "https://www.coindesk.com/business/2025/06/26/real-world-asset-tokenization-market-has-grown-almost-fivefold-in-3-years",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Can Bitcoin ETFs replace bonds in institutional portfolios?",
      "link": "https://cointelegraph.com/explained/can-bitcoin-etfs-replace-bonds-in-institutional-portfolios?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy84MjkxZThkODRjZGYxMTVhMTI2YzUxZGE0OTkyMTQ5MS5qcGc=.jpg\" /></p><p>As Bitcoin ETFs gain traction, some institutions are asking whether crypto can serve as a modern hedge. Can it really take the place of bonds?</p>"
    },
    {
      "title": "The multichain future might kill DeFi before it saves it",
      "link": "https://cointelegraph.com/news/multichain-kill-defi?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM1YjQtMjQzMS03ZDg5LTk2MjAtOTJkMWMwMTFlZTZi.jpg\" /></p><p>The explosion of new blockchains has fractured DeFi’s once-unified liquidity, threatening its core advantage of composability. Without infrastructure that seamlessly connects siloed markets, DeFi risks losing its revolutionary qualities.</p>"
    },
    {
      "title": "Bitcoin price starts &#039;normal and healthy&#039; support test as $108K halts bulls",
      "link": "https://cointelegraph.com/news/bitcoin-price-starts-normal-and-healthy-support-test-as-108k-halts-bulls?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FjOTktY2M2Ny03NTExLWI1NmItM2NiOGFmMmM4YWI0.jpg\" /></p><p>BTC price returns to retest recently reclaimed levels as Bitcoin analysis flags the 50-day moving average trendline as a \"buying opportunity.\"</p>"
    },
    {
      "title": "Pi2Day could change Pi network forever: Here’s what to know before June 28",
      "link": "https://cointelegraph.com/explained/pi2day-could-change-pi-network-forever-heres-what-to-know-before-june-28?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy85N2M2NDBkNWRiMzQ1MzQ5MzA3YzgwMDBjMTBlMTViMy5qcGc=.jpg\" /></p><p>Pi2Day 2025 brings key user-friendly upgrades, from a new KYC sync button solving verification roadblocks to expanded wallet access and enhanced security features.</p>"
    },
    {
      "title": "FBI busts alleged BreachForums admin ‘IntelBroker’ with $250 Bitcoin sting",
      "link": "https://cointelegraph.com/news/fbi-busts-intelbroker-breachforums-bitcoin-sting?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzEzODAtZDFjMy03ODRlLTk3YzItMDBhYzY3NzRmMTcx.jpg\" /></p><p>British national Kai West, known online as “IntelBroker,” has been indicted for allegedly selling stolen data on BreachForums, causing over $25 million in damages.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US judge denies SEC and Ripple’s second bid to amend penalty",
      "link": "https://cryptoslate.com/us-judge-denies-sec-and-ripples-second-bid-to-amend-penalty/",
      "summary": "<p>US District Judge Analisa Torres has denied a joint request from the US Securities and Exchange Commission (SEC) and Ripple Labs to dissolve an earlier court order and lower Ripple&#8217;s financial penalty. The ruling, issued on June 26, firmly rejected the attempt to undo a prior judgment tied to Ripple&#8217;s violations of securities laws through [&#8230;]</p> <p>"
    },
    {
      "title": "Indian ruling party spokesperson pushes Bitcoin reserve pilot, crypto regulation reform",
      "link": "https://cryptoslate.com/indian-ruling-party-spokesperson-pushes-bitcoin-reserve-pilot-crypto-regulation-reform/",
      "summary": "<p>A senior figure in India’s ruling Bharatiya Janata Party (BJP) has called for the country to consider integrating Bitcoin into its official reserve strategy. On July 26, Pradeep Bhandari, a spokesperson for the BJP, encouraged Indian policymakers to adopt a measured approach to Bitcoin, suggesting that even a small-scale pilot program could strengthen India’s economic [&#8230;]</p> <p>"
    },
    {
      "title": "Hong Kong expands digital asset agenda with unified rules, tokenization push",
      "link": "https://cryptoslate.com/hong-kong-expands-digital-asset-agenda-with-unified-rules-tokenization-push/",
      "summary": "<p>Hong Kong released a second policy statement to accelerate its digital asset (DA) development and reinforce its ambition to become a global leader in financial innovation. The latest statement, dated June 26 and dubbed &#8220;Policy Statement 2.0,&#8221; expands on the framework laid out in its initial release from October 2022. According to the Hong Kong [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin miners hold firm as daily revenues hit multi-month lows of $34 million",
      "link": "https://cryptoslate.com/bitcoin-miners-hold-firm-as-daily-revenues-hit-multi-month-lows-of-34-million/",
      "summary": "<p>Bitcoin miners are holding onto their assets even as mining profitability dips to multi-month lows, a new CryptoQuant report shared with shows. The data reveals that miner revenues dropped to $34 million on June 22, marking their weakest earnings since April 20. &#160; This comes amid a broader market pullback and a drop in [&#8230;]</p> <p>"
    },
    {
      "title": "Kraken secures MiCA license via Central Bank of Ireland to ensure EU operations continue",
      "link": "https://cryptoslate.com/kraken-secures-mica-license-via-central-bank-of-ireland-to-ensure-eu-operations-continue/",
      "summary": "<p>Kraken has become the first major global crypto exchange to secure a full Markets in Crypto-Assets (MiCA) license through the Central Bank of Ireland, enabling the company to offer regulated digital asset services across all 30 European Economic Area (EEA) countries. The license, granted June 26, positions Kraken ahead of the European Union’s year-end MiCA [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Reclaims $2,444 Level – Bullish Continuation In Focus",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-reclaims-2444-level-bullish-continuation-in-focus/",
      "summary": "Ethereum has bounced back sharply, reclaiming the $2,400 level after a volatile week marked by geopolitical tensions in the Middle East. Last weekend, ETH briefly dipped below the $2,200 mark as panic selling swept across global markets following US attacks on Iranian nuclear facilities. The sell-off triggered a sharp fakeout that briefly pushed ETH out of its multi-week trading range. However, bulls are regaining control, and Ethereum’s price action now signals the early stages of a potential recovery rally. Related Reading: Ethereum Gears Up For Breakout Above $2,800 – Bullish Momentum Builds Top analyst Ted Pillows shared a technical analysis highlighting that Ethereum is reclaiming the key $2,444 resistance level — a zone that previously acted as both support and resistance throughout May and June. If bulls maintain momentum above this threshold, it could open the door for a bullish continuation toward the higher end of the established range. While uncertainty remains due to lingering macroeconomic and geopolitical risks, Ethereum’s current structure shows renewed strength. Market participants are watching closely, as ETH often serves as a leading indicator for broader altcoin performance. Holding above $2,400 could become a catalyst for a broader rally, especially if Bitcoin continues to stabilize and approach new all-time highs. Ethereum Battles For Breakout As Market Awaits Direction Ethereum is trading at a critical juncture after a turbulent week of price action driven by geopolitical instability and macroeconomic uncertainty. Following a sharp drop below $2,200 amid panic selling over the Middle East conflict escalation, ETH has recovered significantly, now hovering around the $2,444 level. This price zone is key, not only as a technical resistance but also as a sentiment marker for traders watching for signs of a trend reversal or confirmation of a deeper pullback. Analysts remain divided on what comes next. Some believe Ethereum’s recent recovery could signal the beginning of a bullish continuation, especially if price action holds and pushes above the upper range levels near $2,600. A breakout from this zone would indicate renewed strength and could set the tone for a broader altcoin rally, particularly as Ethereum often leads sector momentum. Others, however, warn that the recovery might be short-lived, and a retreat to lower demand zones could occur if macro conditions worsen. Ted Pillows notes that Ethereum is currently reclaiming the $2,444 resistance level. He emphasizes that bullish continuation into the range highs is necessary to confirm breakout strength. Until then, traders are watching closely, as any rejection at this level could shift momentum back to the downside. With global tensions and monetary tightening from central banks continuing to influence markets, the coming weeks may determine whether ETH enters a new uptrend or retreats further into its long-standing consolidation range. Related Reading: Chainlink Reclaims Key Structure – Quiet Accumulation Could Fuel $25–$30 Surge ETH Faces Long-Term Resistance The weekly chart of Ethereum (ETH/USD) shows a strong recovery from the $2,189 low, with ETH currently trading at $2,463 — a 10.5% gain so far this week. This sharp bounce comes after a fakeout below the $2,200 level and suggests renewed buying pressure following recent geopolitical volatility. However, price is now testing a major confluence zone formed by the 50-week ($2,660), 100-week ($2,625), and 200-week ($2,437) simple moving averages. This cluster of moving averages is acting as resistance, capping ETH’s upside momentum. Historically, when Ethereum breaks through these long-term trend lines, a significant trend continuation follows. But for now, bulls must decisively clear this $2,450–$2,660 zone to confirm a breakout and open the door toward the $3,000 psychological level. Related Reading: Bitcoin Buy-Side Pressure Surges: Taker Buy Volume Spikes Sharply Volume has slightly increased, indicating rising interest, but the rejection wicks from prior weekly candles suggest the market remains indecisive. As long as ETH holds above the 200-week SMA ($2,437), the structure remains constructive, but a breakdown below it would likely reintroduce bearish sentiment. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Is The Bitcoin Top In? Bitcoin MVRV-Score Has The Answer",
      "link": "https://www.newsbtc.com/news/bitcoin/is-the-bitcoin-top-in/",
      "summary": "Bitcoin is starting to inch closer toward $110,000 again, recently pushing to an intraday high of $108,116 and now steadily trading above $107,000. Despite the retracement below $99,000 in the past week, Bitcoin&#8217;s current price action shows that the broader market is still bullish. Notably, the recent price action in the past 24 hours is beginning to quiet questions about whether Bitcoin has already reached its top for this cycle. The MVRV Z-Score may be offering a clear answer, and it points in a very different direction from what some might expect. MVRV Z-Score Says Bitcoin Has Room To Run According to crypto analyst Doctor Profit, who initially posted an on-chain analysis of Bitcoin on the social media platform X, the MVRV Z-Score indicates that BTC is still far from its cycle top. The MVRV Z-Score is an established on-chain metric used to determine whether Bitcoin is overvalued or undervalued. Related Reading: Bitcoin Top Is In And Price Is Headed For $92,000, Analyst Warns As pointed out by the analyst, the current level on the MVRV Z-Score metric is only slightly above 2, which has been a relatively neutral zone since Bitcoin&#8217;s creation. Bitcoin only reached its major tops in past cycles when this metric climbed into the red zone and above a value of around 8 and above. The overall Bitcoin price chart shared by Doctor Profit supports this claim. Peaks in the orange MVRV Z-Score line are shown with red shaded zones in the chart below. These red zones have aligned almost perfectly with Bitcoin&#8217;s price tops in 2011, 2013, 2017, and 2021. On the other hand, despite the recent surge to new all-time highs in May, the current cycle has yet to push BItcoin&#8217;s price into that overheated region. Instead, the chart shows the Z-Score still in a much lower band. This boils down to show that the Bitcoin price could have a very significant upside left. MVRV vs Price: What The Current Setup Means For Bitcoin One detail that stands out in the current cycle is the pattern of lower highs forming in the MVRV Z-Score, as seen in the chart. Unlike in old cycles, where the metric surged into extreme overvaluation zones above 10, the most recent peaks have been noticeably more subdued. This trend could be interpreted as a signal that the market is beginning to mature or that Bitcoin may even already be approaching the peak of its current cycle. Related Reading: Bitcoin Price Could Rally To $110,000 ATH As These Macroeconomic Factors Align However, although this pattern is worth keeping an eye on, it is far from conclusive. The only conclusive fact is that Bitcoin&#8217;s price has never reached a definitive cycle top until the MVRV Z-Score has pushed into the red zone, which it has yet to do this time around. Although there isn&#8217;t a set price peak from the metric, other analysts have offered a wide range of predictions for where it might land. Predictions of Bitcoin price peaks range anywhere from $150,000 to as high as $500,000. At the time of writing, Bitcoin is trading at $107,740, up by 1.4% in the past 24 hours. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "$179,000 Or $79,000? Bitcoin Faces Critical Cycle Pivot, Says Analyst",
      "link": "https://www.newsbtc.com/bitcoin-news/179000-or-79000-bitcoin-critical-cycle-pivot/",
      "summary": "A popular crypto analyst has issued a stark cyclical warning that could define Bitcoin’s trajectory for the rest of the summer. Dr. Cat, known for his integrated use of Ichimoku Cloud analysis, Elliott Wave Theory, and proprietary time-cycle forecasting, posted an intricate scenario on X suggesting Bitcoin now stands at a pivotal inflection point—one that may ultimately determine whether the next major move is to $179,000 or back down to $79,000. Bitcoin Faces Make-or-Break Moment “If we set a daily high between the 25th and 27th of June,” Dr. Cat began, referencing the window derived from his Time Theory model, “and it turns out to be a lower high per the Wave Theory, then a lower low should follow.” The implications, however, go far beyond near-term downside. “If a lower low comes, we invalidate the weekly cycle which implies no bottom before mid-July to mid-August.” According to the forecast timeline, the earliest potential bottom would fall between July 14 and August 17, with a primary target range from July 28 to August 3, incorporating a ±2 week deviation. That timing model dovetails with the chart’s behavior around critical Ichimoku levels. Dr. Cat emphasized that Bitcoin is currently “making a bearish retest of the weekly Tenkan Sen,” adding that yesterday&#8217;s attempt to reclaim that level failed: “Price touched Tenkan Sen yesterday but I saw that it would open below it today.” Related Reading: Trump’s Truth Social Officialy Files For Bitcoin And Ethereum ETFs With NYSE The Tenkan Sen and Kijun Sen—two key lines in the Ichimoku system—are not just flat; they are structurally unconvincing despite a nominal 10% price advance. “This isn’t a real uptrend,” noted one user, to which Dr. Cat replied: “This is simply a neutral chart trying to flip bullish.” He elaborated that this neutrality means neither bullish nor bearish continuation is guaranteed, but warned that inaction or false optimism at this stage could expose traders to a cascading downside. One of the most significant technical levels lies just beneath current price. “The super key support of 93.2K (weekly Kijun Sen) is relatively close—and too close to hold if the time cycles play out,” Dr. Cat stated. A failure of that level would likely trigger a deeper reversion to the 3-week Kijun Sen, which remains unvisited and is currently positioned near $75K but rising. The entire bearish cascade remains “completely valid and with a very real chance of playing out,” unless Bitcoin manages to break above $110.6K after June 27. Such a move would invalidate both the time and wave-based lower-high structure and neutralize the scenario before it unfolds. But until then, Dr. Cat is urging traders to look beyond surface-level price movements. “Most people look at whether price goes up or down but don’t look at how it does it,” he said. Recalling his accurate bullish stance in April and May—when others were waiting for retracement—and his caution in early June, he emphasized the importance of reading the structure, not just the candles. Related Reading: Bitcoin Repeats Its 2021 Pattern—Analyst Warns Final Crash Still Ahead “The weekly chart was one candle away from a bullish TK cross, which would’ve implied big bullish continuation. But I waited. Then the market dumped,” he reminded followers. “Now it is relatively similar… dramatic reversals happen as close to invalidation as possible so everyone is tested and trapped to the limit.” In summary, Dr. Cat’s outlook remains balanced—but volatile. “I’m not telling you I can read the future,” he said. “I’m telling you that you need to distinguish neutral from bullish charts, which many people can’t—and suffer the consequences.” With time cycles converging and Ichimoku structures flashing indecision, Bitcoin now stands at a binary junction. The next high or low could lock in a multi-week trend, with targets as distant as $179K—or as painful as $79K—hanging in the balance. “This is simply a neutral chart trying to flip bullish. Which can certainly flip bullish pretty soon but until that happens I discuss whether first comes 179K or 79K with pretty much equal probability and I&#8217;m warning about an absolutely valid scenario which is on the table unless the chart flips bullish,” Dr. Cat concludes. At press time, BTC traded at $107,356. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Crypto ETF Race Heats Up, More Solana ETFs Planned as Snorter Bot Corners Market for Solana Memes",
      "link": "https://www.newsbtc.com/news/crypto-etf-race-heats-up-more-solana-etfs-planned-as-snorter-bot-corners-market/",
      "summary": "The SEC’s filing cabinet has to be pretty full these days, and their ‘paperwork pending’ stack is getting perilously high. Invesco Ltd and Galaxy Digital LP combined forces to offer another Solana-based exchange-traded fund (ETF). They filed the appropriate paperwork with the SEC and joined at least 12 other potential spot and future ETFs on the SEC to rule on their status. The competition for the leading $SOL ETF takes place at the most visible end of the crypto ecosystem. Far lower down, there’s a different race on, with Snorter poised to corner the market in the fast-paced world of Solana meme coins on Telegram. It’s two ends of the same spectrum and speaks to the growing strength and versatility of the Solana ecosystem. Invesco Galaxy Solana ETF Ready to List Why the race for a Solana ETF? Partly because of the tremendous success of Bitcoin and Ethereum ETFs: $IBIT: iShares Bitcoin Trust, $70.6B Assets Under Management (AUM) $FBTC: Fidelity Wise Origin Bitcoin Fund, $20.4B AUM $GBTC: Grayscale Bitcoin Trust, $19.6B AUM $ETHA: iShares Ethereum Trust, $3.9B AUM $ETHE: Grayscale Ethereum Trust, $2.8B AUM It’s no surprise that more players are ready to enter the game, particularly as the realms of traditional finance (TradFi) and decentralized finance (DeFi) move ever-closer together. Only $BTC and $ETH currently have single-asset crypto ETFs, but the pile of pending filings includes everything from $XRP to $SOL to the first-ever NFT ETF, with Pudgy Penguins ($PENGU). And with single-asset crypto ETFs rolling along, institutions aren’t waiting around for the SEC. They’ve already started to move towards multi-asset ETFs. Converting Existing Funds to Multi-Asset ETFs One of the holdups so far has been that the SEC lacks a clear set of rules around crypto ETFs, even after the $BTC and $ETH approvals went ahead. The question now is, will the SEC hold approvals until they draw up new rules? Or will they approve first and develop the rule set as they go? There is some time pressure at work here. Grayscale wants to convert its Digital Large Cap Fund (GDLC) to an ETF, and the deadline for that is July 2. That fund already holds a number of crypto assets, including $XRP, $SOL, and $ADA. If the conversion is approved, look for others to follow. Investment managers from Bitwise to Hasdex have plans to convert other funds to multi-asset ETFs that include cryptos. The funds sit at the top of the financial and investment world, and every one that gets approved boosts Solana’s long-term outlook just slightly. But much, much farther down, there’s another reason to be excited for Solana. The frenetic, fast-paced world of Solana meme coin trading just got a tool that could bring much-needed clarity and make finding those 10x or 100x opportunities much easier. Snorter Token ($SNORT) – One Bot to Rule Them All for Meme Coin Trading on Telegram What do you need to find and trade memes on Telegram? You need: Lightning-fast transactions and swaps Automated sniping, to get in and out at the right time Protection from rug pulls, honeypots, and front-running trades Thankfully, traders now have Snorter Bot, the meme coin-styled trading bot designed specifically for trading low-cap Solana memes on Telegram. The $SNORT token powers the bot, providing for rapid trade execution and the lowest fees possible. The project’s presale has already raised nearly $1.3M in a few weeks, indicating broad support. The roadmap includes launching the bot on Solana but expanding to EVM-compatible chains post-launch. In the meantime, the plans feature a token bridge and a built-in Telegram dashboard. No more avoiding Telegram tokens; traders can dive in with confidence with Snorter. Visit the Snorter website to learn more. Solana ETFs Mark the Next Stage of Crypto Adoption As plans proceed, even the rate of ETF filings indicates just how fast crypto adoption is moving. From Wall Street boardrooms to Telegram chats, Solana is becoming increasingly accessible to investors of every stripe. Keep an eye on Snorter, and another on the broader Solana ecosystem. But remember – always do your own research. This isn’t financial advice."
    },
    {
      "title": "XRP Bulls On Alert—’This Trendline Is Everything,’ Says Analyst",
      "link": "https://www.newsbtc.com/xrp-news/xrp-this-trendline-is-everything-analyst/",
      "summary": "XRP spent the past forty-eight hours coiling into a textbook inflection zone, and the 15-minute chart published by independent analyst Casi makes it hard to miss where the battle lines now stand. Price is hovering at $2.18, clinging to a steeply rising trendline that has underpinned every impulsive thrust since the local swing low near the 0.618 retracement at $1.9824 on 23 June. That trendline intersects a horizontal shelf of former resistance-turned-support at the 1.618 extension measured from the same base move, labelled on the chart at $2.186. The confluence forms the geometric “apex of consolidation” Casi has been highlighting on X. XRP Price At Breaking Point “This trendline is everything right now,” Casi wrote. “We just got a clean reaction off it. This correction already reached the .382 retracement at $2.145, which also happens to be the apex of consolidation… that’s the most critical level on the chart, short-term.” The most recent corrective pullback already tagged the 0.382 Fibonacci retracement of the advance, exactly at $2.145, before bulls forced a reaction. As long as candles continue to close above that retracement—effectively the floor of the micro-range—Casi argues that the underlying market structure remains constructive. A decisive break beneath $2.145, by contrast, would represent both a loss of the diagonal trendline and a surrender of the consolidation base, signalling short-term weakness and, in his words, “opening the door to a deeper flush.” Related Reading: XRP Pullback Nearly Complete—Next Stop: $8 To $12, Says Analyst Overhead, XRP must still reckon with layered resistance. The first ceiling sits at $2.20, but the level called out as “the next big test” is the thicker pink band at $2.25. That mark capped price repeatedly during yesterday’s U.S. session and coincides with a prior 1.272 extension of the late-May corrective leg. “If we can flip that level, we’ll likely open the path toward the $2.69 retrace test,” Casi noted, “and from there, the breakout potential increases dramatically!” If price can reclaim $2.25 on expanding volume and then retest it as support, the chart leaves an unobstructed lane toward the 2.618 extension at $2.296—effectively $2.30—and, by projection, the $2.69 Fibonacci target that would complete the measured-move roadmap Casi is tracking. Related Reading: XRP To $30 Beyond 2026? Analyst Reveals Key BTC Ratio To Watch Momentum, however, is not yet offering a clean green light. The lower pane shows a 14-period RSI capped by its own descending trendline that has compressed every rally since 24 June. With the oscillator printing 46.24 (signal) versus 43.59 (base line) at the time of the screenshot, the gauge is climbing but still mid-range. A marginal higher high in price paired with a lower high in RSI would etch a textbook bearish divergence—an outcome Casi told one follower he is “expecting to set up” if XRP pierces $2.25 before consolidating anew. “I think this next high will form a bearish div,” he added. “The RSI is telling me it’s about to set that up.” In short, the token is balanced on a knife-edge: the bull case hinges on the integrity of the $2.145–$2.186 support complex and a breakout through $2.25, while the bear case rests on trendline failure and an RSI divergence confirming upside exhaustion. With liquidity thinning into the weekend, the resolution of this narrow consolidation could shape the next wave—whether that proves to be the ignition of a larger third impulse or the start of a deeper corrective detour. As Casi put it, “This is the kind of price action you want to see if XRP is serious about continuing this new trend to the upside.” At press time, XRP traded at $2.19. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Japan’s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC",
      "link": "https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Japans-Metaplanet-Acquires-1234-More-Bitcoin-Total-Holdings-Reach-12345-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc\" rel=\"nofollow\">Japan&#8217;s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC</a></p> <p>The Japanese company continues accelerating its Bitcoin treasury strategy with a ¥19.27 billion purchase.</p> <p>"
    },
    {
      "title": "Kraken Launches Krak, a No-Fee App to Use and Store Bitcoin and Crypto",
      "link": "https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Launches-Krak-a-No-Fee-App-to-Use-and-Store-Bitcoin-and-Crypto.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto\" rel=\"nofollow\"> </a></p> <p>Bitcoin and crypto platform Kraken has officially launched Krak, a no-fee, all-in-one global money app that lets users spend, send, and save across over 300 fiat and digital assets—including Bitcoin. Designed to merge the best of banking, payments, and crypto into a single user experience, the Krak app is set to redefine how people move [&#8230;]</p> <p>"
    },
    {
      "title": "Castle Raises $1M to Bring Automated Bitcoin Treasury to Small & Medium-Sized Businesses",
      "link": "https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Castle-Raises-1M-to-Bring-Automated-Bitcoin-Treasury-to-Small-Medium-Sized-Businesses-2.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses\" rel=\"nofollow\">Castle Raises $1M to Bring Automated Bitcoin Treasury to Small &amp; Medium-Sized Businesses</a></p> <p>Backed by Boost VC and Winklevoss Capital, Castle aims to help SMBs protect their balance sheets by automating bitcoin allocations.</p> <p>"
    },
    {
      "title": "FHFA Orders to Recognize Bitcoin And Other Cryptos in Mortgage Assessments",
      "link": "https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FHFA-Orders-to-Recognize-Bitcoin-And-Other-Cryptos-in-Mortgage-Assessments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments\" rel=\"nofollow\"> </a></p> <p>Fannie Mae and Freddie Mac are now directed to treat properly documented Bitcoin and other crypto assets as part of borrower reserves for mortgages.</p> <p>"
    },
    {
      "title": "Kraken Secures MiCA License To Offer Bitcoin And Crypto In Europe",
      "link": "https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Becomes-First-Global-Bitcoin-Crypto-Platform-to-Secure-MiCA-License.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe\" rel=\"nofollow\"> </a></p> <p>The license allows Kraken to offer regulated bitcoin and crypto services across all 30 EEA countries.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Kraken Debuts Krak Crypto and Fiat Payments App Across 110 Countries",
      "link": "https://decrypt.co/327150/kraken-debuts-krak-crypto-fiat-payments-app-110-countries",
      "summary": "The crypto exchange's offering will compete with other cash apps, including PayPal and Jack Dorsey's Cash App."
    },
    {
      "title": "Ripple Stuck With $125 Million Penalty as Judge Denies XRP Settlement With SEC",
      "link": "https://decrypt.co/327157/ripple-stuck-with-125-million-penalty-as-judge-denies-xrp-settlement-with-sec",
      "summary": "While the SEC has become more crypto friendly, a federal judge in Manhattan found that the law hasn't changed."
    },
    {
      "title": "Hacker Drains $9.6 Million From DeFi Stablecoin Protocol Resupply",
      "link": "https://decrypt.co/327148/hacker-drained-9-6-million-from-defi-stablecoin-protocol-resupply",
      "summary": "“Users should avoid reUSD vaults and withdraw funds if possible,\" one security expert told ."
    },
    {
      "title": "Bitcoin and Ethereum Flat as Iran Claims Victory Over US",
      "link": "https://decrypt.co/327140/bitcoin-ethereum-flat-as-iran-claims-victory",
      "summary": "Bitcoin and Ethereum have inched forward, as 77% of Myriad Market users signal they’re certain Iran's supreme leader will remain in power."
    },
    {
      "title": "Telegram Users Can Now Earn 'Institutional-Grade' Financial Rewards on Staked TON",
      "link": "https://decrypt.co/327081/telegram-users-earn-institutional-grade-financial-rewards-staked-ton",
      "summary": "A new collaboration between P2P.org and Ton Whales will allow Telegram users to earn rewards, starting with less than $30 worth of TON."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Court rejects Ripple and SEC bid to slash $125M penalty and lift injunction on XRP sales to institutions",
      "link": "https://cryptobriefing.com/ripple-sec-penalty-court-decision/",
      "summary": "<p>The court's decision underscores the ongoing regulatory challenges and legal scrutiny facing the cryptocurrency industry.</p> <p>"
    },
    {
      "title": "Galaxy Digital secures $175 million for first venture fund to back early-stage crypto startups",
      "link": "https://cryptobriefing.com/early-stage-crypto-startups-fund/",
      "summary": "<p>Galaxy Digital's venture fund expansion could accelerate innovation in crypto, bridging traditional finance and blockchain, impacting global markets.</p> <p>"
    },
    {
      "title": "Jumper Exchange integrates Etherlink for cross-chain access to Tezos L2",
      "link": "https://cryptobriefing.com/etherlink-integration-jumper-exchange/",
      "summary": "<p>The integration enhances cross-chain liquidity and accessibility, potentially accelerating adoption and innovation within the Tezos ecosystem.</p> <p>"
    },
    {
      "title": "Mortgage giants Fannie Mae, Freddie Mac directed to consider crypto as valid assets for home loan eligibility",
      "link": "https://cryptobriefing.com/fannie-mae-freddie-mac-crypto-mortgage-underwriting/",
      "summary": "<p>Integrating crypto assets into mortgage finance could broaden access to home loans, potentially reshaping financial inclusion and asset evaluation.</p> <p>"
    },
    {
      "title": "Fed’s Powell says Bitcoin and crypto have matured and become more mainstream",
      "link": "https://cryptobriefing.com/crypto-mainstream-adoption-fed/",
      "summary": "<p>The mainstreaming of crypto prompts regulatory reassessment, potentially reshaping financial policies and banking practices globally.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "One wallet, 863M TON stacked: Decoding a whale’s Toncoin strategy",
      "link": "https://ambcrypto.com/one-wallet-863m-ton-stacked-decoding-a-whales-toncoin-strategy/",
      "summary": "<img alt=\"TONCOIN\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-12-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A wallet has accumulated 863M TON over time, indicating a long-term strategy that could influence prices."
    },
    {
      "title": "BCH Bulls Buy More Bitcoin Cash and Pepe Dollar (PEPD) In BCH Bank RUN!",
      "link": "https://ambcrypto.com/bch-bulls-buy-more-bitcoin-cash-and-pepe-dollar-pepd-in-bch-bank-run/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"448\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-26-183730.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"773\" />Bitcoin Cash (BCH) is drawing renewed attention from investors in 2025, with bullish momentum fueling [&#8230;]"
    },
    {
      "title": "Bitcoin fear fades, but investors remain cautious – What’s holding BTC back?",
      "link": "https://ambcrypto.com/bitcoin-fear-fades-but-investors-remain-cautious-whats-holding-btc-back/",
      "summary": "<img alt=\"Bitcoin fear fades, but investors remain cautious - What’s holding BTC back?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-26T132551.061-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin cools off near all-time highs, but long-term selling and leverage buildup raise caution."
    },
    {
      "title": "Will crypto bills be delayed until 2026? – Senator Lummis shares insight",
      "link": "https://ambcrypto.com/will-crypto-bills-be-delayed-until-2026-senator-lummis-gives-insight/",
      "summary": "<img alt=\"Lummis on CLARITY &amp; GENIUS Act\" class=\"attachment-full size-full wp-post-image\" height=\"583\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lummis-on-CLARITY-GENIUS-Act.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1036\" />Political chess continues in D.C. as crypto bills inch closer. When will they be approved?"
    },
    {
      "title": "FUNToken’s Telegram Bot Gets a Major Upgrade With High-Stakes Spins",
      "link": "https://ambcrypto.com/funtokens-telegram-bot-gets-a-major-upgrade-with-high-stakes-spins/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"628\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/FUN-WOF-PR.jpeg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1200\" />FUNToken is taking its community experience to the next level with a massive upgrade to [&#8230;]"
    }
  ]
}