{
  "CoinDesk": [
    {
      "title": "Ether Trader Bets Millions on ETH Blasting Above $3.4K by June-End",
      "link": "https://www.coindesk.com/markets/2025/06/06/ether-trader-bets-millions-on-eth-blasting-above-usd3-4k-by-june-end",
      "summary": ""
    },
    {
      "title": "Bitcoin, Ether Bulls Hit With $800M Liquidation as Trump-Musk Tussle Rattles BTC, ETH",
      "link": "https://www.coindesk.com/markets/2025/06/06/bitcoin-ether-bulls-hit-with-800m-liquidation-as-trump-musk-tussle-rattles-btc-eth",
      "summary": ""
    },
    {
      "title": "Uber Once Again Says It's Considering Crypto Years After Mulling BTC Payments",
      "link": "https://www.coindesk.com/markets/2025/06/05/uber-once-again-says-its-considering-crypto-years-after-considering-btc-payments",
      "summary": ""
    },
    {
      "title": "Asia Morning Briefing: Bitcoin Bulls Eye $120K Despite Trump-Musk Turmoil",
      "link": "https://www.coindesk.com/markets/2025/06/05/asia-morning-briefing-bitcoin-bulls-laser-focused-on-120k-despite-trump-musk-turmoil",
      "summary": ""
    },
    {
      "title": "Senate Stablecoin Bill Likely to Win Massive Bipartisan Support, Dem Lawmaker Says",
      "link": "https://www.coindesk.com/policy/2025/06/05/senate-stablecoin-bill-likely-to-win-massive-bipartisan-support-dem-lawmaker-says",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Crypto users fail ‘basic situational awareness’ at events, says Kraken",
      "link": "https://cointelegraph.com/news/crypto-eventgoers-fail-basic-situational-awareness-kraken?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDkwMDYtOTc2Zi03MGEyLThkZWItNTZmOTcwZDQyNWM0.jpg\" /></p><p>Kraken’s security team says that at crypto conferences, it’s seen unlocked laptops, phones left unattended and public discussions about personal wealth.</p>"
    },
    {
      "title": "AI solidifying role in Web3, challenging DeFi and gaming: DappRadar",
      "link": "https://cointelegraph.com/news/ai-solidifying-role-in-web3-rivals-defi-engagement-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTIxMzUtMGMyMy03ZGRhLTkxODEtNjY1NjZkY2EwNTQ5.jpg\" /></p><p>The number of daily unique active wallets on AI-powered crypto apps grew 23% in May, eating into the market share of DeFi and Web3 gaming, says DappRadar.</p>"
    },
    {
      "title": "Ross Ulbricht’s big Bitcoin donor tied to Silk Road successor Alphabay: Report",
      "link": "https://cointelegraph.com/news/silk-road-successor-alphabay-31m-bitcoin-donation-ross-ulbricht?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzJhM2EtNzY4Yi03ZGE2LWI5NTMtOTdkYzZhN2MxYzY5.jpg\" /></p><p>Chainalysis told WIRED that it tracked a $31 million Bitcoin donation to online black market Silk Road founder Ross Ulbricht to a successor marketplace called Alphabay.</p>"
    },
    {
      "title": "Uber in ‘study phase’ of using stablecoins to lower costs, says CEO",
      "link": "https://cointelegraph.com/news/uber-study-phase-stablecoins-lower-costs?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQyZTItMTJmNi03MjMzLTg1N2MtMmI5MjQ0ZTE1MTlm.jpg\" /></p><p>Uber CEO Dara Khosrowshahi says the ride-sharing giant is looking at whether stablecoins can help it cut costs when moving money around the world.</p>"
    },
    {
      "title": "Trump-Musk spat sees Bitcoin tumble, liquidating $308M in longs",
      "link": "https://cointelegraph.com/news/bitcoin-price-decline-long-positions-liquidated-donald-trump-elon-musk-feud?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQyZGMtN2RhNC03MTNkLThlM2YtNzM3OWMyMmRiYTY1.jpg\" /></p><p>Bitcoin long traders took a hit over the past 24 hours amid Bitcoin’s price dwindling amid broader macroeconomic tension and continued sell-offs by long-term holders.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Profit-taking, not capitulation: institutions cut Bitcoin ETF exposure by 23% in Q1",
      "link": "https://cryptoslate.com/profit-taking-not-capitulation-institutions-cut-bitcoin-etf-exposure-by-23-in-q1/",
      "summary": "<p>Institutional investors cut Bitcoin (BTC) allocations in US-based spot exchange-traded funds (ETFs) during the first quarter after hedging profits waned and futures premiums compressed, a June 5 CoinShares report showed. The report assessed 13-F filings from asset managers with at least $100 million in assets under management. These investors reported $21.2 billion in Bitcoin ETF [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin bulls must guard key $95.6k support as veteran holders cash in on gains",
      "link": "https://cryptoslate.com/bitcoin-bulls-must-guard-key-95-6k-support-as-veteran-holders-cash-in-on-gains/",
      "summary": "<p>Bitcoin (BTC) is suffering pressure from veteran holders securing gains and must hold the key $95,600 support level to remain bullish if it breaks below six-figures, according to a June 5 report by Glassnode. The report highlighted that after breaking below $103,700, the next major level of support is the psychological price level of $100,000 [&#8230;]</p> <p>"
    },
    {
      "title": "WLFI issues cease and desist notice to creators of ‘Official Trump Wallet’",
      "link": "https://cryptoslate.com/wlfi-issues-cease-and-desist-notice-to-creators-of-official-trump-wallet/",
      "summary": "<p>World Liberty Financial (WLFI), the crypto venture associated with President Donald Trump and members of his family, has issued a cease-and-desist letter to the creators of a newly announced Trump-branded crypto wallet, Bloomberg News reported on June 5, citing a person familiar with the matter. The letter, reportedly sent to Fight Fight Fight LLC, the [&#8230;]</p> <p>"
    },
    {
      "title": "Uber eyes stablecoins for faster settlements, lower FX costs for global operations",
      "link": "https://cryptoslate.com/uber-eyes-stablecoins-for-faster-settlements-lower-fx-costs-for-global-operations/",
      "summary": "<p>Uber is exploring dollar-pegged stablecoins as a tool for transferring funds across its global network, CEO Dara Khosrowshahi said on June 5 at the Bloomberg Tech conference in San Francisco. Khosrowshahi explained that blockchain-based tokens could settle payments faster than traditional correspondent bank channels and eliminate layers of foreign exchange fees. He said that stablecoins [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin dives below $102k amid fading momentum and macro uncertainty",
      "link": "https://cryptoslate.com/bitcoin-dives-below-102k-amid-fading-momentum-and-macro-uncertainty/",
      "summary": "<p>Bitcoin (BTC) plunged to a low of $101,500 on June 5, marking its sharpest decline in over a month as a wave of selling swept through crypto markets. The drop extended a multi-day slide triggered by shifting investor sentiment and declining demand from institutions. The world’s largest cryptocurrency touched a low of $101,500 before stabilizing [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "TRON Surges Past 8 Million Daily Transactions as TRX Holds Above $0.27",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-surges-past-8-million-daily-transactions-as-trx-holds-above-0-27/",
      "summary": "TRON (TRX) has experienced relatively stable price movement over the past week, fluctuating within a narrow range between $0.276 and $0.272. At the time of writing, the token is trading at $0.2729, reflecting a weekly decline of approximately 1.5%. However, zooming out reveals a broader uptrend, with TRX gaining nearly 12% over the past month, indicating growing market interest amid a backdrop of increased on-chain activity. An assessment of TRON’s network-level data suggests the blockchain is experiencing a surge in usage. According to a recent analysis published on CryptoQuant’s QuickTake platform by contributor Darkfost, daily transaction volume on the TRON network has crossed the 8 million mark, a notable increase from earlier this year. This growth in network transactions is considered a critical indicator of underlying demand and user engagement, which could influence market sentiment around the asset. Related Reading: TRON Activity Hits All-Time High, Is a TRX Price Breakout Coming? Transaction Volume and Address Activity Show Strong Network Engagement Darkfost noted that TRON’s monthly average for daily transactions has seen consistent growth, with recent data showing a roughly 2 million increase in average daily transactions since February. The network is now processing over 8 million transactions per day, marking a more than 30% rise over the past four months. Importantly, a large share of these transactions is occurring outside centralized exchanges, pointing to the growing utility of the blockchain for peer-to-peer transfers and decentralized application (dApp) usage. This shift away from centralized platforms may reflect increased interest in TRON’s native ecosystem services and its competitive yield offerings. As more users interact directly with the network, transaction-based liquidity grows, which can contribute to stronger economic activity across the TRON protocol. Darkfost emphasized that this trend of non-exchange transactions is a positive signal for the blockchain’s real-world usage and investor adoption. TRON Active Address Metrics Reach New Highs In a separate update, CryptoQuant analyst Cryptoonchain highlighted that both the 50-day and 100-day moving averages for active addresses on the TRON network have hit their highest levels to date. This sustained rise in active wallet participation suggests a growing user base that is consistently interacting with the blockchain. While TRX’s price has not fully kept pace with the uptick in address activity, historical trends suggest that increased user engagement often precedes upward price movement. Related Reading: Analyst Explains Reason Behind Tron Price Sluggishness — Are TRX Bears Now In Control? The correlation between active address growth and price performance continues to be an area of interest. With momentum building across multiple on-chain indicators, there is a likelihood that TRON may be positioned for further gains if current trends hold. Analysis of Daily Active Addresses and TRX Price on Tron Network – All-Time Highs in Moving Averages “Historically, changes in active address trends tend to precede major price movements.” – By @CryptoOnchain pic.twitter.com/7QXqP6g1Gh — CryptoQuant.com (@cryptoquant_com) June 4, 2025 Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin Network Activity Booming Despite A Quiet Market—Data",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-network-activity-is-booming-despite-a-quiet-market-data/",
      "summary": "Bitcoin’s price has barely moved in the last week, but other signs point to growing activity on the network. On June 5, Bitcoin traded around $104,300, down 0.50% in 24 hours and off 2.5% over the past seven days. Yet data shows more people are joining the network, and more coins are being passed around. Related Reading: Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge Wallet Creation Jump According to Santiment, on May 29 nearly 557,000 new wallets appeared. That was the highest number since December 2023. It means thousands of people are opening wallets even though price has stayed just under $105,000. People normally open new wallets to send and receive bitcoins but they somehow come across the idea through new sources, increased talks among friends or create simple curiosity. In any case, an increased wallet holding indeed indicates a much wider usage. 📊 Bitcoin&#8217;s on-chain activity has seen sharp rises this week as its price hovers just below $105K: 📈 May 29th: 556,830 new $BTC wallets created (Highest since December 2, 2023) 🔄 June 2nd: 241,360 coins circulated (Highest since December 8, 2024) Growth in a network&#8217;s… pic.twitter.com/2DxknVXrKT — Santiment (@santimentfeed) June 5, 2025 Increased Token Movement On June 2, over 241,360 BTC changed hands. This was deemed the busiest day since December 2024. Reports from Santiment suggest that high coin turnover usually coincides with increased traffic. Traders might be moving coins in and out of exchanges, or investors could be shifting wallets. Big swings in daily token movement can point to a shift in sentiment—people either getting ready to buy or sell. Right now, it mostly looks like more users are sending coins to each other, which keeps the network busy even when price sits still. Big Holders Step In Data from IntoTheBlock shows that large holders—often called “whales”—are stocking up. Their coin inflows jumped by 145% over the last seven days, and by 214% over the past 30 days. When big players load up, it can tighten supply on exchanges. That makes it tougher for new buyers to get in without driving price higher. If whales keep buying at this rate, it could lead to more upward pressure on price once everyday investors step in again. Related Reading: Bitcoin Scarcity May Spark Explosive Surge, Bank Study Shows Mid Tier Investors Buy It’s not just the really big holders adding coins. Wallets holding between 10 and 10,000 BTC added more than 79,000 BTC in just one week. That means these mid-tier holders picked up around 11,320 BTC per day on average. As of June 2, they held over 13 million BTC in total. When both big whales and these mid-level holders keep stacking, it further cuts down the number of coins floating on exchanges. Fewer coins available often mean any shift in demand could move price more. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Dogecoin (DOGE) Gains Bearish Momentum: A Buying Opportunity or Warning Sign?",
      "link": "https://www.newsbtc.com/analysis/doge/dogecoin-doge-gains-bearish-momentum-0-1680/",
      "summary": "Dogecoin started a fresh decline from the $0.20 zone against the US Dollar. DOGE is now consolidating losses and might recover if it clears $0.180. DOGE price started a fresh decline below the $0.1880 and $0.180 levels. The price is trading below the $0.1850 level and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $0.1880 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could start a fresh decline if it declines below the $0.1680 zone. Dogecoin Price Dips Below Support Dogecoin price started a fresh decline after it failed to clear the $0.20 zone, like Bitcoin and Ethereum. DOGE declined below the $0.1920 and $0.1880 levels. The bears even pushed the price below the $0.1750 level. A low was formed at $0.1687 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $0.2005 swing high to the $0.1687 low. Dogecoin price is now trading below the $0.1850 level and the 100-hourly simple moving average. There is also a key bearish trend line forming with resistance at $0.1880 on the hourly chart of the DOGE/USD pair. Immediate resistance on the upside is near the $0.1760 level. The first major resistance for the bulls could be near the $0.1840 level. It is close to the 50% Fib retracement level of the downward move from the $0.2005 swing high to the $0.1687 low. The next major resistance is near the $0.1880 level. A close above the $0.1880 resistance might send the price toward the $0.20 resistance. Any more gains might send the price toward the $0.2050 level. The next major stop for the bulls might be $0.2120. More Losses In DOGE? If DOGE’s price fails to climb above the $0.1850 level, it could start another decline. Initial support on the downside is near the $0.1685 level and the trend line. The next major support is near the $0.1650 level. The main support sits at $0.1550. If there is a downside break below the $0.1550 support, the price could decline further. In the stated case, the price might decline toward the $0.1350 level or even $0.1320 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now losing momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now below the 50 level. Major Support Levels – $0.1680 and $0.1650. Major Resistance Levels – $0.1760 and $0.1880."
    },
    {
      "title": "Ripple May Be Releasing XRP Liquidity Via Backdoor, Claims Crypto Pundit",
      "link": "https://www.newsbtc.com/xrp-news/ripple-releasing-xrp-liquidity-via-backdoor-crypto-pundit/",
      "summary": "A provocative claim by crypto researcher “Darkhorse” has reignited debate over whether Ripple Labs is quietly sidestepping a federal court injunction through a newly disclosed $300 million XRP treasury vehicle involving Asia-based mobility firm Webus International Ltd. “This new treasury setup allows @Ripple to bypass the injunction legally and cleanly,” Darkhorse declared in a post on X dated June 4. He contends that Ripple has found “the only route left by the Judge” by using an institutional structure that moves XRP through regulated intermediaries instead of selling it directly to investors. “It’s not just clever,” he wrote. “It’s compliant by design.” The setup in question was revealed in a recent Form 6-K filing by Webus, which outlined the creation of an XRP Treasury to be managed by Samara Alpha, an SEC-registered investment adviser. The program delegates full control of up to $300 million in XRP to Samara under a phased, regulated structure. While the filing stops short of stating where the XRP will come from, Darkhorse argues the intent is clear: Ripple can legally sell XRP to an SEC-facing intermediary like Samara, which then allocates it to a corporate client like Webus — all without violating the standing injunction. Related Reading: The Worst Case For XRP This Cycle? Just A Giga Rally To $19, Says Analyst “Ripple is enjoined from direct institutional sales without SEC clearance,” Darkhorse explained. “The workaround? Sell to regulated intermediaries (like Samara on behalf of Webus) with treasury agreements that are SEC-transparent and non-retail facing. It’s structured — not casual.” Is Ripple Bypassing The XRP Injunction? Veteran XRP commentator Jay Nisbett pushed back. “I just don’t see any of this as clever or bypassing anything — it’s just adoption,” he replied. Nisbett asserted that Ripple and Webus are not partners, that Webus is simply acquiring XRP like any other participant on the secondary market, and that the asset itself “has been ruled to be not a security in this context.” He added that holding XRP on a balance sheet isn’t the same as triggering a securities transaction. Darkhorse issued a sharp rebuttal. “You’re missing the mechanism,” he told Nisbett, laying out his argument in four parts. First, he emphasized that Webus did not just announce an intent to buy on the open market. “Webus filed via Form 6-K to publicly document a $300M XRP Treasury but not to simply buy on open markets. They delegated management to ‘Samara Alpha,’ an SEC-registered investment adviser, under a phased, regulated structure.” Related Reading: XRP Price Could Hit $21 This Bull Cycle With 1.618 Fib Level As Next Target Second, he argued that the core issue is Ripple’s inability to sell directly to institutions, which is where the intermediary comes in. “This structure is about creating compliant distance,” he wrote. “It’s not Ripple handing XRP to an investor — it’s routing via an SEC-registered manager who takes custody and executes under regulatory supervision.” Third, Darkhorse disputed Nisbett’s assertion that there’s no relationship between Ripple and Webus. “Check RippleNet corridors and prior Asia-Pacific mobility pilot cases,” he wrote. “Their ties to Ripple’s network and XRPL liquidity routes go back years. Just because it wasn’t front-page news doesn’t mean it didn’t happen.” Finally, he challenged the notion that Webus’s XRP holdings are merely passive. “ ‘Just holding on balance sheet’ is not automatic exemption,” he argued. “This is treasury deployment, not idle custody. The fact that Webus structured this through a delegated SEC-facing manager says they do consider XRP institutional risk a legal factor.” He concluded bluntly: “This isn’t Ripple dumping tokens on exchanges. It’s creating institutional conduits that comply while navigating around the injunction bottleneck.” Despite the detailed structure and SEC-facing components, Nisbett remained unmoved. “No I get what you’re saying… I just disagree in that mechanism being an unexpected event,” he wrote. “It’s just a natural maturation of the market and the market reacting to legislation hurdles as the market always has and will.” With Ripple still bound by Judge Torres’s 2024 permanent injunction — which prohibits direct institutional XRP sales unless registered — the debate hinges on whether the Webus structure constitutes indirect circumvention or lawful evolution. The SEC has yet to comment, and the court recently denied the parties’ request to vacate the injunction, calling it “procedurally improper.” At press time, XRP traded at $2.1989. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "XRP Price Drops Toward $2.00: Can Bulls Defend This Critical Support Level?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-drops-toward-2-00/",
      "summary": "XRP price started a fresh decline below the $2.20 zone. The price is now consolidating and might aim for a recovery wave above the $2.120 resistance. XRP price started a fresh decline below the $2.20 zone. The price is now trading above $2.150 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $2.192 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start another increase if it clears the $2.120 resistance zone. XRP Price Dips To Support XRP price failed to gain pace for a move above the $2.220 level and started a fresh decline, like Bitcoin and Ethereum. There was a move below the $0.2150 and $0.2120 levels. Besides, there was a break below a key bullish trend line with support at $2.192 on the hourly chart of the XRP/USD pair. Finally, the price tested the $2.050 zone. It is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $2.281 swing high to the $2.056 low. The price is now trading below $2.120 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.120 level. The first major resistance is near the $2.150 level. The next resistance is $2.1750. It is near the 50% Fib retracement level of the downward move from the $2.281 swing high to the $2.056 low. A clear move above the $2.1750 resistance might send the price toward the $2.20 resistance. Any more gains might send the price toward the $2.220 resistance or even $2.2420 in the near term. The next major hurdle for the bulls might be $2.250. More Losses? If XRP fails to clear the $2.15 resistance zone, it could start another decline. Initial support on the downside is near the $2.050 level. The next major support is near the $2.020 level. If there is a downside break and a close below the $2.020 level, the price might continue to decline toward the $2.00 support. The next major support sits near the $1.920 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.050 and $2.020. Major Resistance Levels – $2.120 and $2.150."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin vs Stablecoins: Bitcoin is an Unreplicable Lifeline in Authoritarian Regimes",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Authoritarian-leader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes\" rel=\"nofollow\"> </a></p> <p>Bitcoin operates beyond any government’s grasp. Its value isn’t in replacing stablecoins — it’s in doing what they fundamentally cannot do.</p> <p>"
    },
    {
      "title": "Bitcoin Life Insurer, Meanwhile, Becomes First Company to Publish Audited Financials Denominated in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Meanwhile-Insurance.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Meanwhile Insurance Bitcoin (Bermuda) Limited (“Meanwhile”) announced it has become the first company in the world to release externally audited financial statements denominated entirely in Bitcoin. According to the announcement, the company reported 220.4 BTC in assets and 25.29 BTC in net income for 2024, a 300% year over year increase. “We’ve just made history [&#8230;]</p> <p>"
    },
    {
      "title": "President Trump’s Truth Social Files S-1 Form For Bitcoin ETF",
      "link": "https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Eric-Trump-Said-Everybody-Wants-Bitcoin.-Everybody-is-Buying-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf\" rel=\"nofollow\">President Trump&#8217;s Truth Social Files S-1 Form For Bitcoin ETF</a></p> <p>Truth Social filed for an S-1 Form for a Bitcoin ETF.</p> <p>"
    },
    {
      "title": "Botanix Launches Federated Sidechain with 16 Members On Testnet",
      "link": "https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_giant_robot_spider_with_big_matrix_code_ch_2-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members\" rel=\"nofollow\"> </a></p> <p>Botanix launches a decentralized Bitcoin sidechain on testnet with a 16-node federation, using the Spiderchain protocol for EVM-compatible dApps. Mainnet set for Q3 2025.</p> <p>"
    },
    {
      "title": "Matador Technologies Raises C$1.64M To Invest in Their Bitcoin Reserve",
      "link": "https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Matador-Technologies-Raising-C1-Million-to-Invest-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve\" rel=\"nofollow\"> </a></p> <p>Matador Technologies announced it raised C$1,644,300 across the issuance of 2,652,097 units to add more bitcoin to their reserve.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "OpenAI Challenges Court Order to Preserve User Data in NYT Lawsuit",
      "link": "https://decrypt.co/323950/openai-challenges-court-order-user-data-nyt-lawsuit",
      "summary": "The AI firm said the order to retain deleted ChatGPT chats undermines user privacy as legal its battle escalates."
    },
    {
      "title": "Meta Oversight Board Slams Parent Company Over Viral Ronaldo Deepfake",
      "link": "https://decrypt.co/323942/meta-oversight-board-slams-parent-company-viral-ronaldo-deepfake",
      "summary": "Meta’s Oversight Board ordered the removal of a Ronaldo deepfake ad, calling out the platform’s weak enforcement of anti-fraud rules."
    },
    {
      "title": "How Circle’s IPO Stacks Up Against Other Crypto Market Debuts",
      "link": "https://decrypt.co/323939/how-circles-ipo-stacks-up-against-other-crypto-market-debuts",
      "summary": "Circle closed with an $18.4 billion valuation, well below Coinbase’s IPO but ahead of newer entrants like Fold and eToro."
    },
    {
      "title": "'A Different Era': Bored Ape Creator Yuga Labs Wants to Kill the ApeCoin DAO",
      "link": "https://decrypt.co/323902/bored-ape-creator-yuga-labs-wants-kill-apecoin-dao",
      "summary": "Bored Ape Yacht Club creator Yuga Labs has proposed axing the ApeCoin DAO, with plans to create a new entity to oversee the Ethereum token."
    },
    {
      "title": "VPN Usage Spikes in France as Pornhub Blocks Users Over Age Restrictions",
      "link": "https://decrypt.co/323881/vpn-usage-spikes-france-pornhub-age-restrictions",
      "summary": "Pornhub’s France block over age checks sparked a 1,000% ProtonVPN signup surge, highlighting pushback against ID laws."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "World Liberty advisor faces six-figure loss after shorting $TRUMP on Trump-Musk fallout",
      "link": "https://cryptobriefing.com/shorting-trump-losses-advisor/",
      "summary": "<p>The fallout highlights the volatility and interconnectedness of crypto and traditional markets, emphasizing the risks of speculative trading.</p> <p>"
    },
    {
      "title": "Trump–Musk feud escalates as Musk accuses Trump of appearing in Epstein files",
      "link": "https://cryptobriefing.com/trump-musk-contracts-epstein-allegation/",
      "summary": "<p>Trump threatens to cut Musks government contracts after backlash over $1.6T bill. Musk fires back with Epstein claim as Tesla sinks 20%.</p> <p>"
    },
    {
      "title": "Truth Social Bitcoin and Ethereum ETF registered in Nevada",
      "link": "https://cryptobriefing.com/truth-social-cryptocurrency-investment-trusts/",
      "summary": "<p>This move could enhance crypto market accessibility and legitimacy, potentially influencing broader adoption and regulatory perspectives.</p> <p>"
    },
    {
      "title": "Trump’s sons send cease-and-desist to his meme coin team over Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/trump-branded-crypto-wallet-dispute/",
      "summary": "<p>The cease-and-desist highlights potential legal and reputational risks in unauthorized use of high-profile names in crypto ventures.</p> <p>"
    },
    {
      "title": "Tesla shares tumble as Trump-Musk bromance collapses days after farewell",
      "link": "https://cryptobriefing.com/tesla-stock-tumble-trump-musk/",
      "summary": "<p>The fallout may impact Tesla's market stability and influence future corporate-political alliances, highlighting risks of volatile partnerships.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "BNB – Signs of accumulation, but should traders wait for a dip instead?",
      "link": "https://ambcrypto.com/bnb-signs-of-accumulation-but-should-traders-wait-for-a-dip-instead/",
      "summary": "<img alt=\"BNB - Signs of accumulation, but should traders wait for a dip instead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BNB-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Binance Coin has seen steady buying pressure since March, making the case for bullish strength."
    },
    {
      "title": "California moves to claim dormant crypto holdings – What should you expect?",
      "link": "https://ambcrypto.com/california-moves-to-claim-dormant-crypto-holdings-what-should-you-expect/",
      "summary": "<img alt=\"California moves to claim dormant crypto holdings - What should you expect? \" class=\"attachment-full size-full wp-post-image\" height=\"583\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/California-Assembly-has-passed-AB-1052.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1036\" />Why is California treating Bitcoin like a forgotten bank account?"
    },
    {
      "title": "$13B in crypto token unlocks incoming – Volatility set to surge across AI, memecoin sectors!",
      "link": "https://ambcrypto.com/13b-in-crypto-token-unlocks-incoming-volatility-set-to-surge-across-ai-memecoin-sectors/",
      "summary": "<img alt=\"$13B in crypto token unlocks incoming - Volatility set to surge across AI, memecoin sectors!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/token-unlocks-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Assessing the potential market volatility ahead of $13 billion worth of supply pressure."
    },
    {
      "title": "AAVE price prediction – Why traders should expect a 8% drop on the charts soon",
      "link": "https://ambcrypto.com/aave-price-prediction-why-traders-should-expect-a-8-drop-on-the-charts-soon/",
      "summary": "<img alt=\"AAVE price prediction - Why traders should expect a 8% drop on the charts soon\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/AAVE-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />AAVE's 4-hour chart suggested more losses may be incoming soon."
    },
    {
      "title": "Toncoin whales buy, but holders remain red – What next?",
      "link": "https://ambcrypto.com/toncoin-whales-buy-but-holders-remain-red-what-next/",
      "summary": "<img alt=\"Toncoin whales buy, but holders remain red - What next?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-05T140156.148-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whale strength contrasts with heavy unrealized losses, positioning TON for a potential breakout."
    }
  ]
}