{
  "CoinDesk": [
    {
      "title": "Senator Seeks to Waive U.S. Taxes on Small-Scale Crypto Activity in Big Budget Bill",
      "link": "https://www.coindesk.com/policy/2025/06/30/senator-seeks-to-waive-us-taxes-on-small-scale-crypto-activity-in-big-budget-bill",
      "summary": ""
    },
    {
      "title": "ETH Price Surges as $2.9B Inflows, EthCC, and Robinhood’s L2 Fuel Bullish Sentiment",
      "link": "https://www.coindesk.com/markets/2025/06/30/eth-price-surges-as-usd2-9b-inflows-ethcc-and-robinhood-s-l2-fuel-bullish-sentiment",
      "summary": ""
    },
    {
      "title": "Circle Applies for National Trust Bank Charter",
      "link": "https://www.coindesk.com/business/2025/06/30/circle-applies-for-national-trust-bank-charter",
      "summary": ""
    },
    {
      "title": "HBAR Climbs 2.1% as Traders Digest ETF Review, AI Launch, and Energy Governance Move",
      "link": "https://www.coindesk.com/markets/2025/06/30/hbar-climbs-2-1-as-traders-digest-etf-review-ai-launch-and-energy-governance-move",
      "summary": ""
    },
    {
      "title": "Bitcoin Carried Crypto Markets in 2025's First Half as Altcoins Crumbled. What's Next?",
      "link": "https://www.coindesk.com/markets/2025/06/30/bitcoin-carries-crypto-markets-in-2025s-first-half-as-altcoins-crumble-whats-next",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "SOL price rallies to $161 after ETF news, but is the rally sustainable?",
      "link": "https://cointelegraph.com/news/sol-price-rallies-to-dollar161-after-etf-news-but-is-the-rally-sustainable?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2MyN2YtYWJlMi03MTlhLTgyNTAtOTJkNmE3ZWZiOTA4.jpg\" /></p><p>Solana's ETF launch sparks a brief rally, but fundamentals and institutional demand remain weak amid competition.</p>"
    },
    {
      "title": "ETH trading pattern points to 100% rally to $5,000: What are the odds?",
      "link": "https://cointelegraph.com/news/eth-trading-pattern-points-to-100percent-rally-to-dollar5000-what-are-the-odds?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjYxM2ItMjU4NS03N2Y4LTk4NGUtZGQ3NzIyMzM4NDY0.jpg\" /></p><p>Ether price enters the most bullish phase of a powerful trading pattern, but bearish headwinds could stall the rally in the short-term.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Spanish authorities arrest five people in $541M crypto fraud case",
      "link": "https://cointelegraph.com/news/authorities-arrest-crypto-fraud-spain?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDNhZjAtMjEyMC03Nzk4LWFjNjktMDdkMWEyZWY2Y2U3.jpg\" /></p><p>Europol reported that the investigation was ongoing, but authorities had made five arrests connected to a scheme that defrauded more than 5,000 people.</p>"
    },
    {
      "title": "Bitcoin holds steady as major catalysts align for breakout above $110K",
      "link": "https://cointelegraph.com/news/bitcoin-holds-steady-as-major-catalysts-align-for-breakout-above-dollar110k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2MyMTMtMDJmMC03Y2Q0LWIyYTQtMTg5NDJiZmNlM2Uy.jpg\" /></p><p>Bitcoin could break past $110,000 as inflation pressures mount, equities rally, and passive capital flows grow on potential S&amp;P 500 rebalancing events.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "DEXs capture almost 30% of CEX spot activity in June, setting new record",
      "link": "https://cryptoslate.com/dexs-capture-almost-30-of-cex-spot-activity-in-june-setting-new-record/",
      "summary": "<p>Decentralized exchanges (DEX) processed roughly $385 billion of spot trades in June, equal to almost 30% of the turnover recorded by centralized venues, according to DefiLlama and The Block data. The 30-day DEX figure represents a 12% decline from May, but centralized exchange (CEX) spot volume contracted nearly 30% in the same period. Notably, this [&#8230;]</p> <p>"
    },
    {
      "title": "German banking giant Sparkassen to offer crypto trading to 50 million customers by 2026",
      "link": "https://cryptoslate.com/german-banking-giant-sparkassen-to-offer-crypto-trading-to-50-million-customers-by-2026/",
      "summary": "<p>Germany’s largest banking group, Sparkassen-Finanzgruppe, is preparing to offer crypto trading services to its retail clients by summer 2026, Bloomberg News reported on June 30. The move represents a significant policy shift for Sparkassen, which had previously avoided crypto offerings due to concerns about volatility and risk. According to the report, the bank’s board of [&#8230;]</p> <p>"
    },
    {
      "title": "Circle targets federally regulated trust status to manage stablecoin reserves, offer custody services",
      "link": "https://cryptoslate.com/circle-targets-federally-regulated-trust-status-to-manage-stablecoin-reserves-offer-custody-services/",
      "summary": "<p>Circle applied to charter First National Digital Currency Bank to become a federally regulated trust that would manage USDC reserves and expand custody services for institutional clients. According to a June 30 announcement, Circle applied to the Office of the Comptroller of the Currency (OCC), seeking authority to operate as a national trust bank subject [&#8230;]</p> <p>"
    },
    {
      "title": "Macro conditions keep Bitcoin boxed between $100k and $110k, bulls awaiting catalyst",
      "link": "https://cryptoslate.com/macro-conditions-keep-bitcoin-boxed-between-100k-and-110k-bulls-awaiting-catalyst/",
      "summary": "<p>Bitcoin (BTC) is in a &#8220;waiting game,&#8221; trading between $100,000 and $110,000, with analysts highlighting the need for a macro catalyst to break the top of the channel. The latest &#8220;Bitfinex Alpha&#8221; report noted lighter spot activity, softer taker-buy flow, and profit-taking by wallets that had bought below $80,000 in April as the reasons behind [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum poised for $3,000 with regulatory tailwinds and ETF demand",
      "link": "https://cryptoslate.com/ethereum-poised-for-3000-with-regulatory-tailwinds-and-etf-demand/",
      "summary": "<p>Recent tailwinds such as staking on exchange-traded funds (ETFs) and regulatory clarity may drive Ethereum (ETH) toward $3,000 in the coming weeks, according to a note by MEXC Research. As of press time, ETH was trading at $2,510, up 3% over the past 24 hours. MEXC Research linked the upside scenario to two key drivers: [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Insane Or Insightful? VC Firm Says XRP Could Reach Nearly $9,000 In Just 5 Years",
      "link": "https://www.newsbtc.com/altcoin/insane-or-insightful-vc-firm-says-xrp-could-reach-nearly-9000-in-just-5-years/",
      "summary": "US regulators and market watchers are eyeing a fresh valuation study that puts XRP on track for a dramatic price surge by 2030. Related Reading: The $100K Mirage: Bitcoin’s Rally Not Backed By On-Chain Strength According to Valhil Capital’s deep‑dive report, XRP could climb from its current price into a range between $4,813 and $9,000 in just five years. That forecast hinges on a model that treats XRP not only as a quick way to move money but also as a store of value. Model Weighs Store Of Value According to the Athey &#38; Mitchnick Model used by Valhil Capital, XRP’s role goes way beyond sending payments. The study gives much more weight to people holding XRP like they would gold. In their view, as more folks start treating XRP as a place to park money, fewer coins stay in circulation. That tight supply pushes the price higher. The model blends economic ideas, real‑world trends, and crypto market moves to arrive at its numbers. Key Figures Drive Forecast Based on reports, the model assumes daily transactions on XRP Ledger will hit $700 billion by 2030. It uses a one‑second transaction speed and the current 56.5 billion XRP supply. With a 10% discount rate and a five‑year adoption window, the study pegs a mid‑case price of $4,813 if about 10% of global payments run on XRPL. In a more bullish view, the researchers push store‑of‑value demand to $1 quadrillion, which shoots the price beyond $9,000. Even a $100 trillion demand level would land XRP at $908 per token. Virtuous Cycle Could Fuel Growth Based on reports from Valhil Capital, the so‑called Virtuous Cycle Flywheel could spark a feedback loop. First, higher use of XRP for cross‑border payments and FX trades drives up demand. Then, price gains lure more holders to lock away their coins, shrinking the free float. That scarcity pushes prices even higher. As value climbs, new use cases could pop up, drawing in more users and adding another spin to the cycle. Regulation And Competition Loom Large XRP’s path to mass use isn’t smooth. Legal questions still swirl around its status in the US and elsewhere. That uncertainty may scare off big financial players. Plus, central bank digital currencies, stablecoins, and rival blockchains are all chasing the same slice of the cross‑border market. Related Reading: Crypto Bombshell: Developer Claims XRP Could Hit $20,000 Valhil Capital calls its forecast “conservative” because it skips markets like derivatives and real estate. Yet it also admits it can’t guess future rules or fresh ways people might use XRP. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Strong Ethereum Accumulation Detected: LTH Buying Heavy During June Consolidation",
      "link": "https://www.newsbtc.com/news/ethereum/strong-ethereum-accumulation-detected-lth-buying-heavy-during-june-consolidation/",
      "summary": "Ethereum is trading above $2,400 after enduring several days of volatility and uncertainty. The price has managed to stabilize despite sharp intraday swings, reflecting growing tension between bullish momentum and cautious sentiment. Analysts are now calling for a decisive move, with some expecting a breakout toward higher levels, while others warn of a possible correction if key demand zones fail to hold. Related Reading: Bitcoin Struggles Below ATH After Weeks Of Failed Attempts – $109K Level In Focus On one hand, ETH has shown strength by holding above its short-term support range, suggesting that buyers are stepping in with confidence. Bullish momentum appears to be building, especially as macro sentiment around risk assets begins to recover. On the other hand, opposing views point to weakening volume and lingering macroeconomic risks, which could trigger a deeper retracement if Ethereum fails to sustain current levels. Adding weight to the bullish case is fresh data from CryptoQuant, which highlights a strong accumulation pattern among long-term ETH holders. According to the data, significant buying pressure emerged during the recent consolidation phase, with hodlers steadily increasing their positions. This divergence between price action and accumulation behavior suggests that foundational support for Ethereum remains intact, even as traders await the next major move. Ethereum Accumulation Builds And Market Awaits Breakout Ethereum is struggling to reclaim the $2,500 level, but its ability to hold steady amid ongoing market uncertainty is a sign of underlying strength. For weeks, ETH has traded within a well-defined range between $2,200 and $2,800, with neither bulls nor bears able to take decisive control. This prolonged consolidation has delayed the long-anticipated altseason, which many believe will only begin once Ethereum breaks above key resistance and pushes into higher territory. Despite the lack of clear direction, the macro setup is becoming increasingly interesting. Global markets remain volatile, with shifting interest rate expectations, geopolitical risk, and unpredictable liquidity conditions creating mixed signals across risk assets. Yet Ethereum continues to hold firm, supported not just by technical structure but also by significant long-term holder activity. According to insights from CryptoQuant, a strong accumulation pattern has been detected among Ethereum holders. During the June consolidation phase, long-term investors steadily increased their positions, even as price action remained choppy. This divergence between price and accumulation volume signals growing confidence under the surface. When price consolidates while demand builds, the result is often explosive. With ETH holding key support levels and long-term accumulation rising, the stage may be set for a major move. If Ethereum can push through $2,500 and reclaim higher ground, it could serve as the ignition point for a broader altcoin rally. Until then, the market remains in a state of quiet buildup. Something big is coming—and Ethereum is at the center of it. Related Reading: Ethereum Sees $269M In Net Inflows In 24H – Bullish Momentum Accelerates ETH Struggles With Resistance Amid Mixed Signals Ethereum is currently trading at $2,470 after failing to hold intraday gains above the $2,500 level. The 12-hour chart shows ETH consolidating within a broader range, with $2,200 acting as strong support and $2,800 as key resistance. Despite several bullish attempts, Ethereum has struggled to reclaim higher ground, and the rejection near the 100-period SMA (green line at $2,537) signals persistent selling pressure near resistance. The price is currently trading above the 200 SMA ($2,170) and just under the 50 SMA ($2,507), which now acts as a short-term resistance. This tight positioning of moving averages suggests ETH is at a decision point—either it breaks through $2,500 to target $2,600 and higher, or it risks rolling over if bulls fail to hold momentum. Related Reading: ONDO Breaks Out Of Ascending Channel – Analyst Sets $0.29 Target Volume remains relatively flat, indicating indecision. The overall structure still favors a neutral-to-bullish bias, especially if price continues to close above the 200 SMA. However, a breakdown below $2,400 would increase the risk of a retest of the $2,200 support zone. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Pundit Warns Bitcoin Is Setting Up Liquidity Traps As It Campaigns For New ATHs",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-set-for-liquidity-traps/",
      "summary": "A seasoned crypto analyst has warned that the recent Bitcoin (BTC) price action may be setting the stage for major liquidity traps, echoing patterns seen in past cycles. As the leading cryptocurrency aims for new all-time highs, the pundit suggests that market makers could be deliberately engineering conditions for bear traps before triggering a powerful breakout. Bitcoin Path To ATH Riddled With Liquidity Traps Crypto market expert Luca has shared intriguing insights into Bitcoin’s latest price behavior, arguing that the market may be entering a classic liquidity trap phase allegedly orchestrated by market makers. The analyst stated in an X (formerly Twitter) post that Bitcoin’s price action since topping out in late May 2025 has followed a suspicious pattern. He noted that despite experiencing several price rallies, not a single local high has been swept in the past few weeks. Related Reading: Bitcoin Price At $110,000: Why BTC Must Break Out Of This Wedge Luca suggests that this rare price structure could be a deliberate setup, giving the illusion of stability and offering false conviction in bearish positions. The analyst warns that market makers have possibly influenced this market behavior by baiting shorts into entering or holding positions with the assumption that Bitcoin could continue to be capped below resistance. Ideally, this underpins the theory that bear traps are potentially being set as BTC gears up for its next bullish rally. Notably, multiple key resistance levels are now stacked tightly between $109,000 and $112,000, as highlighted on the analyst’s 4-hour Bitcoin chart. While BTC has been consolidating just below these levels, forming what appears to be a potential base, Luca argues that this price behavior is not a coincidence. Rather than market weakness, he believes the subdued price action reflects a calculated effort by market makers to encourage bearish complacency. The pundit interprets the deliberate avoidance of liquidity above these resistance lines as a signal that deeper bear traps are possibly being laid. Luca has revealed that this setup could be laying the groundwork for a sudden short squeeze, potentially igniting a sharp move toward a new all-time high for Bitcoin. Analyst Says BTC 2024 Breakout Back In Play Adding historical context to his analysis, Luca compares the current market structure to a prolonged consolidation phase observed throughout 2024. On the second 8-hour chart, a clear trendline of resistance can be seen capping Bitcoin’s upside for most of the previous year. Related Reading: Bitcoin Flashes Double Top Above $106,000: FVG Says A Large Crash Is Coming The chart shows that price action consistently failed to break above the descending barrier, with multiple attempts being rejected between March and October. Each rejection was marked by unswept highs—similar to the current market setup and suggesting that shorts were systematically being protected. This compression finally resolved in November 2024, when Bitcoin erupted through the resistance and launched a parabolic move to new highs. That breakout was fueled by the exact mechanism Luca now believes is in motion. With historical patterns now resurfacing, the analyst maintains that Bitcoin’s ongoing suppression and untouched highs are part of a blueprint that indicates a possible bullish move toward uncharted price territory. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Warning Signs? Long-Term Bitcoin Holders Take Profits as Leverage Spikes",
      "link": "https://www.newsbtc.com/bitcoin-news/warning-signs-long-term-bitcoin-holders-take-profits-as-leverage-spikes/",
      "summary": "Bitcoin continues to maintain its upward trajectory following a minor correction, now trading at $107,251, reflecting a 2.3% increase over the past week. Although still trailing its May all-time high of $111,000 by around 4%, the asset’s price action signals a notable return of momentum. The crypto market, led by Bitcoin, has seen renewed trading activity in recent weeks as investor sentiment oscillates between bullish optimism and profit-taking behavior. According to new on-chain data analyzed by CryptoQuant contributor Amr Taha, Bitcoin may be approaching a critical phase that demands greater attention from market participants. Related Reading: $179,000 Or $79,000? Bitcoin Faces Critical Cycle Pivot, Says Analyst Open Interest Spikes Signal Potential Profit-Taking Zones In his analysis titled &#8220;Binance Open Interest Spikes and Long-Term Holder De-risking: Bitcoin is Approaching a Turning Point&#8221;, Taha highlights two developing trends: repeated spikes in open interest on Binance and a significant drawdown in long-term holders’ exposure. Both indicators, he suggests, reflect changing market dynamics that could influence Bitcoin’s short-term trajectory. One of the key observations from Taha’s analysis is the behavior of Binance’s 24-hour open interest (OI), which has exceeded 6% for the third time in two months. Historical patterns indicate that previous occurrences on May 26 and June 10 were followed by short-term price corrections or periods of consolidation. These spikes often indicate an increase in leveraged trading positions, which tend to precede short-term profit-taking as traders seek to lock in gains. This trend may suggest that Bitcoin is entering another phase of heightened volatility where rapid shifts in market sentiment could influence price direction. The presence of leveraged positions, particularly at elevated price levels, increases the likelihood of sudden liquidations or pullbacks. While this does not confirm an imminent reversal, it marks a zone where caution may be warranted, especially for short-term traders. Such spikes in open interest often act as precursors to more conservative positioning or brief market cooling periods. Bitcoin Long-Term Holders Reduce Risk Exposure In addition to rising speculative activity, a separate trend tracked by Taha focuses on the behavior of long-term holders (LTHs). Data shows that the LTH Net Position Realized Cap, a measure of the realized value of Bitcoin held by these investors, has declined sharply, falling from over $57 billion to just $3.5 billion. This reduction points to active profit-taking among more strategic investors, possibly in response to macroeconomic developments or uncertainty surrounding the current market cycle. Related Reading: Bitcoin Price Could Rally To $110,000 ATH As These Macroeconomic Factors Align While this shift in behavior does not automatically imply a bearish outlook, it suggests that experienced investors are trimming exposure after a notable price rally. Historically, long-term holders have exhibited a higher degree of market foresight, making this activity worth noting. Combined with elevated open interest and a potential cooling-off period, these developments highlight the possibility of increased short-term volatility without fundamentally altering the long-term bullish structure of Bitcoin’s market. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin Dominance Shows Bearish Divergence – Altseason Could Be Near",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-dominance-shows-bearish-divergence-altseason-could-be-near/",
      "summary": "Bitcoin briefly pushed into the $108,800 level a few hours ago but was once again unable to reclaim higher prices, reinforcing the key resistance just below its all-time high. This rejection has left the market in a state of caution, with investors expecting increased volatility in the coming sessions. As BTC continues to hover below the $109,300 mark, traders are watching closely for signs of either a confirmed breakout or a potential pullback. Related Reading: Bitcoin Struggles Below ATH After Weeks Of Failed Attempts – $109K Level In Focus Adding a new layer to the current setup, top analyst Ted Pillows shared a notable development in Bitcoin dominance. According to Pillows, the Bitcoin Dominance chart is now showing a daily bearish divergence—a classic signal that often precedes a shift in momentum from Bitcoin to altcoins. This divergence occurs when BTC dominance trends higher while momentum indicators begin to weaken, suggesting that Bitcoin’s relative strength may be peaking. For altcoin investors, this could be an early signal of a shift. Historically, bearish divergences in dominance have lead to strong altcoin rallies, as capital begins flowing from BTC into higher-beta assets. While Bitcoin consolidates near resistance, attention may soon shift toward altcoins, setting the stage for a possible altseason. Bitcoin Consolidates As Charts Signal Altcoin Rotation Following the resolution of global tensions between the US, Israel, and Iran, Bitcoin surged above the $105,000 level, signaling renewed confidence across global risk markets. The move marked a key recovery from previous uncertainty, with BTC taking back critical support and shifting focus back toward the $110,000 resistance zone. However, despite the initial breakout, Bitcoin has struggled to push into uncharted territory. Price action remains choppy and directionless, with the market hesitating ahead of what many believe could be a decisive move. Analysts continue to call for a breakout, citing strong accumulation trends, improving macroeconomic conditions, and a bullish long-term structure. Yet the inability to break above the $109,300–$110,000 range raises concerns about weakening momentum. The longer Bitcoin remains capped below resistance, the more likely it is that capital may begin to rotate into other parts of the market. Top analyst Ted Pillows recently shared key insights supporting that thesis. According to Pillows, Bitcoin dominance is showing a daily bearish divergence—a classic sign of impending trend reversal. As BTC dominance climbs but momentum weakens, it suggests that Bitcoin’s recent strength may be fading, and a shift toward altcoins could be underway. Historically, bearish divergences in BTC dominance have often preceded sharp corrections in Bitcoin and explosive rallies across the altcoin market. As Bitcoin consolidates and its dominance loses strength, conditions may be forming for the next big altseason. While nothing is guaranteed, the combination of geopolitical relief, market indecision, and technical signals suggests that a sharp rotation could be close. Traders are now watching both BTC price and dominance levels closely, knowing that once momentum shifts, the move could be swift and powerful. Related Reading: Ethereum Sees $269M In Net Inflows In 24H – Bullish Momentum Accelerates ETH/BTC Chart Shows Signs Of Reversal The ETH/BTC weekly chart reveals a prolonged downtrend that has persisted since late 2022, with Ethereum consistently underperforming against Bitcoin. Since peaking above 0.085 BTC in late 2022, the pair has steadily declined, now trading around 0.0228 BTC—a level not seen since 2020. This confirms that Bitcoin has been the clear market leader for nearly two years, adding most of the capital inflow during bullish phases while altcoins, including Ethereum, lagged behind. However, current price action shows early signs that this trend may be nearing its end. ETH/BTC appears to have found a local bottom, just above the 0.02 BTC zone, after a steep drop. Although the pair remains well below the 50 (weekly), 100, and 200 moving averages, the selling momentum has clearly slowed, and volume has begun to stabilize. Related Reading: Ethereum Holds Critical Long-Term Channel – Next Move Could Be Parabolic This phase suggests that a swing could be forming. If Ethereum can reclaim higher support levels and Bitcoin dominance continues to show bearish divergence—as noted in recent market analyses—the ETH/BTC ratio could start trending higher once again. A rotation from Bitcoin into Ethereum and other altcoins may soon follow, potentially marking the beginning of a new phase in the crypto cycle where altcoins start to outperform. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "German Bank Sparkassen-Finanzgruppe Plans to Offer Bitcoin For Private Customers",
      "link": "https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/German-Bank-Sparkassen-Finanzgruppe-Plans-to-Offer-Bitcoin-For-Private-Customers.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers\" rel=\"nofollow\"> </a></p> <p>Germany's largest savings bank financial group will allow private customers to trade Bitcoin and other cryptocurrencies by 2026, in partnership with DekaBank.</p> <p>"
    },
    {
      "title": "How Institutional Flows and Market Cycles Are Shifting",
      "link": "https://bitcoinmagazine.com/markets/how-institutional-flows-and-market-cycles-are-shifting",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/How-Institutional-Flows-and-Market-Cycles-Are-Shifting.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/how-institutional-flows-and-market-cycles-are-shifting\" rel=\"nofollow\"> </a></p> <p>Is bitcoin going higher or lower? Fundamentals are still strong, and post-halving trends show a predictable pattern.</p> <p>"
    },
    {
      "title": "Are Bitcoin Treasury Companies Ponzi Schemes?",
      "link": "https://bitcoinmagazine.com/takes/are-bitcoin-treasury-companies-ponzis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_Generated_Image_xrkcodxrkcodxrkc-1.jpeg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/are-bitcoin-treasury-companies-ponzis\" rel=\"nofollow\"> </a></p> <p>Financial machines of perpetual motion don’t work but bitcoin treasury companies are certainly trying. Why would this fad be any different?</p> <p>"
    },
    {
      "title": "Vanadi Coffee Shareholders Approve €1 Billion Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/vanadi-coffee-shareholders-approve-e1-billion-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Vanadi-Coffee.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/vanadi-coffee-shareholders-approve-e1-billion-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Shareholders of Vanadi Coffee have approved a plan to invest up to €1 billion in Bitcoin as part of a new strategy to manage the company’s finances. This move puts the small café chain, which runs six locations in Alicante, on track to become the largest publicly listed Bitcoin-holding company in Spain.&#160; According to an [&#8230;]</p> <p>"
    },
    {
      "title": "Strategy Acquires $531.9 Million in Bitcoin, Now Holds 597,325 BTC",
      "link": "https://bitcoinmagazine.com/news/strategy-acquires-531-9-million-in-bitcoin-now-holds-597325-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Strategy-Acquires-531.9-Million-in-Bitcoin-Now-Holds-597325-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/strategy-acquires-531-9-million-in-bitcoin-now-holds-597325-btc\" rel=\"nofollow\"> </a></p> <p>Strategy, formerly Microstrategy, has announced the acquisition of an additional 4,980 Bitcoin for approximately $531.9 million, according to a new SEC Form 8-K filed on June 30, 2025. The average purchase price was $106,801 per Bitcoin, inclusive of fees and expenses. The purchase was funded by an equity raise from June 23–29, 2025, across its [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Rex-Osprey Solana ETF to Debut 'First-Ever' US Crypto Fund With Staking",
      "link": "https://decrypt.co/327872/rex-osprey-solana-etf-debut-first-ever-us-crypto-fund-staking",
      "summary": "Rex Shares and Osprey Funds is set to launch the first U.S. ETF offering direct Solana exposure with staking rewards."
    },
    {
      "title": "Mark Zuckerberg Unveils New Meta AI Lab After Poaching OpenAI Talent",
      "link": "https://decrypt.co/327894/after-poaching-openai-talent-mark-zuckerberg-unveils-new-meta-ai-lab",
      "summary": "Meta is throwing huge bucks to lure away top talent in the high-stakes AI race, prompting the company to give its employees the week off to cool down."
    },
    {
      "title": "Solana Advisor Nikita Bier Joins Elon Musk's X, Reigniting Crypto Payments Speculation",
      "link": "https://decrypt.co/327908/solana-advisor-nikita-bier-joins-elon-musk-x-crypto-payments",
      "summary": "Bier’s announcement is fueling speculation about X's future crypto payment plans, including long-rumored Dogecoin integration."
    },
    {
      "title": "Trump Admin Beats Coinbase, Privacy Advocates in Supreme Court IRS Showdown",
      "link": "https://decrypt.co/327898/trump-admin-beats-coinbase-privacy-advocates-supreme-court-irs-showdown",
      "summary": "The Supreme Court declined on Monday to hear a case that could have re-examined whether crypto exchanges like Coinbase need to comply with government requests for customer data."
    },
    {
      "title": "How GameStop Inspired This Lingerie MMA League to Bet on Bitcoin",
      "link": "https://decrypt.co/327861/how-gamestop-inspired-lingerie-mma-league-bet-bitcoin",
      "summary": "Lingerie Fighting Championships started to seriously consider Bitcoin as a treasury asset following GameStop's recent buy."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Circle applies for national trust bank license to expand USDC reserve custody",
      "link": "https://cryptobriefing.com/circle-trust-bank-license-tokenized/",
      "summary": "<p>Circle seeks a trust bank license to directly manage USDC reserves and offer custody for tokenized stocks and bonds onchain.</p> <p>"
    },
    {
      "title": "SEC to rule on Grayscale’s proposal to convert Bitcoin, Ether, XRP, and ADA large-cap fund into a spot ETF this week",
      "link": "https://cryptobriefing.com/crypto-etf-approval-grayscale/",
      "summary": "<p>Approval could set a precedent for broader crypto ETF adoption, potentially transforming investment landscapes and regulatory approaches.</p> <p>"
    },
    {
      "title": "Ripple-backed XRP Ledger launches EVM-compatible sidechain to unlock cross-chain DeFi",
      "link": "https://cryptobriefing.com/xrpl-evm-sidechain-cross-chain-defi/",
      "summary": "<p>The launch of the EVM-compatible sidechain on the XRP Ledger could significantly enhance cross-chain DeFi, fostering broader blockchain interoperability.</p> <p>"
    },
    {
      "title": "Backed rolls out tokenized Apple, Microsoft, and Amazon stocks on Bybit and Kraken",
      "link": "https://cryptobriefing.com/kraken-tokenized-stock-trading/",
      "summary": "<p>Kraken's xStocks could revolutionize global equity access, challenging traditional markets and enhancing blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Kazakhstan plans to establish national crypto reserve using seized and state-mined assets",
      "link": "https://cryptobriefing.com/kazakhstan-crypto-asset-reserve/",
      "summary": "<p>Kazakhstan's crypto reserve initiative could enhance financial innovation and regulatory frameworks, potentially influencing global crypto policies.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Identifying Cardano’s next short-term target as bulls seek reversal",
      "link": "https://ambcrypto.com/identifying-cardanos-next-short-term-target-as-bulls-seek-reversal/",
      "summary": "<img alt=\"Identifying Cardano&#039;s next short-term target as bulls seek reversal\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Cardano-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Weak bearish pressure over the past week could allow ADA to establish a bullish structure."
    },
    {
      "title": "Bitcoin to $130K? –  BTC traders, watch THESE levels next",
      "link": "https://ambcrypto.com/bitcoin-to-130k-btc-traders-watch-these-levels-next/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-1-1.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Heightened liquidations clusters around the current Bitcoin price could define the next targets."
    },
    {
      "title": "Toncoin: Can a 42% hike in whale inflows propel TON to $3.28?",
      "link": "https://ambcrypto.com/toncoin-can-a-42-hike-in-whale-inflows-propel-ton-to-3-28/",
      "summary": "<img alt=\"TON\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-30T120257.392-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Toncoin’s breakout potential strengthens as on-chain growth aligns with rising trading and user activity."
    },
    {
      "title": "Ethereum accumulation hits record high – Will ETH explode past $3K?",
      "link": "https://ambcrypto.com/ethereum-accumulation-hits-record-high-will-eth-explode-past-3k/",
      "summary": "<img alt=\"Ethereum accumulation hits record high - Will ETH explode past $3K?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-5-4.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With the tide in its favor, Ethereum may be all set for a summer breakout."
    },
    {
      "title": "Can XRP’s price ape 2017’s pattern after institutions move $1 billion?",
      "link": "https://ambcrypto.com/can-xrps-price-ape-2017s-pattern-after-institutions-move-1-billion/",
      "summary": "<img alt=\"Can XRP&#039;s price ape 2017&#039;s pattern after institutions move $1 billion?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-12.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP could ape 2017's price movement if all goes according to plan."
    }
  ]
}