{
  "CoinDesk": [
    {
      "title": "Polymarket Partners Up With Elon Musk's xAI",
      "link": "https://www.coindesk.com/business/2025/06/06/polymarket-partners-up-with-elon-musks-xai",
      "summary": ""
    },
    {
      "title": "AVAX Surges 6% After Musk-Trump Dispute Sell-Off",
      "link": "https://www.coindesk.com/markets/2025/06/06/avax-surges-6-after-musk-trump-dispute-sell-off",
      "summary": ""
    },
    {
      "title": "Stablecoin Fever With Circle Soaring Another 40%: Apple, X Among Those Reportedly Wanting In",
      "link": "https://www.coindesk.com/business/2025/06/06/stablecoin-fever-as-circle-soars-apple-x-airbnb-are-reportedly-exploring-stablecoin-integration-to-cut-payment-costs",
      "summary": ""
    },
    {
      "title": "TON Finds 'Strong Support' at $3.00 Level Amid Wild Crypto Price Swings",
      "link": "https://www.coindesk.com/markets/2025/06/06/ton-finds-strong-support-at-300-level-amid-wild-crypto-price-swings",
      "summary": ""
    },
    {
      "title": "Cardano's ADA Finds 'Strong Support' After Dramatic Price Swings Amid Heightened Volatility",
      "link": "https://www.coindesk.com/markets/2025/06/06/cardano-surges-3-after-dramatic-10-plunge-finds-strong-support",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Price predictions 6/6: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, HYPE, SUI, LINK",
      "link": "https://cointelegraph.com/news/price-predictions-6-6-btc-eth-xrp-bnb-sol-doge-ada-hype-sui-link?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ1ZWYtYjRjZC03M2EyLWJmMjgtZDM4N2QzN2NlOWE1.jpg\" /></p><p>Bitcoin’s sharp rebound off the $100,000 level shows a positive sentiment, but higher levels may attract sellers.</p>"
    },
    {
      "title": "Bitcoin rebounds to $105K, but is a &#039;bull trap&#039; underway?",
      "link": "https://cointelegraph.com/news/bitcoin-rebounds-above-105k-but-is-a-bull-trap-underway?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ1Y2MtYjhhYy03ZjdlLWFlN2EtMDk5OWJhNzI5ZTIz.jpg\" /></p><p>Market uncertainty grows as traders question leverage risks, custodian practices, and strategic reserve delays.</p>"
    },
    {
      "title": "How to earn passive income with peer-to-peer lending",
      "link": "https://cointelegraph.com/news/how-to-earn-passive-income-with-peer-to-peer-lending?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzJmYzItY2NkMC03ZWZmLTk1YmItN2UzMTI1YjNjODA2.jpg\" /></p><p>In peer-to-peer crypto lending, knowing how to exit safely when rates fall or platforms falter is just as important as getting started.</p>"
    },
    {
      "title": "Mass data deletion is a call to digital preservation action",
      "link": "https://cointelegraph.com/news/mass-data-deletion?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmMzNzQtYWFmMC03NDE0LWI5ODMtZjIwNTIwNDU0MTZl.jpg\" /></p><p>When administrations erase or quietly remove public data sets, it’s not just bureaucratic housekeeping — it’s a threat to transparency, accountability and the collective memory of society.</p>"
    },
    {
      "title": "Bitcoin nears $105K as Donald Trump demands &#039;full point&#039; Fed rate cut",
      "link": "https://cointelegraph.com/news/bitcoin-nears-105k-donald-trump-demands-full-point-fed-rate-cut?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTY1YjMtN2FjOC03MDEwLWFiNWEtNTcyZTM0YmRmMTE1.jpg\" /></p><p>Bitcoin manages to shake off a US nonfarm payrolls beat as Trump insists yet again that the Fed begins to cut interest rates — will Chair Jerome Powell listen?</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Yuga moves to kill ApeCoin DAO, transfer $168M in assets to new entity",
      "link": "https://cryptoslate.com/yuga-moves-to-kill-apecoin-dao-transfer-168m-in-assets-to-new-entity/",
      "summary": "<p>Yuga Labs has proposed dissolving the ApeCoin DAO and replacing it with a new governing body, ApeCo. This would mark a decisive shift in the management structure of one of Web3’s most recognizable token communities. Filed as an AIP proposal on June 5, the plan would sunset the DAO and transfer all major assets, including [&#8230;]</p> <p>"
    },
    {
      "title": "Institutional Bitcoin ETF holdings decline while direct corporate BTC reserves gain traction",
      "link": "https://cryptoslate.com/institutional-bitcoin-etf-holdings-decline-while-direct-corporate-btc-reserves-gain-traction/",
      "summary": "<p>Institutional allocations to spot Bitcoin ETFs declined for the first time since their introduction, according to Q1 2025 13F filings. However, corporate Bitcoin ownership shows little sign of declining overall. The data marks a shift from the strong initial inflows that followed the funds’ January 2024 launch, as hedge funds reduced exposure and the futures-based [&#8230;]</p> <p>"
    },
    {
      "title": "Trump Media submits new SEC filing to purchase $2.3B Bitcoin reserve",
      "link": "https://cryptoslate.com/trump-media-submits-new-sec-filing-to-launch-2-3b-bitcoin-reserve-strategy/",
      "summary": "<p>Trump Media &#38; Technology Group has filed a Form S-3 with the U.S. Securities and Exchange Commission, registering 85 million securities related to its previously closed $2.44 billion Bitcoin treasury deal. The filing also includes a universal shelf registration, granting the company flexibility to issue additional securities in the future as part of a broader [&#8230;]</p> <p>"
    },
    {
      "title": "FCA clears path for UK retail crypto ETF trading—kind of",
      "link": "https://cryptoslate.com/fca-clears-path-for-uk-retail-crypto-etf-trading-kind-of/",
      "summary": "<p>The UK’s Financial Conduct Authority has proposed lifting its longstanding ban on crypto exchange-traded notes for retail investors, opening the door for broader access to regulated crypto exposure through public investment exchanges. The move, announced June 6, forms part of a broader regulatory push to bolster market competitiveness and reduce barriers for financial firms. Retail [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet’s ambitious $5.4B Bitcoin acquisition plan sets sights on 210k BTC",
      "link": "https://cryptoslate.com/metaplanets-ambitious-5-4b-bitcoin-acquisition-plan-sets-sights-on-210k-btc/",
      "summary": "<p>Metaplanet has launched what it calls Asia’s largest equity raise dedicated to Bitcoin. According to CEO Simon Gerovich, the company is issuing 555 million shares through moving strike warrants in a ¥770.9 billion ($5.4 billion) capital raise. The firm has also acquired 1,088 BTC for ¥16.9 billion ($117.5 million), increasing its on-chain holdings to 8,888 [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Could Break The Dollar — $250K Prediction Still In Play, Billionaire Says",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-could-break-the-dollar-250k-prediction-still-in-play-billionaire-says/",
      "summary": "Tim Draper, a Silicon Valley venture capitalist, has doubled down on his call for Bitcoin to hit $250,000 by the end of 2025. He shared this on X, renewing a prediction he first made in 2018 when he set his sights on reaching that mark by 2022. Related Reading: Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge Back then, the crypto market took a sharp downturn in 2022—thanks in part to FTX’s collapse—and the timeline slipped. Still, Draper believes today’s drivers are strong enough to push prices higher. He even suggested that the US dollar might vanish in a decade as Bitcoin takes its place. Tim Draper’s Bold Timeline According to Draper, the $250,000 target isn’t just wishful thinking. In 2018, he said Bitcoin would reach that level by 2022. It didn’t happen—2022 saw many digital assets tumble in value. This year, though, he repeated his forecast after seeing a “recent surge” in the crypto. Bitcoin might go infinite against the dollar. On the heels of the recent surge, I’m still expecting Bitcoin to reach $250,000 this year. Whether Bitcoin will keep gaining ground that fast, who knows. But the main factors pushing it forward right now are: → General optimism… pic.twitter.com/EiD36iYbRy — Tim Draper (@TimDraper) June 4, 2025 He also claimed Bitcoin could become “infinite against the dollar,” arguing that in 10 years the US dollar wouldn’t exist. His confident tone suggests he’s sticking with the same numbers—$250,000 by December 31, 2025. Political And Regulatory Drivers Based on reports, Draper points to politics as a big catalyst. He highlighted moves by US President Donald Trump, who is working on new trade deals. One sign of this push is the Media &#38; Technology Group’s filing on June 5, 2025, for a Truth Social Bitcoin ETF. That application is headed to the NYSE Arca, with Crypto.com lined up as custodian, and it aims to bring more mainstream money into Bitcoin. On the regulatory front, the US Senate voted 66–32 on May 19 to advance the GENIUS Act, which would set rules for stablecoins. Plus, the Digital Asset Market Clarity Act of 2025 is under debate. It has bipartisan support and is meant to spell out clear rules for crypto. Financial Institutions And Adoption Draper also sees banks and big companies stepping in. He mentioned that JP Morgan plans to let its clients buy Bitcoin and use spot-BTC ETFs—like BlackRock’s IBIT—as collateral. That shift could open doors to a flood of institutional cash. Meanwhile, according to Bitcoin Treasuries data, Michael Saylor’s Strategy leads the pack, holding over 580,000 BTC. At current prices, that stash is worth about $61 billion. These moves, Draper argues, point to people treating Bitcoin more like gold than a risky token. Related Reading: Bitcoin Network Activity Booming Despite A Quiet Market—Data Technological Advances On Bitcoin In his view, the tech upgrades on Bitcoin matter too. He talked about Web3 apps built on Bitcoin and said “Layer 2 solutions give Bitcoin the flexibility of Ethereum.” Right now, Lightning Network handles many Bitcoin transactions, making payments faster and cheaper. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Bullish Signs For Ethereum: Metrics Pointing To Upcoming Breakout",
      "link": "https://www.newsbtc.com/news/ethereum/bullish-signs-for-ethereum-metrics-pointing-to-upcoming-breakout/",
      "summary": "The Ethereum (ETH) price experienced a significant decline on Thursday, falling over 7% and approaching the $2,400 mark. However, expert analysis suggests that a new bullish trend may soon emerge for the second-largest cryptocurrency. Key Metrics Indicate Accumulation By Larger Investors Market analyst Lark Davis took to social media platform X (formerly Twitter) to share insights on Ethereum&#8217;s potential. He noted that various on-chain metrics and market behaviors indicate an impending breakout for the ETH price. Notably, Ethereum has been outperforming Bitcoin (BTC) in the second quarter of the year, suggesting growing investor confidence. The recent Pectra upgrade has improved Ethereum’s scalability and reduced its inflation rate, making it more attractive to investors. Related Reading: Bitcoin Price Crash To $100,00 Loading: Next Targets Revealed As Bears Take Over Additionally, the expert highlights that with exchange balances hitting seven-year lows and substantial inflows into Ethereum exchange-traded funds (ETFs), it appears that larger investors are accumulating ETH for the long term. Despite these bullish indicators, Davis cautioned that not all market participants share this optimistic outlook. Betting markets on Polymarket currently assign only a 27% chance that Ethereum will reach a new all-time high by 2025. Critical Support For Ethereum Amid Political Disputes The broader cryptocurrency market also faced challenges on Thursday, with total market capitalization dropping from $3.30 trillion to approximately $3.12 trillion. Bitcoin, XRP, and Solana (SOL) were among the notable cryptocurrencies experiencing losses, retracing by 3%, 5%, and 6%, respectively. In a separate but related development, tensions between US President Donald Trump and his former adviser Elon Musk have surfaced, adding to the day’s market volatility. Trump expressed disappointment over Musk&#8217;s criticism of a key tax and spending bill from his administration, suggesting that their &#8220;great relationship&#8221; may be nearing its end. Musk retaliated by accusing Trump of ingratitude, claiming his support was instrumental in Trump’s election victory. Related Reading: Crypto Analyst Warns: This Bitcoin Bull Cycle Looks Nothing Like 2017 or 2021 This public dispute has drawn attention to the intersection of US politics and cryptocurrency, a dynamic that market analyst Income Sharks noted in a recent post on Elon Musk’s social media site, X. The analyst remarked on the swift impact of political conflicts on crypto markets, emphasizing that the Ethereum price has not yet lost critical support levels. Income Sharks, in his analysis, identified the $2,390 mark as a crucial support point for the altcoin in the immediate term, which could determine the next upward targets of $3,000 and $4,000. While trading at $2,406 when writing, Ethereum finds itself well below its all-time high reached during the market’s last bullish cycle in 2021. As of now, the altcoin stands 50% below its record of $4,878, according to CoinGecko data. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Cycle Top Is In—$270,000 Delayed Until 2026, Says Analyst",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-cycle-top-in-270000-delayed-until-2026/",
      "summary": "Bitcoin’s majestic 2024-25 ascent may have stalled at the very moment many traders expected an early-summer melt-up, according to crypto analyst Dr Cat (@DoctorCatX). In an extended thread published today, the Ichimoku-focused technician argues that the market printed a “valid cycle high” on the weekly chart and has now slipped into neutral territory—potentially postponing the next decisive breakout until mid-July or, failing that, as late as the first quarter of 2026. Bitcoin Bottom Not In? “I warned multiple times that we can’t be bullish on the weekly before the 9th of June,” Dr Cat reminded followers. The Chiko Span (CS) “entered the candles” last week, he noted, stripping the weekly timeframe of its bullish bias even though the long-term monthly structure remains intact. “Because the monthly chart is bullish, things are still long-term bullish,” he conceded, yet the immediate path higher has narrowed to two clear windows. Related Reading: The Last Bitcoin Cycle? Swan Says History’s Turning The first window opens in the week beginning 16 June. If Bitcoin starts that week above $99,881 and closes with CS breaking cleanly above the candle range, Dr Cat believes “the moonshot, potentially to $270,000,” could ignite. Should price open below that threshold, a textbook CS tracing pattern would already be underway, pushing the next breakout target to the week commencing 14 July (or the one immediately after). “Simply because these are the places where CS can make a clear breakout above the candles terminating a CS tracing,” he explained. Below $93,200—the current position of the weekly Kijun Sen—the bullish countdown is voided. “If the Kijun Sen at 93.2K is lost, we consider much later breakout,” Dr Cat warned, pointing traders to a broad monthly window between November 2025 and April 2026 when the Kijun Sen itself is expected to slope upward again. Until then, he is “not confident that the bottom is in,” flagging $97–98 K as a short-term confluence zone in which the daily Kumo cloud, the weekly Tenkan Sen and the two-day Kijun Sen intersect. The analysis comes at a delicate moment for sentiment. Bitcoin’s April all-time high above $111,999 has so far resisted several retests, and funding rates on major derivatives venues have eased from euphoric to merely positive. For Dr Cat, such moderation is consistent with Ichimoku’s Kihon Suchi 17-period rhythm: “Time cycles … give a valid cycle high on the weekly. I think at this point it obviously printed,” he wrote, implying that a fresh consolidation phase is statistically favored. Altcoin Season Even Further Delayed Altcoins face an even steeper uphill battle. In a companion post dissecting the TOTAL3 index (the market capitalization of all crypto assets excluding Bitcoin and Ethereum), Dr Cat argued that “altcoins are not ready to pump on the weekly and need minimum 1-2 months for that in the most bullish scenario.” Related Reading: Crypto Analyst Warns: This Bitcoin Bull Cycle Looks Nothing Like 2017 or 2021 He cited four overlapping bearish ingredients: price below the weekly Kijun Sen, a negative Tenkan–Kijun cross, a Chiko Span trapped beneath the candle “forest,” and a Kijun Sen poised to turn down next week. “The chance for a bullish altcoins explosion in June is around 5 %,” he concluded, assigning a roughly equal probability that Bitcoin alone could rally while “dominance destroys alts.” That dour appraisal extends to Ethereum and other large caps. In Dr Cat’s view, “blindness … applies to anyone expecting a parabolic bull run above ATH in June for TOTAL3.” The first legitimate “window of opportunity for altcoin bulls,” he adds, does not open until August, when the weekly CS will encounter a thinner overhang of historic candles. Market implications hinge on whether Bitcoin can defend its higher-timeframe pivots long enough to align with those temporal windows. So far, the $93.200 Kijun Sen serves as the demarcation line between an orderly pause and a deeper retracement. A weekly close beneath it would “activate” the November-to-April contingency track—effectively pushing any move toward Dr Cat’s headline $270,000 projection into the next halving cycle. At press time, BTC traded at $103,072. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Kuaishou’s Kling AI Tool Gears Up to Hit $100M in Sales; AI Coins Like SUBBD to Explode",
      "link": "https://www.newsbtc.com/news/ai-coins-like-subbd-to-explode/",
      "summary": "Kuaishou’s AI video tool – Kling – is now a top-earning AI video generation tool. In April and May of 2025 alone, it pulled in a hefty $14M. Given its high demand, Kling’s on track to hitting a whopping $100M in sales by February. This is proof that demand for AI-generated video content is exploding – a boon for AI crypto projects like SUBBD Token ($SUBBD). Kling Makes Pro-Quality AI Video Creation Affordable Since its June 2024 launch, Kling AI has rolled out over 20 updates. The changes were aimed at enhancing core model performance, refining image clarity, and introducing innovative features for video creators. By using the AI tool&#8217;s ‘inspiration credits,’ anyone, from solo creators to major brands, can tap into Kling&#8217;s powerful video creation capabilities. The model is extremely straightforward: Want sharper, high definition videos? Spend more credits. Want to save on budget? Lower the tool&#8217;s parameters. It’s super cost-effective, too. For just one dollar, you get 66 credits. Top-quality videos cost approximately 100 credits, whereas simpler versions cost just 20. By using Kling AI, creators now enjoy the freedom to scale their content based on budget, quality, and turnaround times. Tencent Holdings &#38; Alibaba Capitalize on AI Video Hype The AI video space is heating up with growing competition. Hunyuan Video, launched by Tencent Holdings in December 2024, delivers high-quality cinematic video generation with advanced features. These features include dynamic camera movement, lifelike reflections, and seamless transitions between realistic and animated picture styles. Alibaba is also in on the trend, having released Wan 2.1 in February 2025 – a proprietary suite of open-source AI models. The models are designed for high-quality video generation based on text and image inputs. It’s also gearing up for a major upgrade, Wan 2.1-VACE, which will expand its functionality with advanced tools for reference-to-video generation and video-to-video editing. Let&#8217;s not forget OpenAI. The company is now developing Sora, a new tool for automated video generation. And then there&#8217;s Runway AI&#8217;s $3B valuation. Each of these developments signals a promising future for the SUBBD Token ($SUBBD), which goes a step further. This new crypto project delivers a full-suite of AI powered tools – not just video creation, but also online content management. SUBBD Leverages AI &#38; Crypto to Reshape Creator Workflows $SUBBD powers a next-gen content creation platform that streamlines creators&#8217; workflows and boosts community engagement through AI and Web3 technology. The digital content creation industry is booming, predicted to grow at a CAGR of 9.59% and reach $39.3B by 2032. Yet, despite the growth, creators still face serious challenges: High management and platform fees; Strict content policies on major platforms; Fragmented AI tools requiring multiple subscriptions; Outdated or slow payment systems. Thankfully, this is where the SUBBD ecosystem comes in, offering a seamless experience for AI-assisted content creation, editing, and monetization. The project achieves this through various AI tools, including a video generator, custom voice creator, and automatic live-streams. Meanwhile, fans get direct access to their favorite creators, and can enjoy personalized ecosystem fees and exclusive content – without having to rely on intermediaries. Influencers also benefit significantly thanks to a personal AI assistant. This tool is programmed to manage interactions and content schedules. Beyond content and engagement optimization, the personal assistant is an all-in-one tool that also boosts earnings by slashing third-party fees. Buying $SUBBD also ensures subscription discounts, staking rewards at a 20% APY, and XP multipliers for the platform&#8217;s raffles, games, and events. SUBBD to Soar as AI Video Craze Blows Up Kuaishou’s Kling AI is on track to reach $100M in sales. This, coupled with the success of similar providers, like Hunyuan Video, Wan 2.1, Sora, and Runway, demonstrates just how quickly AI-driven video content is scaling. As demand for streamlined, AI-powered content creation continues to rise, SUBBD stands out with its crypto-AI platform that unlocks additional monetization opportunities for creators (including automated live streams and token rewards). To get involved, all you need to do is buy $SUBBD on presale for as little as $0.0556. The presale has raised over $600M so far, and the price is going to increase again in two days. High-earning creators moving to the platform could further push the coin to $0.438 this year – a 687% gain, based on the current price. Before making any investment decisions, always do your own research first and never spend more than you’d be willing to lose."
    },
    {
      "title": "XRP Price Sends Mixed Signals After 4 Green Daily Closes, Crash Or Rally?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-sends-mixed-signals/",
      "summary": "The XRP price has now moved back into bearish territory after a remarkable run on the daily chart that had been signaling possible bullish momentum. Crypto analyst Master Ananda points this out in a post that shows a disturbing trend in the XRP price chart. If this continues, then the future of XRP, at least in the short term, has become even more uncertain, with bears fighting for more control. 4 Green Daily Closes Fall to Nothing After suffering a crash along with the rest of the crypto market, the XRP price had faced a recovery that seemed to have put it right back on track to rally again. This saw the first green daily close on the last day of May and then carried on into the new month of June. The first three days also closed in the green, leading to four consecutive daily green closes, which is usually bullish for the price. Related Reading: Bitcoin Price Crash Below $100,000 Still Possible: Analysts Issue Downtrend Warnings However, there was just another part of the trend that was not completed to show that this was a bullish move, and it has to do with volume. As Master Ananda pointed out, a spike in volume was expected as the XRP price put in a higher low. This would mean there is the momentum needed to push the price back up. But this was not the case as the volume plummeted and remained muted. The absence of this expected volume suggests there is weakness surrounding the XRP price, and this played out as the next day saw a red close for the altcoin for the first time in June. If this lack of momentum continues, then the price could continue to plummet. So far, there is now resistance mounting at the 0.382 Fibonacci level, which is $2.2959. This resistance would need to be cleared with a spike in volume if there is to be a recovery in the XRP price. Otherwise, it risks a fall back down to the 0.236 Fibonacci level, meaning the first steps toward falling below $2. Related Reading: XRP Price Could Hit $21 This Bull Cycle With 1.618 Fib Level As Next Target XRP Price Could Fall As Volumes Suffer Data from Coinglass shows how bad the XRP volume has been recently. So far in June, daily volume has remained well below $5 billion, reminiscent of the bear market figures whenever the price was falling. This also shows reduced participation from investors who are wary of entering the market during such conditions. Interestingly, though, open interest remains rather high, $3.94 billion, showing that crypto traders are actively betting on the XRP price. However, the majority are betting that the XRP price will continue to fall from here, with Coinglass data showing 52.75% of all positions being short compared to only 47.25% betting the price will increase. Featured image from Dall.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Know Labs, Inc. Announces Adopting a Bitcoin Treasury Strategy, Starting with 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Know-Labs-Inc.-Announces-Adopting-a-Bitcoin-Treasury-Strategy-Starting-with-1000-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>Know Labs, Inc. announces making a Bitcoin Treasury Strategy, holding 1,000 Bitcoin and placing Greg Kidd as the CEO of the company.</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: Ark",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-ark",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Layer-2-Ark.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-ark\" rel=\"nofollow\"> </a></p> <p>The first article in the Bitcoin Layer 2 series. This article covers the Ark protocol designed by Burak, being built by Ark Labs and Second.</p> <p>"
    },
    {
      "title": "Mapping Bitcoin’s Bull Cycle Potential",
      "link": "https://bitcoinmagazine.com/markets/mapping-bitcoins-bull-cycle-potential",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/maxresdefault.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/mapping-bitcoins-bull-cycle-potential\" rel=\"nofollow\"> </a></p> <p>Bitcoin Cycle Timing: 925 days from low, 140-150 days to potential top in Q3/Q4 2025</p> <p>"
    },
    {
      "title": "Palantir Is Violating Its Own Principles by Avoiding a Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/bitcoin-for-corporations/palantir-violates-principles-avoiding-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Palantir-Is-Violating-Its-Own-Principles-by-Avoiding-a-Bitcoin-Treasury-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bitcoin-for-corporations/palantir-violates-principles-avoiding-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>Palantir builds for sovereignty and resilience—but without a Bitcoin treasury, its mission remains unfinished and its capital strategy misaligned.</p> <p>"
    },
    {
      "title": "Bitcoin vs Stablecoins: Bitcoin is an Unreplicable Lifeline in Authoritarian Regimes",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Authoritarian-leader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes\" rel=\"nofollow\"> </a></p> <p>Bitcoin operates beyond any government’s grasp. Its value isn’t in replacing stablecoins — it’s in doing what they fundamentally cannot do.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Trump-Elon feud Erupts, Crypto falls, Coinbase to list Fartcoin",
      "link": "https://decrypt.co/videos/interviews/kV6cxbIC/trump-elon-feud-erupts-crypto-falls-coinbase-to-list-fartcoin",
      "summary": "FOMO HOUR EP373 FOMO HOUR brings you the biggest daily news, updates and events from inside and outside of the crypto and macro spheres! Join hosts Farokh, Mando and Tyler as they cover some of the biggest topics at present with some of the biggest names in the ecosystem. Streaming live 5 days per week, Monday to Friday 10:00 AM EST to 11:00 AM EST on YouTube and X. Crypto drops then rebounds after Trump-Elon feud. DOGE, ADA & ETH lead decline in top 20 coins. Circle stock spikes 200% post IPO, trading halted. Strategy increases preferred stock issuance to $1bn. Metaplanet to issue $5.4b equity to buy BTC. Trump earned $1bn from crypto in last 9 months. Trump Media to raise up to $12bn to buy BTC. Robinhood flips Coinbase in market cap. Truth Social BTC, ETH ETF registered in Nevada. Uber evaluates accepting stablecoins for payments. CoinFlip exploring $1bn sales. Tether invests in Shiga Digital. Singapore to remove unlicensed blockchain firms. European APS buys $3.4m tokenized real estate. Taiwan’s BitoPro hacked for $11m+. Posta Romana to install BTC, crypto terminals. JOIN YEET = https://yeet.com/register?aff=fomohour PLAYLIST = https://www.youtube.com/playlist?list=PLGSgoImPFTiVpkHhLXF78cE_Z3uG7VNGL PODCAST = https://x.com/i/spaces/1kvKpydgqMQGE LIVE SPACE = https://x.com/i/spaces/1DXxyqYyDRVxM Links: https://linktr.ee/fomohour https://twitter.com/fomohour https://www.rug.fm/ https://x.com/rugradio Hosts: https://twitter.com/farokh https://twitter.com/rektmando https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets #bitcoin #crypto #podcast"
    },
    {
      "title": "Early Twitter Investor Builds $100 Million Bitcoin Treasury for Public Healthtech Company",
      "link": "https://decrypt.co/323987/early-twitter-investor-builds-100-million-bitcoin-treasury-public-company",
      "summary": "Publicly traded healthtech firm Know Labs is planning to buy 1,000 Bitcoin under its new leader, noted fintech investor Greg Kidd."
    },
    {
      "title": "Strategy Boosts STRD Preferred Stock Offering to $1 Billion to Buy Up Bitcoin",
      "link": "https://decrypt.co/323988/strategy-upsizes-strd-stock-offering-1-billion-buy-bitcoin",
      "summary": "Strategy’s Michael Saylor described STRD as the “fourth gear” in the company’s “Bitcoin Engine.”"
    },
    {
      "title": "'FIFA Rivals' Game Launching Next Week on iOS, Android",
      "link": "https://decrypt.co/323977/fifa-rivals-game-launching-next-week-ios-android",
      "summary": "NFL Rivals creator Mythical Games is gearing up to launch its next officially licensed sports game, FIFA Rivals—with an assist from Adidas."
    },
    {
      "title": "Official Trump and Dogecoin Sag After Musk's Epstein Rant About the President",
      "link": "https://decrypt.co/323962/official-trump-dogecoin-sag-musk-epstein-president",
      "summary": "Donald Trump and Elon Musk have had a very public falling out and meme coins tied to the figures have slumped as a result."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Elon Musk’s X names Polymarket as official prediction market partner",
      "link": "https://cryptobriefing.com/elon-musks-prediction-markets/",
      "summary": "<p>This partnership could enhance the accuracy of public sentiment analysis, potentially influencing decision-making in politics and finance.</p> <p>"
    },
    {
      "title": "Apple, X, and Google hold talks with crypto firms on stablecoin integration",
      "link": "https://cryptobriefing.com/stablecoin-integration-tech-discussions/",
      "summary": "<p>The integration of stablecoins by major tech firms could revolutionize global payment systems, enhancing efficiency and reducing costs.</p> <p>"
    },
    {
      "title": "Coinzilla fuels 80 million+ impressions for Solidus Ai Tech in landmark crypto ad campaign",
      "link": "https://cryptobriefing.com/crypto-ad-campaign-record-impressions/",
      "summary": "<p>The campaign's success highlights the transformative potential of strategic advertising in rapidly scaling crypto and AI ventures.</p> <p>"
    },
    {
      "title": "UK FCA plans to let consumers buy crypto ETNs, but keeps retail blocked from derivatives",
      "link": "https://cryptobriefing.com/fca-crypto-etns-retail-ban/",
      "summary": "<p>The FCA's decision may boost crypto market participation but raises concerns about retail investors' exposure to high-risk financial products.</p> <p>"
    },
    {
      "title": "World Liberty advisor faces six-figure loss after shorting $TRUMP on Trump-Musk fallout",
      "link": "https://cryptobriefing.com/shorting-trump-losses-advisor/",
      "summary": "<p>The fallout highlights the volatility and interconnectedness of crypto and traditional markets, emphasizing the risks of speculative trading.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "How Bitcoin can still bounce back, $1B in crypto liquidations later",
      "link": "https://ambcrypto.com/how-bitcoin-can-still-bounce-back-1b-in-crypto-liquidations-later/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-2.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With over $1B in crypto liquidations, Bitcoin received the biggest share of over $342M but the odds were more for a move up."
    },
    {
      "title": "Top 6 Telegram trading bots of June 2025",
      "link": "https://ambcrypto.com/top-6-telegram-trading-bots-of-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1220\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/rubaitul-azad-u4F54GIZWGI-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Trading bots are automated software tools that are used to execute trades depending on predefined [&#8230;]"
    },
    {
      "title": "Silk Road’s Ross Ulbricht gets $31 mln in Bitcoin – But the source raises questions",
      "link": "https://ambcrypto.com/silk-roads-ross-ulbricht-gets-31-mln-in-bitcoin-but-the-source-raises-questions/",
      "summary": "<img alt=\"Silk Road&#039;s Ross Ulbricht gets $31 mln in Bitcoin - But the source raises questions\" class=\"attachment-full size-full wp-post-image\" height=\"680\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ross-Ulbricht-received-a-31-million-bitcoin-donation.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1209\" />What secrets lie behind the $31 million Bitcoin donation, traced to illicit origins?"
    },
    {
      "title": "New whales are stacking Sats fast – Will this trigger Bitcoin’s next leg up?",
      "link": "https://ambcrypto.com/new-whales-are-stacking-sats-fast-will-this-trigger-bitcoins-next-leg-up/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_36_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Are the Bitcoin whales preparing for a breakout before the next macro trigger?"
    },
    {
      "title": "Top 9 DEXs to watch out for in June 2025",
      "link": "https://ambcrypto.com/top-9-dexs-to-watch-out-for-in-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1277\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/traxer-BORcZjp8ssg-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />DEX or Decentralized exchanges are essentially blockchain-based peer-to-peer marketplaces that allow users to conduct transactions [&#8230;]"
    }
  ]
}