{
  "CoinDesk": [
    {
      "title": "NEAR Protocol Surges 5% as Buyers Dominate Amid Middle East Tensions",
      "link": "https://www.coindesk.com/markets/2025/06/19/near-protocol-surges-5-as-buyers-dominate-amid-middle-east-tensions",
      "summary": ""
    },
    {
      "title": "XRP Tests Key Support as Traders Watch for Breakout Signal",
      "link": "https://www.coindesk.com/markets/2025/06/19/xrp-tests-key-support-as-traders-watch-for-breakout-signal",
      "summary": ""
    },
    {
      "title": "SOL Slips Below $144 Even as Sol Strategies Eyes Nasdaq to Deepen Its Bet",
      "link": "https://www.coindesk.com/markets/2025/06/19/sol-slips-below-usd144-even-as-sol-strategies-eyes-nasdaq-to-deepen-its-bet",
      "summary": ""
    },
    {
      "title": "Elon Musk's X to Offer Investments, Trading 'Soon:' FT",
      "link": "https://www.coindesk.com/business/2025/06/19/elon-musks-x-to-offer-investments-trading-soon-ft",
      "summary": ""
    },
    {
      "title": "Crypto for Advisors: Digital Asset Tax Preparation",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/18/crypto-for-advisors-digital-asset-tax-preparation",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Polymarket gives US stablecoin bill 89% chance of becoming law",
      "link": "https://cointelegraph.com/news/polymarket-genius-stablecoin-bill-chance-law?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhhMDYtOTlmYy03YTE0LTlhMjQtZTc3OTQ5ZTI1ZWJm.jpg\" /></p><p>The platform launched the betting market for the GENIUS Act after the US Senate passed it on Tuesday.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "XBTO, Arab Bank Switzerland launch BTC yield product for institutional clients",
      "link": "https://cointelegraph.com/news/xbto-arab-bank-switzerland-bitcoin-yield-product-wealth-management-clients?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhhMDctYzYwOS03ZWI3LTg3YzYtMWZmMDg4OTViOGFm.jpg\" /></p><p>The partnership is part of a broader trend of banks integrating structured BTC yield products into wealth management services.</p>"
    },
    {
      "title": "Bitcoin ‘weak hands’ sell 15K BTC at a loss: Are BTC lows under $100K next?",
      "link": "https://cointelegraph.com/news/bitcoin-weak-hands-sell-15k-btc-at-a-loss-are-btc-lows-under-100k-next?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg4OTgtNzAzZi03YWFkLTgxMzMtOTI0YzEzY2Q5ZjQx.jpg\" /></p><p>This week, 15,000 Bitcoin were moved at a loss by short-term holders, raising the chance for a BTC price dip under $100,000.</p>"
    },
    {
      "title": "Musk’s X plans payments, investment features rollout for 2025 — Report",
      "link": "https://cointelegraph.com/news/elon-musk-x-financial-services-x-money-app-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg5OGYtOGI2NS03ZDgxLTkyZTQtMzYzMmY5NWEwNmE2.jpg\" /></p><p>The social media app will soon be embedded with various financial services, X CEO Linda Yaccarino said.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Jupiter halts governance voting to tackle burnout and refocus on innovation",
      "link": "https://cryptoslate.com/jupiter-halts-governance-voting-to-tackle-burnout-and-refocus-on-innovation/",
      "summary": "<p>Solana’s largest decentralized exchange aggregator, Jupiter, has decided to halt all community voting through next year and keep its governance Treasury sealed until 2027, citing community burnout and a need to prioritize building new products. The move temporarily disables one of the main utilities for Jupiter’s native token, JUP, which powers governance proposals and decisions [&#8230;]</p> <p>"
    },
    {
      "title": "Circle approaches $50B valuation amid evolving regulatory landscape in the US",
      "link": "https://cryptoslate.com/insights/circles-stock-rally-propels-valuation-to-nearly-50-billion/",
      "summary": "<p>Circle, the issuer of the USD Coin (USDC) stablecoin, is edging closer to a $50 billion valuation after a major rally in its stock price. Since debuting at $31, Circle&#8217;s shares (CRCL) have climbed over 540%, now trading around $200, according to Yahoo Finance. This surge has helped push Circle&#8217;s valuation to approximately $48.4 billion [&#8230;]</p> <p>"
    },
    {
      "title": "Elon Musk’s X accelerates fintech pivot with plans for in-app payments and trading",
      "link": "https://cryptoslate.com/elon-musks-x-accelerates-fintech-pivot-with-plans-for-in-app-payments-and-trading/",
      "summary": "<p>X (formerly known as Twitter) is ramping up efforts to integrate financial services directly into its ecosystem and moving beyond its roots in social networking, the Financial Times reported on June 19. According to the report, the social media giant is preparing to let users carry out a wide range of financial transactions within the [&#8230;]</p> <p>"
    },
    {
      "title": "Trump family cuts stake in World Liberty Financial by 20%",
      "link": "https://cryptoslate.com/trump-family-cuts-stake-in-world-liberty-financial-by-20/",
      "summary": "<p>President Donald Trump&#8217;s family has reduced its stake in World Liberty Financial (WLFI) in the last couple of weeks, Forbes reported on June 20. DT Marks DEFI LLC, the Trump family’s main holding company for the project, has trimmed its ownership from 75% in December 2024 to about 60% by January and further down to [&#8230;]</p> <p>"
    },
    {
      "title": "Tether CEO Paolo Ardoino unveils PearPass as response to record 16 billion password leak",
      "link": "https://cryptoslate.com/tether-ceo-paolo-ardoino-unveils-pearpass-as-response-to-record-16-billion-password-leak/",
      "summary": "<p>Tether CEO Paolo Ardoino announced a new open-source password manager, PearPass, after an unprecedented 16 billion passwords were leaked in what experts now call the largest credential breach ever recorded. Ardoino wrote: “The cloud has failed us. Again. 16 billion passwords just leaked. It’s time to ditch the cloud.&#8221; He pledged that PearPass will work [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Top Firm Warns: Bitcoin Price Could Be Headed For A Surprise Move",
      "link": "https://www.newsbtc.com/bitcoin-news/top-firm-warns-bitcoin-price-could-be-headed-for-a-surprise-move/",
      "summary": "The Bitcoin price and the crypto market remain under pressure as the sector enters a low volatility period. While a lot of traders were expecting a big move yesterday, following the US Federal Reserve (Fed) decision on rate cuts, the cryptocurrency held its current levels. Related Reading: Analyst Warns: Strategy On Track For Historic Collapse, Bigger Than FTX Despite the relative resilience in the top crypto and other cryptocurrencies, the Bitcoin price is showing signs of potential downside. At the time of writing, BTC trades at around $105,000 with a 2.3% decline over the past seven days. Bitcoin price moving sideways over the past 2 months as seen on the daily chart. Source: BTCUSD on Tradingview Bitcoin Price’s Stuck, But Not for Long? Analyst Daan Crypto shared insights regarding the current Bitcoin price action. The analyst believes that BTC has been compressing over the past weeks. In that sense, a lot of traders are expecting a spike in volatility. As seen on the image below, the Bitcoin price has been trading within a tight range form by its monthly high sitting at $110,600 and a monthly low at around $100,000. Within this range, there are two key levels to watch: the area between $109,000 and $103,000. A breakout or breakdown from this range might signal the return of volatility to the Bitcoin price action. Thus, the cryptocurrency might reclaim or return to either or the previously mentioned levels on higher timeframes. The analyst stated the following: BTC Still hanging around the $105K area which is the middle of the monthly range and right at the monthly open. Price has been compressing and it&#8217;s clear that the market is waiting for a big move to occur. The statistics still heavily favor a further displacement this week and especially this month. So keep an eye on these levels and play accordingly. Bitcoin price trading within a tight range on the 4 hour chart. Source: Daan Crypto via X Bitcoin Seasonality Might Shock Traders On a separate report, trading desk QCP Capital claims that the Bitcoin price might be affected by ‘summertime blues.’ In other words, the firm predicts a decline in volatility as institutions and traders exit the market over July and August. Related Reading: Bitcoin Channel Break Below $105,000 Sparks Panic, Analysts Predict Further Crashes QCP Capital claims that there are signs of this sluggishness affecting the market, including BTC’s implied volatility. This indicator is currently sitting below 40%. In addition with a hawkish Fed, the trading desk predicts more dull price action over the coming weeks and caution amongst operators: (…) the Fed held interest rates steady. But its stance remains hawkish. Inflation expectations are still elevated, with tariffs flagged as a key upside risk. The Fed prefers to “wait and see” until there is more clarity on inflation’s path. While some macro watchers expect softening labor and economic data to eventually push the Fed dovish, the current numbers say otherwise. Cover image from ChatGPT, BTC/USD chart from Tradingview"
    },
    {
      "title": "Ethereum Bullish Wave Towards ATH Coming? Here Are The Targets",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-bullish-wave-to-ath/",
      "summary": "Recent price action in the past 24 hours has seen Ethereum clawing back above $2,500 after a pullback that saw its price fall to a low of $2,440. This is a notable correction from Ethereum&#8217;s foray to $2,770 in the past seven-day timeframe, but according to crypto analyst KledjdiCuni, it aligns with one of the anticipated price scenarios. Now, the analyst&#8217;s outlook is of a reversal into a bullish wave. In his latest update, KlejdiCuni laid out several upside targets that traders may want to keep in focus if Ethereum confirms a breakout. Accumulation And Bullish Setup Toward $2,800 Breakout Crypto analyst KlejdiCuni, posting on the TradingView platform, believes Ethereum may now be on the verge of initiating a much larger bullish trend. According to his analysis, the $2,440 region held up as expected, confirming it as a strong accumulation zone. Related Reading: Analyst Says Ethereum Is Ready To Surge With Higher Lows Against Bitcoin, But There’s A Caveat In the daily candlestick price chart he shared, KlejdiCuni illustrated what he identifies as a bullish pattern. This pattern is a formation of higher lows and relatively stable resistance near the upper boundary. This setup resembles an ascending channel structure, which suggests that buyers are gradually taking control of Ethereum&#8217;s price action. Ethereum&#8217;s rebound to $2,660 has formed a structure that could break above the current pattern, likely in the direction of $2,800. This aligns with the upper resistance boundary of the bullish pattern, and as such, it is the first immediate target to look towards for a breakout to higher price levels. Price Targets For Ethereum If Ethereum successfully breaks above the $2,800 resistance level, the bullish momentum could signal the start of the expected bullish trend, according to the analyst. In this case, the first major target in this sequence is $3,300. Ethereum&#8217;s reaction here would be one to watch, as it coincides with a resistance level in late January 2025 that eventually broke to the downside in early February 2025. If Ethereum manages to clear this zone, it would confirm a sustained buying interest. Related Reading: Ethereum Price Could Rally To $10,000 If This Major Resistance Is Broke Should Ethereum maintain its upward pressure beyond $3,300, the next target is at $3,800. This level carries particular technical significance, as it coincides with an order block in early January that caused the initial rejection as it tried to push toward the $4,000 price level again. Breaking through $3,800 to the upside would be an indication that bullish sentiment has taken firm hold across higher timeframes again. Finally, if the bullish wave extends uninterrupted, the analyst projects a longer-term target of $4,500. This level is only a short distance from Ethereum’s all-time high of around $4,878, and reaching it would represent a near-complete recovery from the prolonged bear market. Hitting $4,500 would also place Ethereum at new price highs for this cycle. At the time of writing, Ethereum is trading at $2,521, having retraced by 0.7% in the past 24 hours. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Big Move For XRP: Ripple-Backed ETF Launches In Canada",
      "link": "https://www.newsbtc.com/altcoin/big-move-for-xrp-ripple-backed-etf-launches-in-canada/",
      "summary": "Canada’s Toronto Stock Exchange today saw a new entrant aimed at making XRP more accessible to investors. The 3iQ Corp. rolled out its spot-based XRP ETF, trading under the ticker XRPQ, with an introductory 0% management fee for the first six months. Related Reading: Tether Enforces Freeze On $12 Million In Tron Funds Over Illicit Activity Based on reports, this move offers both retail and institutional clients a hands‑off way to own XRP without worrying about private wallets or unregulated platforms. Building Trust Through Custody According to the announcement, XRPQ will hold its XRP coins in cold storage, kept separate for each investor to cut down the chance of a hack. The fund plans to buy XRP from regulated sources like over‑the‑counter desks. That setup mirrors what other digital‑asset funds do for Bitcoin and Ether. We are excited to announce the launch of the 3iQ XRP ETF (TSX: XRPQ, XRPQ.U) — one of the first ETFs in North America to provide exposure to #XRP. XRPQ debuts with a 0% management fee for the first six months, and @Ripple as an early investor in the fund. “The launch of XRPQ… pic.twitter.com/me19RLAzJI — 3iQ Digital Asset Management (@3iq_corp) June 18, 2025 Backing From Ripple San Francisco’s Ripple has taken a stake in the new fund, according to reports. The company didn’t share how much it invested, but its support sends a strong message. It shows Ripple believes in XRPQ’s structure and security, even after years of uncertainty about XRP in the US courts. Growth Of XRP Over A Decade Data from 2015 to now shows that XRP’s price jumped to around 10,700%, climbing from $0.02 back then to $2.16 today. That surge underscores why 3iQ’s CEO and President, Pascal St‑Jean, called this ETF “an easy way for Canadians and qualified investors overseas to tap into XRP’s growth.” He rang the TSX’s closing bell to mark the launch. Purpose Joins The Fray Reports also disclose that Purpose Investments launched its own XRP ETF, XRPP, on the same day. That makes two spot XRP ETFs now available on the same exchange. Both products aim to give investors a regulated path to XRP, but only time will tell which approach wins more fans. Related Reading: Iran’s Top Crypto Hub Loses $82 Million To Hackers With Israeli Links—Details Looking Ahead To US Approval According to industry watchers, over 10 applications for a spot XRP ETF are currently waiting on the US Securities and Exchange Commission. Traders and managers predict a green light could come by October 2025. Until then, US investors will be watching from the sidelines, while Canada continues to lead in crypto‑ETF innovation. With XRPQ’s debut, 3iQ highlights its mission of opening up digital assets in a regulated way. It’s a clear sign that more traditional markets are warming up to crypto. And with Ripple’s backing and a zero‑fee for half a year, this new ETF could draw attention from anyone who wants XRP exposure without the usual hurdles. Featured image from Pixabay, chart from TradingView"
    },
    {
      "title": "Ethereum Analyst Eyes High Timeframe Close – Range Break Above $2,800 Could Be Violent",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-analyst-eyes-high-timeframe-close-range-break-above-2800-could-be-violent/",
      "summary": "Ethereum is currently facing a pivotal moment as it continues to consolidate below the $3,000 level. Bulls are targeting a breakout above this key resistance zone, which could trigger a major upward move. However, broader market conditions remain fragile. Geopolitical tensions—particularly the ongoing conflict between Israel and Iran—continue to create a high-risk macroeconomic environment, leading to increased volatility and intermittent selling pressure across risk assets. Related Reading: Tron Shows Real Growth: Transaction Volume Soars While Success Rate Stays Above 96% Despite these challenges, ETH has shown resilience by holding above the $2,500 support zone. The price has remained locked in a narrow trading range for weeks, reflecting market indecision and caution among participants. According to a technical analysis shared by top analyst Daan, Ethereum continues to trade within this very tight range, with price wicks on both sides consistently getting absorbed. This type of price action signals growing compression, often a precursor to a strong directional move once one side gives in. Traders are now closely monitoring the structure for a higher timeframe close above $2,800, which could validate bullish momentum and open the path toward $3,000 and beyond. Until then, the market appears balanced, and any shift in geopolitical developments may quickly tilt sentiment in either direction. Ethereum Prepares For Breakout as Market Awaits Confirmation Ethereum remains over 60% below its 2024 high of $4,100, but the asset is showing signs of recovery after months of downward pressure and indecision. Bulls have struggled to regain control throughout the year, but recent price action indicates the start of a potential rally. This recovery, however, remains tentative and will require confirmation through a higher timeframe close above critical resistance levels, particularly the $2,800–$3,000 range. The broader environment continues to weigh heavily on sentiment. Escalating geopolitical tensions in the Middle East, coupled with macroeconomic uncertainty—including rising U.S. Treasury yields and concerns about inflation—are creating headwinds for risk assets, Ethereum included. Despite this, ETH has managed to hold key support above the $2,500 level, a sign that bulls are defending their ground. According to technical analysis shared by analyst Daan, Ethereum is currently trading within a very tight range, with price wicks on both sides being consistently absorbed. This type of compression typically signals an incoming surge in volatility. Daan notes that once one side gives in, the resulting move often becomes explosive and sustained. The current range-bound action reflects equilibrium between buyers and sellers, but that balance won’t last forever. Traders are watching closely for a decisive higher timeframe close above resistance—or below support—as confirmation of the next trend direction. With ETH positioned near major technical zones, a breakout could lead to significant momentum, potentially bringing Ethereum closer to reclaiming the psychological $3,000 mark and reigniting a push toward cycle highs. Until then, the market remains in a wait-and-see mode. Related Reading: Bitcoin Consolidates as Realized Profits Stay Low – No Signs Of Major Sell-Off Yet Ethereum Continues Range-Bound Trading As Key Support Holds Ethereum (ETH) remains locked in a tight range between approximately $2,500 and $2,800, showing little directional clarity over the past several weeks. The chart above (12-hour timeframe) reflects persistent consolidation with multiple wicks on both ends of the candles, indicating absorption of both bullish and bearish momentum. This suggests that neither buyers nor sellers have taken firm control. ETH currently trades near $2,540 and is holding above the 100-period simple moving average (SMA), which is acting as short-term support. The 50 SMA has flattened, further reinforcing the sideways nature of the price action. Volume has also tapered off, typical in compression phases that often precede strong breakouts or breakdowns. If ETH fails to reclaim the $2,675–$2,800 resistance zone, the 200 SMA near $2,117 may become relevant as a deeper support target. However, as long as ETH maintains price action above $2,500, bulls are still in play. Related Reading: Bitcoin Holds Strong Despite Israel-Iran Tensions – Weekly Resistance Begins To Crack The structure suggests that Ethereum is building energy for a decisive move. A higher timeframe close above $2,800 could trigger a new leg up toward $3,000 and beyond. Conversely, a break below $2,500 could lead to renewed bearish pressure. For now, traders are watching for breakout confirmation. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Why The June 22 Date Is Important As Bitcoin Price Flirts With $100,000",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-action-on-june-22/",
      "summary": "The Bitcoin price action is currently testing investors&#8217; nerves as it hovers around $100,000. While it flirts with this psychological level, analysts are highlighting June 22, 2025, as a key date for potential volatility. Backed by both historical volatility patterns and technical indicators, this date is gearing up to be a critical window for Bitcoin’s next move. Bitcoin Price Braces For Volatility On June 22 Bitcoin is entering a decisive phase as it trades above the $100,000 mark, with technical signals identified by TradingView expert ‘readCrypto’ aligning around a critical time frame—-June 22. The chart analysis shows that June 22 is an important date, signaling the projected start of Bitcoin’s next volatility window, with a potential to break out or break down depending on how the flagship cryptocurrency reacts to key support and resistance zones. Related Reading: Analyst Predicts Bitcoin Price Crash As War Tensions Mount In Middle East Currently, Bitcoin is trading at $104,731, close to a pivotal confluence range between $104,463 and $106,133—a zone highlighted as a structural mid-point. This area is defined by the DOM (60) and a Heikin-Ashi high point on the price chart, marking the formation of a recent upper boundary. Moreover, the lower end of the range sits around $99,705, which is the HA-High support level, where the price has previously been tested but not yet broken. According to the analyst, the June 22 date is important because it coincides with the confluence of key price levels with the M-Signal indicator on the weekly chart. This indicator is currently rising and aligning near the $99,705 HA-high level. If Bitcoin falls below this level, it could signal the start of a deeper corrective move, possibly toward the monthly M-Signal line or even the $89,294 region, corresponding with the 2.618 Fibonacci. Conversely, if Bitcoin holds above this level and breaks out of the $108,316 resistance, momentum could shift back to the upside. The analyst has set upper bullish targets near $109,598 and $111,696, reflecting the final resistance zone before new highs. Support Zones And Momentum Indicate Tense Standoff Moving past readCrypto’s volatility-driven projection, the TradingView analyst’s Bitcoin chart shows that the On-Balance-Volume (OBV) oscillator remains below the zero line. This suggests that despite recent gains, selling pressure may still be dominating the broader market. However, the histogram in the chart shows signs of waning momentum on the sell side. Related Reading: Brace For Impact: Bitcoin Price Primed For Deep Correction Below $90,000 This divergence aligns with Bitcoin’s weakening Stochastic Relative Strength Index (RSI), which indicates momentum may be cooling. The low OBV readings, combined with the recent bounce from a lower support range, also underscore an intense standoff within the market. If Bitcoin breaks below the Heikin Ashi high point at $99,705, a retest of new lows at $89,294 is more than likely. Until then, readCrypto’s analysis shows that all eyes are on the $104,000 to $106,000 zone. The area between $99,705 and $108,316 now defines the high-boundary consolidation range. A confirmed move outside this range, mainly triggered during the June 21-13 window, could dictate Bitcoin’s next major move. Featured image from Pixabay, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Semler Scientific Appoints Joe Burnett as Director of Bitcoin Strategy, Targets 105,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/semler-scientific-appoints-joe-burnett-as-director-of-bitcoin-strategy-targets-105000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Semler-Scientific-Appoints-Joe-Burnett-as-Director-of-Bitcoin-Strategy-Targets-105000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/semler-scientific-appoints-joe-burnett-as-director-of-bitcoin-strategy-targets-105000-btc-by-2027\" rel=\"nofollow\"> </a></p> <p>Semler Scientific, the second U.S. publicly traded company to adopt Bitcoin as its primary treasury reserve asset, has appointed Joe Burnett as Director of Bitcoin Strategy while announcing a Bitcoin accumulation plan. The healthcare technology company targets holding 10,000 Bitcoin by year end 2025, 42,000 by 2026, and 105,000 by 2027.&#160; The announcement comes as [&#8230;]</p> <p>"
    },
    {
      "title": "President Donald Trump: America Will Show The World How To Win With Digital Assets Like Never Before",
      "link": "https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/President-Trump-Says-22We-Are-Going-to-Show-the-World-How-to-WIN-with-Digital-Assets-Like-Never-Before22.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before\" rel=\"nofollow\"> </a></p> <p>President Donald Trump posted on Truth Social Tuesday evening regarding recent Senate legislation, stating the U.S. will &#8220;show the World how to WIN with Digital Assets like never before.&#8221;"
    },
    {
      "title": "3 Misconceptions About US Debt",
      "link": "https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FRED-chart.png\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt\" rel=\"nofollow\"> </a></p> <p>This newsletter explores three common misconceptions about U.S. federal debt and deficits.</p> <p>"
    },
    {
      "title": "The Smarter Web Company Acquires £8.1M in Bitcoin For Treasury Holdings",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Smarter-Web-Company-Acquires-8.1M-in-Bitcoin-For-Treasury-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings\" rel=\"nofollow\"> </a></p> <p>The London listed firm now holds 346.63 Bitcoin worth £27.2 million, reinforcing its long-term strategy to integrate Bitcoin into corporate finance through its \"10 Year Plan.\"</p> <p>"
    },
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Hyperliquid Token Hits 10-Day Low Following Recent Record High",
      "link": "https://decrypt.co/326147/hyperliquid-token-hits-10-day-low-following-recent-record-high",
      "summary": "Analysts told that the dip may represent a reaction to recent corporate treasury buy-ins and a decline in trading volume."
    },
    {
      "title": "Telegram Boss Pavel Durov Temporarily Permitted to Leave France: Report",
      "link": "https://decrypt.co/326141/telegram-boss-pavel-durov-permitted-travel-to-dubai",
      "summary": "The crypto-friendly app's boss was arrested in France last year and is under investigation."
    },
    {
      "title": "AI Infrastructure Firm Gradient Bags $10 Million to Develop Protocols on Solana",
      "link": "https://decrypt.co/326140/ai-infrastructure-firm-gradient-bags-10-million-to-develop-protocols-on-solana",
      "summary": "Pantera and Multicoin Capital lead the funding for startup creating peer-to-peer protocols Lattica and Parallax, aiming to distribute AI computing across everyday devices."
    },
    {
      "title": "Kraken Debuts Bitcoin Staking With BABY Token Rewards",
      "link": "https://decrypt.co/326092/kraken-debuts-bitcoin-staking-through-baby-tokens",
      "summary": "Staked Bitcoin rewards will be paid in $BABY, Babylon’s native token, the crypto exchange said."
    },
    {
      "title": "Trump Family Reduces Stake in Crypto Project World Liberty",
      "link": "https://decrypt.co/326105/trump-family-reduces-equity-stake-crypto-project-world-liberty",
      "summary": "DT Marks DEFI LLC recently reduced its ownership share in the company from 60% to approximately 40%."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump-affiliated company cuts stake in World Liberty Financial to 40%",
      "link": "https://cryptobriefing.com/world-liberty-stake-reduction/",
      "summary": "<p>The reduced stake may signal a strategic shift in investment focus, potentially impacting the company's influence in the crypto sector.</p> <p>"
    },
    {
      "title": "Seamless Protocol launches plug and play Leverage Tokens as ERC-20 assets on Base",
      "link": "https://cryptobriefing.com/launch-leveraged-defi-tokens/",
      "summary": "<p> Seamless Protocol debuts Leverage Tokens on Base, packaging passive DeFi strategies into tradable ERC-20s for one-click exposure.</p> <p>"
    },
    {
      "title": "Only 30% of crypto miners comply with Russia’s new rules, finance ministry official says",
      "link": "https://cryptobriefing.com/crypto-mining-compliance-russia/",
      "summary": "<p>The low compliance rate among crypto miners in Russia highlights challenges in enforcing regulations, potentially impacting energy policies and economic oversight.</p> <p>"
    },
    {
      "title": "Elon Musk’s X will soon launch investment and trading features as part of ‘everything app’ vision",
      "link": "https://cryptobriefing.com/financial-services-expansion-elon-musk-x/",
      "summary": "<p>Musk's X expansion into finance could redefine digital ecosystems, merging social media with financial services, impacting user engagement.</p> <p>"
    },
    {
      "title": "Binance co-founder calls for crypto platforms to implement ‘will function’ for asset inheritance",
      "link": "https://cryptobriefing.com/crypto-inheritance-tools-platforms/",
      "summary": "<p>Implementing a 'will function' in crypto platforms could ensure secure asset transfer, addressing inheritance challenges in digital finance.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum hints toward a breakout, but are you missing the signs?",
      "link": "https://ambcrypto.com/ethereum-hints-toward-a-breakout-but-are-you-missing-the-signs/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-36.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With Open Interest at record highs and inflows surging, ETH could be repeating Bitcoin’s biggest moves."
    },
    {
      "title": "Bitcoin’s biggest institutional wave since 2024 – A macro-led rally soon?",
      "link": "https://ambcrypto.com/bitcoins-biggest-institutional-wave-since-2024-a-macro-led-rally-soon/",
      "summary": "<img alt=\"Bitcoin&#039;s biggest institutional wave since 2024 – A macro-led rally soon?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-19T124405.928-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Retail may be selling, but whales and long-term holders are tightening the float."
    },
    {
      "title": "30% of Bitcoin could be ‘lost forever’ by 2035 – Why that’s a big deal",
      "link": "https://ambcrypto.com/30-of-bitcoin-could-be-lost-forever-by-2035-why-thats-a-big-deal/",
      "summary": "<img alt=\"30% of Bitcoin Could Be ‘Lost Forever&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"734\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/30-of-Bitcoin-Could-Be-‘Lost-Forever.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1305\" />Scarcity is growing, coins are vanishing. Can Bitcoin’s unique supply curve disrupt traditional market expectations?"
    },
    {
      "title": "TRUMP faces $2.4 mln insider exodus – But the real dump may not have begun",
      "link": "https://ambcrypto.com/trump-faces-2-4-mln-insider-exodus-but-the-real-dump-may-not-have-begun/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-19T104320.495-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TRUMP faces bearish sentiment as whale outflows rise and adoption slows amid support retest."
    },
    {
      "title": "SPX pumps 12% on Binance U.S. listing plan – Will profit-taking stall the rally?",
      "link": "https://ambcrypto.com/spx-pumps-12-on-binance-u-s-listing-plan-will-profit-taking-stall-the-rally/",
      "summary": "<img alt=\"SPX pumps 12% on Binance U.S. listing plan - Will profit-taking stall the rally? \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/SPX6900-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can SPX sustain the short-term sell pressure after the recent pump?"
    }
  ]
}