{
  "CoinDesk": [
    {
      "title": "BTC Tops $108K on JPMorgan Crypto Filing, XRP Rallies on ETF News",
      "link": "https://www.coindesk.com/markets/2025/06/16/btc-tops-108k-on-jpmorgan-crypto-filing-xrp-rallies-on-etf-news",
      "summary": ""
    },
    {
      "title": "JPMorgan Files Trademark for Digital Asset Platform as Wall Street's Crypto Embrace Continues",
      "link": "https://www.coindesk.com/business/2025/06/16/jpmorgan-files-trademark-for-digital-asset-platform-as-wall-streets-crypto-embrace-continues",
      "summary": ""
    },
    {
      "title": "Solana Treasury Strategy Better Than ETH, Firms Buying SOL Should Trade at Premium: Cantor",
      "link": "https://www.coindesk.com/markets/2025/06/16/solana-treasury-strategy-better-than-eth-firms-buying-sol-should-trade-at-premium-cantor",
      "summary": ""
    },
    {
      "title": "Bitcoin Mining Costs Soar as Hashrate Hits Records: TheMinerMag",
      "link": "https://www.coindesk.com/markets/2025/06/16/bitcoin-mining-costs-soar-as-hashrate-hits-records-theminermag",
      "summary": ""
    },
    {
      "title": "Spot XRP ETF Set to Start Trading in Canada This Week After Regulatory Nod, Token Up 7%",
      "link": "https://www.coindesk.com/markets/2025/06/16/spot-xrp-etf-set-to-start-trading-in-canada-this-week-after-regulatory-nod-token-up-7",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin dips amid reports Trump has called advisers to situation room",
      "link": "https://cointelegraph.com/news/bitcoin-dips-reports-trump-summon-national-security-council?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmZkYmMtOTU4NS03YTkzLTlkMTgtNWVmNzllNDJjMjI3.jpg\" /></p><p>Bitcoin has lost recent gains in a $2,000 slide as Middle East tensions escalated on Monday night.</p>"
    },
    {
      "title": "JPMorgan files ‘JPMD’ trademark for crypto payment services",
      "link": "https://cointelegraph.com/news/jpmorgan-files-jpmd-trademark-crypto-payment-services?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdhOWUtYjM0Mi03ZDY2LWFkMTEtNTU3MDJlNDI3ZmJm.jpg\" /></p><p>JPMorgan has filed a new trademark that covers a range of potential crypto-services for the bank, which industry commentators speculate could include a stablecoin venture.</p>"
    },
    {
      "title": "Fairmint calls for blockchain framework for private markets in SEC proposal",
      "link": "https://cointelegraph.com/news/fairmint-blockchain-framework-private-markets-sec-proposal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWVkNGMtYTg1YS03M2I5LWJhZWEtMmFkOTI4MmRmZTZk.jpg\" /></p><p>The proposal outlines a seven-step framework that includes real-time regulatory oversight and updates to investor accreditation standards.</p>"
    },
    {
      "title": "Polyhedra cites liquidity attacks, Wintermute deposits behind ZKJ price drop",
      "link": "https://cointelegraph.com/news/polyhedra-liquidity-attacks-deposits-zkj-drop?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzcyZmQtNTQ0Zi03OTBhLTk4YjUtN2NhY2Y2M2ViZWI3.jpg\" /></p><p>The project said several wallets had “coordinated a liquidity attack with an egregious malicious attempt” followed by “aggressive ZKJ sell-offs.”</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin delivers 90% risk-adjusted return to 60/40 portfolios with 10% allocation, 2x gold’s risk efficiency",
      "link": "https://cryptoslate.com/bitcoin-delivers-90-risk-adjusted-return-to-60-40-portfolios-with-10-allocation-2x-golds-risk-efficiency/",
      "summary": "<p>Investors who added 10% in Bitcoin (BTC) to their &#8220;60/40 portfolio&#8221; strategies got a 90% risk-adjusted return in the past 12 months, outperforming gold&#8217;s 51% return in the same period. On a June 16 post via X, the profile Ecoinometrics highlighted BTC&#8217;s performance through June 13 and charted the result against total return. A 60/40 [&#8230;]</p> <p>"
    },
    {
      "title": "Dozens of memecoin-related X accounts including Pumpfun suspended for unknown reasons",
      "link": "https://cryptoslate.com/dozens-of-memecoin-related-x-accounts-including-pumpfun-suspended-for-unknown-reasons/",
      "summary": "<p>The official Pump.fun account and the personal handle of its founder Alon Cohen were seemingly suspended by X on June 16, along with a cohort of other accounts tied to the memecoin sector. As of press time, neither X nor the people behind the suspended accounts explained the reason for the suspensions. Users noticed that [&#8230;]</p> <p>"
    },
    {
      "title": "Bybit unveils TradFi platform to blend crypto and traditional markets",
      "link": "https://cryptoslate.com/bybit-unveils-tradfi-platform-to-blend-crypto-and-traditional-markets/",
      "summary": "<p>Bybit launched a new platform on June 16 that allows users to trade gold, forex, stock CFDs, global indices, and commodities directly within its app, a first for any major crypto exchange. The launch of Bybit TradFi expands the company’s offerings beyond digital assets, positioning it as a full-service financial hub aimed at bridging the [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin reclaims $108k amid upward consolidation as war tensions show signs of easing",
      "link": "https://cryptoslate.com/bitcoin-reclaims-108k-amid-upward-consolidation-as-war-tensions-show-signs-of-easing/",
      "summary": "<p>Bitcoin (BTC) reclaimed the $108,000 threshold on June 16 as tensions of war escalating in the Middle East fell after reports surfaced that Iran was open to negotiations with the US and Israel. Bitcoin&#8217;s move up regained the price level surrendered on June 12 while markets processed the initial flare-up in Israeli-Iranian hostilities. The “Bitfinex Alpha” [&#8230;]</p> <p>"
    },
    {
      "title": "JPMorgan files ‘JPMD’ trademark for digital asset payment services, hinting at potential stablecoin",
      "link": "https://cryptoslate.com/jpmorgan-files-jpmd-trademark-for-digital-asset-payment-services-hinting-at-potential-stablecoin/",
      "summary": "<p>JPMorgan filed a trademark application for the mark “JPMD,” covering trading, exchange, transfer, and payment services tied to virtual currency, digital tokens, and blockchain-enabled money. According to reports from June 16, the filing lists electronic fund transfers, real-time token trading, custody services, and secure online financial transactions. The document identifies JPMorgan Chase Bank, N.A., as [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Dogecoin Must Hold This Level—Or Risk A 30% Price Crash",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-must-hold-level-or-risk-30-price-crash/",
      "summary": "An analyst has explained how Dogecoin might have to hold strong above this level, if the memecoin has to avoid a 30% price drop. Dogecoin Is Currently Trading Inside A Symmetrical Triangle In a new post on X, analyst Ali Martinez has shared a chart that shows where Dogecoin currently stands from a technical analysis (TA) perspective. Below is the graph in question, showing the trend in the 1-day price of the memecoin. From the chart, it&#8217;s visible that the Dogecoin price has possibly been trading inside a triangular channel during the last few months. The channel hasn&#8217;t appeared to be just any triangle-shaped one, either, but a special type called the Symmetrical Triangle. Related Reading: Ethereum ETF Frenzy: Inflows Jump 5x While Bitcoin Stalls A Symmetrical Triangle forms whenever an asset observes consolidation between two trendlines converging at a roughly equal and opposite slope. The upper line of the pattern tracks lower highs in the price, and the lower one higher lows. As the asset moves inside this channel, its range becomes narrower with time, until it shrinks down to a point at the apex. Generally, volatile moves are more likely to occur when consolidation tightens, so a breakout of the pattern becomes increasingly probable as the price approaches the tip of the triangle Symmetrical Triangle breakouts can signal a continuation of the trend in the direction of the break. This means that a rise above the pattern can be a bullish sign, while a drop below it may be a bearish one. As displayed in the chart, the 1-day price of Dogecoin has recently been nearing the end of the triangle, a potential sign that a breakout could be imminent. Currently, the memecoin is retesting the lower line, so it will be interesting to see whether the level holds or if this is where a break would finally happen. Unlike the Ascending and Descending Triangles, two other popular types of triangular channels in TA, breakouts are usually considered to be equally probable in either direction for a Symmetrical Triangle. The reason is simple: consolidation occurs in an exactly sideways manner in this pattern. In contrast, the Ascending and Descending types slope upward and downward, respectively, which can bias the breakout direction. Thus, even if Dogecoin is retesting the lower level right now, a rebound and then breakout from the upper line may also still be quite possible. That said, in the event that a bearish breakout does take place, things can be especially troubling for DOGE, as there is another level of importance just nearby. Related Reading: $390M In Ethereum Leaves Exchanges—Biggest Daily Exit In Over A Month The level in question, situated around $0.168, corresponds to the 0.786 Fibonacci Retracement level. Fibonacci Retracement levels are lines defined using ratios found in the famous Fibonacci series. &#8220;Dogecoin $DOGE must hold above $0.168 to avoid a 30% price drop!&#8221; warns the analyst. DOGE Price At the time of writing, Dogecoin is trading around $0.177, down over 4% in the last week. Featured image from Dall-E, charts from TradingView.com"
    },
    {
      "title": "Bitcoin Whale And Retail Inflows To Binance Fall To Cycle Lows, More Upside Ahead?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-whale-and-retail-inflows-to-binance-fall-to-cycle-lows-more-upside-ahead/",
      "summary": "As Bitcoin (BTC) reels amidst escalating geopolitical tensions between Israel and Iran &#8211; dropping from $110,530 on June 9 to just above $106,900 today &#8211; concerns are mounting that BTC’s upward momentum may have stalled. However, on-chain data suggests that both Bitcoin whales and retail investors still anticipate further upside for the leading cryptocurrency. Bitcoin Whale And Retail Inflows To Binance Tumble According to a recent CryptoQuant Quicktake post by contributor Darkfost, Bitcoin inflows to Binance crypto exchange from two distinct cohorts &#8211; whales and retail investors &#8211; have fallen to their lowest levels in the current market cycle. Related Reading: Bitcoin Upward Momentum ‘Highly Likely’ To Continue, On-Chain Data Shows Darkfost shared the following chart illustrating that Bitcoin whale inflows to Binance have hit their lowest point since 2024. Similarly, retail investor inflows are also at their lowest since 2024, signalling a strong preference to hold rather than sell. The contributor emphasized that this alignment in behavior between whales and retail investors is a “highly constructive signal for the market.” Apart from the consistent inflows observed at the start of the current cycle, Darkfost identified two previous instances when both groups acted in sync. Notably, such periods of aligned behavior have typically coincided with previous market tops. These tops were marked by synchronized BTC inflows into exchanges, leading to a significant uptick in selling pressure and, eventually, market demand exhaustion. Commenting on the recent drop in BTC inflows, Darkfost suggested that market participants may be waiting for clearer macroeconomic cues or are simply exhibiting high conviction in Bitcoin’s long-term potential. They added: Such alignment across investor classes may also reflect broader market confidence, with expectations of further profits ahead. Recent trading setups support the aforementioned outlook. In a separate X post, seasoned crypto analyst Ash Crypto highlighted that a Bitcoin whale had opened a massive $200 million long position with 20x leverage. Should BTC Holders Be Worried? Despite the encouraging dip in BTC inflows to major exchanges like Binance, some analysts warn that a deeper correction may be imminent. For example, TradingView analyst MIRZA recently predicted that BTC could fall as low as $85,000. Related Reading: Bitcoin Sees Negative Funding On Binance – A Classic Setup For A Short Squeeze? Similarly, veteran trader Peter Brandt shared a cautionary note, that BTC may see a steep slide in the coming months. Brandt stated that if BTC mirrors the 2021-22 market cycle, then it may risk falling to as low as $23,600. That said, BTC outflows from exchanges continue to rise, depleting available reserves &#8211; a dynamic that could result in a supply shock. As of this writing, BTC is trading at $106,920, up 1.8% over the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "What Are The Implications For XRP If Ripple Captures 14% Of SWIFT’s Volume?",
      "link": "https://www.newsbtc.com/xrp-news/xrp-with-4-of-swifts-volume/",
      "summary": "A recent analysis by a crypto market expert has reignited interest in XRP’s potential utility, especially in the context of Ripple capturing a portion of SWIFT’s global transaction volume. According to the expert, if Ripple secures just 14% of SWIFT’s market share, the implications for XRP’s supply and potential could be significant. XRP’s Potential If Ripple Takes On 14% Of SWIFT Market expert Crypto Eri has emphasized, through detailed mathematical calculations, the impact Ripple, capturing 14% of SWIFT’s total annual cross-border volume, could have on XRP’s supply and daily transactions. Notably, the market expert emphasized that if Ripple were to process such a percentage, which is roughly $4.2 trillion, it would require a surprisingly small portion of XRP’s total supply to support the transaction. Related Reading: XRP Price Still On Track For $1.5T Market Cap And 27% Crypto Market Dominance According to Crypto Eri’s calculations, the $4.2 trillion annual volume translates to approximately $11.5 billion in daily transaction value. To assess how much the altcoin would be needed to facilitate this, the analyst assumed a deliberately conservative scenario, with each token being used once every three minutes. This is significantly slower than XRP’s actual settlement capability of 3 to 5 seconds but was chosen to reflect the potential liquidity management constraints in real-world applications. With 86,400 seconds in a day and each transaction occupying about 80 seconds, each XRP could be used for up to 480 transactions daily. Moreover, at the current market price of $2.15, Crypto Eri calculated that one XRP could facilitate $1,032 worth of transactions per day. To process the estimated $11.5 billion in daily volume, this would need approximately 11.15 million XRP tokens. This figure is striking when compared to XRP’s circulating supply, which currently stands at around 58.82 billion tokens. Crypto Eri stated that just 0.0190% of this supply would be necessary to handle the calculated transaction volume, reinforcing the idea that XRP’s high velocity and reusability make it a possible efficient bridge asset. Overall, Crypto Eri’s Ripple-SWIFT analysis model presents a compelling case for XRP’s utility in the global payments space. Her calculations and projections have also sparked widespread engagement across the crypto community, with several independent researchers and members concurring with her assessment and contributing their data-driven models to validate the projections further. The Token Burn Rate Estimates For Trillion-Dollar Use Case As XRP’s potential utility in global finance is brought into focus by Crypto Eri, the market expert also offers new insight into XRP’s burn rate in terms of fees needed to facilitate a $5 trillion annual transaction volume. A crypto community member followed up on the analyst’s earlier Ripple and SWIFT calculations by asking how many of the token would be conservatively burned through transaction fees. Related Reading: Liquidity Levels Show XRP Price Is Headed Up, But Must Cross $2.40 First The analyst estimated that only 5,000 XRP would be permanently burned in the process—an astonishingly small figure considering the massive scale of value being transferred. The estimate assumes an average transaction size of $10,000, which would result in roughly 500 million transactions per year to reach the $5 trillion mark. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Gold Rush 2.0? Treasuries Swell With 60 New Players",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-gold-rush-2-0-treasuries-swell-with-60-new-players/",
      "summary": "Companies around the globe made 60 Bitcoin announcements in five days, signaling a surge in corporate interest. Between June 9 and 13, companies added thousands of BTC to their balance sheets and revealed plans for billions more. This week’s activity shows that more businesses are treating Bitcoin like any other financial asset. Related Reading: Amid Bitcoin Hype, Seasoned Trader Predicts Sudden Drop To This Level Six New Bitcoin Treasuries Open Doors According to data shared by @btcNLNico on X, six firms created fresh Bitcoin treasuries and together added 404 BTC in just one week. American Bitcoin Corp led the pack with an initial purchase of 215 BTC as it moves toward a public merger under the ABTC ticker. 🚨 Week 24 &#8211; #Bitcoin Treasury Strategy Updates 🚨 📅 June 9-13 saw a massive 60 announcements! 🤯 &#8211; 6 new treasuries launched with 404 BTC &#8211; 10 future treasuries announcements &#8211; 23 companies added bitcoin, totaling 2,188 BTC &#8211; 9 plans to buy more bitcoin, up to ~$1.83 billion… pic.twitter.com/HM9FiZWMvb — NLNico (@btcNLNico) June 14, 2025 Bitmine and Gumi also made their debut in the corporate Bitcoin club. On top of that, 10 companies—including Mercury Fintech, which unveiled an $800 million financing plan—have filed paperwork or announced intentions to set up their own Bitcoin reserves. Trump Media, owned by US President Donald Trump, even registered for a $2.3 billion Bitcoin Treasury deal. Existing Holders Expand Their Stakes Twenty‑three firms bolstered existing Bitcoin piles with 2,188 BTC of new buys. Strategy was the busiest, scooping up 1,045 BTC and closing a $979.7 million IPO on June 10. Remxpoint added 279.9 BTC, KULR took on 118.6 BTC, and Cipher Mining snapped up 111 BTC. Smaller players like Vanadi Coffee and Rocksoft chipped in with between 1 and 10 BTC each. Based on reports, this wave of buying echoes the rush into Bitcoin ETFs—BlackRock’s IBIT fund alone approached $1 billion in inflows over the same stretch. Plans Point To $1.83 Billion In Future Buys Nine companies have spelled out intentions to buy more Bitcoin, potentially fueling $1.83 billion of fresh demand. ANAP has raised funds earmarked for a 585 BTC purchase. Mélioz brought in $32.5 million and set up warrants that could translate into another $69.48 million in Bitcoin. GameStop announced a $2.25 billion convertible note issue, with proceeds tagged for crypto investments. Related Reading: Ethereum Whales Feast While Retail Flees—ETH Ocean Just Got Hungrier Asset Tokenization And Capital Raises Take Shape Based on reports, some firms are going beyond simple purchases. DDC Enterprise and H100 Group plan to tokenize real‑world assets and use Bitcoin as collateral. The Blockchain Group in France kicked off a €300 million capital program and won shareholder backing to raise up to 10 billion euros. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Ethereum Consolidation Continues – Altseason May Follow A Clean Break Above Resistance",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-consolidation-continues-altseason-may-follow-a-clean-break-above-resistance/",
      "summary": "Ethereum has remained in a volatile consolidation phase, trading between the $2,400 and $2,800 levels as geopolitical tensions weigh heavily on global markets. After last week’s failed breakout above resistance, ETH has retraced yet again, struggling to build sustained momentum. The ongoing conflict between Israel and Iran has intensified market uncertainty, contributing to spikes in volatility across risk assets, including cryptocurrencies. Related Reading: Ethereum Weekly Candle Hints At Pre-Tower Top Formation – Details Despite the macro headwinds, Ethereum bulls continue to defend key support levels, preventing a deeper breakdown. The $2,400 zone has acted as a strong floor in recent weeks, absorbing sell pressure and keeping ETH within its current trading range. Meanwhile, the $2,800 resistance remains the major hurdle to reclaim for a bullish breakout scenario. Top analyst Jelle shared a technical outlook suggesting that Ethereum is still consolidating below a key resistance area. This structure indicates that ETH is coiling before its next major move. The window for a potential breakout narrows as price tightens within this established range. Ethereum Prepares To Move Ethereum has pushed into a critical price zone, with bulls attempting to hold the $2,600–$2,700 range after recent volatility. The asset has shown resilience, rebounding from last week’s lows and re-entering the mid-range of its multi-week consolidation. With price action once again approaching the $2,800 resistance level, market participants are eyeing a potential breakout that could open the door to $3,000 and beyond. Analysts remain divided. On one side, bullish momentum and improving market sentiment suggest ETH is preparing for a larger move. A confirmed breakout above $2,800 would likely trigger aggressive buying and initiate a broader altcoin rally. Many investors are positioning themselves in anticipation of a rotation from Bitcoin into high-beta assets like Ethereum, hoping to ride the next phase of the cycle. On the other side, caution persists. Some technical analysts argue that Ethereum may still be at risk of losing steam, especially if the price gets rejected again at resistance. A failure to maintain the current range could result in a retracement toward $2,400 support or even lower, shaking out weak hands. According to a recent technical update from Jelle, Ethereum remains locked in consolidation just below its key resistance zone. The analysis points to a tightening structure where the window of opportunity is closing. If ETH breaks above this zone, it could ignite fireworks across the altcoin market. With global uncertainty still present and traders closely watching resistance levels, Ethereum’s next move could define the pace of the broader market. Whether it’s a breakout or a breakdown, the coming days are likely to be pivotal. Related Reading: Bitcoin Tests Critical $104K Support – Eyes On $97K If It Breaks ETH Price Action: Technical Details Ethereum is currently trading at $2,606, maintaining a tight consolidation range between $2,400 and $2,800 as shown in the 12-hour chart. After multiple rejections around the $2,800 zone, the asset is struggling to break through this resistance level decisively. Despite the volatility triggered by macroeconomic uncertainty and Middle East conflict, ETH has managed to defend the $2,500 area, supported by a rising 100-period moving average. The recent bounce from the lower end of the range suggests that bulls are still active, stepping in to defend critical structure. However, volume remains relatively muted, indicating that buyers are cautious and awaiting confirmation before initiating larger positions. Meanwhile, the 50-period moving average remains above the 200-period MA, hinting at a medium-term bullish bias if support continues to hold. Related Reading: Ethereum Holds $2,500 Support – History Signals $4,000 As Potential Target The yellow horizontal zone marks the key resistance Ethereum must clear to trigger a sustained move higher, with a clean break above $2,800 likely igniting upside momentum toward $3,000. If the range breaks to the downside, the $2,400 zone is the next level to watch for demand. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "H100 Group Receives 144.8 BTC in Convertible Loan Deal",
      "link": "https://bitcoinmagazine.com/news/h100-group-receives-144-8-btc-in-convertible-loan-deal",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/H100-Group-Receives-144.8-BTC-in-Convertible-Loan-Deal-Now-Holds-169.2-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/h100-group-receives-144-8-btc-in-convertible-loan-deal\" rel=\"nofollow\"> </a></p> <p>H100 Group, Swedish health-tech firm, has received 144.8 BTC as part of a settlement tied to its convertible loan agreement, according to a company press release issued Monday. With this latest transaction, the Stockholm-based firm now holds a total of 169.2 BTC on its balance sheet. The 144.8 BTC was transferred as a part of [&#8230;]</p> <p>"
    },
    {
      "title": "Trump Media Files to Launch Bitcoin and Ethereum ETF",
      "link": "https://bitcoinmagazine.com/news/trump-media-files-to-launch-bitcoin-and-ethereum-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Trump-Media-Files-to-Launch-Bitcoin-and-Ethereum-ETF.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/trump-media-files-to-launch-bitcoin-and-ethereum-etf\" rel=\"nofollow\"> </a></p> <p>Trump Media &#38; Technology Group has filed a registration statement with the U.S. Securities and Exchange Commission to launch the Truth Social Bitcoin and Ethereum ETF, B.T. The ETF will directly hold Bitcoin and Ether, with an initial allocation of 75% Bitcoin and 25% Ether. Shares of the fund will be offered to investors to [&#8230;]</p> <p>"
    },
    {
      "title": "Michael Saylor and Pakistan’s Crypto Minister Bilal Talk Bitcoin and Global Investment",
      "link": "https://bitcoinmagazine.com/news/michael-saylor-and-pakistans-crypto-minister-bilal-talk-bitcoin-and-global-investment",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Michael-Saylor-and-Pakistans-Crypto-Minister-Bilal-Talk-Bitcoin-and-Global-Investment.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/michael-saylor-and-pakistans-crypto-minister-bilal-talk-bitcoin-and-global-investment\" rel=\"nofollow\"> </a></p> <p>Michael Saylor discussed how trust and leadership could attract global Bitcoin investments to Pakistan.</p> <p>"
    },
    {
      "title": "Senator Hagerty’s Vision Beyond The GENIUS Act: Make Tennessee A Hub For Bitcoin Mining",
      "link": "https://bitcoinmagazine.com/politics/senator-hagertys-vision-beyond-the-genius-act-make-tennessee-a-hub-for-bitcoin-mining",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Senator-Bill-Hagerty-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/senator-hagertys-vision-beyond-the-genius-act-make-tennessee-a-hub-for-bitcoin-mining\" rel=\"nofollow\"> </a></p> <p>While currently focused on stablecoin legislation, the Tennessee senator also has plans for Bitcoin mining and AI data centers in his home state.</p> <p>"
    },
    {
      "title": "Strategy Acquires 10,100 BTC, Surpasses 592,000 Bitcoin in Holdings",
      "link": "https://bitcoinmagazine.com/news/strategy-acquires-10100-btc-surpasses-592000-bitcoin-in-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Strategy-Acquires-10100-BTC-Surpasses-592000-Bitcoin-in-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/strategy-acquires-10100-btc-surpasses-592000-bitcoin-in-holdings\" rel=\"nofollow\"> </a></p> <p>Michael Saylor’s Strategy announces it has purchased an additional 10,100 BTC for approximately $1.05 billion, raising its total holdings to 592,100 BTC acquired at an average cost of $70,666 per Bitcoin. Strategy added another 10,100 Bitcoin to its treasury between June 9 and June 15, 2025, according to a Form 8-K filed Monday with the [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "China’s $9 AI Video Tool Kling 2.1 Adds Audio—Can It Beat Google’s $250 Veo 3?",
      "link": "https://decrypt.co/325459/kling-ai-video-tool-audio-beat-googles-250-veo-3",
      "summary": "Kuaishou has rolled out synchronized sound effects for its video generator in a bid to challenge Google’s Veo3. But is it better?"
    },
    {
      "title": "Avalanche Launches Free Gaming 'Battle Pass' With AVAX and NFT Rewards",
      "link": "https://decrypt.co/325391/avalanche-launches-gaming-battle-pass-rewards",
      "summary": "The free Avalanche Battle Pass NFT, which can be minted at Magic Eden, provides token rewards to crypto gamers."
    },
    {
      "title": "Cantor Sees 75% Upside in Solana-Focused Stocks With New Analyst Coverage",
      "link": "https://decrypt.co/325457/cantor-solana-focused-stocks-analyst-coverage",
      "summary": "Cantor analysts think Solana-linked stocks could outperform by offering faster crypto exposure and income through staking."
    },
    {
      "title": "JP Morgan Files Trademark for JPMD: Is It a Stablecoin?",
      "link": "https://decrypt.co/325431/jp-morgan-files-trademark-for-jpmd-is-it-a-stablecoin",
      "summary": "The U.S. investment bank has submitted a regulatory filing has submitted a regulatory filing to trademark JPMD—a mysterious project proposal that some crypto industry experts are saying could be a stablecoin."
    },
    {
      "title": "Crypto Is Now Trump's Second-Most Lucrative Source of Income",
      "link": "https://decrypt.co/325440/crypto-is-now-trumps-second-most-lucrative-source-income",
      "summary": "The president made more money off crypto than most income streams in 2024—before he re-assumed the White House and made billions more off the sector."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "X accounts tied to Pump.fun, ElizaOS, and GMGN suspended",
      "link": "https://cryptobriefing.com/x-account-suspensions-pump-fun-elizaos/",
      "summary": "<p>The suspension of these accounts could disrupt upcoming projects and impact investor confidence in decentralized platforms.</p> <p>"
    },
    {
      "title": "JPMorgan files ‘JPMD’ trademark, hinting at possible stablecoin offering",
      "link": "https://cryptobriefing.com/jpmorgan-stablecoin-trademark-application/",
      "summary": "<p>JPMorgan's trademark move could accelerate mainstream adoption of digital currencies, influencing financial markets and regulatory landscapes.</p> <p>"
    },
    {
      "title": "Eric Trump says he loves Justin Sun but denies involvement in Tron’s public debut plan",
      "link": "https://cryptobriefing.com/eric-trump-tron-statement/",
      "summary": "<p>Eric Trump's denial of involvement in Tron's debut highlights potential complexities in crypto market entries and the influence of high-profile endorsements.</p> <p>"
    },
    {
      "title": "SEC formally accepts Trump Media’s Bitcoin spot ETF filing",
      "link": "https://cryptobriefing.com/sec-bitcoin-spot-etf-filing/",
      "summary": "<p>The SEC's review of Trump Media's Bitcoin ETF filing could influence future crypto investment products and regulatory approaches.</p> <p>"
    },
    {
      "title": "Purpose Investments to launch XRP spot ETF on June 18",
      "link": "https://cryptobriefing.com/purpose-xrp-etf-launch/",
      "summary": "<p>The launch of the XRP ETF could accelerate mainstream adoption of digital assets, positioning Canada as a leader in crypto investment innovation.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Why Aerodrome Finance’s 60% 7-day surge means $1 could fall next!",
      "link": "https://ambcrypto.com/why-aerodrome-finances-60-7-day-surge-means-1-could-fall-next/",
      "summary": "<img alt=\"Why Aerodrome Finance&#039;s 60% 7-day surge means $1 could fall next!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/AERO-Featured-Image.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Are AERO bulls just getting started?"
    },
    {
      "title": "Altcoin season on the brink? Experts flag Cardano’s $100M BTC treasury shift",
      "link": "https://ambcrypto.com/altcoin-season-on-the-brink-experts-flag-cardanos-100m-btc-treasury-shift/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/AltcoinseasonFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite the hike in BTC dominance, HYPE outperformed BTC by nearly 20x."
    },
    {
      "title": "Bitcoin clears $106K – Will the Fed or Iran-Israel tensions spark the next move?",
      "link": "https://ambcrypto.com/bitcoin-clears-106k-will-the-fed-or-iran-israel-tensions-spark-the-next-move/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-14.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is BTC setting up for yet another macro-driven rejection?"
    },
    {
      "title": "Bitcoin bulls, here’s why your wait for a new ATH may be over!",
      "link": "https://ambcrypto.com/bitcoin-bulls-heres-why-your-wait-for-a-new-ath-may-be-over/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250616_131724_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin may kick off the week with a significant price rally."
    },
    {
      "title": "New ATHs for Hyperliquid, but can it REALLY back up the hype?",
      "link": "https://ambcrypto.com/new-aths-for-hyperliquid-but-can-it-really-back-up-the-hype/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-26.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With a 36% rally this month and ATHs stacking up, HYPE’s bullish wave isn't slowing down yet."
    }
  ]
}