{
  "CoinDesk": [
    {
      "title": "XRP Could Capture 14% of SWIFT’s Global Volume, Ripple CEO Says",
      "link": "https://www.coindesk.com/markets/2025/06/13/xrp-could-capture-14-of-swifts-global-volume-ripple-ceo-says",
      "summary": ""
    },
    {
      "title": "Anthony Pompliano Set to Head $750M Bitcoin Investment Vehicle: FT",
      "link": "https://www.coindesk.com/markets/2025/06/13/anthony-pompliano-set-to-head-750m-bitcoin-investment-vehicle-ft",
      "summary": ""
    },
    {
      "title": "Ripple, SEC File Joint Motion to Release $125M Held in Escrow",
      "link": "https://www.coindesk.com/markets/2025/06/13/ripple-sec-file-joint-motion-to-release-125m-held-in-escrow",
      "summary": ""
    },
    {
      "title": "XRP, SOL Poised to Take Off Amid Rocketing Institutional Demand, Analyst Says",
      "link": "https://www.coindesk.com/markets/2025/06/13/xrp-sol-poised-to-take-off-amid-rocketing-institutional-demand-analyst-says",
      "summary": ""
    },
    {
      "title": "Single Bitcoin Trader Loses $200M as Crypto Bulls See $1B Liquidations",
      "link": "https://www.coindesk.com/markets/2025/06/13/single-bitcoin-trader-loses-200m-as-crypto-bulls-see-1b-liquidations",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Walmart, Amazon consider issuing own stablecoins: WSJ",
      "link": "https://cointelegraph.com/news/walmart-amazon-explore-stablecoins-payments?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5MzhjMWQtYjU4ZS03OWU1LThlNGItYTQxNzlhODk0NWY3.jpg\" /></p><p>Retail giants Walmart and Amazon are reportedly evaluating digital currencies to streamline e‑commerce and boost cross‑border transactions.</p>"
    },
    {
      "title": "Polkadot community split on selling 500K DOT for Bitcoin reserve",
      "link": "https://cointelegraph.com/news/polkadot-bitcoin-reserve-proposal-sparks-mixed-reactions?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY4YWItZGRkMS03MGFiLWJjOGUtMzg4M2JjMjQxOTNm.jpg\" /></p><p>Polkadot’s community is split over a proposal to convert 500,000 DOT tokens into tBTC using a year-long DCA strategy amid market volatility.</p>"
    },
    {
      "title": "Bitcoin price Bollinger Bands &#039;failure&#039; risks end of uptrend at $112K",
      "link": "https://cointelegraph.com/news/bitcoin-price-bollinger-bands-failure-risks-end-uptrend-112k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTI0ZjktM2U5Mi03NmE2LWFiODEtMmQ2M2Y3ZjE1MzA0.jpg\" /></p><p>Bitcoin Bollinger Bands analysis leads to potentially grim conclusions about the fate of the BTC price rebound, which began at sub-$75,000 lows in April.</p>"
    },
    {
      "title": "GameStop shares tank 22% after boosting raise to $2.25B for Bitcoin strategy",
      "link": "https://cointelegraph.com/news/gamestop-sink-20-500m-upsizing-btc-investments?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVjOTEtNWYwYi03ZTcxLWIyM2MtZTE5MjM1NzY2NmJk.jpg\" /></p><p>GameStop boosted its convertible note offering to $2.25 billion, fueling its Bitcoin treasury strategy and raising speculation about future crypto investments.</p>"
    },
    {
      "title": "Why is the crypto market down today?",
      "link": "https://cointelegraph.com/news/why-is-the-crypto-market-down-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvODAzMjgxMmQtMWQ1MC00NmFiLWI5NjUtYTBjYjZkZDQxYTYz.jpg\" /></p><p>Crypto market volatility rises in reaction to Israel’s attack on Iran, but the technical setup suggesting that the uptrend still remains intact.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "SEC pulls back from crypto rules proposed under Gary Gensler administration",
      "link": "https://cryptoslate.com/sec-pulls-back-from-crypto-rules-proposed-under-gary-gensler-administration/",
      "summary": "<p>The US Securities and Exchange Commission (SEC) is rolling back 14 proposed rules, including key measures that once targeted the crypto industry. The decision, announced on June 12, illustrates the shift in regulatory priorities as the agency distances itself from the aggressive stance adopted during the previous administration. The withdrawn proposals were introduced between March [&#8230;]</p> <p>"
    },
    {
      "title": "How Nemo Money Is Redefining Global Investing With Smart Tools and Zero Commission Trading",
      "link": "https://cryptoslate.com/how-nemo-money-is-redefining-global-investing-with-smart-tools-and-zero-commission-trading/",
      "summary": "<p>Introduction In an increasingly complex investment world, Nemo Money is breaking through the noise. As a next-generation investing app developed by Exinity, Nemo is designed for both new and experienced investors looking for smarter, more accessible ways to manage their money — without paying excessive fees. Built for Investors Who Want More With over 6,000 [&#8230;]</p> <p>"
    },
    {
      "title": "Over $1.1B liquidated amid Middle East conflict with Bitcoin, Ethereum hit hardest",
      "link": "https://cryptoslate.com/insights/over-1-1b-liquidated-amid-middle-east-conflict-with-bitcoin-ethereum-hit-hardest/",
      "summary": "<p>In the past 24 hours, over $1.14 billion in crypto market positions were liquidated, with long positions accounting for roughly 91 percent of the total, according to data from Coinglass. The sharp unwinding came as Bitcoin dropped more than 5 percent from a local high of $108,000 Thursday to as low as $103,000, following Israeli [&#8230;]</p> <p>"
    },
    {
      "title": "Israel strike on Iran nuclear sites causes Bitcoin 5% slide, fails to act as a financial flight to safety",
      "link": "https://cryptoslate.com/israel-strikes-iran-nuclear-sites-causes-bitcoin-5-slide-fails-to-act-as-a-financial-flight-to-safety/",
      "summary": "<p>Bitcoin dropped sharply early Friday following Israel’s overnight strikes on Iran, weakening its recent position as a perceived safe-haven asset. The leading digital asset fell over 5 percent, from a local high of $108,000 on Thursday to approximately $103,000, as market participants reacted to escalating conflict in the Middle East. Oil markets surged in response [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin liquidity moves to non-KYC exchanges as US reserves thin",
      "link": "https://cryptoslate.com/bitcoin-liquidity-moves-to-non-kyc-exchanges-as-us-reserves-thin/",
      "summary": "<p>During Bitcoin&#8217;s climb to a new ATH above $111,000 in late May, a silent but measurable reshuffling has occurred in the market: more BTC is now held on offshore exchanges than on regulated platforms in the US, and volumes are steadily leaking from KYC-compliant venues. Data from CryptoQuant shows that the market embraced institutional inflows [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Bears Back In Control After $110,000 Rejection, What Comes Next?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-bears-back-in-control/",
      "summary": "The Bitcoin price has suffered a violent rejection after hitting the $110,000 level, showing a clear intention of the bears to keep the digital asset from hitting new all-time highs. So far, the rejections from $110,000 have been swift and have put the bears back in control. This has given credence to calls that the Bitcoin price will fall back below the psychological level of $100,000, something that could trigger another wave of declines in the crypto market. Bitcoin Rejection At $110,000 Part Of The Plan? The Bitcoin price rejection has no doubt triggered a wave of panic among investors, many of whom believe that this is the end of the cycle. However, a crypto analyst has suggested that the pullback is part of the larger plan as the largest cryptocurrency by market cap moves on its way to new all-time highs. Related Reading: Bitcoin Risks Pullback To $105,000 After Facing Rejection Above $110,000 In the analysis, they explain that the digital asset is currently at a point where it is undergoing significant distribution, and this will explain the decline in price. The pullback in and of itself is no cause for alarm, as minor corrections after major surges are normal. In addition to this, there is a lot of accumulation going on as Bitcoin moves from the hands of old investors into the hands of new investors at a higher cost basis. The accumulation is expected to move Bitcoin into the next bullish wave. This bullish wave is the next step in the trend as the BTC price moves into place for the next price surge. Once the volume moves upward as expected, then the asset’s price is expected to follow in succession. BTC Price Could Hit $130,000 Target After Breakout Going by the analyst’s chart shared on the TradingView website, the Bitcoin price correction is not expected to last for long. Mainly, holding the $107,000 support becomes paramount at this level as this could set the launchpad point for the next bullish impulse. Related Reading: XRP Price Forms Flag Pattern Above Accumulation Zone That Points To $5 Target The completion of the accumulation phase puts the next breakout level as high as $130,000, which would be an over 20% increase from the current level. However, this may not be the end as the crypto analyst has set a swing target for as high as $150,000. As for the timeline for when this could happen, the crypto analyst places a long-term target for the end of the year 2025. But there is also the possibility that the trend would be completed sooner and the Bitcoin price could reach its target and new all-time highs before the year runs out. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "ONDO To Repeat 2024’s ‘Parabolic’ Run? Analyst Anticipates 130% Rally Soon",
      "link": "https://www.newsbtc.com/news/ondo-to-repeat-2024s-parabolic-run-analyst-anticipates-130-rally-soon/",
      "summary": "Despite failing to break out of its downtrend, ONDO could be preparing for a surge above the $2 barrier. Some analysts suggest it could repeat its 2024 playbook if it continues to hold its current levels. Related Reading: Ethereum Prepares For Massive Run After $2,800 Reclaim – ‘Up Only’ Ahead? ONDO Breakout Eyes $2 ONDO, the native token of the tokenized real-world asset (RWA) platform Ondo Finance, is attempting to reclaim a key area amid the market pullback. Notably, the cryptocurrency has struggled to hold the $1 mark since losing the area as support over three months ago. In December, the RWA token hit its all-time high (ATH) of $2.14 after US President Donald Trump’s crypto venture, World Liberty Financial (WLFI), purchased 134,216 ONDO tokens for 250,000 USDC. This propelled ONDO’s price above the $2 barrier for the first time, but the late 2024 and Q1 2025 corrections halted its bullish momentum, sending its price to the $0.60-$0.70 range. Following the late April market recovery, ONDO’s price reclaimed the $0.85 area and broke out of its multi-month downtrend. The cryptocurrency then hovered between the $0.85-$1.10 levels throughout May, hitting a three-month high of $1.13 nearly a month ago. Since then, the token has been in a one-month downtrend, dipping below its local range after the recent market pullback. However, the cryptocurrency has been attempting to reclaim this range for the past week, hitting a one-week high of $0.92 on Wednesday. Crypto analyst World of Charts highlighted the token’s performance, affirming, “after a long correction, Finally Looking Good For Midterm.” As ONDO attempts to reclaim the $0.90 area, the analyst anticipates that the cryptocurrency will soon break out of its current range and the downtrend line, forecasting a 130% rally toward the $2 barrier. 2024 ATH Repeat Coming? On Thursday, analyst Sjuul from AltCryptoGems noted ONDO’s performance over the past year, asserting, “Not sure there are many other charts looking as good on high time frames like ONDO.” He explained that “The King of RWA” is “basically holding a bullish structure since its launch,” making a series of higher lows for over a year while maintaining its ascending support trendline. Meanwhile, analyst Alex Clay suggested that ONDO could see a parabolic run based on its performance in 2024. The market watcher noted that the token is currently accumulating at the bottom of a 15-month ascending channel, which previously served as a crucial bounce point for its rally toward its ATH. As Clay explained, after reaching the channel’s upper boundary last year, ONDO saw a multi-month downtrend toward the lower boundary, before printing a higher low. This was followed by a massive rally toward the channel’s top. Related Reading: Bitcoin Eyes New Highs As Price Retests $109,000, But Analyst Warns Of Potential Pullback This year, ONDO is “following the Bullish Fractal from the previous year” after falling to the channel’s lower boundary, breaking out of the downtrend line, and registering a higher low. “These 2 reasons are more than enough to pump straight up to the channel&#8217;s top,” the analyst concluded. If history repeats, the cryptocurrency could surge toward the $2.8-$3 area. At the time of writing, ONDO trades at $0.84, a 5.2% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price’s Brutal Sell-Off Has One More Stop, Says Analyst — Here’s Where",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-prices-brutal-sell-off-has-one-more-stop-says-analyst-heres-where/",
      "summary": "The Bitcoin price continues to decelerate as the crypto market shows signs of weakness due to macroeconomic factors. The top crypto by market capitalization has been testing critical support levels and is at risk of falling deeper into its monthly lows. Related Reading: Bitcoin Could Jump 20% For Every 1% Liquidity Boost: Expert At the time of writing, the Bitcoin price trades around $104,000 recording a 2.5% drop over the past 24 hours. Other cryptocurrencies show greater weaknesses on similar timeframes with Ethereum and XRP displaying a 8% and 4% drop, respectively. Bitcoin price hints at further losses on the daily chart. Source: BTCUSD on Tradingview Bitcoin Price Alert, Key Levels To Watch According to top crypto analyst Daan Crypto, the Bitcoin price has been trading within a narrow window after losing the range high located at $108,385. While the cryptocurrency has been able to withstand the sell-off, the analyst drew important levels to watch. As seen on the chart below, and according to the analyst, the Bitcoin price is likely to stay on its bearish course and potentially touch the mid area of its current range. This price action would put BTC at around $99,600 in the coming days. If buyers can’t hold the sell pressure around this level, then BTC is more than likely to keep bleeding into its range low of $90,000. This bearish price action, the analyst clarified, would become the norm for the rest of June. Key Levels to watch as the Bitcoin price shows weakness on low timeframes. Source: Daan Crypto via X Daan Crypto stated the following regarding the Bitcoin price action: Quick move after that which was obviously &#8220;helped&#8221; by the headlines although the news was looming already with the past 48 hours of headlines which is also why price started selling of prior. I&#8217;ve said it a couple of times before but I&#8217;ll say it again. Bulls had no business going back down below $108K and I&#8217;m treating this as another deviation and move back into the larger range. This is reason enough for me to be cautious and not add on exposure that was derisked (…). In this context, the analyst advised his followers to wait for clear confirmation that the bull trend is returning if Bitcoin can retake its range high around the previously mentioned level. Otherwise, the best course of action is to remain cautious. Optimism Fades as Bitcoin Aims for Lower On a separate note, trading desk QCP Group noted that the biggest risk for Bitcoin and the crypto market comes from the rising tensions between the US and China, and the growing tensions in the Middle East. Related Reading: Bitcoin Is Just 0.2% Of Global Wealth — And That’s Why It’s Not Too Late: Analyst However, the trading desk pointed at several items to show that there are still good news hinting at a potential recovery in the digital asset market. These included the spike in Ethereum ETFs inflows, the potential launch of a Solana ETF, and GameStop’s plan to offer $1.7 billion in convertible notes to allocate money into Bitcoin as the company looks for “balance sheet diversification.” Cover image ChatGPT, BTC/USD chart from Tradingview"
    },
    {
      "title": "$390M In Ethereum Leaves Exchanges—Biggest Daily Exit In Over A Month",
      "link": "https://www.newsbtc.com/news/ethereum/393m-ethereum-leaves-exchanges-biggest-daily-exit/",
      "summary": "On-chain data shows Ethereum has just witnessed its largest daily withdrawal in over a month, a sign that may turn out to be bullish for the asset&#8217;s price. Ethereum Has Recently Seen Notable Exchange Outflows As explained by the institutional DeFi solutions provider Sentora (formerly IntoTheBlock) in a new post on X, a large amount of Ethereum has left exchanges. The on-chain indicator of interest here is the &#8220;Exchange Netflow,&#8221; which measures the net amount of ETH entering into or exiting out of the wallets associated with centralized exchanges. When the value of this metric is positive, it means the exchanges are receiving a net number of deposits. As one of the main reasons why investors deposit their tokens to these platforms is for selling-related purposes, this kind of trend can have a bearish implication for the ETH price. Related Reading: Tron Has Plenty Of Room For A 2025 Bull Run, Risk Metric Signals On the other hand, the indicator being below zero suggests the exchange outflows outweigh the inflows. Such a trend can imply the holders are accumulating, which can naturally have a bullish effect on the asset. Now, here is the chart shared by Sentora that shows the trend in the Ethereum Exchange Netflow over the past month: As displayed in the above graph, the Ethereum Exchange Netflow has seen a sharp negative spike during the past day, which suggests the investors have withdrawn a significant amount of the cryptocurrency. In total, the exchanges have handled net outflows of more than 140,000 ETH (worth about $390 million) with this withdrawal spree. This is the largest single-day exit that these platforms have faced in over a month. These outflows have come as Ethereum has been attempting a breakout from its month-long range. As such, it&#8217;s possible that a portion of the large holders of the market have some level of confidence in this rally. In some other news, the cash-margined Ethereum Futures Open Interest has set a new all-time high, as the on-chain analytics firm Glassnode has revealed in an X post. The Futures Open Interest is an indicator that measures the total amount of positions related to Ethereum that are currently open on all derivatives platforms. Here, the &#8216;cash-margined&#8217; Open Interest is of relevance, which includes all the contracts that have fiat/stablecoins as collateral. Related Reading: Bitcoin Options Traders Expect Quiet—But On-Chain Data Suggests Chaos From the chart, it&#8217;s apparent that this metric has recently seen some rapid growth and has achieved a new record of about $20 billion. &#8220;Despite a slight pullback from the $2.8K levels, leverage continues to build as traders load up using stablecoins,&#8221; notes Glassnode. ETH Price Ethereum crossed beyond the $2,800 level earlier, but it appears it has seen a setback as its price is back at $2,750. Featured image from Dall-E, Glassnode.com, IntoTheBlock.com, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Is Just 0.2% Of Global Wealth — And That’s Why It’s Not Too Late: Analyst",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-is-just-0-2-of-global-wealth-and-thats-why-its-not-too-late-analyst/",
      "summary": "According to Walker, host of The Bitcoin Podcast, Bitcoin’s share of the world’s wealth is still tiny. It sits at about $2 trillion in market value. That’s just 0.2% of roughly $1 quadrillion held across all assets. For many investors, that number brings a sense of how early this market really is. Yet, it also raises questions about what comes next for this highly talked-about coin. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Global Wealth Distribution Real estate holds the biggest slice of that $1 quadrillion pie. At around $370 trillion, it represents 37% of total global wealth. Bonds follow close behind with $318 trillion. Those are seen as a safe choice for retirees and conservative funds. Stocks, meanwhile, sit at $135 trillion. Cash and bank deposits add another almost $130 trillion to the mix. These numbers show where most of the world’s money lives today. There is $1000 TRILLION of global wealth. Bitcoin is only $2T… Bitcoin is only 0.2% of global wealth, and there will only ever be 21M bitcoins. We are insanely early yet many still feel like they’ve missed the boat… If you’re reading this, buy bitcoin. Chart: @Croesus_BTC pic.twitter.com/gjju41MMGm — Walker⚡️ (@WalkerAmerica) June 11, 2025 Bitcoin’s Market Share Bitcoin’s $2 trillion value looks small next to these giants. It comes in below art, cars and collectibles, which together amount to $27 trillion. Gold, long a trusted store of value, sits at $22 trillion. So, while Bitcoin is rare by design, it still trails behind assets with centuries of history and deep pockets on the buying side. Scarcity Fuels Price Talk With only 21 million coins ever to be mined, Bitcoin’s supply cap is fixed. That has led to forecasts of big price jumps if demand keeps growing. Based on reports, some say Bitcoin could match gold’s $22 trillion market cap one day. That would push a single coin past $1.15 million. Other backers warn that missing out now could mean buying in later at much higher levels, driven by FOMO—fear of missing out. Related Reading: TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin Institutions Eye The Market Michael Saylor, who heads one of the biggest Bitcoin treasury firms, thinks big players might wait until prices soar. He suggests that companies like JPMorgan could finally jump in when Bitcoin hits $1 million. He even floated the idea of $10 million per coin before it becomes common in mainstream portfolios. These views point to a potential wave of new cash rushing in if certain price thresholds are crossed. Featured image from Bitbo, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Will Replace Gold And Go To $1,000,000, Says Galaxy Digital CEO Mike Novogratz",
      "link": "https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Will-Replace-Gold-And-Go-To-1000000-Says-Galaxy-Digital-CEO-Mike-Novogratz.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz\" rel=\"nofollow\"> </a></p> <p>Mike Novogratz, in an interview with CNBC, said “there have been more Bitcoins lost than will be mined for the rest of eternity.\"</p> <p>"
    },
    {
      "title": "Coinbase Announces Bitcoin Rewards Credit Card, Offering up to 4% BTC Back on Everything",
      "link": "https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-BTC-Credit-Card.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything\" rel=\"nofollow\"> </a></p> <p>Coinbase is launching its first-ever branded credit card in partnership with American Express, set to roll out this fall. Called the Coinbase One Card, it will be available only to U.S. members of Coinbase One, the platform’s monthly subscription service. The card will offer 2% to 4% back in Bitcoin on everyday purchases, along with [&#8230;]</p> <p>"
    },
    {
      "title": "France’s The Blockchain Group Secures €9.7 Million More For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Frances-The-Blockchain-Group-Secures-E9.7-Million-More-For-Its-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Adam Back, TOBAM and Ludovic Chechin-Laurans back ALTBG with €9.7 million in equity and convertible bonds.</p> <p>"
    },
    {
      "title": "Bitcoin: How To Solve the Student Loan Crisis",
      "link": "https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/studentdebt.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis\" rel=\"nofollow\"> </a></p> <p>Students are already taking out mortgage-sized loans for college. The financial jiu-jitsu of pairing bitcoin with student loans can fix the student debt crisis.</p> <p>"
    },
    {
      "title": "Passport Prime: A New Security Device For a New Generation",
      "link": "https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Passport-Prime-A-New-Security-Device-For-a-New-Generation.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation\" rel=\"nofollow\"> </a></p> <p>Passport Prime from Foundation Devices gears up for a Q3 2025 release, offering NFC, 2FA, and a sleek design to boost Bitcoin security.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Meta Invests $14 Billion in Scale AI to ‘Deepen’ its Work on Superintelligence",
      "link": "https://decrypt.co/325031/meta-invests-14-billion-in-scale-ai-to-deepen-its-work-on-superintelligence",
      "summary": "The deal values data-labeling startup Scale AI at $29 billion, as Meta aims to catch up with rivals such as OpenAI and Google."
    },
    {
      "title": "Thai Police Arrest Chinese Suspect in $6.1 Million Bitcoin Fraud Case",
      "link": "https://decrypt.co/325028/thai-police-arrest-chinese-suspect-bitcoin-fraud-case",
      "summary": "Two Chinese victims lost their Bitcoin after a business meeting in Mae Sai district, transferring funds in two separate transactions."
    },
    {
      "title": "Coinbase Launches Bitcoin Rewards Card to Drive Subscriber Growth",
      "link": "https://decrypt.co/325025/coinbase-bitcoin-rewards-card-drive-subscriber-growth",
      "summary": "Coinbase has launched a Bitcoin rewards credit card, with possible plans to support multiple tokens over time, was told."
    },
    {
      "title": "Barbie, Hot Wheels Toy Maker to Use OpenAI Tech to Boost Productivity",
      "link": "https://decrypt.co/325022/barbie-hot-wheels-toy-maker-openai-tech-productivity",
      "summary": "Mattel will retain full control of its brands while using AI to develop new products, with the first launch expected later this year."
    },
    {
      "title": "Ripple, SEC Ask Court to Dissolve XRP Injunction, Release $125M in Escrow",
      "link": "https://decrypt.co/325015/ripple-sec-ask-court-to-dissolve-xrp-injunction-release-125m-in-escrow",
      "summary": "The joint filing proposes a $50 million payment to the SEC and marks a key step toward settling the years-long legal battle over XRP sales."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Amazon, Walmart, and Expedia consider issuing stablecoins to sidestep costly card fees: WSJ",
      "link": "https://cryptobriefing.com/retailers-embrace-stablecoins/",
      "summary": "<p>Retailers' stablecoin adoption could revolutionize payment systems, enhance cash flow, and challenge traditional financial networks.</p> <p>"
    },
    {
      "title": "Bitcoin slides, gold spikes after Israel strikes Iran, Israeli PM warns campaign will last as many days as needed",
      "link": "https://cryptobriefing.com/crypto-market-volatility-israel-iran/",
      "summary": "<p>Geopolitical tensions may drive investors to traditional safe-haven assets, impacting cryptocurrency markets and regional economic stability.</p> <p>"
    },
    {
      "title": "$USD1 stablecoin begins minting on TRON",
      "link": "https://cryptobriefing.com/usd1-stablecoin-minting-on-tron/",
      "summary": "<p>The minting of USD1 on TRON could enhance institutional trust and adoption, bolstering TRON's position in the global blockchain market.</p> <p>"
    },
    {
      "title": "Trump says Fed can raise rates if inflation returns, but warns Powell will be “too late for that too”",
      "link": "https://cryptobriefing.com/trump-fed-interest-rates-inflation/",
      "summary": "<p>Trump's remarks highlight ongoing tensions with the Fed, potentially impacting future monetary policy decisions and economic stability.</p> <p>"
    },
    {
      "title": "Circle brings USDC to Ripple’s network as XRP Ledger gears up for EVM-compatible sidechain this quarter",
      "link": "https://cryptobriefing.com/usdc-on-xrp-ledger-evm-sidechain/",
      "summary": "<p>The integration of USDC on XRPL and the upcoming EVM sidechain could significantly enhance XRPL's utility and attract diverse blockchain projects.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum’s sharp 15% fall: Is this a classic bull trap in play?",
      "link": "https://ambcrypto.com/ethereums-sharp-15-fall-is-this-a-classic-bull-trap-in-play/",
      "summary": "<img alt=\"Ethereum&#039;s sharp 15% fall: Is this a classic bull trap in play?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-5.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A bull trap wiped out Ethereum gains - Can support hold the line?"
    },
    {
      "title": "GameStop stock tanks amid news of $1.75B Bitcoin bet: ‘Insane!’",
      "link": "https://ambcrypto.com/gamestop-stock-tank-amid-news-of-1-75b-bitcoin-bet-insane/",
      "summary": "<img alt=\"GameStop shares tank 11.7% amid news of $1.75B Bitcoin bet: &#039;Insane!&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"723\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/GameStop-Announces-Proposed-Private-Offering.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1286\" />Is GameStop’s crypto pivot backfiring?"
    },
    {
      "title": "Top 9 presales to look out for in June 2025",
      "link": "https://ambcrypto.com/top-9-presales-to-look-out-for-in-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1469\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/john-mcarthur-ROQzKIAdY78-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A presale refers to an early sale of tokens before they are listed on public [&#8230;]"
    },
    {
      "title": "Bitcoin set for explosive growth as inflation cools – $200k in sight?",
      "link": "https://ambcrypto.com/bitcoin-set-for-explosive-growth-as-inflation-cools-200k-in-sight/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Inflation remains lower than expected, but Bitcoin continues to trend higher through the chaos."
    },
    {
      "title": "TRON: Despite recent volatility, TRX’s bullish trend remains",
      "link": "https://ambcrypto.com/tron-despite-recent-volatility-trxs-bullish-trend-remains/",
      "summary": "<img alt=\"TRON: Despite recent volatility, TRX&#039;s bullish trend remains\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/TRON-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A bullish phase was underway, but the swift retracement over the past couple of days could reset market sentiment."
    }
  ]
}