{
  "CoinDesk": [
    {
      "title": "Standard Chartered Says It’s the First Global Bank to Offer Spot Bitcoin, Ether Trading",
      "link": "https://www.coindesk.com/business/2025/07/15/standard-chartered-says-it-s-the-first-global-bank-to-offer-spot-bitcoin-and-ether-trading",
      "summary": ""
    },
    {
      "title": "Strategy Bears Cave In as Anti-MSTR Leveraged ETF Hits Rock Bottom",
      "link": "https://www.coindesk.com/markets/2025/07/15/strategy-bears-cave-in-as-anti-mstr-leveraged-etf-hits-rock-bottom",
      "summary": ""
    },
    {
      "title": "XRP Tumbles 8% as Token Sees Resistance at $3 Ahead of ProShares ETF Launch",
      "link": "https://www.coindesk.com/markets/2025/07/15/xrp-tumbles-8-as-token-sees-resistance-at-3-ahead-of-proshares-etf-launch",
      "summary": ""
    },
    {
      "title": "DOGE Plunges 10% Before Quick Recovery Rally on Institutional Volume Spike",
      "link": "https://www.coindesk.com/markets/2025/07/15/doge-plunges-10-before-quick-recovery-rally-on-institutional-volume-spike",
      "summary": ""
    },
    {
      "title": "Dogecoin Leads Losses Among Majors as Profit-Taking Grips Crypto Market",
      "link": "https://www.coindesk.com/markets/2025/07/15/dogecoin-leads-losses-among-majors-as-profit-taking-grips-crypto-market",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Standard Chartered launches Bitcoin and Ether trading for institutions",
      "link": "https://cointelegraph.com/news/standard-chartered-bitcoin-ether-trading-institutions?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5ODBjZjYtNmUzMi03ZDFhLWE0YjAtYjFiZjM5MTZmNzdm.jpg\" /></p><p>After rolling out Bitcoin and Ether spot trading, Standard Chartered plans to soon introduce crypto derivatives for institutional investors.</p>"
    },
    {
      "title": "Arcadia Finance exploited, $2.5M stolen and converted to WETH",
      "link": "https://cointelegraph.com/news/arcadia-finance-exploit-2-5m-crypto-theft?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5ODBjZjktYWUzNS03NzdkLWJiMGYtNjFhN2RkNmNiYzhl.jpg\" /></p><p>Arcadia Finance’s Rebalancer contract was exploited for $2.5 million in USDC and USDS on the Base blockchain, with stolen assets swapped to WETH.</p>"
    },
    {
      "title": "Can AI bots steal your crypto? The rise of digital thieves",
      "link": "https://cointelegraph.com/explained/can-ai-bots-steal-your-crypto-the-rise-of-digital-thieves?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9lZjE4MDdhOWI3MzUwY2ViZTc2ODc0MWVjNTc5ZGQ5MC5qcGc=.jpg\" /></p><p> Discover how AI bots exploit vulnerabilities, why traditional security measures are no longer enough, and what steps can keep your crypto safe. </p>"
    },
    {
      "title": "LA sheriff deputies admit to helping crypto ‘Godfather’ extort victims",
      "link": "https://cointelegraph.com/news/la-sheriff-deputies-admit-helping-crypto-extort-victims?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzRjYzUtNmZlOS03NDU4LWE5NjQtODEyMTUwZGNjZTFl.jpg\" /></p><p>The Justice Department says two LA Sheriff deputies admitted to helping extort victims, including for a local crypto mogul, while working their private security side hustles.</p>"
    },
    {
      "title": "Ethereum investors pile into ETH amid massive weekly surge",
      "link": "https://cointelegraph.com/news/ethereum-investors-pile-into-eth-amid-massive-weekly-surge?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzA2MWEtNGM1Ny03MWFjLTgxMmUtNjJjMmZhZTkyZjI2.jpg\" /></p><p>Ethereum treasury companies accumulated more than 545,000 ETH over the past month, while institutional funds saw the fourth-highest weekly inflow on record.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "The future of crypto payments: Why infrastructure, not hype, will define the next wave of the industry",
      "link": "https://cryptoslate.com/the-future-of-crypto-payments-why-infrastructure-not-hype-will-define-the-next-wave-of-the-industry/",
      "summary": "<p>The following article is a guest post and opinion of Mike Romanenko, CVO &#38; Co-founder of Kyrrex. The environment of crypto payments is shifting from speculative hysteria to underlying development. As the industry matures, a strong foundation in the form of business-to-business (B2B) payment infrastructure, user experience (UX), and regulation is materializing as crucial for [&#8230;]</p> <p>"
    },
    {
      "title": "Options gamma pin at $123k holds Bitcoin in a tight range after new ATH",
      "link": "https://cryptoslate.com/options-gamma-pin-at-123k-holds-bitcoin-in-a-tight-range-after-new-ath/",
      "summary": "<p>Bitcoin has set a new all-time high above $121,000, and the options market on Deribit is showing clear signs of hedging pressure and gamma-driven pinning around this level. Traders are in a market structured heavily in favor of upside exposure, with positioning and Greek profiles aligning at a delicate inflection point. Current open interest and [&#8230;]</p> <p>"
    },
    {
      "title": "PUMP debuts at $5.6B FDV, logs $34M volume within first 3 hours",
      "link": "https://cryptoslate.com/pump-debuts-at-5-6b-fdv-logs-34m-volume-within-first-3-hours/",
      "summary": "<p>Pump.fun’s PUMP token opened at a fully diluted valuation (FDV) of roughly $5.6 billion on July 14 and fell 7.3% within the first three hours of trading, according to DEX Screener data. The Solana-based coin changed hands at approximately $0.005128 at 20:30 UTC, implying a current FDV of nearly $5.12 billion, liquidity of $19.3 million, [&#8230;]</p> <p>"
    },
    {
      "title": "Retail accumulation absorbs fresh supply, propels Bitcoin to record highs",
      "link": "https://cryptoslate.com/retail-accumulation-absorbs-fresh-supply-propels-bitcoin-to-record-highs/",
      "summary": "<p>Retail investors buying long-term drove Bitcoin (BTC) out of its four-month channel between $100,000 and $110,000 to a new all-time high of $123,120, a 65% rebound from April’s tariff-panic low. According to the latest Bitfinex Alpha report, the move to heavy bidding from wallets holding fewer than 100 BTC, while long-term holder selling slowed. Grassroots [&#8230;]</p> <p>"
    },
    {
      "title": "OCC, Fed, FDIC publish joint guidance for banks offering crypto custody",
      "link": "https://cryptoslate.com/occ-fed-fdic-publish-joint-guidance-for-banks-offering-crypto-custody/",
      "summary": "<p>The Office of the Comptroller of the Currency (OCC), the Federal Reserve Board (Fed), and the Federal Deposit Insurance Corporation (FDIC) released a joint statement explaining how existing banking rules apply when institutions custody crypto for customers. The guidance describes “safekeeping” as the act of holding a digital asset on a client’s behalf and stresses [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Strategy Grabs Another $472M In Bitcoin—Even With Price At ATH",
      "link": "https://www.newsbtc.com/bitcoin-news/strategy-grabs-472m-in-bitcoin-even-with-price-ath/",
      "summary": "Bitcoin has been exploring new all-time highs (ATHs) recently, but Strategy still seems to be in accumulation mode as it has announced another large purchase. Strategy Has Bought 4,225 Bitcoin In Latest Acquisition As announced by Strategy Chairman Michael Saylor in an X post, the company has made a fresh Bitcoin acquisition, continuing its chain of 2025 buys. With the latest purchase, the firm has added 4,225 BTC to its holdings. According to the US Securities and Exchange Commission (SEC) filing, the buy occurred between July 7th and July 13th, and involved an average BTC cost basis of $111,827. This means the 4,225 tokens were acquired for about $472.5 million. Related Reading: Bitcoin Hits $123,000—But Inflows Are Just A Fraction Of 2024’s Peak In the same period as the acquisition, BTC witnessed a breakout to new ATHs. If the purchase is to go by, it seems Strategy is still interested in buying even at these high prices. &#8220;Short Bitcoin if you hate money,&#8221; said Saylor in an earlier X post. After the latest buy, the total holding of the firm has hit 601,550 BTC. The company spent around $42.87 billion to assemble this stack and today, its value stands at $72.25 billion, implying a significant profit of 68.5%. Earlier in the day, another Bitcoin treasury company added to its holdings: Metaplanet. According to the X post by CEO Simon Gerovich, the company has added 797 BTC to its reserve, taking the total to 16,352 BTC. Unlike Strategy, though, the firm&#8217;s average coin cost basis is on the higher side, standing at $100,191 right now. In some other news, while the big players in the market have been buying BTC for a while now, data from the on-chain analytics firm Glassnode suggests retail investors have finally joined in. In the chart, the data of the Accumulation Trend Score is shown for the different segments of the Bitcoin userbase. The &#8220;Accumulation Trend Score&#8221; is an indicator that tells us about whether the BTC investors are accumulating or distributing. From the graph, it&#8217;s visible that the score has recently been pretty close to 1 for the 1,000 to 10,000 BTC cohort. This means that these large hands, popularly known as the whales, have been showing a near-perfect accumulation trend. The latest rally in the cryptocurrency may be a product of this conviction. While the whales have been buying, the rest of the Bitcoin market has been showing behavior that tends more toward distribution. The mega whales, carrying more than 10,000 BTC, have remained in selling mode with an Accumulation Trend Score around 0.3. Related Reading: Bitcoin Breaks $118,000—But Liquidity Still Thin, Glassnode Warns Until recently, the hands with less than 1 BTC, the retail, were in a phase of distribution, but it seems the latest rally has caused them to change their tune, as they have started buying. BTC Price Bitcoin went up to $123,000 earlier, but it seems the asset has since seen a setback as its price is down to $119,900. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Top Crypto Exchanges Made $172 Million From TRUMP Memecoin Listing – Report",
      "link": "https://www.newsbtc.com/news/top-crypto-exchanges-made-172-million-from-trump-memecoin-listing-report/",
      "summary": "A recent report has found that US President Donald Trump’s official memecoin, TRUMP, had a faster listing process on crypto exchanges than the average memecoin and generated millions of dollars in gains for the platforms. Related Reading: Fibonacci Maps Dogecoin Path To $23—Is It Too Far-Fetched? Crypto Exchanges Profit From TRUMP Memecoin On Monday, news agency Reuters shared an analysis of market data and industry announcements related to the listing of the official TRUMP memecoin on some of the biggest crypto exchanges by market share. In January, President Trump surprised the crypto industry after launching his official token ahead of the start of his presidency. The cryptocurrency quickly skyrocketed to its all-time high (ATH) of $75, yielding significant profits for many early investors. However, the memecoin faced heavy backlash from the community, with several investors calling the President’s crypto venture a “big red flag.” Notably, 80% of the cryptocurrency’s supply was held by the Trump family and their partners, raising concerns over “such a high concentration of ownership”, which can allow the team behind it to “sell large amounts of it at once, collapsing the price for retail investors,” Reuters noted. The report claims that exchanges have been “major beneficiaries of Trump&#8217;s embrace of the industry,” as TRUMP has generated millions of dollars in revenue for the 10 largest exchanges reviewed by Reuters. Based on standard fee estimates compiled for the analysis, the crypto platforms allegedly made more than $172 million in trading fees since the token’s listing. Additionally, the token has “favored a small group of investors,” with 45 crypto wallets making around $1.2 billion in profits over the past six months. Nonetheless, as the token trades at 87.1% below its ATH, 712,777 wallets accumulate a collective loss of $4.3 billion, according to Bubblemaps data. Presidential Token Saw Express Listing Process According to the report, the largest exchanges, including Binance, Gate.io, Bitget, MEXC, OKX, Coinbase, Bybit, Upbit, Crypto.com, and HTX, listed Trump’s token “with unusual speed” compared to other recent prominent memecoins, despite the industry’s concerns. Reuters’ analysis showed that eight of the 10 largest crypto exchanges listed TRUMP within the first 48 hours since its launch. Coinbase listed the memecoin three days later, while Upbit added the token nearly a month later, on February 13. Meanwhile, the same 10 exchanges took significantly more to list Pepe (PEPE), Bonk (BONK), Fartcoin (FARTCOIN), and dogwifhat (WIF), the four other largest memecoins launched since 2022. Per the report, all 10 exchanges listed PEPE and BONK, while nine listed WIF, and only seven listed FARTCOIN. For comparison, all 10 exchanges took an average of 129 days to list these tokens, but only took an average of four days to list the presidential memecoin. Bitget, MEXC, and Coinbase reportedly said they listed the token quickly to “respond to overwhelming demand for the $TRUMP coin.” Gracy Chen, Bitget’s CEO, explained in a statement that “the crypto space was buzzing with the hype and, as any other token with a growing craze, it was imperative to add TRUMP.” Related Reading: Bitcoin Ignites Intraday Optimism With A Step Past $119,000 Threshold Chen told Reuters that Bitget also had concerns about the 80% supply figure but said the fact that the upcoming US president announced the coin on his social media accounts “should kind of solve the compliance issue.” &#8220;Ultimately, user trading volume, demand … overrode the so-called risky factor here,&#8221; Bidget CEO concluded. As of this writing, TRUMP trades at $9.43, a 2.6% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Solana (SOL) Pulls Back — Can Buyers Defend The $155 Line?",
      "link": "https://www.newsbtc.com/analysis/solana-sol-pulls-back-168/",
      "summary": "Solana started a fresh increase above the $160 zone. SOL price is now correcting gains and might find bids near the $155 support zone SOL price started a fresh upward move above the $155 and $160 levels against the US Dollar. The price is now trading below $162 and the 100-hourly simple moving average. There was a break below a key bullish trend line with support at $162 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could start a fresh increase if it clears the $162 resistance zone. Solana Price Corrects Gains Solana price started a decent increase after it cleared the $160 resistance, like Bitcoin and Ethereum. SOL climbed above the $162 level to enter a short-term positive zone. However, the price is facing a major hurdle at $168 and $169. A high is formed at $168.60 and the price is now correcting gains. There was a move below the 50% Fib retracement level of the upward move from the $158 swing low to the $168 high. Besides, there was a break below a key bullish trend line with support at $162 on the hourly chart of the SOL/USD pair. Solana is now trading below $162 and the 100-hourly simple moving average. It is also trading below the 76.4% Fib retracement level of the upward move from the $158 swing low to the $168 high. The price is now approaching the $158 support. On the upside, the price is facing resistance near the $160 level. The next major resistance is near the $162 level. The main resistance could be $1685. A successful close above the $168 resistance zone could set the pace for another steady increase. The next key resistance is $178. Any more gains might send the price toward the $185 level. More Losses in SOL? If SOL fails to rise above the $162 resistance, it could start another decline. Initial support on the downside is near the $158 zone. The first major support is near the $155 level. A break below the $155 level might send the price toward the $150 zone. If there is a close below the $150 support, the price could decline toward the $145 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $158 and $155. Major Resistance Levels – $162 and $168."
    },
    {
      "title": "Spot Volume Drop on Binance Preceded Bitcoin’s Price Surge, Data Shows",
      "link": "https://www.newsbtc.com/bitcoin-news/spot-volume-drop-on-binance-preceded-bitcoins-price-surge-data-shows/",
      "summary": "Bitcoin surged to a new all-time high above $123,000 earlier today after crossing the $120,000 threshold late Sunday night. The move has added more than 10% to its value over the past week, pushing the global cryptocurrency market valuation above $3.87 trillion, inching toward the $4 trillion mark. The current rally has reignited discussions around volume dynamics and accumulation patterns, as analysts monitor potential early signals that may influence near-term market behavior. Related Reading: Bitcoin To Reach $135,000 By September’s Close, Standard Chartered Forecasts Two contributors to CryptoQuant’s QuickTake platform, BorisVest and Darkfost, have highlighted technical patterns that emerged before and during Bitcoin’s latest breakout. Their analyses suggest a combination of shrinking spot volume and surging accumulation activity may have played a role in driving prices higher. These insights provide a more nuanced view of the forces behind Bitcoin’s recent surge, particularly at a time when market participants weigh upside potential against the possibility of volatility in uncharted price zones. Volume Drop on Binance Preceded Breakout, Analyst Says According to BorisVest, a notable collapse in spot trading volume on Binance preceded Bitcoin’s move out of the $100,000 to $110,000 consolidation range. In his post titled “Binance Spot Volume Collapsed Before Bitcoin’s Breakout: Was It a Hidden Squeeze Signal?”, he explained that declining spot volumes often represent quiet periods of either accumulation or distribution. Binance, due to its liquidity depth and user base, is seen as a reliable proxy for broader crypto market behavior. BorisVest noted that once the breakout began, trading volume spiked sharply. While such spikes can indicate local tops or bottoms, in this case, the surge in volume did not trigger a reversal but instead accelerated the rally. “That’s a strong signal. If the move had no real backing, we would have seen a fast pullback. Instead, Bitcoin kept pushing higher,” he wrote. He emphasized that volume acts as a roadmap for identifying zones of trade concentration and potential shifts in sentiment, cautioning that while Bitcoin’s recent move appears structurally strong, market participants should be aware of the risks tied to high volatility zones. Accumulator Addresses Hit 2025 High Amid Price Surge In a separate update, CryptoQuant analyst Darkfost observed that Bitcoin “accumulator addresses,” wallets with a history of only buying and not selling BTC, have collectively acquired roughly 248,000 BTC in 2025 so far. This is well above the monthly average of 164,000 BTC, pointing to intensified buying activity in recent weeks. “These addresses have no history of distribution and their continued activity at current price levels indicates long-term positioning,” he said. Darkfost also cautioned that if Bitcoin enters a correction or consolidation phase, some of these wallets could begin selling, which would disqualify them as accumulators and potentially introduce significant selling pressure. Related Reading: Who Flipped The Switch? Bitcoin STHs Accumulate While LTHs Take Profit At today’s prices, the accumulated 248,000 BTC are worth about $30 billion. For now, however, this cohort’s behavior reflects strong confidence in Bitcoin’s long-term trajectory, even as the asset trades at record highs. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "XRP Price Corrects After Strong Rally — Support Levels in Focus",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-corrects-after-rally-3-00/",
      "summary": "XRP price started a fresh increase and traded above the $3.00 zone. The price is now correcting gains and might test the $2.75 support zone. XRP price started a fresh increase above the $2.850 zone. The price is now trading above $2.80 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.820 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above the $2.750 zone. XRP Price Rallies Over 5% XRP price started a fresh increase after it settled above the $2.650 level, like Bitcoin and Ethereum. The price was able to climb above the $2.80 resistance level. The recent move was positive and the bulls pushed the price above the $3.00 level. A high was formed at $3.0324 and the price is now correcting gains. There was a move below the 50% Fib retracement level of the upward move from the $2.660 swing low to the $3.0324 high. The price is now trading above $2.80 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.820 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.920 level. The first major resistance is near the $2.950 level. A clear move above the $2.950 resistance might send the price toward the $3.020 resistance. Any more gains might send the price toward the $3.080 resistance or even $3.120 in the near term. The next major hurdle for the bulls might be near the $3.20 zone. More Downsides? If XRP fails to clear the $2.950 resistance zone, it could start another decline. Initial support on the downside is near the $2.820 level and the trend line zone. The next major support is near the $2.80 level and the 76.4% Fib retracement level of the upward move from the $2.660 swing low to the $3.0324 high. If there is a downside break and a close below the $2.80 level, the price might continue to decline toward the $2.750 support. The next major support sits near the $2.650 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.820 and $2.750. Major Resistance Levels – $2.950 and $3.020."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Tornado Cash Trial Begins with Discussions around Motions In Limine and Data Custodians",
      "link": "https://bitcoinmagazine.com/news/tornado-cash-trial-begins-with-discussions-around-motions-in-limine-and-data-custodians",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Tornado-Cash-Trial-SDNY.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/tornado-cash-trial-begins-with-discussions-around-motions-in-limine-and-data-custodians\" rel=\"nofollow\"> </a></p> <p>The judge addressed questions and requests from the defense regarding updated motions and the legitimacy of certain data that will be used as evidence in the case.</p> <p>"
    },
    {
      "title": "TD Cowen Raises Strategy Price Target to $680, Forecasts $155K Bitcoin by Year-End",
      "link": "https://bitcoinmagazine.com/news/td-cowen-raises-strategy-price-target-to-680-forecasts-155k-bitcoin-by-year-end",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/TD-Cowen-Raises-Strategy-Price-Target-to-680-Forecasts-155K-Bitcoin-by-Year-End.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/td-cowen-raises-strategy-price-target-to-680-forecasts-155k-bitcoin-by-year-end\" rel=\"nofollow\"> </a></p> <p>TD Cowen has raised its price target for Strategy’s stock from $590 to $680 per share, citing the company’s deepening role as a Bitcoin proxy and forecasting a potential surge in BTC prices to $155,000 by December.&#160; The research report from today sets a base-case target of $128,000 for Bitcoin by year-end, with a downside [&#8230;]</p> <p>"
    },
    {
      "title": "US Regulators Allow Banks Custody Over Bitcoin And Crypto",
      "link": "https://bitcoinmagazine.com/news/us-regulators-allow-banks-custody-over-bitcoin-and-crypto",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/US-Regulators-Allow-Banks-Custody-Over-Bitcoin-And-Crypto-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/us-regulators-allow-banks-custody-over-bitcoin-and-crypto\" rel=\"nofollow\"> </a></p> <p>The Federal Reserve, OCC, and FDIC warn banks that safekeeping bitcoin and other crypto-assets demands strong cybersecurity, operational expertise, and full legal compliance.</p> <p>"
    },
    {
      "title": "Make Bitcoin Mining Decentralized Again",
      "link": "https://bitcoinmagazine.com/business/make-bitcoin-mining-decentralized-again",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/BM-TN.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/make-bitcoin-mining-decentralized-again\" rel=\"nofollow\"> </a></p> <p>From Bitaxes to Heatbits, small and comfortable home mining equipment are retail’s new entry into Bitcoin.</p> <p>"
    },
    {
      "title": "Kazakhstan Considers Investing National Reserves in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/kazakhstan-considers-investing-national-reserves-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Kazakhstan-Considers-Investing-National-Reserves-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kazakhstan-considers-investing-national-reserves-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>The country’s central bank is exploring Bitcoin and crypto exposure for its sovereign wealth portfolios and advancing plans to create a Bitcoin reserve.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin Trading at Centre of High-Profile New Zealand Homicide Case",
      "link": "https://decrypt.co/330147/bitcoin-trading-high-profile-new-zealand-homicide-case",
      "summary": "Records show the New Zealand woman used fake crypto screenshots to convince her mother the investment had generated $160,000 profit."
    },
    {
      "title": "One LA Sheriff’s Deputy Charged, Another Pleads Guilty in Crypto ‘Godfather’ Case",
      "link": "https://decrypt.co/330144/sheriffs-deputy-charged-another-pleads-guilty-crypto-godfather-case",
      "summary": "The officers staged fake raids and used fraudulent warrants to track victims for \"The Godfather's\" criminal enterprise, prosecutors alleged."
    },
    {
      "title": "These Economic Forces Could Help Lift Bitcoin Higher",
      "link": "https://decrypt.co/330141/these-economic-forces-could-help-lift-bitcoin-higher",
      "summary": "Bitcoin’s record rally could receive another boost as the global bond crisis heats up with Japan’s 30Y yields hitting new highs."
    },
    {
      "title": "Rep. Maxine Waters Opines on Upcoming US Crypto Bills: 'I Told You So'",
      "link": "https://decrypt.co/330133/maxine-waters-upcoming-us-crypto-bills",
      "summary": "Rep. Maxine Waters has warned two pending crypto bills could gut consumer protections and hand more power to politically connected players."
    },
    {
      "title": "Grok Went MechaHitler and Elmo Said Hold My Beer",
      "link": "https://decrypt.co/330121/grok-mechahitler-elmo-hold-my-beer",
      "summary": "The incident follows a previous issue with Grok last week, which began responding with hate-filled speech to users on X."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "ProShares leveraged XRP ETF gets NYSE Arca clearance, prepares for trading debut",
      "link": "https://cryptobriefing.com/proshares-ultra-xrp-etf-listing/",
      "summary": "<p>The approval of ProShares' leveraged XRP ETF could boost investor interest in crypto derivatives, potentially increasing market volatility.</p> <p>"
    },
    {
      "title": "Wallet linked to Satoshi-era Bitcoin whale moves 9,000 BTC to Galaxy Digital",
      "link": "https://cryptobriefing.com/galaxy-digital-receives-4500-btc-from-dormant-80k-btc-whale/",
      "summary": "<p>The movement of dormant Bitcoin by a whale could impact market stability and spark renewed interest in cryptocurrency security and ownership.</p> <p>"
    },
    {
      "title": "Ripple CTO David Schwartz sees Bitcoin as the bedrock of the digital asset ecosystem",
      "link": "https://cryptobriefing.com/bitcoin-dominance-ripple-cto-insights/",
      "summary": "<p>Bitcoin's foundational role as a secure settlement layer may ensure its enduring relevance despite competition from advanced blockchains.</p> <p>"
    },
    {
      "title": "Federal Reserve clears US banks to custody crypto assets including Bitcoin",
      "link": "https://cryptobriefing.com/federal-reserve-approves-us-banks-custody-bitcoin-crypto/",
      "summary": "<p>US banks can now offer crypto custody services following new Federal Reserve guidance, opening doors for institutional adoption.</p> <p>"
    },
    {
      "title": "Pump.fun’s $PUMP token launches at $5.6B valuation",
      "link": "https://cryptobriefing.com/pump-token-launch-valuation/",
      "summary": "<p>PUMP went live today with listings across top exchanges including Bybit, KuCoin, MEXC, and Hyperliquid, marking pumpfuns official debut.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "$500M in XRP moved! – How whales could drive its next rally",
      "link": "https://ambcrypto.com/500m-in-xrp-moved-how-whales-could-drive-its-next-rally/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-14T163502.958-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whales vanish off-exchange, traders chase XRP on Coinbase. What's this split signal saying?"
    },
    {
      "title": "Satoshi Nakamoto’s $133B Bitcoin fortune makes him 11th richest person!",
      "link": "https://ambcrypto.com/satoshi-nakamotos-133b-bitcoin-fortune-makes-him-11th-richest-person/",
      "summary": "<img alt=\"Satoshi Nakamoto’s rise to #11 in the &#039;rich list&#039; - And, BTC might just be getting started!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250714_160142_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can Bitcoin sustain its rally beyond $121K with current institutional backing?"
    },
    {
      "title": "Bitcoin missing peak euphoria DESPITE new ATH past $122K – Reasons and details!",
      "link": "https://ambcrypto.com/bitcoin-missing-peak-euphoria-despite-new-ath-past-122k-reasons-and-details/",
      "summary": "<img alt=\"Bitcoin missing peak euphoria DESPITE new ATH past $122K - Reasons and details!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-Featured-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A few warning signs on Bitcoin's charts may be worth looking at."
    },
    {
      "title": "Is altcoin season here again after Bitcoin Dominance falls by 2%?",
      "link": "https://ambcrypto.com/is-altcoin-season-here-again-after-bitcoin-dominance-falls-by-2/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Altcoin-Season-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The altcoin market cap's breakout past the key resistance at $1.25 trillion hinted at bullish intent."
    },
    {
      "title": "Thanks to THIS macro signal, Bitcoin’s ATH case just got stronger!",
      "link": "https://ambcrypto.com/thanks-to-this-macro-signal-bitcoins-ath-case-just-got-stronger/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1069\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika1-1-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1900\" />Why Bitcoin’s rally is a macro signal, not a micro one."
    }
  ]
}