{
  "CoinDesk": [
    {
      "title": "Crypto Cracks Late in Day, Bitcoin Slumps Below $106K",
      "link": "https://www.coindesk.com/markets/2025/06/12/crypto-cracks-late-in-day-bitcoin-slumps-below-106k",
      "summary": ""
    },
    {
      "title": "Coinbase to Launch Bitcoin Rewards Card With Amex, While Eyeing U.S. Futures Expansion",
      "link": "https://www.coindesk.com/business/2025/06/12/coinbase-to-launch-bitcoin-rewards-card-with-amex-while-eyeing-us-futures-expansion",
      "summary": ""
    },
    {
      "title": "Shopify to Enable USDC Payments on Coinbase's Base for Merchants Worldwide",
      "link": "https://www.coindesk.com/business/2025/06/12/shopify-to-enable-usdc-payments-on-coinbase-s-base-for-merchants-worldwide",
      "summary": ""
    },
    {
      "title": "Bitcoin Will Rally as U.S. Growth Improves, Crypto Bills Progress: Coinbase Research",
      "link": "https://www.coindesk.com/markets/2025/06/12/bitcoin-will-rally-as-us-growth-improves-crypto-bills-progress-coinbase-research",
      "summary": ""
    },
    {
      "title": "DeFi Adding $5B of Solana Buying Power With New Line of Credit",
      "link": "https://www.coindesk.com/business/2025/06/12/defi-adding-5b-of-solana-buying-power-with-new-line-of-credit",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Tencent explores purchase of Nexon gaming company",
      "link": "https://cointelegraph.com/news/tencent-purchase-nexon-gaming-company?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY2MzAtMzYzMi03M2VkLTg5MGMtMjE5NDI5NmUzN2Mx.jpg\" /></p><p>Talks of a potential acquisition follow renewed interest in Nexon's massively multiplayer online role-playing game series MapleStory.</p>"
    },
    {
      "title": "Solana futures open interest hits $7.4B amid ETF speculation: Is $200 SOL next?",
      "link": "https://cointelegraph.com/news/solana-futures-open-interest-2-year-high-etf-rally?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY2MGUtOThmNy03M2IwLThlODItZWE5NTQxMzZlMTY1.jpg\" /></p><p>SOL’s futures open interest hits a 2-year high above $7.4 billion, but neutral funding and declining DEX activity cast doubt on a breakout to $200.</p>"
    },
    {
      "title": "Shift to digital asset technology won&#039;t be &#039;slow&#039; — Franklin Templeton CEO",
      "link": "https://cointelegraph.com/news/franklin-templeton-ceo-digital-asset-shift?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY1YmUtMGQwNy03NzRiLTg1MjQtM2JkYTNkMmI0NTJl.jpg\" /></p><p>In the world of traditional finance, sentiment has been shifting toward digital assets, with BlackRock, JPMorgan and Franklin Templeton making moves.</p>"
    },
    {
      "title": "Ex-Kamala Harris campaign adviser joins Coinbase advisory council",
      "link": "https://cointelegraph.com/news/david-plouffe-coinbase-advisory-council?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY1NjMtOWQ4OC03MjU5LTgyZDAtZmVhMjc4Zjg4ZTkx.jpg\" /></p><p>David Plouffe previously worked as an adviser for Alchemy Pay, Binance, former President Barack Obama's and former Vice President Kamala Harris’ presidential campaigns.</p>"
    },
    {
      "title": "Trump’s Big Beautiful Bill could trigger a US debt crisis and Bitcoin boom",
      "link": "https://cointelegraph.com/news/bitcoin-safe-haven-us-debt-crisis-big-beautiful-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTkyODUtZTZhZC03YWMzLTk0ZTMtZGJmODI2MjNiOTdj.jpg\" /></p><p>President Trump’s debt-heavy bill could speed up the devaluation of the US dollar. With higher inflation looming, Bitcoin may be one of the few real hedges left.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Shopify to enable USDC payments via Base across its Checkout ecosystem",
      "link": "https://cryptoslate.com/shopify-to-enable-usdc-payments-via-base-across-its-checkout-ecosystem/",
      "summary": "<p>Shopify is rolling out support for USDC payments, allowing consumers to pay with stablecoins via Shopify Payments and Shop Pay. The feature, developed in partnership with Coinbase and launching on the exchange&#8217;s Base blockchain, is available in early access starting this week and will expand to more merchants over the coming months. New payment rails [&#8230;]</p> <p>"
    },
    {
      "title": "BlackRock’s BUIDL nears $3B, registers 3x increase in less than 90 days",
      "link": "https://cryptoslate.com/blackrocks-buidl-nears-3b-registers-3x-increase-in-less-than-90-days/",
      "summary": "<p>BlackRock&#8217;s USD Institutional Digital Liquidity Fund (BUIDL) expanded by about $1 billion between March 26 and June 11, representing roughly half of the $2 billion growth of the tokenized US treasuries market in the period. According to rwa.xyz data, BUIDL&#8217;s size is $2.89 billion as of June 11. It is the largest tokenized money fund, [&#8230;]</p> <p>"
    },
    {
      "title": "Andreessen Horowitz champions blockchain integration for AI ownership and innovation",
      "link": "https://cryptoslate.com/andreessen-horowitz-champions-blockchain-integration-for-ai-ownership-and-innovation/",
      "summary": "<p>Andreessen Horowitz’s crypto arm a16z said blockchains could steer artificial intelligence toward user ownership and open standards, according to a June 11 report. The paper argued that core context and “agent passports” should reside in self-custodial wallets, providing any large-language-model interface with instant access to preferences without requiring repeated training. A chain-based identity layer would [&#8230;]</p> <p>"
    },
    {
      "title": "World’s largest financial clearinghouse DTCC eyeing stablecoin launch",
      "link": "https://cryptoslate.com/worlds-largest-financial-clearinghouse-dtcc-eyeing-stablecoin-launch/",
      "summary": "<p>The Depository Trust &#38; Clearing Corporation (DTCC), which handles the clearing and settlement of nearly all U.S. stock trades, is exploring the issuance of a U.S. dollar-backed stablecoin, The Information reported on June 12, citing sources familiar with the matter. According to the report, DTCC is in the early stages of evaluating whether to launch [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase to launch CFTC-cleared perpetual futures trading, Bitcoin-backed credit card for US customers",
      "link": "https://cryptoslate.com/coinbase-to-launch-cftc-cleared-perpetual-futures-trading-bitcoin-backed-credit-card-for-us-customers/",
      "summary": "<p>Coinbase announced a Bitcoin-backed credit card and CFTC-compliant perpetual futures for US customers. The exchange made the revelation during its annual State of Crypto Summit on June 12. Perpetual futures for US traders Max Branzburg, head of consumer and business products, said Coinbase will soon list perpetual futures contracts for domestic users under the Commodity [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Altcoin Season Just Flashed A Golden Cross Amid Crypto Market Recovery",
      "link": "https://www.newsbtc.com/altcoin/altcoin-season-golden-cross/",
      "summary": "Crypto analyst InvestingScope has drawn market participants’ attention to a major occurrence that hints at an imminent altcoin season. The analyst also revealed how high the crypto market could reach as altcoins outperform Bitcoin during this period. Altcoin Season May Be Imminent As Golden Cross Flashes In a TradingView post, InvestingScope revealed that altcoins have made a 1-day Golden Cross, the first since just right after the US elections. He noted that the rally that followed made new highs for these altcoins, indicating that another altcoin season may be on the horizon. The analyst also predicted that the total crypto market can reach at least $4.03 trillion on this rally. Related Reading: Positioning For Altcoin Season: Analyst Reveals When To Buy As Bitcoin Dominance Rises He noted that since the Bear Cycle bottom, this is the fourth 1-day Golden Cross and that the minimum the market has surged around such a formation was just over 73%. As such, the crypto market cap, currently valued at $3.39 trillion, can reach the $4 trillion target during this altcoin season rally. Altcoins have again rallied following the recent Bitcoin run close to its all-time high (ATH). The Ethereum price hit $2,900, coming close to the psychological $3,000 level. Additionally, the Solana price also hit $170, its highest level over the last 90 days. With two of the top major altcoins making these runs, this has further fueled optimism that altcoin season may be around the corner. Bloomberg analyst Eric Balchunas told investors to get ready for a potential Altcoin ETF summer with Solana likely leading the way. This development could be the catalyst that sparks the altcoin season, with the SEC already asking issuers to amend their S-1 filings. Meanwhile, the Ethereum ETFs just hit a four-month high of inflows, with $240 million flowing into these funds on June 11. These funds have also witnessed 18 consecutive days of inflows as optimism grows about the SEC approving staking for these funds. This could be another catalyst for altcoin season as the Ethereum price usually leads the way. ETH/BTC Breakout Is Imminent In an X post, market expert Paul Barron indicated that the ETH/BTC breakout was imminent, a development which would usher in the altcoin season. He declared that Altseason is preparing for a face-melter and that the ETH/BTC breakout is “committed”. The expert added that with market sentiment up 2.8%, ETH will be the leader. Related Reading: When Will Altcoin Season Begin After Bitcoin Price Hit ATH Above $111,000? Crypto analyst Mikybull Crypto has also made a case for Ethereum to lead the altcoin season. In a recent analysis, he stated that from a technical perspective, ETH is looking solid at its current levels. The analyst claimed that $2,800 is the next resistance to clear out before a rally to a new high of $3,900. He added that Ethereum usually performs well near the peak of the cycle. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Nasdaq Says Yes To Cardano: ADA Earns A Spot Among Crypto Giants",
      "link": "https://www.newsbtc.com/altcoin/nasdaq-says-yes-to-cardano-ada-earns-a-spot-among-crypto-giants/",
      "summary": "Cardano’s ADA has joined the Nasdaq Crypto Index, moving from the sidelines into the institutional spotlight. According to Nasdaq filings, this shift brings ADA alongside Bitcoin and Ethereum in one of the main benchmarks watched by big investors. It’s a sign that regulators and asset managers see Cardano as more than just another blockchain token. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Index Broadens To Nine Assets Based on reports from TapTools and Nasdaq’s Form 8-K, the index grew from five to nine assets. It now lists Bitcoin, Ethereum, Litecoin, Chainlink, Uniswap, and adds Cardano (ADA), Solana (SOL), Ripple (XRP), and Stellar (XLM). The change gives these newcomers a seat at the table. It also means more options for funds that track this benchmark. Cardano $ADA has officially been added to the Nasdaq Crypto Index, joining BTC and ETH in one of the industry’s top institutional benchmarks. It’s not just recognition— It’s infrastructure-level validation. Full breakdown 👇https://t.co/n6nW3aK8rt pic.twitter.com/KuyDXy4cem — TapTools (@TapTools) June 10, 2025 Impact On Weighting Of Bitcoin And Ethereum Previously, Bitcoin made up 85% of the index and Ethereum held 10%. With ADA and the other three in play, Bitcoin’s share falls to 75% and Ethereum’s to 11%. This shift lets portfolio managers spread risk across a broader set of tokens. It also lowers the concentration in the two biggest names in crypto. SEC approves NASDAQ Index that includes ADA Cardano pic.twitter.com/p7Rj5RVGQd — Cardano Feed ($ADA) (@CardanoFeed) June 11, 2025 ETF Holdings Await SEC Signoff Even though the index itself now includes all 9 assets, the US-listed Hashdex Nasdaq Crypto Index ETF still holds only Bitcoin and Ethereum. That won’t change until the SEC signs off on updates to the ETF’s rulebook. Based on the current timeline, that approval is expected in early 2026. Until then, US investors can track the wider index on paper, but their ETF shares will stick with the original two coins. Related Reading: TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin Cardano Gains Institutional Spotlight For Cardano, this is more than a trophy. It means added liquidity, better price support, and a clearer path into institutional portfolios. More cash in and out of ADA markets could narrow trading spreads and smooth out big swings. Trading platforms, custody services, and exchanges will feel the impact too. They’ll need to meet the index’s criteria—steady volume, regulated venues, and institutional-grade storage. Those checkpoints help keep major players comfortable when they decide to buy or sell ADA at scale. Overall, bringing ADA into this benchmark shows that big finance is watching Cardano more closely than before. Yet the final step—actual ETF inclusion in the US—still lies with regulators. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Ethereum Repeats History – Key Support Holds Again Ahead Of Potential Rally",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-repeats-history-key-support-holds-again-ahead-of-potential-rally/",
      "summary": "Ethereum is at a critical juncture after breaking above key resistance but failing to sustain momentum toward the psychological $3,000 level. The recent surge brought optimism to the market, yet ETH has now pulled back slightly, struggling to extend gains as global uncertainty weighs on sentiment. With macro pressures mounting and negotiations between the US and China over a potential trade deal in focus, the broader market appears to be awaiting clarity before making its next decisive move. Related Reading: Solana Forms Higher Low: Charging Toward Range Highs? Top analyst Rekt Capital offered historical context to Ethereum’s current setup, pointing to two previous cycles where ETH successfully retested the $2,500 level before launching toward $4,000. In August 2021 and again in early 2024, ETH held $2,500 as strong support (green circles), acting as the foundation for a major breakout rally. This repeating pattern has investors now eyeing the same level with growing interest. As Ethereum trades near $2,750–$2,800, the coming days could determine whether this current setup mirrors past bullish cycles—or if momentum fades again. With strong support beneath and a clear historical roadmap above, ETH’s ability to reclaim strength could trigger the next leg in what many believe may be the start of altseason. Ethereum Echoes Past Patterns Ahead Of Potential Breakout Ethereum has rallied over 100% since its April lows, showcasing powerful momentum and heightened activity at current levels. After briefly tapping a local high near $2,830, ETH has retraced slightly but remains firmly above the $2,750 mark—a key area that now acts as short-term support. The strength of this rebound is fueling growing speculation that Ethereum may not only be preparing for another leg up but also setting the tone for a broader altseason. Analysts across the board are closely watching ETH’s current consolidation, with many citing historical patterns as a reason for optimism. Notably, Rekt Capital highlighted a recurring pattern that has previously led to significant rallies. In August 2021, Ethereum successfully retested the $2,500 level as support before surging to approximately $4,000. The same thing occurred in early 2024, when ETH once again bounced from $2,500 and rallied to the same zone. Now, for the past five weeks, Ethereum has repeatedly confirmed the $2,500 level as solid support, forming what appears to be a textbook foundation for another major move. This accumulation phase—mirroring past cycles—has many traders confident that ETH could soon reclaim $3,000 and begin leading altcoins higher. With macro conditions still uncertain and market participants looking for signals of strength, Ethereum’s behavior at these levels carries added significance. If ETH can maintain its position above $2,750 and build momentum through $2,830, the market could see an explosive shift in sentiment, potentially triggering the next phase of the bull cycle. For now, all eyes remain on Ethereum as it tests the top of its multi-week range with bullish conviction. Related Reading: Ethereum Price Tests Ascending Channel Resistance – Breakout Or Breakdown? ETH Holds Above Breakout Zone After $2,830 Rejection Ethereum is currently trading at $2,749 on the 4-hour chart, holding above a key breakout zone between $2,700 and $2,740 following a brief rejection at $2,830. After breaking above this multi-week resistance last week, ETH surged into higher territory before pulling back in the last few sessions. Despite this retrace, the price has so far maintained support above the previous resistance area, now acting as a strong demand zone. This range—highlighted by the yellow box on the chart—served as a ceiling for nearly a month before being flipped into support during the breakout. Ethereum is now consolidating right above this area, and as long as it remains above the 50 and 100 simple moving averages (SMAs), the bullish structure is intact. Volume has started to cool off slightly, suggesting that traders are waiting for a decisive move—either a bounce toward $2,800–$2,900 or a breakdown back below $2,700. Related Reading: Ethereum Still Rangebound Below $2,735 Level – No Clear Breakout Yet A successful hold of this support zone could confirm the retest and build momentum for another breakout attempt. However, failure to hold $2,700 could see ETH revisit the 200 SMA around $2,570. For now, Ethereum remains technically strong, but traders are watching closely for confirmation. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Crypto Expert Puts Ethereum Price At $19,500 With Head And Shoulders Emergence",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-19500-with-hs-pattern/",
      "summary": "Ethereum reclaimed a significant technical level in the latest 24-hour trading session, with its price crossing above the $2,800 mark and briefly touching $2,870. This interesting cross makes it the first time since February 2025 that Ethereum has traded above the $2,800 threshold. The move comes amid rising bullish momentum flowing out from Bitcoin, and according to recent analysis from a crypto expert, this could be just the beginning of a much larger rally for Ethereum. Technical Pattern Says Ethereum Could Be Close To $20,000 An interesting technical formation on Ethereum has now caught the attention of some traders: a classic inverse Head and Shoulders bottom. According to crypto expert Gert van Lagen, who shared his analysis on the social media platform X, this inverse head and shoulders is setting up on a long-term timeframe. Related Reading: Ethereum Price Eyes 38% Jump To $3,500 As 50EMA Swims Into View Specifically, Ethereum&#8217;s two-week candlestick chart, shared by the analyst, reveals a fully formed structure with a left shoulder in mid-2021, a pronounced head that took shape during the bear market in late 2022 to early 2023, and a right shoulder forming throughout the 2024 correction into early 2025. The left shoulder emerged in mid-2021, when Ethereum’s price peaked around $4,870, then retraced into the year-end. The head was formed at the lows around $1,350 in 2022 and 2023. The right shoulder is currently in formation after the Ethereum price rebounded from roughly $1,600 in 2025. Finally, this pattern is also highlighted by a symmetry around the neckline drawn near the $4,200 price region. Keeping this in mind, the neckline of the pattern, which is anchored just below the $4,200 resistance level, is now the most important level to break above. A confirmed breakout above this zone could activate the full bullish target projected by the technical formation. ETH Price Close To $20,000 According to Gert van Lagen, the two-week head-and-shoulders pattern suggests Ethereum may be “closer to $20K than most anticipate.” His price target calculation follows a classic technical methodology. By measuring the vertical distance from the head’s lowest point to the neckline resistance and then projecting that same distance upward from the neckline, he arrives at a target of approximately $19,500, which is more than a 600% gain from today’s price levels. Related Reading: Pundit Says Do Not Ignore Ethereum Amid New All-Time Highs In Major Metric In the same analysis, van Lagen also highlighted a descending broadening wedge pattern that has been forming since mid-2023. This secondary structure reinforces the notion that Ethereum may embark on a significantly larger breakout once $4,200 is cleared. However, this projection of $19,500 is based on the technical symmetry of the inverse head and shoulders pattern, rather than fundamental shifts in Ethereum. Additionally, there is no clear timeline for this target; however, based on the multi-year nature of the inverse head and shoulders pattern, the price target may also take up to four years to materialize. At the time of writing, Ethereum is trading at $2,772, having retraced slightly from $2,870. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Solana-Linked $1 Billion DeFi Dream Crushed By SEC Intervention",
      "link": "https://www.newsbtc.com/altcoin/solana-linked-1-billion-defi-dream-crushed-by-sec-intervention/",
      "summary": "DeFi Development Corp. hit a major roadblock this week when the US Securities and Exchange Commission blocked its $1 billion registration filing. The move came after regulators found that the company’s Form S-3 lacked a key internal controls report tied to its 10-K. As a result, DeFi Development—formerly known as Janover—pulled the filing and said it will fix the paperwork before trying again. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Missing Controls Report According to the SEC, the registration was ineligible because it did not include the required internal controls over financial reporting. That report is a must for any firm raising capital through public offerings. Without it, the commission won’t even consider your request. DeFi Development filed in late April 2025 but overlooked this step, a basic requirement in US securities law. DeFi Development (formerly Janover) has withdrawn its $1 billion Form S-3 registration after the SEC deemed it ineligible due to missing a required internal controls report in its Form 10-K. No securities were issued, and part of the proceeds had been intended for purchasing… — Wu Blockchain (@WuBlockchain) June 11, 2025 Plan To Buy Solana Based on reports, the company aimed to use the funds to buy Solana tokens. Solana ranks as the sixth-largest cryptocurrency by market cap. The filing showed some of the $1 billion would go toward staking rewards and token purchases. Staking can earn regular returns, but only if SOL holds or gains value. Putting such a large stake into one chain carries risks if market prices dip. Withdrawal And Next Steps DeFi Development confirmed that no securities were issued during this process. It said it plans to refile once the controls report is in place. A quick resubmission—perhaps within 30 or 45 days—would signal they were almost ready. Investors will watch whether the company brings in an experienced underwriter or auditor to prevent another slip. Related Reading: TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin Market Reaction Some traders had hoped the influx of a billion dollars in Solana tokens would boost the price. Now that the filing is on hold, those bets may stall. Markets often react when big purchases are delayed. Based on trading patterns, any sudden buy order of hundreds of millions in SOL could swing prices up or down. What Comes Next DeFi Development’s experience highlights that crypto firms must meet the same rules as any other public issuer. Skipping standard checks can derail even the boldest plans. The company’s next move will show how well it can balance its blockchain ambitions with straightforward regulatory steps. For now, the token-buy plan waits in limbo, and everyone from investors to developers will be watching the next filing. Featured image from Reuters, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Will Replace Gold And Go To $1,000,000, Says Galaxy Digital CEO Mike Novogratz",
      "link": "https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Will-Replace-Gold-And-Go-To-1000000-Says-Galaxy-Digital-CEO-Mike-Novogratz.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz\" rel=\"nofollow\"> </a></p> <p>Mike Novogratz, in an interview with CNBC, said “there have been more Bitcoins lost than will be mined for the rest of eternity.\"</p> <p>"
    },
    {
      "title": "Coinbase Announces Bitcoin Rewards Credit Card, Offering up to 4% BTC Back on Everything",
      "link": "https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-BTC-Credit-Card.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything\" rel=\"nofollow\"> </a></p> <p>Coinbase is launching its first-ever branded credit card in partnership with American Express, set to roll out this fall. Called the Coinbase One Card, it will be available only to U.S. members of Coinbase One, the platform’s monthly subscription service. The card will offer 2% to 4% back in Bitcoin on everyday purchases, along with [&#8230;]</p> <p>"
    },
    {
      "title": "France’s The Blockchain Group Secures €9.7 Million More For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Frances-The-Blockchain-Group-Secures-E9.7-Million-More-For-Its-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Adam Back, TOBAM and Ludovic Chechin-Laurans back ALTBG with €9.7 million in equity and convertible bonds.</p> <p>"
    },
    {
      "title": "Bitcoin: How To Solve the Student Loan Crisis",
      "link": "https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/studentdebt.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis\" rel=\"nofollow\"> </a></p> <p>Students are already taking out mortgage-sized loans for college. The financial jiu-jitsu of pairing bitcoin with student loans can fix the student debt crisis.</p> <p>"
    },
    {
      "title": "Passport Prime: A New Security Device For a New Generation",
      "link": "https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Passport-Prime-A-New-Security-Device-For-a-New-Generation.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation\" rel=\"nofollow\"> </a></p> <p>Passport Prime from Foundation Devices gears up for a Q3 2025 release, offering NFC, 2FA, and a sleek design to boost Bitcoin security.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Ethereum Treasury Company SharpLink Gaming Plunges 70% Amid SEC Filing Confusion",
      "link": "https://decrypt.co/324932/ethereum-treasury-company-sharplink-gaming-plunges-70-sec-confusion",
      "summary": "Following a recent surge fueled by its embrace of Ethereum, SharpLink Gaming's stock price plummeted late Thursday."
    },
    {
      "title": "Shopify to Roll Out USDC Stablecoin Payments on Base in Coinbase Team-Up",
      "link": "https://decrypt.co/324930/shopify-roll-out-usdc-stablecoin-payments-on-base-coinbase-team-up",
      "summary": "Customers buying from Shopify merchants will be able to use the USDC stablecoin thanks to a collaboration with Coinbase and Stripe."
    },
    {
      "title": "Another Public Company Goes Hard on XRP With $500 Million Treasury Plan",
      "link": "https://decrypt.co/324927/public-company-goes-hard-xrp-with-500-million-treasury",
      "summary": "Singapore-based Trident is bucking the Bitcoin reserve trend, instead embracing the Ripple-linked XRP for its treasury."
    },
    {
      "title": "Crypto Longs Get Rekt as Bitcoin, Ethereum and Dogecoin Dive",
      "link": "https://decrypt.co/324931/crypto-longs-get-rekt-bitcoin-ethereum-dogecoin-dive",
      "summary": "Long position liquidations are rapidly piling up as Bitcoin, Ethereum, Dogecoin, and Solana losses accelerate Thursday."
    },
    {
      "title": "'FIFA Rivals' Launches—Why Mythical Games Thinks It'll Hit Bigger Than 'NFL Rivals'",
      "link": "https://decrypt.co/324868/fifa-rivals-launches-why-mythical-games-hit-bigger-nfl",
      "summary": "Mobile soccer game FIFA Rivals launched on Thursday, pairing the \"beautiful game\" with blockchain on iOS and Android."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump says Fed can raise rates if inflation returns, but warns Powell will be “too late for that too”",
      "link": "https://cryptobriefing.com/trump-fed-interest-rates-inflation/",
      "summary": "<p>Trump's remarks highlight ongoing tensions with the Fed, potentially impacting future monetary policy decisions and economic stability.</p> <p>"
    },
    {
      "title": "Circle brings USDC to Ripple’s network as XRP Ledger gears up for EVM-compatible sidechain this quarter",
      "link": "https://cryptobriefing.com/usdc-on-xrp-ledger-evm-sidechain/",
      "summary": "<p>The integration of USDC on XRPL and the upcoming EVM sidechain could significantly enhance XRPL's utility and attract diverse blockchain projects.</p> <p>"
    },
    {
      "title": "BlackRock targets to become world’s largest crypto asset manager by 2030",
      "link": "https://cryptobriefing.com/blackrock-crypto-asset-management/",
      "summary": "<p>BlackRock's crypto ambitions could reshape global financial markets, influencing regulatory landscapes and accelerating digital asset adoption.</p> <p>"
    },
    {
      "title": "Why is Bitcoin down today? US-China trade deal fails to impress, Israel-Iran conflict threat rises",
      "link": "https://cryptobriefing.com/bitcoin-down-us-china-trade-tensions/",
      "summary": "<p>Geopolitical tensions and unimpressive trade deals highlight Bitcoin's vulnerability to global instability, affecting its market resilience.</p> <p>"
    },
    {
      "title": "Fintech giant Stripe to acquire crypto wallet provider Privy following $1.1B stablecoin deal",
      "link": "https://cryptobriefing.com/stripe-acquires-privy-enhancing-services/",
      "summary": "<p>Stripe's acquisition of Privy signals a significant step towards enhancing global digital financial infrastructure and streamlining crypto adoption.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum whales buy back at higher prices – Is it conviction or FOMO?",
      "link": "https://ambcrypto.com/ethereum-whales-buy-back-at-higher-prices-is-it-conviction-or-fomo/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-17.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum whale purchase 16,500 ETH worth $46.4 million as 140k ETH worth $393 million leave exchanges"
    },
    {
      "title": "Bitrue hacker buys Ethereum as ETH sees $393 mln outflow: Bullish signs?",
      "link": "https://ambcrypto.com/bitrue-hacker-buys-ethereum-as-eth-sees-393-mln-outflow-bullish-signs/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-3-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The Bitrue hacker's purchase of ETH, coupled with rising OI, could be signs of renewed bullishness."
    },
    {
      "title": "BTC on the brink: Vanishing supply signals volatility storm",
      "link": "https://ambcrypto.com/btc-on-the-brink-vanishing-supply-signals-volatility-storm/",
      "summary": "<img alt=\"Bitcoin supply\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-supply-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will the global liquidity surge and BTC's 30% supply decline trigger an explosive run?"
    },
    {
      "title": "Raydium drops 10% in 24 hours as shorts take the lead: More losses ahead?",
      "link": "https://ambcrypto.com/raydium-drops-10-in-24-hours-as-shorts-take-the-lead-more-losses-ahead/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250612_111510_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />RAY’s ongoing downtrend shows clear signs of deepening in the near term."
    },
    {
      "title": "Shiba Inu: THESE are SHIB’s key levels after 103K% spike in burn rate",
      "link": "https://ambcrypto.com/shiba-inu-these-are-shibs-key-levels-after-103k-spike-in-burn-rate/",
      "summary": "<img alt=\"SHIB\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-12T152222.519-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SHIB burn spikes and whale accumulation hint at a breakout above descending channel resistance."
    }
  ]
}