{
  "CoinDesk": [
    {
      "title": "ATOM Rebounds From 5% Drop as Buyer Demand Defends Key Support Level",
      "link": "https://www.coindesk.com/markets/2025/06/06/atom-rebounds-from-5-drop-as-buyers-defend-key-support-level",
      "summary": ""
    },
    {
      "title": "Metaplanet to Raise $5.3B, Japan’s Largest Stock Warrant Deal, to Grow Bitcoin Stash",
      "link": "https://www.coindesk.com/markets/2025/06/06/metaplanet-to-raise-53b-japans-largest-stock-warrant-deal-to-grow-bitcoin-stash",
      "summary": ""
    },
    {
      "title": "SOL Recovers to $147 After Flash Crash Shakes Out Weak Hands",
      "link": "https://www.coindesk.com/markets/2025/06/06/sol-recovers-to-usd147-after-flash-crash-shakes-out-weak-hands",
      "summary": ""
    },
    {
      "title": "Yuga Labs Proposes Scrapping ApeCoin DAO, Launching ApeCo",
      "link": "https://www.coindesk.com/markets/2025/06/06/yuga-labs-proposes-scrapping-apecoin-dao-launching-apeco",
      "summary": ""
    },
    {
      "title": "Elon Musk Joins Bitcoin Maxis in Warning of ‘Potential’ U.S. Fiscal Collapse or Are We There Already?",
      "link": "https://www.coindesk.com/markets/2025/06/06/elon-musk-joins-bitcoin-maxis-in-warning-of-potential-us-fiscal-collapse-or-are-we-there-already",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Why is the crypto market down today?",
      "link": "https://cointelegraph.com/news/why-is-the-crypto-market-down-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvODAzMjgxMmQtMWQ1MC00NmFiLWI5NjUtYTBjYjZkZDQxYTYz.jpg\" /></p><p>The cryptocurrency market is down on June 6 due to the intensifying Trump-Musk feud, significant long liquidations, and a weak technical structure.</p>"
    },
    {
      "title": "Bitcoin gets sub-$100K price targets with RSI ’a week away’ from new lows",
      "link": "https://cointelegraph.com/news/bitcoin-gets-sub-100k-price-targets-rsi-week-away-from-new-lows?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ0NDYtYmZhZS03OTZiLWExNjAtOTdhNjljNmY5MjM4.jpg\" /></p><p>Bitcoin price expectations fall in line with a new retest of $100,000 support. Traders see news lows with RSI heading still lower.</p>"
    },
    {
      "title": "Bitcoin ETFs bleed on Trump-Musk fallout as sentiment turns to fear",
      "link": "https://cointelegraph.com/news/bitcoin-etf-bleed-trump-musk-fallout-sentiment-fear?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5NDE2YWQtNTRmOC03NTA3LWE0NzktNGVjNDgxZjUxMDZm.jpg\" /></p><p>While Bitcoin ETFs flipped to $278 million of outflows amid the Trump-Musk feud, Ether ETFs saw inflows, continuing a 14-day streak.</p>"
    },
    {
      "title": "Yuga Labs looks to replace ‘unserious’ ApeCoin DAO with new ApeCo entity",
      "link": "https://cointelegraph.com/news/yuga-labs-aims-to-replace-apecoin-dao-with-apeco?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ0MGEtODVkMi03ZDJjLTkyMjAtODdkMWI3ZWIwODQ3.jpg\" /></p><p>Yuga Labs CEO Greg Solano said the DAO became a slow, noisy, unserious governance theater.</p>"
    },
    {
      "title": "Crypto lobby wants software dev protections added to crypto bill",
      "link": "https://cointelegraph.com/news/crypto-lobby-software-dev-protections-added-to-crypto-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzQ5MGMtYTkwZC03YTBkLTk5NWEtOTM2MDBjNzU3Nzgx.jpg\" /></p><p>A group of crypto advocacy groups have urged lawmakers to include a bill protecting software devs from being labelled as money transmitters included in a crypto market structure bill.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Aave DAO activates on-chain slashing mechanism with ‘Umbrella’ launch",
      "link": "https://cryptoslate.com/aave-dao-activates-on-chain-slashing-mechanism-with-umbrella-launch/",
      "summary": "<p>Aave has launched Umbrella, a fully on-chain staking-based risk management system designed to replace its legacy Safety Module with a more automated and capital-efficient framework. Built by BGD Labs and ratified by Aave governance, Umbrella allows users to stake interest-bearing aTokens, such as aUSDC, aWETH, and GHO, to provide real-time, automated coverage for bad debt [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum, XRP, Dogecoin, Solana hit by $384 million in largest liquidation day since February",
      "link": "https://cryptoslate.com/insights/ethereum-xrp-dogecoin-solana-hit-by-384-million-in-largest-liquidation-day-since-february/",
      "summary": "<p>In the past 24 hours, crypto markets witnessed a massive liquidation wave totaling $979.72 million, with long positions overwhelmingly impacted. The day closed out as the largest liquidation event since February, when nearly $3 billion in both longs and shorts were liquidated within 48 hours. Here&#8217;s how it breaks down: Longs Liquidated: $873.05M (≈89.12%) Shorts [&#8230;]</p> <p>"
    },
    {
      "title": "Nearly $1 billion liquidated as Bitcoin recovers from $100k dip during Elon Musk, Donald Trump breakup",
      "link": "https://cryptoslate.com/nearly-1-billion-liquidated-as-bitcoin-recovers-from-100k-dip-during-elon-musk-donald-trump-breakup/",
      "summary": "<p>Bitcoin briefly dipped to $100,000 before swiftly rebounding to $103,000 in early trading hours Friday, as markets reacted to an explosive social media fallout between U.S. President Donald Trump and Tesla CEO Elon Musk. The confrontation, unfolding in real time across Truth Social and X, was marked by Trump’s threat to revoke federal contracts and [&#8230;]</p> <p>"
    },
    {
      "title": "Profit-taking, not capitulation: institutions cut Bitcoin ETF exposure by 23% in Q1",
      "link": "https://cryptoslate.com/profit-taking-not-capitulation-institutions-cut-bitcoin-etf-exposure-by-23-in-q1/",
      "summary": "<p>Institutional investors cut Bitcoin (BTC) allocations in US-based spot exchange-traded funds (ETFs) during the first quarter after hedging profits waned and futures premiums compressed, a June 5 CoinShares report showed. The report assessed 13-F filings from asset managers with at least $100 million in assets under management. These investors reported $21.2 billion in Bitcoin ETF [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin bulls must guard key $95.6k support as veteran holders cash in on gains",
      "link": "https://cryptoslate.com/bitcoin-bulls-must-guard-key-95-6k-support-as-veteran-holders-cash-in-on-gains/",
      "summary": "<p>Bitcoin (BTC) is suffering pressure from veteran holders securing gains and must hold the key $95,600 support level to remain bullish if it breaks below six-figures, according to a June 5 report by Glassnode. The report highlighted that after breaking below $103,700, the next major level of support is the psychological price level of $100,000 [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "As Lagrange Crypto Token $LA Surges, Climbing 500%, Will Solaxy See Bigger Gains?",
      "link": "https://www.newsbtc.com/news/lagrange-crypto-la-surges-500-solaxy-next-5x-token/",
      "summary": "Thousands of tokens launch every day. Most crash quickly, becoming worthless in time (or all but worthless). So why do people keep investing? Because every now and then, a Lagrange ($LA) comes along. The utility token for the Lagrange Foundation, which aims to support a verifiable AI ecosystem, $LA climbed 560%+ in a few hours after securing listings across major exchanges. The move pushed the token’s market cap over $287M. What went right for $LA, and what does it say about other upcoming projects? Stars Aligned for $LA Launch Lagrange had a few things going for it: Foundational ecosystem: $LA fuels the base layer for an ambitious but detailed technical project (the ZK Prover Network). Strong early interest: Lagrange attracted major early development from the likes of Peter Thiel’s Founders Fund, which provided $13.2M in seed funding. Detailed project design: Tokenomics, fee generation, staking – Lagrange clearly defined how each element worked in the $LA ecosystem. Broad DEX/CEX listing: After the TGE (Token Generation Event), $LA went live on a number of major exchanges, including Coinbase, KuCoin, Bitget, and more. It was a combination of factors, rather than any one thing, that helped push the project up. Crucially, investors seem confident in the long-term outlook for the Lagrange Foundation. When some investors took profits off the initial surge, causing the token to dip, others bought the dip, pushing $LA back up. No two crypto projects are identical, and this goes for their future potential, as well. But we can take some of the basic principles from $LA’s success and apply them to other projects to get a better idea of their chances. And one project – Solaxy ($SOLX) – shows promising similarities to $LA. Solaxy ($SOLX) – Meme-Focused Multichain Token for Groundbreaking Solana Layer-2 Solaxy ($SOLX) might seem like your average Solana meme coin, at least at first glance. But under the surface, Solaxy isn’t just a meme coin – it’s the foundation of the first ever Solana Layer-2, designed to be the foundation of a whole generation of faster-than-ever Solana tokens. It might even become one of the best meme coins in 2025 and beyond. A closer look at the project shows how $SOLX and $LA share some critical features: $LA raised $13.2M in seed funding; $SOLX raised $44.5M in its crypto presale (set to end in 10 days). $LA provided detailed information about technical developments; $SOLX has already launched the Solaxy block explorer and bridge, with full operational status in June 2025. $LA serves to support key ZK products and features; $SOLX offers a blazing-fast blockchain to add to the $56B meme coin market Both $LA and $SOLX are multi-chain tokens; $LA supports Ethereum, Base, Arbitrum, Solana, Optimism, and Polygon, and $SOLX supports Solana and Ethereum Solaxy is working fast, rolling out key features in the techmap to push full deployment of the Layer-2 as soon as possible. There’s only ten days left for investors to get in during the presale. If $SOLX imitates $LA’s climb, this is the lowest the price will ever be, so learn how to buy Solaxy with our guide, and don&#8217;t delay. The current token price is $0.001746. Our price prediction shows that it could climb to $0.032 by the end of the year, passing even $LA&#8217;s success and delivering 1,735% returns to investors who get in now. Visit the Solaxy presale page. Factors for $LA’s Success Bode Well for $SOLX That 500% price increase was pretty sweet for early Lagrange investors, and who knows how far the $LA token will go? Some of the same factors that contributed to $LA’s big wins look promising for $SOLX as well. Will it be the next 5x token? Never invest in anything without doing your own research; this is not financial advice."
    },
    {
      "title": "Bitcoin RSI Dips Below 30—Is A New All-Time High Next?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-rsi-dips-below-30-new-all-time-high-next/",
      "summary": "Data shows the 14-day Bitcoin Relative Strength Index (RSI) has dropped into the oversold region. Here&#8217;s what this could mean for the asset. Bitcoin RSI Has Breached Below The 30 Mark In a new post on X, analyst Axel Adler Jr has talked about the latest trend in the RSI of Bitcoin. The &#8220;RSI&#8221; refers to an indicator from technical analysis (TA) that measures the speed and magnitude of changes occurring in any given asset&#8217;s price over a specific period. In the current case, the period is 14 days. This metric is generally used for spotting oversold or overbought conditions for the asset. When the RSI is greater than 70, it can be a sign that the price is heating up and may be due a correction to the downside. On the other hand, it being under 30 can imply the asset is becoming underbought. Related Reading: Solana’s Old Hands Are Moving—Is Trouble Brewing? Now, here is the chart shared by the analyst that shows the trend in the 14-day Bitcoin RSI over the last couple of years: As displayed in the above graph, the 14-day Bitcoin RSI has plummeted recently and is now below the 30 threshold. This naturally suggests the cryptocurrency is becoming oversold, at least from the perspective of this indicator. &#8220;Other metrics are also showing alerts,&#8221; notes Adler Jr. &#8220;I think now all conditions are in place to start testing the ATH.&#8221; Though, while bullish developments may have occurred on the RSI and other indicators, BTC has actually declined during the past day. On-chain data may provide hints about where the next potential support zone could be located for the asset. As the analytics firm Glassnode has revealed in its latest weekly report, the average cost basis of the short-term holders is located at $97,100. The short-term holders (STHs) refer to the Bitcoin investors who purchased their coins during the past 155 days. The cost basis of this group has often been a relevant level for the cryptocurrency, taking turns as support and resistance. In the chart, the analytics firm has also shown two other levels: the +1 and -1 standard deviation bands. Currently, the latter is situated at $83,200, so it&#8217;s possible that if BTC&#8217;s bearish momentum lasts for long enough to push it under the STH cost basis, this value could prove significant. However, before this level, there is another on-chain level that could be important. The level in question is part of the Spent Supply Distribution (SSD) Quantiles model, which basically tells us which price levels the investors selling their coins right now initially purchased them. Related Reading: Bitcoin’s Key Investors Double Down, Buy Another 79,000 BTC The 0.85 quantile is located at $95,600, which is quite close to the STH cost basis, so a retest of the zone could be a particularly vital one for Bitcoin. BTC Price At the time of writing, Bitcoin is floating around $101,000, down almost 5% in the last seven days. Featured image from Dall-E, CryptoQuant.com, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "SUI Rally At Risk? Analysts Warn Of 30% Dip If This Level Doesn’t Hold",
      "link": "https://www.newsbtc.com/news/sui-rally-at-risk-analysts-warn-of-30-dip-if-this-level-doesnt-hold/",
      "summary": "SUI, one of the leading altcoins of this cycle, has recorded an impressive price recovery over the past two months. However, as the cryptocurrency fails to hold some key levels, some analysts warn of a potential drop below the $3.00 support. Related Reading: Ethereum Eyes 15% Move Amid Key Resistance Retest – Breakout Or Rejection Next? SUI Rally Risks Massive Price Drop Since hitting its four-month high of $4.29, SUI’s price has been moving sideways, hovering between $3.40-$4.00 throughout most of May. Amid last week’s market retrace, the altcoin recorded a 14.2% price drop, losing its range and hitting the $3.00 support over the weekend. At the start of this week, SUI saw a mild recovery alongside the rest of the market, surging to the $3.20 area. Nonetheless, the cryptocurrency has failed to hold this level over the past 24 hours and dropped to the $3.10-$3.15 area on Thursday morning. Crypto analyst Carl Runefelt warned that the cryptocurrency’s rally could be in danger as it risks breaking down of a descending triangle pattern. Per"
    },
    {
      "title": "TRON Surges Past 8 Million Daily Transactions as TRX Holds Above $0.27",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-surges-past-8-million-daily-transactions-as-trx-holds-above-0-27/",
      "summary": "TRON (TRX) has experienced relatively stable price movement over the past week, fluctuating within a narrow range between $0.276 and $0.272. At the time of writing, the token is trading at $0.2729, reflecting a weekly decline of approximately 1.5%. However, zooming out reveals a broader uptrend, with TRX gaining nearly 12% over the past month, indicating growing market interest amid a backdrop of increased on-chain activity. An assessment of TRON’s network-level data suggests the blockchain is experiencing a surge in usage. According to a recent analysis published on CryptoQuant’s QuickTake platform by contributor Darkfost, daily transaction volume on the TRON network has crossed the 8 million mark, a notable increase from earlier this year. This growth in network transactions is considered a critical indicator of underlying demand and user engagement, which could influence market sentiment around the asset. Related Reading: TRON Activity Hits All-Time High, Is a TRX Price Breakout Coming? Transaction Volume and Address Activity Show Strong Network Engagement Darkfost noted that TRON’s monthly average for daily transactions has seen consistent growth, with recent data showing a roughly 2 million increase in average daily transactions since February. The network is now processing over 8 million transactions per day, marking a more than 30% rise over the past four months. Importantly, a large share of these transactions is occurring outside centralized exchanges, pointing to the growing utility of the blockchain for peer-to-peer transfers and decentralized application (dApp) usage. This shift away from centralized platforms may reflect increased interest in TRON’s native ecosystem services and its competitive yield offerings. As more users interact directly with the network, transaction-based liquidity grows, which can contribute to stronger economic activity across the TRON protocol. Darkfost emphasized that this trend of non-exchange transactions is a positive signal for the blockchain’s real-world usage and investor adoption. TRON Active Address Metrics Reach New Highs In a separate update, CryptoQuant analyst Cryptoonchain highlighted that both the 50-day and 100-day moving averages for active addresses on the TRON network have hit their highest levels to date. This sustained rise in active wallet participation suggests a growing user base that is consistently interacting with the blockchain. While TRX’s price has not fully kept pace with the uptick in address activity, historical trends suggest that increased user engagement often precedes upward price movement. Related Reading: Analyst Explains Reason Behind Tron Price Sluggishness — Are TRX Bears Now In Control? The correlation between active address growth and price performance continues to be an area of interest. With momentum building across multiple on-chain indicators, there is a likelihood that TRON may be positioned for further gains if current trends hold. Analysis of Daily Active Addresses and TRX Price on Tron Network – All-Time Highs in Moving Averages “Historically, changes in active address trends tend to precede major price movements.” – By @CryptoOnchain pic.twitter.com/7QXqP6g1Gh — CryptoQuant.com (@cryptoquant_com) June 4, 2025 Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin Network Activity Booming Despite A Quiet Market—Data",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-network-activity-is-booming-despite-a-quiet-market-data/",
      "summary": "Bitcoin’s price has barely moved in the last week, but other signs point to growing activity on the network. On June 5, Bitcoin traded around $104,300, down 0.50% in 24 hours and off 2.5% over the past seven days. Yet data shows more people are joining the network, and more coins are being passed around. Related Reading: Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge Wallet Creation Jump According to Santiment, on May 29 nearly 557,000 new wallets appeared. That was the highest number since December 2023. It means thousands of people are opening wallets even though price has stayed just under $105,000. People normally open new wallets to send and receive bitcoins but they somehow come across the idea through new sources, increased talks among friends or create simple curiosity. In any case, an increased wallet holding indeed indicates a much wider usage. 📊 Bitcoin&#8217;s on-chain activity has seen sharp rises this week as its price hovers just below $105K: 📈 May 29th: 556,830 new $BTC wallets created (Highest since December 2, 2023) 🔄 June 2nd: 241,360 coins circulated (Highest since December 8, 2024) Growth in a network&#8217;s… pic.twitter.com/2DxknVXrKT — Santiment (@santimentfeed) June 5, 2025 Increased Token Movement On June 2, over 241,360 BTC changed hands. This was deemed the busiest day since December 2024. Reports from Santiment suggest that high coin turnover usually coincides with increased traffic. Traders might be moving coins in and out of exchanges, or investors could be shifting wallets. Big swings in daily token movement can point to a shift in sentiment—people either getting ready to buy or sell. Right now, it mostly looks like more users are sending coins to each other, which keeps the network busy even when price sits still. Big Holders Step In Data from IntoTheBlock shows that large holders—often called “whales”—are stocking up. Their coin inflows jumped by 145% over the last seven days, and by 214% over the past 30 days. When big players load up, it can tighten supply on exchanges. That makes it tougher for new buyers to get in without driving price higher. If whales keep buying at this rate, it could lead to more upward pressure on price once everyday investors step in again. Related Reading: Bitcoin Scarcity May Spark Explosive Surge, Bank Study Shows Mid Tier Investors Buy It’s not just the really big holders adding coins. Wallets holding between 10 and 10,000 BTC added more than 79,000 BTC in just one week. That means these mid-tier holders picked up around 11,320 BTC per day on average. As of June 2, they held over 13 million BTC in total. When both big whales and these mid-level holders keep stacking, it further cuts down the number of coins floating on exchanges. Fewer coins available often mean any shift in demand could move price more. Featured image from Imagen, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin vs Stablecoins: Bitcoin is an Unreplicable Lifeline in Authoritarian Regimes",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Authoritarian-leader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes\" rel=\"nofollow\"> </a></p> <p>Bitcoin operates beyond any government’s grasp. Its value isn’t in replacing stablecoins — it’s in doing what they fundamentally cannot do.</p> <p>"
    },
    {
      "title": "Bitcoin Life Insurer, Meanwhile, Becomes First Company to Publish Audited Financials Denominated in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Meanwhile-Insurance.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Meanwhile Insurance Bitcoin (Bermuda) Limited (“Meanwhile”) announced it has become the first company in the world to release externally audited financial statements denominated entirely in Bitcoin. According to the announcement, the company reported 220.4 BTC in assets and 25.29 BTC in net income for 2024, a 300% year over year increase. “We’ve just made history [&#8230;]</p> <p>"
    },
    {
      "title": "President Trump’s Truth Social Files S-1 Form For Bitcoin ETF",
      "link": "https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Eric-Trump-Said-Everybody-Wants-Bitcoin.-Everybody-is-Buying-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf\" rel=\"nofollow\">President Trump&#8217;s Truth Social Files S-1 Form For Bitcoin ETF</a></p> <p>Truth Social filed for an S-1 Form for a Bitcoin ETF.</p> <p>"
    },
    {
      "title": "Botanix Launches Federated Sidechain with 16 Members On Testnet",
      "link": "https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_giant_robot_spider_with_big_matrix_code_ch_2-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members\" rel=\"nofollow\"> </a></p> <p>Botanix launches a decentralized Bitcoin sidechain on testnet with a 16-node federation, using the Spiderchain protocol for EVM-compatible dApps. Mainnet set for Q3 2025.</p> <p>"
    },
    {
      "title": "Matador Technologies Raises C$1.64M To Invest in Their Bitcoin Reserve",
      "link": "https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Matador-Technologies-Raising-C1-Million-to-Invest-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve\" rel=\"nofollow\"> </a></p> <p>Matador Technologies announced it raised C$1,644,300 across the issuance of 2,652,097 units to add more bitcoin to their reserve.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "OpenAI Challenges Court Order to Preserve User Data in NYT Lawsuit",
      "link": "https://decrypt.co/323950/openai-challenges-court-order-user-data-nyt-lawsuit",
      "summary": "The AI firm said the order to retain deleted ChatGPT chats undermines user privacy as legal its battle escalates."
    },
    {
      "title": "Meta Oversight Board Slams Parent Company Over Viral Ronaldo Deepfake",
      "link": "https://decrypt.co/323942/meta-oversight-board-slams-parent-company-viral-ronaldo-deepfake",
      "summary": "Meta’s Oversight Board ordered the removal of a Ronaldo deepfake ad, calling out the platform’s weak enforcement of anti-fraud rules."
    },
    {
      "title": "How Circle’s IPO Stacks Up Against Other Crypto Market Debuts",
      "link": "https://decrypt.co/323939/how-circles-ipo-stacks-up-against-other-crypto-market-debuts",
      "summary": "Circle closed with an $18.4 billion valuation, well below Coinbase’s IPO but ahead of newer entrants like Fold and eToro."
    },
    {
      "title": "'A Different Era': Bored Ape Creator Yuga Labs Wants to Kill the ApeCoin DAO",
      "link": "https://decrypt.co/323902/bored-ape-creator-yuga-labs-wants-kill-apecoin-dao",
      "summary": "Bored Ape Yacht Club creator Yuga Labs has proposed axing the ApeCoin DAO, with plans to create a new entity to oversee the Ethereum token."
    },
    {
      "title": "VPN Usage Spikes in France as Pornhub Blocks Users Over Age Restrictions",
      "link": "https://decrypt.co/323881/vpn-usage-spikes-france-pornhub-age-restrictions",
      "summary": "Pornhub’s France block over age checks sparked a 1,000% ProtonVPN signup surge, highlighting pushback against ID laws."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "World Liberty advisor faces six-figure loss after shorting $TRUMP on Trump-Musk fallout",
      "link": "https://cryptobriefing.com/shorting-trump-losses-advisor/",
      "summary": "<p>The fallout highlights the volatility and interconnectedness of crypto and traditional markets, emphasizing the risks of speculative trading.</p> <p>"
    },
    {
      "title": "Trump–Musk feud escalates as Musk accuses Trump of appearing in Epstein files",
      "link": "https://cryptobriefing.com/trump-musk-contracts-epstein-allegation/",
      "summary": "<p>Trump threatens to cut Musks government contracts after backlash over $1.6T bill. Musk fires back with Epstein claim as Tesla sinks 20%.</p> <p>"
    },
    {
      "title": "Truth Social Bitcoin and Ethereum ETF registered in Nevada",
      "link": "https://cryptobriefing.com/truth-social-cryptocurrency-investment-trusts/",
      "summary": "<p>This move could enhance crypto market accessibility and legitimacy, potentially influencing broader adoption and regulatory perspectives.</p> <p>"
    },
    {
      "title": "Trump’s sons send cease-and-desist to his meme coin team over Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/trump-branded-crypto-wallet-dispute/",
      "summary": "<p>The cease-and-desist highlights potential legal and reputational risks in unauthorized use of high-profile names in crypto ventures.</p> <p>"
    },
    {
      "title": "Tesla shares tumble as Trump-Musk bromance collapses days after farewell",
      "link": "https://cryptobriefing.com/tesla-stock-tumble-trump-musk/",
      "summary": "<p>The fallout may impact Tesla's market stability and influence future corporate-political alliances, highlighting risks of volatile partnerships.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "$1B liquidation bloodbath: Can Bitcoin hold $100K amid Musk–Trump drama?",
      "link": "https://ambcrypto.com/1b-liquidation-bloodbath-can-bitcoin-hold-100k-amid-musk-trump-drama/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika3-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Political war erupts, billions wiped out - Is Bitcoin’s $100k crown in danger?"
    },
    {
      "title": "Bitcoin stuck in key region: What’s keeping BTC from bouncing?",
      "link": "https://ambcrypto.com/bitcoin-stuck-in-key-region-whats-keeping-btc-from-bouncing/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-05T170237.123-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin faces weakening retail interest and shrinking liquidity, putting pressure on its recovery."
    },
    {
      "title": "Bitcoin eyes major rally as ETF inflows spike – But THIS can ruin the party",
      "link": "https://ambcrypto.com/bitcoin-eyes-major-rally-as-etf-inflows-spike-but-this-can-ruin-the-party/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BDAB8D8A-3B7B-4DFC-9D95-6FE6A7FB2756.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin could be ready for another major upswing."
    },
    {
      "title": "BNB – Signs of accumulation, but should traders wait for a dip instead?",
      "link": "https://ambcrypto.com/bnb-signs-of-accumulation-but-should-traders-wait-for-a-dip-instead/",
      "summary": "<img alt=\"BNB - Signs of accumulation, but should traders wait for a dip instead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BNB-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Binance Coin has seen steady buying pressure since March, making the case for bullish strength."
    },
    {
      "title": "California moves to claim dormant crypto holdings – What should you expect?",
      "link": "https://ambcrypto.com/california-moves-to-claim-dormant-crypto-holdings-what-should-you-expect/",
      "summary": "<img alt=\"California moves to claim dormant crypto holdings - What should you expect? \" class=\"attachment-full size-full wp-post-image\" height=\"583\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/California-Assembly-has-passed-AB-1052.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1036\" />Why is California treating Bitcoin like a forgotten bank account?"
    }
  ]
}