{
  "CoinDesk": [
    {
      "title": "Can Tether's Dominance Survive the U.S. Stablecoin Bill?",
      "link": "https://www.coindesk.com/news-analysis/2025/06/17/can-tether-s-dominance-survive-the-u-s-stablecoin-bill",
      "summary": ""
    },
    {
      "title": "Why Blockchain Valuation Models Are Still Up for Debate",
      "link": "https://www.coindesk.com/opinion/2025/06/17/why-blockchain-valuation-models-are-still-up-for-debate",
      "summary": ""
    },
    {
      "title": "Shiba Inu Slides to Two-Month Low as Trump Threatens Khamenei, Demands Unconditional Surrender",
      "link": "https://www.coindesk.com/markets/2025/06/17/shiba-inu-slides-to-two-month-low-as-trump-downplays-iran-truce",
      "summary": ""
    },
    {
      "title": "Bitcoin Heads Lower as Trump Threatens to Assassinate Iran’s Supreme Leader",
      "link": "https://www.coindesk.com/markets/2025/06/17/bitcoin-heads-lower-as-trump-threatens-to-assassinate-irans-supreme-leader",
      "summary": ""
    },
    {
      "title": "Can the Real Cypherpunks Please Stand Up?",
      "link": "https://www.coindesk.com/opinion/2025/06/17/can-the-real-cypherpunks-please-stand-up",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "JPMorgan pushes JPMD pilot on Base, says deposit tokens beat stablecoins",
      "link": "https://cointelegraph.com/news/jpmorgan-deposit-token-jpmd-pilot-base-coinbase?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdmNzMtNmEwNS03MDkzLWE2NDctNWU5MDFjNDY1Y2Ey.jpg\" /></p><p>Once the pilot phase ends, Coinbase’s institutional clients can begin using JPMD for transactions.</p>"
    },
    {
      "title": "GENIUS Act could strengthen dollar power, write ‘rulebook’ for global financial system",
      "link": "https://cointelegraph.com/news/genius-act-dollar-dominance-rulebook-global-financial-system?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGY2NDQtNDM0OS03M2RmLWJkMWUtNjNmYzYwMjUxNTBl.jpg\" /></p><p>After clearing a key procedural vote, the GENIUS Act faces a final decision in the Senate before moving to the House of Representatives.</p>"
    },
    {
      "title": "Regulatory uncertainty looms as CFTC struggles with vacancies",
      "link": "https://cointelegraph.com/news/cftc-regulate-crypto-bill-us?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzU1YTYtNzg2ZS03ODNlLTkwZDEtMzgzMmU3YmU0Njdj.jpg\" /></p><p>New legislation in Washington would have the CFTC regulate crypto, but is it currently able to provide effective rulemaking?</p>"
    },
    {
      "title": "Cycles eyes sustainable crypto credit after 2022 liquidity crisis",
      "link": "https://cointelegraph.com/news/cycles-eyes-sustainable-crypto-credit-after-2022-liquidity-crisis?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDJiMmUtNDMwZi03YWNiLTliM2YtNWMxY2M3NDRiYWQy.jpg\" /></p><p>“The panic of ‘22 showed that much like in TradFi, liquidity and solvency are intimately bound up with each other,” said Cycles’ Ethan Buckman.</p>"
    },
    {
      "title": "Coinbase seeking SEC approval for ‘tokenized equities’ — Report",
      "link": "https://cointelegraph.com/news/coinbase-sec-approval-tokenized-equities?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGQ3ZDYtYjJhZi03YjA0LWJjODMtMjc3ODg1Y2MzYzk3.jpg\" /></p><p>If approved by the US regulator, the investment offering could have Coinbase competing against other stock trading platforms.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Treasury Secretary Bessent says stablecoins are debt relief engine as Senate readies to vote on GENIUS Act",
      "link": "https://cryptoslate.com/treasury-secretary-bessent-says-stablecoins-are-debt-relief-engine-as-senate-readies-to-vote-on-genius-act/",
      "summary": "<p>Treasury Secretary Scott Bessent stated on June 17 that stablecoins could cut federal borrowing costs and slow debt growth if Congress sends the Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act to the president. In an X post, he pointed to research projecting a $3.7 trillion stablecoin market by 2030 and argued that [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase seeking SEC approval to offer blockchain-based equities",
      "link": "https://cryptoslate.com/coinbase-seeking-sec-approval-to-offer-blockchain-based-equities/",
      "summary": "<p>Coinbase is seeking permission from the U.S. Securities and Exchange Commission (SEC) to launch blockchain-based equities, Reuters reported on June 17, citing the exchange&#8217;s chief legal officer, Paul Grewal. The plan would enable Coinbase to offer digital tokens that represent ownership in publicly listed companies, effectively merging traditional equity markets with blockchain infrastructure. If greenlit, [&#8230;]</p> <p>"
    },
    {
      "title": "Kraken’s L2 network rolls out native INK token to power protocol incentives, allocation",
      "link": "https://cryptoslate.com/krakens-l2-network-rolls-out-native-ink-token-to-power-protocol-incentives-allocation/",
      "summary": "<p>Ink Foundation announced on June 17 that it would mint 1 billion INK tokens to fund user-run liquidity on Ink, the Ethereum layer-2 network backed by Kraken. The foundation has permanently set the supply cap and will release the mint date and contract address after completing the audits. The end of audits, together with predefined [&#8230;]</p> <p>"
    },
    {
      "title": "Thailand’s government unveils five-year crypto tax exemption for investors",
      "link": "https://cryptoslate.com/thailands-government-unveils-five-year-crypto-tax-exemption-for-investors/",
      "summary": "<p>Thailand has announced a significant tax reform to position itself as a leading crypto-friendly nation. On June 17, the country&#8217;s Cabinet approved a five-year personal tax exemption on profits from selling digital assets, including Bitcoin. The measure takes effect from January 2025 and will run until December 2029. Deputy Finance Minister Julapun Amornvivat explained on [&#8230;]</p> <p>"
    },
    {
      "title": "Over $91B in staked ETH makes Ethereum nearly impossible to attack",
      "link": "https://cryptoslate.com/insights/over-91b-in-staked-eth-makes-ethereum-nearly-impossible-to-attack/",
      "summary": "<p>Ethereum staking has reached a new milestone, with over 35 million ETH now locked across various platforms, according to Dune Analytics data. This accounts for nearly one-third of the crypto’s total supply and reflects a growing preference among holders to earn passive rewards by securing the network. Lido remains the largest staking provider, holding 8.94 [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Dogecoin Sets The Stage For A Liftoff With Key Reversal Pattern",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-key-reversal-pattern/",
      "summary": "Crypto Sat recently took to X to share a technical insight on Dogecoin, revealing that the asset is showing signs of accumulation following a sharp correction. According to the analyst, the 2-hour chart is beginning to shape a potential double bottom pattern. Should this structure be confirmed, it might signal a renewed upward push for DOGE, catching the interest of short-term traders and long-term holders. Make-or-Break Moment For Dogecoin: The Neckline Battle Ahead Dogecoin is currently displaying the characteristics of a double bottom formation, a classic reversal setup that could signal a shift in momentum, as noted by Crypto Sat. The first bottom was established around the $0.170 mark, following a significant price drop, where buyers initially stepped in to defend the zone. Related Reading: Dogecoin Must Hold This Level—Or Risk A 30% Price Crash Shortly after, DOGE made a move back down for a second test of the same support area, with a higher low structure forming, suggesting weakening bearish pressure and the emergence of early accumulation. The key area to watch is the neckline resistance, which sits in the $0.198 to $0.200 range. Crypto Sat emphasizes that a breakout above the neckline would serve as strong technical confirmation of a shift in market sentiment. If bulls manage to push through, it might open the door for a sustained upward rally, as traders gain confidence in the reversal setup taking hold. Here Are Key Signals To Watch In the analysis, Crypto Sat has outlined several key signals to watch as Dogecoin&#8217;s price action tightens. One early bullish sign, he notes, is the rising volume on the second bottom, a subtle but important clue that buyers may be stepping in with growing conviction. Volume often leads price, and this uptick could mark the start of renewed upward momentum. Related Reading: Dogecoin Breaks Out Of Bull Pennant—What’s The Target? The crucial level to monitor is the resistance zone around $0.200. A strong breakout above this zone could trigger a technical shift, paving the way for a potential rally toward the $0.220 and $0.230 range. Such a move would confirm the double bottom formation and likely attract more bullish participation as confidence builds. However, if price fails to break through the neckline, support around $0.165 becomes the next critical level. A bounce from that zone would keep the pattern alive, but a clean drop below it could invalidate the setup and suggest further downside risk. Sharing his personal outlook, Crypto Sat believes DOGE may be positioning for a breakout, but cautions traders to be patient. &#8220;Let the neckline decide the next big move,&#8221; he advises, underscoring the importance of watching for confirmation before making aggressive plays. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Rising Bitcoin Dominance Above 64% Dashes Hopes Of Altcoin Season, Here’s Why",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-dominance-above-64/",
      "summary": "Crypto analyst Daan Crypto has provided an analysis of the rising Bitcoin dominance, explaining why this will likely continue to surge. Based on his analysis, the altcoin season is unlikely to come anytime soon, with many alts suffering significant selling pressure while BTC accumulation increases. Bitcoin Dominance Surge Dashes Hopes Of Altcoin Season In an X post, Daan Crypto stated that the Bitcoin Dominance shows no signs of stopping following the latest surge above 64%. He indicated that the dominance will only continue to rise as more treasury companies try to accumulate Bitcoin. Meanwhile, on the other hand, hopes of an altcoin season fade away as many altcoins are plagued with big unlocks and downtrending momentum. Related Reading: Positioning For Altcoin Season: Analyst Reveals When To Buy As Bitcoin Dominance Rises Daan Crypto also alluded to how there was a short squeeze last month on Ethereum, which took a lot of coins with it. However, this momentum quickly faded afterwards, again dashing hopes of an altcoin season. The analyst explained that there wasn’t sufficient spot bid to bid most of these coins up further. Meanwhile, he cautioned market participants to pick their altcoin investments wisely. Daan Crypto remarked that most of them will underperform BTC over a larger timeframe. His warning suggests that the Bitcoin dominance will continue to trend upwards while an altcoin season may not happen anytime soon. Basically, there is a lack of interest and capital in these altcoins to spark an altcoin season, which could see them outperform BTC. Meanwhile, the Bitcoin dominance is surging thanks to massive adoption from institutional investors. These companies are looking to adopt Strategy’s playbook or gain exposure through the Bitcoin ETFs. BlockchainCenter data shows that it is still Bitcoin season and nowhere near altcoin season. For it to be altcoin season, 75% of the top 50 coins need to have outperformed BTC over the last 90 days. Only ten altcoins have outperformed the flagship crypto during this period. Altseason Is Still Coming, But Slowly In an X post, crypto analyst Astronomer assured that the altcoin season is still coming, although it could take a while. He noted that the price remains the same for these altcoins, but declared that nothing has changed. The analyst remarked that this lines up with the overall plan of the Bitcoin price ranging till the end of June and altcoins remaining in their local ranges. Related Reading: The Return Of Altcoin Season: Why Bitcoin Dominance Must Fall To 62% Astronomer also indicated that BTC needs to break out while the Bitcoin dominance remains below 65% for all parts of the plan for an altcoin season to be completed. The analyst urged market participants to be patient, expressing his confidence that an altcoin season would still occur. At the time of writing, the Bitcoin price is trading at around $107,300, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Trump Media Makes Moves On Bitcoin And Smartphone – What’s Next?",
      "link": "https://www.newsbtc.com/crypto/trump-media-makes-moves-on-bitcoin-and-smartphone-whats-next/",
      "summary": "A new filing shows Trump Media &#38; Technology Group moving into both crypto and telecom markets. The company behind Truth Social and Truth+ has asked the US Securities and Exchange Commission to register a Bitcoin and Ethereum ETF, according to reports. At roughly the same time, it unveiled plans for a $499 Trump‑branded smartphone and service plan. Related Reading: Record‑High Ethereum Open Interest Signals Institutional Confidence Truth Social Bitcoin And Ethereum ETF According to the registration statement dated June 16, the proposed ETF would hold 75% of its assets in Bitcoin and the remaining 25% in Ethereum. If the SEC clears the way, the fund will list on NYSE Arca under a sponsor agreement with Yorkville America Digital. The plan is to store both coins in direct custody, meaning the ETF will actually hold the digital tokens rather than futures contracts or other derivatives. Crypto.com Handles Custody And Staking Based on reports, Crypto.com will serve as the ETF’s sole custodian and prime execution agent. The company will also provide staking and liquidity services for the Ethereum portion. That setup could ease SEC concerns, given the regulator’s focus on secure storage and clear oversight. Still, there’s no guarantee the ETF will win approval. Past spot crypto ETF proposals have faced delays and rejections due to worries over market manipulation and investor protection. Trump Mobile Smartphone and Service Plan At a media event in Trump Tower, US President Donald Trump’s organization introduced “Trump Mobile,” a new phone and network service. The device will sell for $499 starting in September, and the monthly plan is priced at $47.45—a nod to Trump’s role as the 47th US President. BREAKING: The Trump Organization announced Trump Mobile, which will offer 5G service starting at $47.45 through the 3 major carriers and will be releasing a phone in August called the “T1 Phone.” The phone is described as “a sleek, gold smartphone engineered for performance and… pic.twitter.com/jhtXRLveJZ — RedWave Press (@RedWave_Press) June 16, 2025 The phone itself is made in the US, and call centers here will handle customer support. Coverage will run on existing networks, with the Trump name licensed rather than the company building its own towers. Related Reading: Amid Bitcoin Hype, Seasoned Trader Predicts Sudden Drop To This Level Trump Mobile: Bundled Extras Aim To Attract Users According to the company, Trump Mobile will bundle telemedicine visits, international texting to 100 countries, and roadside assistance. Donald Trump Jr. highlighted those extras as part of a flat‑fee package designed to stand out from major carriers. The idea is to offer more than just voice and data—giving customers a health line and car help all through one monthly bill. The trademark applications filed by DTTM Operations cover telecom services and accessories under the Trump brand. Featured image from Joe Raedle/Getty Images, chart from TradingView"
    },
    {
      "title": "XRP Must Complete Right Shoulder Before Takeoff—But How Low First?",
      "link": "https://www.newsbtc.com/xrp-news/xrp-complete-right-shoulder-before-takeoff-how-low/",
      "summary": "XRP bulls appear to be facing one last test of conviction before the market’s next explosive phase, according to CryptoInsightUK’s video analysis released on 16 June. The British analyst argues that the token is sculpting an inverse head-and-shoulders formation whose right shoulder “still needs to form around the high-$1.80s” before any sustained rally can commence. How Low Must XRP Go? In the broadcast, he emphasised that “dense liquidity is below us,” pointing to a confluence of resting bids and stop-loss clusters between roughly $1.92 and $1.80. “I still think it comes down to make the right shoulder which is around 1.88,” he said, adding that a swift wash-out into that pocket would “flush the lows, tap in there and send it.” At present, XRP is changing hands near $2.24, up about 3% over the past 24 hours, which implies a prospective drawdown of roughly 20% if the market fulfills his downside scenario. From the analyst’s vantage point, such a retreat is less a cause for alarm than a prerequisite for the next major leg higher: “If we come down first, we’ve done the downside part. Otherwise I’m still going to be worried about going down even if we come up to $2.42 or higher.” Related Reading: What Are The Implications For XRP If Ripple Captures 14% Of SWIFT’s Volume? He linked the bearish short-term bias to structural forces beyond the XRP Ledger’s ecosystem. Bitcoin dominance, he noted, has crept toward a historical inflection zone that previously triggered alt-seasons: “Anywhere in this box could be the start of alt-season… That would probably coincide with Bitcoin dropping to between $100,000 and $93,000.” A dominance spike fed by a late-cycle Bitcoin dip, he argued, would typically inflict outsized percentage losses on major altcoins—including XRP—before liquidity rotates back into them. Within XRP’s own order book, CryptoInsightUK highlighted a “liquidity vacuum” created by May’s capitulation candle. Although the token has since retraced most of that single-session collapse, he described the rebound as “choppy corrective price action,” lacking the conviction and volume that accompanied earlier impulse waves. The right-shoulder flush, in his view, would neutralise residual leverage, particularly among traders who re-loaded longs too aggressively during the $2.15–$2.40 bounce. How High Can XRP Explode? The inverse head-and-shoulders thesis also features prominently on his long-range chart, stretching back to mid-May. The analyst first published the pattern on X, showing a left shoulder near $2.42, a head at $1.47, and a neckline just above $2.50. Completing a symmetrical right shoulder near $1.88 would, by classical pattern-measuring rules, project an upside target above $3.50—a level not visited since late-2021’s cycle top. Related Reading: Still Sleeping On XRP? Analyst Says $8 Breakout Is ‘Just Waiting’ Liquidity dynamics across the broader market reinforce his caution. Open interest in perpetual swaps for Ether, he observed, remains “as high as it’s ever been,” suggesting that any sudden drop in majors could spark a forced-liquidation cascade across altcoin pairs. “These people will be flushed out,” he warned, calling attention to negative-funding episodes that hint at an overcrowded short base waiting to be squeezed—once the final downside pocket has been filled. Despite the near-term jitters, CryptoInsightUK reiterated a resolutely bullish macro stance. “The next stage I’m most certain about is that we’re going to go significantly higher for crypto,” he told viewers. Drawing parallels with gold’s record weekly close, he argued that an undercurrent of global risk aversion is quietly supporting non-sovereign stores of value, positioning both Bitcoin and XRP for accelerated appreciation once the technical reset concludes. For long-term holders, his advice was unequivocal: avoid wholesale portfolio shifts and instead treat any sub-$2.00 wick as a final accumulation window. “Dollar-cost averaging from here is a good thing to do,” he said, revealing that 97% of his own capital remains in spot positions, with only a single-digit percentage reserved for surgical bids in the $1.80–$1.92 zone. Whether XRP respects that script will become clear in the days ahead. Should the market indeed sweep into the high-$1.80s and rebound with the aggressive thrust the analyst expects, the right shoulder will be complete—and the runway clear—for the long-awaited take-off. At press time, XRP traded at $2.23. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Analyst Predicts Bitcoin Price Crash As War Tensions Mount In Middle East",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-crash-as-war-tensions/",
      "summary": "Bitcoin’s recent price activity has been characterized by sharp swings as global uncertainties persist, particularly following the escalation of tensions between Israel and Iran. After plunging by nearly 5% amid the rising geopolitical strain, Bitcoin managed to recover, bouncing back above $105,000 and currently trading around $106,800. The past 24 hours have been highlighted by Bitcoin recovering toward $108,000 briefly again, but with escalating tensions in the Middle East, there&#8217;s a good chance it could crash soon. This aligns with an outlook from a crypto analyst, who noted that Bitcoin might crash toward $100,000. Resistance Band Faces Test For Bitcoin According to crypto analyst Pejman_Zwin on the TradingView platform, Bitcoin is hovering within a confluence of resistance and short liquidation zones, stretching from $105,330 to $107,120. This range, he notes, is not only a structural resistance zone but also corresponds with the cumulative short liquidation leverage area. Related Reading: Bitcoin Price Forms Descending Triangle Pattern Amid Israel-Iran Tensions Basically, this means there&#8217;s a high possibility of an intensified price volatility if this zone is challenged or broken. The charts also reveal the presence of a possible contracting triangle pattern, which is a bearish continuation setup in the context of a larger correction. According to the analyst, if Bitcoin fails to reclaim $106,600 convincingly, the structure could shift from a corrective triangle to a five-wave downward impulse. This would cause a deeper retracement, especially as the price is already forming lower highs within the triangle. As such, the longer Bitcoin lingers in this resistance range without a breakout, the higher the likelihood of a rapid downward move. Bearish And Bull Targets If Bitcoin were to confirm this breakdown, the analyst noted the first major target around the lower boundary of the support zone, which lies between $105,330 and $103,162. This zone is reinforced by the monthly pivot point and also overlaps with the cumulative long liquidation leverage region. The 1-hour candlestick timeframe chart further highlighted a potential short setup from the reversal zone near $107,100 and a projected target close to $104,300. Related Reading: Bitcoin Bears Back In Control After $110,000 Rejection, What Comes Next? Further downside could pull the price toward the next support band around $102,600 or even down to $101,000, should liquidation pressure persist. Pejman, on the other hand, pointed out that a sustained breakout above the $107,120 resistance line could initiate a bullish reversal and push Bitcoin back towards the heavy resistance cluster above $108,000. A strong daily close above $108,000 could cancel the bearish outlook. However, failure to break above here could lead to a rejection and another downside move. Although Bitcoin is starting to show some signs of bullishness, its price action is still vulnerable to a quick pullback, especially if the tensions in the Middle East continue to unfold. At the time of writing, Bitcoin is trading at $106,638, down 0.02% in the past 24 hours. This subdued price action shows its current consolidation nature. Featured image from Pixabay, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "BBVA Tells Wealthy Clients to Invest Up to 7% in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BBVA.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Spanish bank BBVA is now advising its wealthy clients to invest up to 7% of their portfolios in crypto and Bitcoin, showing how traditional banks are starting to see the potential of Bitcoin.&#160; &#8220;With private customers, since September last year, we started advising on Bitcoin,&#8221; said Philippe Meyer, head of digital &#38; blockchain solutions at [&#8230;]</p> <p>"
    },
    {
      "title": "Ukraine Introduces Bill to Allow Bitcoin in National Reserves",
      "link": "https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Ukraine-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves\" rel=\"nofollow\"> </a></p> <p>Ukraine has introduced a bill that would give its central bank the legal right to hold Bitcoin and other assets as part of its national reserves. The draft law, submitted to the Verkhovna Rada on June 10, 2025, proposes updates to existing legislation to include “virtual assets” in the foreign exchange and gold reserves of [&#8230;]</p> <p>"
    },
    {
      "title": "Fold Holdings Secures $250 Million Equity Deal to Expand Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Fold-Holdings-Secures-250M-Equity-Deal-to-Expand-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>Fold aims to increase its bitcoin treasury through a $250M equity facility, giving the company flexibility to raise funds as needed.</p> <p>"
    },
    {
      "title": "Thailand Approves Five Year Bitcoin And Crypto Tax Break",
      "link": "https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Thailand-Approves-Tax-Exemption-on-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break\" rel=\"nofollow\"> </a></p> <p>Thailand has approved a five year tax exemption on capital gains from cryptocurrency trading made through licensed digital asset platforms. The exemption will be in effect from January 1, 2025, through December 31, 2029. Deputy Finance Minister Julapun Amornvivat announced the measure, calling it a move to increase investment, stimulate economic activity, and drive long [&#8230;]</p> <p>"
    },
    {
      "title": "DDC Enterprise Secures $528 Million to Expand Bitcoin Holdings",
      "link": "https://bitcoinmagazine.com/news/ddc-enterprise-secures-528-million-to-expand-bitcoin-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/DDC-Enterprise-Secures-528-Million-to-Expand-Bitcoin-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ddc-enterprise-secures-528-million-to-expand-bitcoin-holdings\" rel=\"nofollow\"> </a></p> <p>Anson Funds, Animoca Brands, Kenetic Capital, and QCP Capital are funding a $528 million raise to expand DDC Enterprise Limited corporate Bitcoin treasury.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Kraken's Ethereum Layer-2 Ink Network Is Launching a Token",
      "link": "https://decrypt.co/325652/kraken-ethereum-ink-network-launching-token",
      "summary": "The Ink Foundation will debut a native token for Kraken's Ethereum layer-2 network. Here's what we know so far."
    },
    {
      "title": "Bitcoin, Altcoins Plunge as Trump's Threat to Assassinate Iran Leader Escalates Middle East Tensions",
      "link": "https://decrypt.co/325642/bitcoin-altcoins-plunge-trump-threat-assassinate-iran-leader",
      "summary": "Bitcoin, Ethereum, and other coins are down after President Trump threatens to have Iran's leader assassinated."
    },
    {
      "title": "JP Morgan Exec Wary of 'Overcrowding' Stablecoin Market as Bank Registers JPMD Trademark",
      "link": "https://decrypt.co/325571/jp-morgan-exec-wary-overcrowding-stablecoin-market",
      "summary": "JP Morgan warns of an \"overcrowding\" stablecoin market while major banks await regulatory clarity. The GENIUS Act faces a crucial Senate vote today."
    },
    {
      "title": "Meme Coin Massacre: Buying Opportunity or a Warning to Exit?",
      "link": "https://decrypt.co/325605/meme-coin-massacre-buying-opportunity-warning-exit",
      "summary": "PEPE drops 12%, SPX6900 dives 11%, and Fartcoin falls 9% amid geopolitical shocks and whale exits. Is the meme coin market facing a hard reset?"
    },
    {
      "title": "TRUMP'S CRYPTO RISK, THE CRCL TRADE, MARKET VOLATILITY",
      "link": "https://decrypt.co/videos/interviews/a8YZLArL/trumps-crypto-risk-the-crcl-trade-market-volatility",
      "summary": "UNDER EXPOSED LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. Macro. Trump's growing crypto risk. The CRCL short trade. PUMP and the SOL Trade. More crypto treasury companies by the day. JP morgan teases stablecoin. HYPE hits new ATH. Fartcoin on Coinbase. Coinbase has huge day with card, DEX, perp futures. Stripe buys privy. 00:00 - Introduction and Current Events 03:25 - Crypto Markets 04:30 - Top Stories in Crypto and Macro 07:15 - Is this dip a buy? 14:20 - What is the timeline saying? 18:30 - Is this the final Cycle? 32:20 - Are Trump family too deep in crypto? 39:30 - Circle IPO discussion 51:20 - Pump Fun Token 58:30 - What's everyone buying roundtable LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    }
  ],
  "CryptoBriefing": [
    {
      "title": "JPMorgan Chase to pilot stablecoin-like JPMD for institutional clients on Base",
      "link": "https://cryptobriefing.com/jpmorgan-jpmd-deposit-token/",
      "summary": "<p>JPMorgan's pilot of JPMD tokens could accelerate institutional adoption of blockchain technology, influencing future financial systems.</p> <p>"
    },
    {
      "title": "How is technology redefining money and currency?",
      "link": "https://cryptobriefing.com/technology-redefining-money-currency/",
      "summary": "<p>Technology is redefining money with digital assets, smart contracts, and blockchain, shifting value exchange beyond traditional currency.</p> <p>"
    },
    {
      "title": "Kraken-backed layer 2 Ink to launch $INK token",
      "link": "https://cryptobriefing.com/kraken-ink-token-launch/",
      "summary": "<p>The launch of $INK could significantly enhance DeFi ecosystems by fostering user-driven governance and expanding on-chain capital markets.</p> <p>"
    },
    {
      "title": "Coinbase plans to offer tokenized equities to rival Robinhood, Charles Schwab",
      "link": "https://cryptobriefing.com/coinbase-tokenized-equities-sec-approval/",
      "summary": "<p>Coinbase's move into tokenized equities could reshape financial markets by increasing competition, innovation, and accessibility in trading.</p> <p>"
    },
    {
      "title": "NYSE-listed DayDayCook to raise up to $528 million for Bitcoin treasury expansion",
      "link": "https://cryptobriefing.com/bitcoin-treasury-expansion-ddc-enterprise/",
      "summary": "<p>DayDayCook's significant Bitcoin investment could influence corporate treasury strategies, highlighting growing institutional interest in digital assets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin mining costs surge past $70K – Will rising expenses hit miners hard?",
      "link": "https://ambcrypto.com/bitcoin-mining-costs-surge-past-70k-will-rising-expenses-hit-miners-hard/",
      "summary": "<img alt=\"bitcoin mining\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-29.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Costs have surged, squeezing margins and triggering silent sell-offs via OTC channels."
    },
    {
      "title": "Bitcoin drops after Trump urges Tehran evacuation, calls emergency situation room meeting",
      "link": "https://ambcrypto.com/bitcoin-drops-after-trump-urges-tehran-evacuation-calls-emergency-situation-room-meeting/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-10.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With macro risk back in the driver’s seat, is Bitcoin’s local bottom already behind us?"
    },
    {
      "title": "Bitcoin treasury hype will burst like memecoin supercycle – Crypto VC",
      "link": "https://ambcrypto.com/bitcoin-treasury-hype-will-burst-like-memecoin-supercycle-crypto-vc/",
      "summary": "<img alt=\"Bitcoin treasury\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BitcointreasuryFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here's why crypto VCs doubt whether Bitcoin and altcoin treasury trend will last."
    },
    {
      "title": "Bitcoin Cash: Can BCH continue its bullish run after recent 20% surge?",
      "link": "https://ambcrypto.com/bitcoin-cash-can-bch-continue-its-bullish-run-after-recent-20-surge/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-17T155053.836_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Traders are currently over-leveraged at $458.7 on the lower side and $486.9 on the upper [&#8230;]"
    },
    {
      "title": "Ripple and SEC want appeals paused – Is a breakthrough ruling coming soon?",
      "link": "https://ambcrypto.com/ripple-and-sec-want-appeals-paused-is-a-breakthrough-ruling-coming-soon/",
      "summary": "<img alt=\"Ripple XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-15.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Paused appeals, rising confidence - Is the verdict already priced in?"
    }
  ]
}