{
  "CoinDesk": [
    {
      "title": "Bitmine Immersion Stock Sheds Another 20% After $2B ATM Offering",
      "link": "https://www.coindesk.com/markets/2025/07/10/bitmine-immersion-sheds-another-20-after-2b-atm-offering",
      "summary": ""
    },
    {
      "title": "Crypto for Advisors: Advisors, the Final Frontier",
      "link": "https://www.coindesk.com/coindesk-indices/2025/07/09/crypto-for-advisors-advisors-the-final-frontier",
      "summary": ""
    },
    {
      "title": "ICP Surges 4% on Strong Volume and Developer Momentum",
      "link": "https://www.coindesk.com/markets/2025/07/10/icp-surges-4-on-strong-volume-and-developer-momentum",
      "summary": ""
    },
    {
      "title": "BONK Advances 5% in V-Shaped Recovery as Bulls Eye Breakout",
      "link": "https://www.coindesk.com/markets/2025/07/10/bonk-advances-5-in-v-shaped-recovery-as-bulls-eye-breakout",
      "summary": ""
    },
    {
      "title": "Coinbase Partners With Perplexity AI to Bring Real-Time Crypto Market Data to Traders",
      "link": "https://www.coindesk.com/markets/2025/07/10/coinbase-partners-with-perplexity-ai-to-bring-real-time-crypto-market-data-to-traders",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "US sees stablecoins as key to preserving the dollar’s reserve status — Sygnum",
      "link": "https://cointelegraph.com/news/us-administration-stablecoins-reversing-usd-falling-reserve-status-sygnum?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjBjM2QtZGEyNi03NmEwLWFhY2MtMDcyN2JlYjcyY2U3.jpg\" /></p><p>US President Donald Trump and members of his administration have pushed for the passing of the GENIUS Act, which would regulate stablecoins in the US.</p>"
    },
    {
      "title": "India’s Bitcoin crossroads: Will it add BTC to national reserves?",
      "link": "https://cointelegraph.com/explained/indias-bitcoin-crossroads-will-it-add-btc-to-national-reserves?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy80ZTY0NzMzMTllNzYyZTU2YzU0YzZjODZiZmI3Mjc4MS5qcGc=.jpg\" /></p><p>As the US and others explore Bitcoin reserves, India faces a pivotal choice: Can BTC boost macro resilience and digital leadership?</p>"
    },
    {
      "title": "Trump’s crypto agenda favors elites, not the everyday user",
      "link": "https://cointelegraph.com/news/trump-crypto-rigged-for-the-rich?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhjZmQtZjFjZC03YTkwLWEzOTItYmNlZGRlZTE2YTJl.jpg\" /></p><p>Donald Trump’s crypto agenda claims to champion financial freedom, but the real beneficiaries are political insiders and wealthy elites.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Bit Mining surges 350% on pivot to Solana, plans $300M token treasury",
      "link": "https://cointelegraph.com/news/bit-mining-solana-pivot-300m-strategy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDdmZmItYzg2NC03YzVjLWIyZDgtNWRjOGViNTE3MTNh.jpg\" /></p><p>Bit Mining’s stock price surged 350% in pre-market trading after announcing a strategic pivot into the Solana ecosystem.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "HyperLiquid breaks $8 billion daily trading volume pushing HYPE token near all-time highs",
      "link": "https://cryptoslate.com/hyperliquid-breaks-8-billion-daily-trading-volume-pushing-hype-token-near-all-time-highs/",
      "summary": "<p>Hyperliquid&#8217;s native token, HYPE, is approaching its all-time high, fueled by the decentralized derivatives exchange capturing over 80% of the on-chain perpetual futures market. The platform has seen its average daily trading volumes increase to a consistent range of $2-6 billion, a surge that coincides with a new partnership with Phantom wallet and recent network [&#8230;]</p> <p>"
    },
    {
      "title": "Circle eyes China market Alipay integration amid reported Ant Group partnership",
      "link": "https://cryptoslate.com/circle-eyes-china-market-alipay-integration-amid-reported-ant-group-partnership/",
      "summary": "<p>Circle, the issuer of the USDC stablecoin, is reportedly exploring a partnership with Ant Group to extend its presence into China, according to a July 10 report by Bloomberg. Sources familiar with the matter reportedly said that Ant Group, parent company of Alipay and one of China’s largest financial technology firms, plans to integrate USDC [&#8230;]</p> <p>"
    },
    {
      "title": "Binance’s Zhao urges governments to simplify laws with AI tools",
      "link": "https://cryptoslate.com/binances-zhao-urges-governments-to-simplify-laws-with-ai-tools/",
      "summary": "<p>Binance founder and former CEO Changpeng Zhao has urged national governments to explore the use of artificial intelligence tools, particularly large language models (LLMs), to simplify their legal systems. In a July 10 post on X, Zhao argued that AI could play a key role in making legal codes more understandable and accessible to everyday [&#8230;]</p> <p>"
    },
    {
      "title": "Memecoins rebound surging 30%+ as Bitcoin ATH fuels gains amid DeFi rebound",
      "link": "https://cryptoslate.com/memecoins-rebound-surging-30-as-bitcoin-ath-fuels-gains-amid-defi-rebound/",
      "summary": "<p>A rally in the crypto market, pushing Bitcoin to a new all-time high above $121,000 on July 9, has ignited substantial gains across a range of altcoins, with memecoins and select DeFi tokens posting daily increases exceeding 30%. The broad market uplift comes as Ethereum also shows strength, crossing the $2,780 mark with a 6% [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase Bitcoin premium indicates US demand led surge to $112,000",
      "link": "https://cryptoslate.com/insights/bitcoin-hits-record-112k-amid-intensified-us-investor-interest/",
      "summary": "<p>Bitcoin, which had spent much of the past month trading within a narrow range, suddenly broke out to a new all-time high of $112,000 on July 9. The surge coincided with a sharp increase in the &#8220;Coinbase Premium,&#8221; a key indicator used to gauge Bitcoin demand among US investors. According to data from CryptoQuant, BTC [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ripple CEO Wants To Take Over SWIFT’s Customers — Centrals Banks Tap In",
      "link": "https://www.newsbtc.com/ripple-2/ripple-take-over-swifts-customers/",
      "summary": "Ripple’s ambitions in the global payments space have grown louder and more direct, as its CEO Brad Garlinghouse, openly stated at APEX 2025 that the company is aiming to take over SWIFT’s customer base. The commentary follows Ripple’s long-term strategy to shift global banking infrastructure away from legacy systems to the blockchain-based XRP Ledger. Meanwhile, central banks are increasingly taking note, with recent reports revealing that the capacity of Ripple&#8217;s network is currently being studied alongside SWIFT’s systems in experiments. Garlinghouse Sets Sights On SWIFT’s Market Share Speaking at the APEX summit, Ripple CEO Brad Garlinghouse declared that Ripple’s goal is not only to compete with SWIFT but to replace its role in moving money on the global scale. According to Garlinghouse, although SWIFT is very dominant in messaging, the most important thing is the liquidity that banks can provide. Related Reading: Ripple To Replace SWIFT? XRP Analyst Breaks Down Recent Developments “I think less about the messaging and more about liquidity,” he said. Ripple is targeting this deeper infrastructure among banks, which is the actual movement of value. Interestingly, Garlinghouse asserted that Ripple plans to capture up to 14% of SWIFT’s current cross-border volume within five years. That’s a bold number, especially considering the scale at which SWIFT currently operates. Recent estimates show that SWIFT currently facilitates more than 45 million financial messages and handles around $5 trillion in money transfers daily. Even a 14% share of that market would represent hundreds of billions of dollars in value flowing through Ripple’s ecosystem, which would create a significant demand for XRP in the process. Central Banks Are Tapping In Garlinghouse’s comments come at a time when institutional momentum appears to be shifting in Ripple’s favor. Interestingly, Ripple’s global push is not limited to private sector partnerships. A crypto enthusiast on the social media platform X known as Finance Bull recently drew attention to growing central bank interest in blockchain-based payment infrastructure. Unsurprisingly, Ripple’s technology is the key focus to this growing interest. Related Reading: Ripple Plans To Take 14% Of SWIFT Volume, USDC Lands On XRPL – What Does This Mean For XRP Price? Ripple’s xCurrent solution, which is built on the Interledger Protocol (ILP), was recently studied alongside SWIFT’s gpi system as part of Project Stella. Project Stella is a collaborative research initiative by the European Central Bank and the Bank of Japan. Basically, what this means is that central banks are starting to look into Ripple&#8217;s technology, which says a lot about the ecosystem&#8217;s outlook in the coming years. The fact that two of the world&#8217;s most influential central banks reviewed Ripple’s infrastructure alongside SWIFT is a signal that XRP’s utility is now being evaluated at the core of global monetary policy discussions. These developments closely align with what many fervent XRP supporters have long believed. There have been recurring predictions among the community’s most confident voices that XRP’s price is destined to move far beyond its current all-time high of $3.40. Some technical analyses have predicted double-digit prices for XRP. Other predictions for the XRP price are as high as $1,000. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Blasts to $112,017 ATH – What’s the Best Crypto to Buy Before the Next Surge?",
      "link": "https://www.newsbtc.com/news/bitcoin-blasts-to-ath/",
      "summary": "After hovering below the $110K mark over the past few weeks, Bitcoin hit a new all-time high yesterday. Bolstered by growing institutional adoption, $BTC is stronger than ever. And that means now’s the time to buy crypto before the next surge. $BTC finally reached the $100K milestone late last year, before outdoing itself in May, when it reached $111,970. Making it to $112,017 is another first for the crypto OG. Make no mistake, Lady Luck played no hand in Bitcoin’s surge. It’s down to an ever-growing list of financial institutions worldwide that are recognizing the value of $BTC, due in part to supportive government policies. Top Guns Weigh In Bitcoin champion Michael Saylor, Executive Chairman of Strategy, argues that Bitcoin has gotten through its riskiest period. In fact, he told Bloomberg in a June 10 interview that he believes that $BTC will be $1M. “The President of the United States supports Bitcoin. The Cabinet supports Bitcoin. [Treasury Secretary] Scott Bessent supports Bitcoin. Paul Atkins has shown himself to be enthusiastic about bitcoin and digital assets. Brian Quintenz at CFTC feels that the banks will custody Bitcoin.” Saylor explained that Bitcoin Treasury companies are buying $BTC’s natural supply. In addition, “BlackRock and the ETFs are buying another measure of that, and we&#8217;ve got nation-state actors coming into the space. The writing is on the wall. Bitcoin is moving higher.” Bitcoin’s status as a heavyweight institutional asset is solidifying fast. And while Saylor’s Strategy continues to grab the spotlight, the corporate herd is growing. Take GameStop, for instance. It made waves in May by greenlighting Bitcoin buys at the board level. Soon after, GameStop purchased 4.71K Bitcoin. And for its part, the Trump Media and Technology Group is also eyeing a blended crypto ETF. Dubbed the “Crypto Blue Chip ETF,” it plans to offer exposure to five digital assets. Some 70% of the ETF&#8217;s holdings will be in $BTC, 15% in $ETH, 8% in $SOL, and 5% in $XRP. The remaining 2% of the ETF’s holdings will be in $CRO – the native token of the ETF’s digital custodian, the exchange Crypto.com. Bitcoin Wins, Crypto Scores With fresh ETF inflows, increased corporate balance sheet exposure, the rise of crypto futures, and a more favorable regulatory environment, $BTC is experiencing a powerful surge in institutional interest. And the momentum shows no signs of slowing down anytime soon. So, if you&#8217;re wondering which crypto to buy before the next big surge, you&#8217;re in the right place. Here are three altcoins with massive potential to explode when $BTC rallies again. If Michael Saylor’s predictions hold true, that surge could be just around the corner. 1. Bitcoin Hyper ($HYPER) – Scalability for Bitcoin Through an L2 In keeping with all things $BTC, Bitcoin Hyper ($HYPER) brings an exciting proposal to the crypto table. A Bitcoin Layer-2 (L2) platform. The Bitcoin blockchain has a lot going for it, especially in terms of top-level security. It falls short, however, in terms of speed and high transaction fees, especially when compared to the likes of Solana. In short, Bitcoin lacks scalability. That’s where $HYPER steps up to the plate. This upcoming meme coin is set to power an innovative Bitcoin L2 ecosystem that will increase the speed and reduce fees. More importantly, it adds cross-chain compatibility. That means seamless access to the best meme coins, DeFi, and dApps. At the moment, Bitcoin Hyper is on presale. That means you can buy it for $0.0122. You can also stake your $HYPER for 360% APY. If you’re keen to discover more about this L2 and the meme coin behind it, take a look at our guide to buying $HYPER. It explains all you need to know. Keep in mind, though, that as a presale, the price of $HYPER will increase in stages, offering you the chance to secure tokens at a lower cost now. Additionally, the rewards APY is dynamic and will decrease over time, so the earlier you get in, the better the returns. Once $HYPER lists on DEXs after the presale, the price is expected to rise even further, so now is a prime opportunity to get involved before the price climbs. 2. Best Wallet Token ($BEST) – Driving Global Crypto Wallet Market Domination It’s not only institutions that are taking Bitcoin and other digital assets much more seriously these days. With the growing number of retail, as in individual, investors also entering the scene, it means a bigger demand for crypto wallets. That’s what makes the Best Wallet Token ($BEST) one to watch with a very close eye. It’s the native token of Best Wallet, a non-custodial, no KYC, multi-chain, and multi-currency hot wallet that is gaining serious market traction. So much so that Best Wallet is on a mission to dominate 40% of the global crypto wallet market by the end of next year. And it’s using $BEST to help it achieve that target. Holding $BEST means additional benefits and features of what is already a leading crypto wallet. That includes being able to buy the best presale crypto directly from the mobile wallet (a market first, by the way); lower transaction fees; and higher staking rewards. $BEST also comes with community governance. So you can have a say in the project’s direction – including the presale tokens available to buy, and other features. $BEST is also on presale. Buy yours today for $0.025305 and stake it for 99% before the upcoming price increase. Our How To Buy $BEST guide explains how to do just that. 3. America Party ($AP) – On the Heels Of Musk&#8217;s New Party The America Party Token ($AP) is another newcomer to the crypto scene. It was launched mere days after Elon Musk announced he intends to create a new political party. However, unlike $HYPER and $BEST, which are both on presale, $AP is already listed on DEXs. To be clear, though, the $AP token is not affiliated with Musk or the America Party he is launching. That said, $AP does stand to ride on Musk’s coattails. And to sweeten the deal, when Musk mentions a cryptocurrency, meme coins in particular, that token often explodes. And recently, Musk was asked by a follower whether his America Party will embrace Bitcoin. His response was definitive: “Fiat is useless, so yes.” Another boost for crypto. Right now, $AP costs $0.01830 – up 239.38% since it launched on July 7. Get yours today through UniSwap or MEXC. “The Writing’s On The Wall” As Saylor put it, “Bitcoin is moving higher.” And while the market can be unpredictable at best, $BTC’s latest rally to $112K is a definitive indicator that the institutional adoption of digital assets is positively impacting, and with signs of slowing. That means newer cryptos like $HYPER, $BEST, and $AP also have the potential to pump if current conditions continue. And the best part of investing in new tokens is getting in at an early-bird price. That said, nothing is guaranteed, and we’re not financial advisers. Be sure to always DYOR research before making any investment."
    },
    {
      "title": "Bitcoin Is One Candle Away From $141,300 Breakout, Chart Master Warns",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-one-candle-away-141300-breakout/",
      "summary": "Top analyst Aksel Kibar (CMT) believes Bitcoin is approaching a decisive moment on the weekly chart. In a post shared on 9 July 2025, the veteran technician noted that BTC/USD is “holding right at the pattern boundary.” The annotated chart he released—covering Bitstamp weekly prices back to mid-2022—shows the cryptocurrency compressing directly beneath a horizontal resistance band at $109,000, the neckline of what he labels a six-month head-and-shoulders (H&#38;S) continuation formation. Bitcoin Poised For $141,300 Kibar’s chart first revisits the basing sequence that reversed the 2022 bear cycle. A textbook inverse head-and-shoulders bottom completed in early-2023, with troughs at roughly $17,600 (left shoulder), $15,500 (head) and $19,500 (right shoulder). The breakout above the neckline sent Bitcoin to $31,400. Related Reading: Bitcoin &#38; Stablecoin Reserves Diverge On Binance: Liquidity Explosion Brewing? Immediately thereafter, price stalled in a six-month rectangle bounded by $25,000 support and $31,400 resistance. The eventual topside resolution propelled the market to the rectangle’s implied target of $38,000, validating two consecutive classical projections in less than a year. Afterwards, the BTC price grinded higher. Below $73,700, BTC consolidated in a falling wedge, ending with a breakout toward $109,000. From that point, the initial pullback bottomed at $91,200, creating what Kibar designates as the left shoulder. A deeper descent to $76,500 carved out the head. Then, the Bitcoin price formed the right shoulder at $101,500, echoed by the blue bowl-shaped arc on the chart. Throughout this structure the neckline at $109,000 remained intact, acting as a clear demarcation between consolidation and fresh highs. The inverse head-and-shoulders pattern spans roughly half a year, matching the analyst’s “6-month-long” annotation. Related Reading: Last Time This Happened, Bitcoin Jumped $50,000—Is History Repeating? Using the orthodox H&#38;S continuation rule—adding the vertical distance from the head ($73,700) to the neckline ($109,000) to the breakout level—Kibar derives a price objective of $141,300. He notes in an X reply that this target is separate from the earlier $137,000 objective, which came from a larger cup-with-handle on the monthly scale. In other words, the shorter-term weekly pattern now projects modestly higher than the longer-term structure. At press time Bitcoin, Bitcoin traded near $111,000, surpassing the neckline. However, from a technician’s standpoint, the breakout still needs to confirm with the weekly close. Confirmation requires a decisive weekly settlement north of the $109,000 neckline. As Kibar notes: “Breakout needs to take place with a long white candle, similar to previous pattern completions. There should be no hesitation.” Invalidation would emerge on a weekly close back below the most recent swing-low support at $101,500; deeper failure beneath $91,2000 would unravel the pattern entirely. For now, Bitcoin sits at the fulcrum of its six-month equilibrium. A weekly candle or two should reveal whether the largest digital asset can convert yet another classical chart formation into a measured move—this time toward mid-six-figure territory. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Back At Range Highs: Breakout Above $2,800 Could Ignite Altseason",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-back-at-range-highs-breakout-above-2800-could-ignite-altseason/",
      "summary": "Ethereum surged over 5% yesterday, pushing past the key $2,700 level and signaling renewed strength across the altcoin market. After weeks of sideways action and uncertainty, this move marks a small but significant breakout, reigniting bullish sentiment among investors and traders. The breakout comes as Bitcoin continues to consolidate below its all-time highs, allowing ETH and other altcoins to take the lead. Related Reading: Bitcoin 30-Day Average Funding Rate Drops – Bullish Setup Takes Shape Market participants are closely watching Ethereum’s price action, as its movements often set the tone for the broader altcoin space. Top analyst Ted Pillows shared a technical view highlighting that ETH is once again trading at the top of its recent range. A breakout above this level could confirm the beginning of a larger expansion phase for altcoins. With bullish momentum building and Ethereum holding strong above reclaimed support levels, traders are becoming increasingly confident that the altcoin market may be on the verge of a broader breakout. However, key resistance still lies ahead, and the next few days will be crucial in determining whether Ethereum has the strength to continue higher and lead a new leg up in the crypto cycle. Ethereum Trades at Range Highs: Breakout Looms Ethereum has spent the past several weeks consolidating in a well-defined range between approximately $2,400 and $2,800, a structure that began forming in early May. Despite short-term volatility, ETH has held key support levels, suggesting that bulls remain in control. Now, with price action pushing toward the upper boundary of the range once again, the market is watching closely to see whether Ethereum can break through resistance and initiate a sustained rally. The broader macroeconomic backdrop has shifted in favor of risk assets. In the US, strong labor market data and wage growth have helped ease concerns of an economic slowdown. Meanwhile, the resolution of several global geopolitical tensions has reduced uncertainty, allowing markets to stabilize. This supportive environment could give Ethereum the fuel it needs to attempt a breakout. Ted Pillows recently highlighted that Ethereum is now trading at the range highs again — a level that has repeatedly capped price advances in recent months. According to Pillow, a confirmed breakout above the $2,800 resistance would likely trigger renewed momentum for ETH and potentially spark a broader move across the altcoin market. Related Reading: Ethereum Price Action Signals Momentum Shift: BTC Sleeps And ETH Moves $2,800 Resistance Now In Sight Ethereum is showing renewed strength as it breaks out of a multi-week consolidation range, with the latest 12-hour candle closing above $2,760. The price action has decisively reclaimed the $2,700 level and is now testing the critical $2,800 resistance zone. This breakout is supported by a clear surge in volume, confirming bullish momentum. The 50, 100, and 200-period moving averages are all trending upwards and currently sit well below the current price, a strong technical sign of sustained momentum. ETH has moved above all three key SMAs, confirming that bulls are in control in the short to medium term. Notably, this is the highest ETH has traded since early June, and the candle structure resembles a classic continuation breakout setup. Related Reading: ERC-20 Stablecoin Supply Hits All-Time High At $121B – Liquidity On The Rise A successful daily close above $2,800 would open the door for an expansion toward the $3,000 level and potentially higher if momentum holds. However, the key now lies in whether buyers can sustain this move without immediate rejection at resistance. If ETH can hold above $2,700 and build support, the breakout could serve as a launchpad for altcoins, especially as Ethereum often leads broader market moves. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "‘Real’ Crypto Bull Run Just Beginning, Says Analyst—Here’s Why",
      "link": "https://www.newsbtc.com/news/real-crypto-bull-run-just-beginning-analyst/",
      "summary": "In a livestream broadcast on X, independent market technician Kevin, known online as @Kev_Capital_TA, argued that crypto markets are only now entering what he called “the real bull run,” pointing to a confluence of technical signals, macroeconomic data and inter-market correlations that he believes have not been fully appreciated by traders. The Real Bull Run Starts Here Kevin placed particular emphasis on the behavior of Tether dominance (USDT.D), the share of crypto market capitalization held in the dollar-pegged stablecoin. The analyst displayed two long-term logarithmic USDT.D charts, each showing an initial sharp decline followed by what he described as a “rising channel slash bear flag.” In both 2024 and the present structure, the measured-move target of the pattern sits at 3.70 percent. “It’s really astonishing how this is kind of attempting to play out,” he said, stressing that any sustainable rally in risk assets will require that level to be reached. “The two key words that are going to be the most important words over the next couple of weeks are follow through.” Related Reading: Crypto Market Cap On Track To $4.5 Trillion As Q3 Unfolds – Details He then overlaid a macro descending triangle on a separate two-week USDT.D chart dating back to March 2020. Each time the two-week Stochastic RSI crossed downward, the dominance metric fell sharply, coinciding with periods of strength in Bitcoin and altcoins. The latest cross, now curling lower, again targets 3.70 percent. If that support were to give way, Kevin allowed, a deeper slide toward “the two-percent handle” could mark a “peak bull market” phase—though he cautioned against speculating that far ahead. The technical discussion broadened to Bitcoin’s hash-ribbon indicator, which tracks miner capitulation and recovery. Historically, weekly “buy” signals have preceded 40 to 100 percent upside moves within nine weeks, with what Kevin called a “100 percent hit rate” over eight years of back-testing. Kevin linked the on-chain data to macro conditions. Citing the real-time inflation gauge “Truthflation,” he highlighted a 1.66 percent reading—below the Federal Reserve’s nominal 2 percent target—and falling import prices, both of which, he argued, increase the odds of an imminent shift to easier policy. “If Truthflation stays below 2 percent, you’re going to get the easing you want,” he said, predicting that markets would price in an end to quantitative tightening ahead of any official announcement. “Retail traders are becoming more educated than they’ve ever been.… The market will sniff out rate cuts coming.” Altcoin capital rotation formed a second pillar of the bullish thesis. Ethereum’s market-share chart, he said, had been basing at 2019-2020 lows, with monthly MACD, Stochastic RSI and Market Cipher signals all turning up. Early reallocations into ETH-beta names such as Chainlink and Uniswap are already “up 60 percent” from their accumulation zones, he claimed, framing the moves as the foothills of a broader run. Nonetheless, he warned viewers not to wait for central-bank confirmation: “Don’t be the person sitting on the sidelines waiting for Powell to come out saying QT is over.” Related Reading: XRP Set To Shock The Crypto Market With 30% Share, Analyst Predicts Turning to Bitcoin itself, Kevin acknowledged that the benchmark still faces substantial resistance. Price must clear the March record, then the $112,000–$116,000 range and, ultimately, $120,000 before “thin air” opens a path to $140,000–$150,000. Similarly, the “total three” index—market cap excluding Bitcoin and Ethereum—needs a daily close above $877 billion and, crucially, the yellow-shaded resistance band that has capped rallies five times since February. Only then, he argued, would a new all-time high for the broader alt-basket come into view. Despite the optimism, Kevin repeatedly returned to the notion that conviction without confirmation is premature. “We need to see real deal price action,” he said, noting that Bitcoin’s daily RSI has not reached the 90-plus “euphoria” zone since 2017. He called"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "KULR Technology Increases Bitcoin Holdings to $101 Million",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million\" rel=\"nofollow\"> </a></p> <p>KULR now holds 1,021 BTC, reporting a 291% BTC yield year to date.</p> <p>"
    },
    {
      "title": "K Wave Media Raises $1 Billion For Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/K-Wave-Media-Raises-1-Billion-For-Bitcoin-Treasury-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>K Wave Media Inc. has announced a $500 million convertible note agreement with Anson Funds to support its Bitcoin treasury strategy. This financing follows an earlier $500 million standby equity purchase agreement with Bitcoin Strategic Reserve, bringing the company’s total capital capacity to $1 billion. As part of the Anson agreement, K Wave will issue [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: Sidechains",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-sidechains",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Layer-2-Sidechains.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-sidechains\" rel=\"nofollow\"> </a></p> <p>The fourth article in the Bitcoin Layer 2 series. This article covers sidechains, a concept originally proposed by the founders of Blockstream.</p> <p>"
    },
    {
      "title": "Bitcoin Hits New All Time High at $112,000 As Corporations Buy Record Amounts of BTC",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-at-112000-as-corporations-buy-record-amounts-of-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-at-112000-As-Corporations-Buy-Record-Amounts-of-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-at-112000-as-corporations-buy-record-amounts-of-btc\" rel=\"nofollow\"> </a></p> <p>Bitcoin's ATH signals a new era of institutional adoption, with major players like BlackRock, Strategy, and Smarter Web Company expanding their commitment to the digital asset.</p> <p>"
    },
    {
      "title": "Donald Trump Jr. Invests $4 Million in Bitcoin Treasury Company Thumzup Media",
      "link": "https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Donald-Trump-Jr.-Invests-4-Million-in-Bitcoin-Treasury-Company-Thumzup-Media.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media\" rel=\"nofollow\"> </a></p> <p>The social media firm, which reported just $151 in revenue last quarter, has drawn Trump Jr.’s interest after adopting a Bitcoin treasury strategy.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin Treasury Company Rumble to Launch Crypto Wallet With MoonPay",
      "link": "https://decrypt.co/329542/bitcoin-treasury-company-rumble-crypto-wallet-moonpay",
      "summary": "Publicly traded video sharing platform Rumble is launching its own crypto wallet after establishing a Bitcoin treasury."
    },
    {
      "title": "Myriad Protocol Launches With Multichain Expansion to Ethereum L2 Linea",
      "link": "https://decrypt.co/329492/myriad-protocol-launches-with-multichain-expansion-to-ethereum-l2-linea",
      "summary": "With key components being built on EigenCloud, Myriad Protocol is designed to power prediction markets \"everywhere, for everyone.”"
    },
    {
      "title": "BTC HITS ATH, PUMPFUN RELEASES TOKENOMICS, PENGU SOARS",
      "link": "https://decrypt.co/videos/interviews/IstwaMiY/btc-hits-ath-pumpfun-releases-tokenomics-pengu-soars",
      "summary": "BTC hits new ATH, ETH leads majors. ETH heading to $10k: Hayes. BTC overtakes Alphabet in market value. Whale fumbles $26m profit from ETH short. Emirates signs with Cryptocom for crypto integration. Strategy now has $24b unrealised BTC profit. BTCS to buy $225m ETH, stock pumps 2x. Gamesquare stock doubles in a day. Sharplink only behind ETH foundation in ETH holdings. XRP to custody $500m RLUSD with BNY Mellon. Circle made a revenue share deal with Bybit. Kraken, Backed to expand xStocks to BNB chain. Bitget launches six tokenised stock products. Ant Group to integrate USDC"
    },
    {
      "title": "Snoop Dogg’s Telegram NFT Drop Sold Out in Half an Hour",
      "link": "https://decrypt.co/329480/snoop-doggs-telegram-nft-drop-sold-out-in-half-an-hour",
      "summary": "The collab with Telegram’s TON blockchain appears to show that celebrity-led NFTs, at least on apps like it, aren’t entirely dead."
    },
    {
      "title": "Circle's USDC Is Being Adopted by Jack Ma Payment Giant Ant Group",
      "link": "https://decrypt.co/329488/circles-usdc-jack-ma-payment-giant-ant-group",
      "summary": "The Chinese parent company of Alipay is set to incorporate the stablecoin into its blockchain platform, as per unconfirmed reports."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump says Bitcoin and tech boom show US economy is back, urges Fed to cut rates",
      "link": "https://cryptobriefing.com/us-economy-boom-bitcoin-tech/",
      "summary": "<p>Trump's call for rate cuts amid tech and Bitcoin surges highlights tensions between market optimism and cautious monetary policy.</p> <p>"
    },
    {
      "title": "Coinbase, Perplexity AI join forces to enhance crypto data access for traders",
      "link": "https://cryptobriefing.com/ai-crypto-data-coinbase-perplexity/",
      "summary": "<p>This collaboration could accelerate mainstream crypto adoption by enhancing data accessibility and informed decision-making for traders.</p> <p>"
    },
    {
      "title": "Jack Ma-backed Ant Group to adopt USDC for its blockchain platform to power cross-border payments, crypto transactions",
      "link": "https://cryptobriefing.com/usdc-blockchain-adoption-ant-group/",
      "summary": "<p>Ant Group's USDC integration may enhance stablecoin adoption globally, influencing cross-border payments and regulatory frameworks in Asia and Europe.</p> <p>"
    },
    {
      "title": "xAI introduces Grok 4; Musk predicts Grok will start inventing new technologies by 2026",
      "link": "https://cryptobriefing.com/grok-4-ai-model-xai/",
      "summary": "<p>Grok 4's advancements could revolutionize technology and physics, potentially reshaping industries and scientific understanding by 2026.</p> <p>"
    },
    {
      "title": "Ben ‘BitBoy’ Armstrong faces six charges for harassing phone calls, released after arrest",
      "link": "https://cryptobriefing.com/bitboy-legal-troubles-armstrong-arrest/",
      "summary": "<p>The ongoing legal issues surrounding Ben Armstrong highlight the potential reputational risks and legal challenges for crypto influencers.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Chainlink rebounds – Could $18 be LINK’s next stop? Assessing…",
      "link": "https://ambcrypto.com/chainlink-rebounds-could-18-be-links-next-stop-assessing/",
      "summary": "<img alt=\"LINK\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-10T130858.011-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Buy-side strength grows for Chainlink, but mixed on-chain signals challenge a sustained rally toward $18."
    },
    {
      "title": "Tokenized securities are still securities – SEC Peirce’s warning!",
      "link": "https://ambcrypto.com/tokenized-securities-are-still-securities-sec-peirces-warning/",
      "summary": "<img alt=\"SEC tokenized securities\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/SECtokenizedsecuritiesPeirce-1.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitwise CIO projects that tokenized market could grow 4000x and can be maximized in these ways..."
    },
    {
      "title": "Top 6 Play-to-Earn NFT games to try in July 2025!",
      "link": "https://ambcrypto.com/top-6-play-to-earn-nft-games-to-try-in-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/javier-martinez-hUD0PUczwJQ-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />NFTs, or Non-fungible tokens, are digital identifiers or cryptographic tokens that cannot be copied. They [&#8230;]"
    },
    {
      "title": "Bitcoin: Here’s why $112K could be just the start of BTC’s rise!",
      "link": "https://ambcrypto.com/bitcoin-heres-why-112k-could-be-just-the-start-of-btcs-rise/",
      "summary": "<img alt=\"Bitcoin&#039;s rise\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika-10.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is BTC’s early July breakout setting the stage for a parabolic Q3 run?"
    },
    {
      "title": "Why Exchanges Freeze Your Funds: Real Cases and Risks",
      "link": "https://ambcrypto.com/why-exchanges-freeze-your-funds-real-cases-and-risks/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/kelly-sikkema-zcAgxLryKe4-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ScanMyWallet.Network — an aggregator of services for checking cryptocurrency wallets for AML (Anti-Money Laundering) risks. [&#8230;]"
    }
  ]
}