{
  "CoinDesk": [
    {
      "title": "CoinDesk 20 Performance Update: Filecoin (FIL) Drops 2% as Index Trades Lower",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/27/coindesk-20-performance-update-filecoin-fil-drops-2-as-index-trades-lower",
      "summary": ""
    },
    {
      "title": "Bolt Embraces Stablecoin Payments for Global Marketplaces as Digital Dollar Race Heats Up",
      "link": "https://www.coindesk.com/business/2025/06/27/bolt-embraces-stablecoin-payments-for-global-marketplaces-as-digital-dollar-race-heats-up",
      "summary": ""
    },
    {
      "title": "Short COIN/Long BTC Trade Will Be a Winner as Soaring Coinbase Nears Overvaluation: 10x Research",
      "link": "https://www.coindesk.com/markets/2025/06/27/time-to-short-coinbase-coin-and-long-bitcoin-btc-as-high-flying-coinbase-nears-overvaluation-10x-research",
      "summary": ""
    },
    {
      "title": "Tokenization Firm Midas Introduces Private Credit Product with Fasanara, Morpho and Steakhouse",
      "link": "https://www.coindesk.com/business/2025/06/27/tokenization-firm-midas-introduces-private-credit-product-with-fasanara-morpho-and-steakhouse",
      "summary": ""
    },
    {
      "title": "Crypto’s Worst Six Months Yet? North Korea Hacks Lead to $2.1B in Thefts",
      "link": "https://www.coindesk.com/markets/2025/06/27/cryptos-worst-six-months-yet-north-korea-hacks-lead-to-21b-in-thefts",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Across Protocol DAO under fire over $23M fund misuse claims",
      "link": "https://cointelegraph.com/news/across-protocol-founders-accused-of-funneling-23m-to-own-company?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDMwZjUtMWU5Yy03ODlkLTk1MzktOGJjNmQ1MjE5OGU5.jpg\" /></p><p>Across Protocol founders are accused of manipulating DAO governance to funnel $23 million in tokens to their affiliated for-profit company, Risk Labs.</p>"
    },
    {
      "title": "Small crypto trading prodigy nets $1.5M using unorthodox strategy",
      "link": "https://cointelegraph.com/news/crypto-trader-turns-6800-into-1-5m-using-maker-volume-strategy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2IxMmQtZjYxYS03M2ViLTg4MjItYWNkOWM1MzUxYThi.jpg\" /></p><p>A crypto trader turned $6,800 into $1.5 million with a one-sided quoting strategy, dominating over 3% of maker volume on a major exchange in just two weeks.</p>"
    },
    {
      "title": "Bitcoin Treasury Corporation to relist on Toronto exchange, buys 292 BTC",
      "link": "https://cointelegraph.com/news/bitcoin-treasury-resumes-tsxv-trading-raises-92m-buys-292-btc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2IwZGEtNjUzOC03OTU3LWIzNDktNTUxYjI1Yzg5NDBl.jpg\" /></p><p>Bitcoin Treasury Corporation completed a $92 million raise and bought 292.8 BTC ahead of its trading resumption on the TSX Venture Exchange.</p>"
    },
    {
      "title": "Three signs that XRP price will soon break out after 4-month consolidation",
      "link": "https://cointelegraph.com/news/xrp-price-will-soon-break-out-after-4-month-consolidation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzg3MTUtNGYwNS03MDE5LTlhNzAtNGIzN2U2YmY3NDU0.jpg\" /></p><p>XRP price fundamental and technical indicators are giving bulls hope that the current consolidation sets the stage for a move toward $5.</p>"
    },
    {
      "title": "Bitcoin long-term holders stack 800K BTC per month in record hodl run",
      "link": "https://cointelegraph.com/news/bitcoin-long-term-holders-stack-800-btc-per-month-record-hodl-run?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGM4Y2QtNjRlYi03ZGIxLTliNmQtOGM5N2Y4ZjQ5OGZm.jpg\" /></p><p>Bitcoin long-term holder supply has increased at a record rate over the past month, data from CryptoQuant reveals.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin near all-time high as dollar slides to three-year low",
      "link": "https://cryptoslate.com/bitcoin-near-all-time-high-as-dollar-slides-to-three-year-low/",
      "summary": "<p>Bitcoin is holding firm near historic highs as the U.S. dollar tumbles to its weakest level in more than three years, spotlighting the fragile dance between crypto prices and the world’s dominant reserve currency. As of Friday morning in London, Bitcoin traded at $107,639, up around 9.8% since the start of the year and 6% [&#8230;]</p> <p>"
    },
    {
      "title": "Grayscale’s top 20 crypto picks include Avalanche and Morpho, skips heavyweights XRP, ADA",
      "link": "https://cryptoslate.com/grayscale-snubs-heavyweight-xrp-in-top-20-crypto-list/",
      "summary": "<p>Grayscale has updated its Top 20 crypto assets for the third quarter of 2025, naming Avalanche (AVAX) and Morpho as new entrants while dropping Optimism and Lido DAO, according to a July 26 report. The firm emphasized that the changes reflect a research-driven selection process that favors on-chain traction over popularity or market capitalization. Following [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto heists reach $2.1B so far in 2025 as state-backed hackers ramp up attacks",
      "link": "https://cryptoslate.com/crypto-heists-reach-2-1b-so-far-in-2025-as-state-backed-hackers-ramp-up-attacks/",
      "summary": "<p>The first half of 2025 exposed deep vulnerabilities in the crypto industry, with hackers stealing over $2.1 billion across 75 separate incidents. This marks a 10% increase from the previous H1 record of $2 billion in 2022 and nearly matches the full-year figure for 2024, which closed at $2.2 billion, according to a report from [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin market cap overtakes Google’s $2.1 billion valuation as crypto equities also rise",
      "link": "https://cryptoslate.com/bitcoin-market-cap-overtakes-googles-2-1-billion-valuation-as-coinbase-stock-jumps-on-stablecoin-hopes/",
      "summary": "<p>Bitcoin has overtaken Google’s parent Alphabet to become the world’s sixth most valuable asset, and is now sitting within a few percent of Amazon. The move comes amid a renewed burst of crypto optimism, as Coinbase stock surges on imminent U.S. stablecoin regulation. This one-two punch of market and policy news is fuelling speculation that [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase hints at Bitcoin treasury as COIN stock reaches new heights",
      "link": "https://cryptoslate.com/coinbase-hints-at-bitcoin-treasury-as-coin-stock-reaches-new-heights/",
      "summary": "<p>Coinbase CEO Brian Armstrong has revealed that the exchange is steadily acquiring Bitcoin weekly, signaling what many believe could be the early stages of a treasury-building effort. Armstrong shared the update on June 27, stating that Coinbase has adopted a “Long Bitcoin” strategy. However, he stopped short of confirming whether these acquisitions are explicitly intended [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "$15B Bitcoin Options Expire Today: Will This Send BTC Bull Token Soaring?",
      "link": "https://www.newsbtc.com/news/15b-bitcoin-options-expire-today-will-this-send-btc-bull-token-soaring/",
      "summary": "Bitcoin traders everywhere will be watching their feeds closely, willing the world’s largest crypto to hold steady at or near its current $107K mark. $15B in Bitcoin options expire today, a major portion of the roughly $40B in options outstanding. If $BTC’s price falls to $102K or below, the market would endure a true ‘pain point.’ As long as that doesn’t happen, Bitcoin looks set to press on with business as normal – setting the stage for further growth of the ecosystem and the first meme coin offering direct $BTC exposure, BTC Bull Token ($BTCBULL). Narrowing Volatility Indicates Positive Outlook The $BTC volatility index has narrowed in recent days, drawing more closely to the historical volatility and generally indicating that traders don’t expect dramatic price moves either way – up or down. That was supported by Deribit Chief Commercial Officer Jean-David Péquignot, who stated: ‘Low open interest in perps and fairly depressed Bitcoin implied volatility and skew are indicative of limited expectations for sharp price movements…’ Where does that leave Bitcoin? Still looking bullish. Crypto treasury strategies are still expanding, adding thousands of $BTC tokens to long-term reserves and increasing demand. Metaplanet just added 1,234 $BTC, bringing its total portfolio north of 12K $BTC. And it isn’t just direct Bitcoin purchases; the ecosystem around the world’s leading crypto continues to fuel demand. ETFs Notch 13 Days Consecutive Inflows, Bitcoin Overtakes Google Bitcoin ETFs are building on a 13-day stretch of positive inflows. Monday to Thursday, daily cumulative inflows amounted to: $350M $588M $547M $226M Positive inflows point to long-term interest from retail and institutional investors, rather than short-term traders, and contribute to underlying buying pressure. And with the largest Bitcoin ETF, BlackRock’s iShares Bitcoin Trust, holding over $70B in total assets, Bitcoin took advantage of weakening Alphabet stock to overthrow Google as the world’s sixth-largest asset. It’s a combination of fundamentally positive factors, reinforcing a bullish case for $BTC – and the meme coin built on that case. BTC Bull Token ($BTCBULL) – Meme Coin Trusting $BTC to Hit $250K and Beyond BTC Bull Token ($BTCBULL) is confident that Bitcoin will one day reach $250K and more – so confident that the project is built around key Bitcoin price milestones. Bitcoin $125K: The project burns $BTCBULL tokens to exert deflationary pressure on the price. Bitcoin $150K: BTC Bull token investors who hold their tokens in the Best Wallet app receive a free $BTC airdrop. Bitcoin $175K: Another $BTCBULL token burn. Bitcoin $200K: Another $BTC airdrop! Bitcoin $225K: A final $BTCBULL burn. Bitcoin $250K: A massive $BTCBULL airdrop. The combination of token burns and airdrops encourages positive momentum for BTC Bull Token, following Bitcoin’s upward trajectory. The presale has raised $7.5M so far. Only three days remain in the presale, so act now – you can learn how to buy BTC Bull token in our guide. Tokens currently cost $0.00258, but our analysts expect the price to hit $0.0084 by year-end. Visit the BTC Bull token website today. BTC Options Expire, But Outlook Is Bullish for Bitcoin With $15B in Bitcoin options expiring, narrowing volatility, and consistent ETF inflows, Bitcoin’s foundation looks stronger than ever. For investors looking to capitalize on Bitcoin’s momentum, BTC Bull Token offers a bold, milestone-based roadmap aligned with $BTC’s rise to $250K. But be warned – there’s mere days left in the presale, so the window to join is closing fast. Always do your own research. This is not financial advice."
    },
    {
      "title": "Bitcoin Lockdown: 14 Million BTC Now In Cold Storage As Holders Dig In",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-lockdown-14-million-btc-now-in-cold-storage-as-holders-dig-in/",
      "summary": "According to on-chain analytics firm Glassnode, more than 14 million Bitcoin have sat idle in wallets with little to no spending history. That leaves only about 7 million BTC out of the total 21 million supply ready for trading. This shift points to a growing number of holders who prefer long-term storage over quick trades. Related Reading: Double Win: Dogwifhat Jumps 24% Alongside Bitcoin’s $107K Push Steep Rise In Illiquid Bitcoin Based on reports, the illiquid supply of Bitcoin climbed from just under 14 million in December 2024—when Bitcoin first broke the $100K mark—to roughly 14.30 million today. Demand for cold storage and self-custody solutions has never been higher. Investors are moving coins off exchanges and into private wallets. That trend has been especially sharp since late March, even though price swings have stayed volatile. Bitcoin&#8217;s illiquid supply just crossed 14 million $BTC More and more holders are pulling coins off exchanges choosing cold storage over quick trades. The message is clear: conviction is growing, and they’re here for the long haul. #Bitcoin #BTC #CryptoHODL pic.twitter.com/bQozg31mBK — Erica Hazel (@Erica__Hazel) June 26, 2025 Corporate Buyers Ramp Up Holdings In just the past week, more than five companies announced new Bitcoin purchases. ProCap BTC led the way with two buys: 3,724 BTC for $387 million and 1,208 BTC for $128 million, adding up to 4,930 BTC worth $515 million. Michael Saylor’s Strategy added 245 BTC after spending $1 billion the week before. Smarter Web picked up 197 BTC, while Méliuz S.A. acquired 275 BTC, taking its total to 596 BTC. The Blockchain Group chipped in with 75 BTC, bringing its haul to 1,728 BTC. Most recently, Metaplanet spent around $132 million on 1,234 BTC, lifting its total Bitcoin stash to 12,345 BTC purchased for about $1.20 billion. Supply Numbers Tighten Only one-third of Bitcoin’s fixed supply remains “liquid,” meaning it’s likely to trade hands. That squeeze could make it harder for new buyers to find inventory. Over-the-counter desks and exchange order books report thinner BTC listings. When institutions can’t source coins as easily, they may bid prices higher. On-chain metrics can’t tell us why coins are unmoved—some may be lost forever—but the uptick in self-custody transfers shows real demand. Related Reading: TRUMP Token In Trouble? Over $4 Million Liquidity Exit Sparks Crash Fears Forecasts Suggest Price Pressure Ahead At Bitcoin Conference 2025, Eric Trump predicted that he believes BTC will hit $170K at the end of 2026. He pointed out that the number of firms with Bitcoin has doubled in the last year. But if a supply crunch is matched with steady or increasing demand, prices might experience a strong push higher. Yet markets may remain unpredictable. Unexpected sell-offs or macro shocks can turn the trend around quicker than anyone can imagine. Investors and analysts will be monitoring the pace of new entrants into the market. For the time being, a record 14.35 million Bitcoin are sleeping idle, and that constricted supply may lay the groundwork for the next great rally. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Top Analyst Predicts New Bitcoin Peak Timeline And ‘Double Cycle Blowoff’",
      "link": "https://www.newsbtc.com/bitcoin-news/top-analyst-new-bitcoin-peak-timeline-double-cycle-blowoff/",
      "summary": "Veteran crypto analyst Bob Loukas has delivered a Bitcoin update suggesting that the asset could be entering the “perfect storm” phase of its four-year cycle. But in a twist that defies traditional cycle models, Loukas now sees the possibility of a delayed blowoff top extending into early 2026 and introduces the prospect of a rare double-cycle structure. In his latest installment of the Four-Year Journey published on June 26, Loukas reaffirms that the current Bitcoin cycle — which began with the November 2022 low — remains structurally intact and is nearing its climactic phase. &#8220;This is certainly the most bullish phase of the four-year cycle,&#8221; Loukas states. &#8220;We&#8217;re now sort of on the cusp of what traditionally has been the beginning or the blowoff phase of a cycle.&#8221; Bitcoin Blowoff Delayed? What separates this cycle, according to Loukas, is the unique combination of maturing fundamentals and a confluence of macro, institutional, and regulatory forces. These include continued ETF inflows, corporate treasury adoption, and a radical policy shift under the Trump administration, including what he anticipates may be a pro-crypto Fed chair appointment. Together, these forces are creating what he calls a “perfect storm” for price expansion. Related Reading: Is The Bitcoin Top In? Bitcoin MVRV-Score Has The Answer Loukas is cautious about providing hard price targets but acknowledges a doubling effect that could send Bitcoin from its current range near $110,000 to as high as $150,000–$170,000 in the short term. Historically, such phases have seen Bitcoin double in a matter of months once new highs are breached. “A breakout to the upside can see Bitcoin essentially almost double in a very short period of time,” he says, pointing to prior legs of the cycle where Bitcoin surged from $25K to $75K or $50K to $100K within five-month windows. Yet what makes this latest report particularly notable is Loukas&#8217; introduction of a more complex structure he calls a “double cycle blowoff.” He describes this as a fusion of two adjacent four-year cycle peaks — a concept that could delay the market top to as late as February or March 2026, well beyond the traditional 35-month cycle peak window. &#8220;If we&#8217;ve still got sort of a six to seven month expansion to a peak… that would lead us into maybe even a February or March peak,” Loukas explains. This scenario, while still within the broader cyclical rhythm, would imply a 39–41 month uptrend rather than the typical 33–35 months. “I do think it’s time… 15–16 years into Bitcoin’s adoption,” he notes, referencing the arc from early tech believers to deep institutional penetration. Related Reading: $179,000 Or $79,000? Bitcoin Faces Critical Cycle Pivot, Says Analyst The implications are significant. A delayed peak could mean a much shorter corrective phase — or even the emergence of a second explosive rally as the next cycle begins, creating what Loukas describes as the illusion of one extended supercycle. “There’s a significant upside potential still to come in this cycle,” he says, warning that many may be caught off guard. “You don’t want to be surprised.” BTC Price Targets Loukas also addresses the broader sentiment picture, noting that the typical mania — the kind that marked tops in 2017 and late 2021 — has not yet materialized. “We haven’t seen that sort of blowoff, absolute extreme sentiment that you typically would see near the top,” he says. He sees this as further evidence that the final phase is still ahead. Regarding the price target for a supercycle, Loukas ponders: “I can see numbers in the quarter of a million level. I can also see some really crazy numbers when you see prior manias and bubbles in different asset classes, [&#8230;] Seeing a 5x, 6x, 7x move from here over a 2-year period in a major mania is not really a stretch. Even from a market cap perspective, it&#8217;s not a stretch, seeing where gold is already heading through the $20 trillion level and well beyond.” While he emphasizes that these ideas are probabilistic and not predictions, Loukas does warn of the long-term consequences if his double-cycle thesis plays out. A massive influx of institutional capital, sovereign interest, and retail mania could ultimately trigger Bitcoin’s first true secular bear market, one not measured in months but in years. “If you consider a mania leadup where so many treasury companies and traditional flows come together and peak… the unwinding process just takes a lot longer.” For now, Loukas’ model portfolio remains partially in cash after trimming some positions near recent highs, reflecting a conservative approach tailored to capital preservation. Still, he acknowledges that younger or more risk-tolerant investors may view this moment as a final accumulation window before the next phase begins. “This video is very, very bullish, right?” he quips. At press time, BTC traded at $107,317. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "XRP Price Declines Back To $2 As Legal Dispute With SEC Continues",
      "link": "https://www.newsbtc.com/xrp-news/xrp-price-declines-back-to-2-as-legal-dispute-with-sec-continues/",
      "summary": "The XRP price experienced a significant decline on Thursday following new developments in the ongoing legal dispute between Ripple Labs and the US Securities and Exchange Commission (SEC). Judge Analisa Torres&#8217; decision to deny the joint motion from Ripple and the SEC for an indicative ruling halted the XRP price recovery as it aimed to breach the nearest resistance level at $2.23. Key Issues Unresolved For Ripple Despite the SEC dropping its appeal, which indicated that the primary legal conflict between the two parties may be reaching a conclusion, Judge Torres&#8217; ruling highlighted that several procedural matters still require resolution, including necessary court approvals. In her judgment, she made it clear that private agreements cannot supersede public court decisions, stating, “The parties do not have the authority to agree not to be bound by a court’s final judgment… They have not come close to doing so here.” Related Reading: XRP Gears Up For Major Move — Chart Signals Are Clear In response to the ruling, Ripple&#8217;s Chief Legal Officer, Stuart Alderoty, took to social media platform X (formerly Twitter) to convey that the situation is now back in Ripple&#8217;s hands. The executive pointed out that the court has given them two options: either to dismiss their appeal regarding the historic institutional sales or to continue with the appeal. Regardless of the path chosen, Alderoty emphasized that XRP&#8217;s legal status as a non-security remains intact, reassuring stakeholders that it is business as usual. Expert Reactions To Torres’ Decision Legal expert Fred Rispoli also weighed in on the implications of the injunction, stating that it would not impact XRP in secondary markets or affect potential exchange-traded fund (ETF) filings awaiting approval by the SEC. He noted that the injunction is merely a court document and emphasized the low likelihood of Judge Torres calling Ripple and the SEC back into court unless the SEC believes Ripple is violating the terms of the injunction. Rispoli further questioned whether the SEC has the authority to grant Ripple the necessary exemptions to alleviate any restrictions imposed by the injunction, suggesting that such actions fall within the SEC&#8217;s executive powers. Ripple has asserted that it has adjusted its operations to align with the court&#8217;s findings, particularly regarding its past sales to institutional investors. Related Reading: Is The Bitcoin Top In? Bitcoin MVRV-Score Has The Answer Alderoty&#8217;s use of the term &#8220;historic institutional sales&#8221; in his recent statement indicates a shift in how both parties might approach future transactions, signaling a potential settlement that would allow XRP sales to institutions in a manner acceptable to the SEC. XRP Price Could Reach $5 Despite this temporary setback, market analysts remain optimistic about XRP&#8217;s future. Crypto analyst CryptoBullet recently noted that XRP&#8217;s two-week price chart resembles patterns seen in 2017, including a significant accumulation phase and a potential breakout. With this historical context in mind, the expert predicts a final surge in the XRP price, forecasting new all-time high targets between $4.50 and $5.40 for the cryptocurrency. As of press time, the XRP price has retreated to the $2.08 mark, which is a key support level for bulls anticipating further recovery of the token. In the last 24 hours, XRP has dropped 4.4%, and 10% in the last month. According to CoinGecko data, the XRP price remains 38% below its record high of $3.40. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Deaton Says Ripple IPO Could Trigger $100B Valuation, How High Will The XRP Price Be?",
      "link": "https://www.newsbtc.com/analysis/xrp/ripple-ipo-100b-xrp-price/",
      "summary": "The possibilities of a Ripple Initial Public Offering (IPO) have become higher as time goes on and the company moves toward a complete resolution of its SEC lawsuit. With expectations of the IPO rising, possible valuations have started to fly around as the company is one of the largest cryptocurrency companies. Most notably, pro-XRP lawyer and community member John Deaton has proposed that the Ripple IPO could lead to the company being valued at over $100 billion. Deaton Puts Ripple At $100 Billion The comment and valuation from lawyer John Deaton come after Circle, the company behind the USDC stablecoin, successfully completed its Initial Public Offering (IPO). So far, the crypto firm has found a lot of success in the market, surging from an initial $5 billion valuation to over $63 billion in valuation post-IPO. Related Reading: Bitcoin To Surge To $130,000 Next? What The Wave Count Says Deaton responded to a post on X (formerly Twitter), highlighting this feat, pointing out how Ripple could be even more successful in this regard. He explains that despite Ripple CEO Brad Garlinghouse saying that the company was in no rush to go public, the IPO should be timed correctly to have the right impact. Pointing to the current market environment, he points out that if Circle can grow to a $63 billion valuation, then it means that Ripple can soar even higher. Given XRP’s standing in the market as the 4th-largest cryptocurrency, ahead of Circle’s USDC, which sits at 7th place, Deaton believes that Ripple’s valuation post-IPO can rise to $100 billion. “If Circle can hit a 62B-75B market cap then Ripple, with nearly 40B XRP, currently valued at $2 (ie $80B), could certainly hit a $100B market cap in this environment,” Deaton wrote. As Bitcoinist reported, Ripple had issued a $700 million tender offer with shares priced at $175. This now puts the equity valuation of the company at $25 billion with 141 million outstanding shares as investors look favorably at the crypto firm. How High Could The XRP Price Go? Market experts have speculated that if the Ripple IPO does go through and the valuation soars, the XRP price will soar in tandem. Crypto investor Dennis Liu shared a video that suggested a successful IPO would be positive for the XRP price. He points out that a symbiotic relationship of the XRP coin related to the Ripple stock would be the dream of investors. Related Reading: Bitcoin Price Could Rally To $110,000 ATH As These Macroeconomic Factors Align Other market experts have debated that the XRP price would go double-digits to rise above $10 if this happens. In some cases, the XRP price has been pegged as high as $100 if Ripple does complete its IPO and begins trading as a publicly listed company. Featured image from Dall.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Tahini’s Bitcoin Treasury: How a Family Chain Outsmarted Inflation",
      "link": "https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/tahini-bitcoin-2020-treasury-playbook.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation\" rel=\"nofollow\"> </a></p> <p>Tahini’s, a Canadian fast-casual chain, embraced Bitcoin in 2020, leveraging it to compete with giants like McDonald’s. Here’s their treasury playbook.</p> <p>"
    },
    {
      "title": "Coinbase to Launch US Nano Bitcoin Perpetual-Style Futures In July",
      "link": "https://bitcoinmagazine.com/news/coinbase-to-launch-us-nano-bitcoin-perpetual-style-futures-in-july",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-to-Launch-US-Nano-Bitcoin-Perpetual-Style-Futures-In-July.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-to-launch-us-nano-bitcoin-perpetual-style-futures-in-july\" rel=\"nofollow\"> </a></p> <p>Coinbase Derivatives to introduce long-dated, regulated futures contracts with 24/7 trading and spot price tracking.</p> <p>"
    },
    {
      "title": "Japan’s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC",
      "link": "https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Japans-Metaplanet-Acquires-1234-More-Bitcoin-Total-Holdings-Reach-12345-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc\" rel=\"nofollow\">Japan&#8217;s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC</a></p> <p>The Japanese company continues accelerating its Bitcoin treasury strategy with a ¥19.27 billion purchase.</p> <p>"
    },
    {
      "title": "Kraken Launches Krak, a No-Fee App to Use and Store Bitcoin and Crypto",
      "link": "https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Launches-Krak-a-No-Fee-App-to-Use-and-Store-Bitcoin-and-Crypto.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto\" rel=\"nofollow\"> </a></p> <p>Bitcoin and crypto platform Kraken has officially launched Krak, a no-fee, all-in-one global money app that lets users spend, send, and save across over 300 fiat and digital assets—including Bitcoin. Designed to merge the best of banking, payments, and crypto into a single user experience, the Krak app is set to redefine how people move [&#8230;]</p> <p>"
    },
    {
      "title": "Castle Raises $1M to Bring Automated Bitcoin Treasury to Small & Medium-Sized Businesses",
      "link": "https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Castle-Raises-1M-to-Bring-Automated-Bitcoin-Treasury-to-Small-Medium-Sized-Businesses-2.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses\" rel=\"nofollow\">Castle Raises $1M to Bring Automated Bitcoin Treasury to Small &amp; Medium-Sized Businesses</a></p> <p>Backed by Boost VC and Winklevoss Capital, Castle aims to help SMBs protect their balance sheets by automating bitcoin allocations.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Russian Mother and Self-Styled 'Crypto Expert' Jailed Over $23M Bitcoin Scam",
      "link": "https://decrypt.co/327389/russian-mother-and-self-styled-crypto-expert-jailed-over-23m-bitcoin-scam",
      "summary": "A Moscow court sentenced \"Bitmama\" to seven years in jail over a crypto scheme saw millions moved daily through informal deals."
    },
    {
      "title": "Bitcoin ETFs Notch 13 Consecutive Days of Inflow—Why It Matters",
      "link": "https://decrypt.co/327337/bitcoin-etfs-13-consecutive-inflow-days",
      "summary": "Most Bitcoin ETF inflows are driven by long-only fundamental investors, not short-term traders, analyst Peter Chung told ."
    },
    {
      "title": "MrBeast Pulls AI Thumbnail Tool Following Backlash",
      "link": "https://decrypt.co/327338/mrbeast-pulls-ai-thumbnail-tool-backlash",
      "summary": "The YouTube star has made key changes to an AI tool he recently launched, following copyright concerns from content creators."
    },
    {
      "title": "Coinbase US Perpetuals Are Arriving Next Month as Stock Soars to New Heights",
      "link": "https://decrypt.co/327312/coinbase-us-perpetuals-are-arriving-next-month-as-stock-soars-to-new-heights",
      "summary": "Coinbase aims to fill what it describes as a “critical gap” in the U.S. market, where domestic traders have long relied on offshore platforms."
    },
    {
      "title": "Bakkt Files to Sell Up to $1 Billion in Securities For Potential Bitcoin Play",
      "link": "https://decrypt.co/327309/bakkt-files-1-billion-securities-bitcoin-play",
      "summary": "The platform is seeking new capital following a policy update earlier this month, allowing it to hold Bitcoin on its balance sheet."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Elon Musk announces Grok 4 to be released just after July 4",
      "link": "https://cryptobriefing.com/grok-4-release-after-july/",
      "summary": "<p>Grok 4's release could redefine AI training by enhancing data accuracy and reducing bias, potentially transforming digital knowledge bases.</p> <p>"
    },
    {
      "title": "Octora AI brings real-time context to AI agents with a next-generation playground experience",
      "link": "https://cryptobriefing.com/real-time-ai-context-octora/",
      "summary": "<p>Octora AI's integration of real-time data access for AI agents could revolutionize AI applications by enhancing contextual understanding and decision-making.</p> <p>"
    },
    {
      "title": "Crypto exchange Bakkt files to raise up to $1 billion to support Bitcoin strategy",
      "link": "https://cryptobriefing.com/bakkt-bitcoin-strategy-funding/",
      "summary": "<p>Bakkt's fundraising could accelerate its shift towards crypto infrastructure, potentially influencing market dynamics and digital asset adoption.</p> <p>"
    },
    {
      "title": "US Treasury may release federal Bitcoin holdings report, says Bo Hines",
      "link": "https://cryptobriefing.com/us-bitcoin-holdings-treasury-report/",
      "summary": "<p>The potential release of the US Bitcoin holdings report could enhance transparency, influencing global crypto market dynamics and policy debates.</p> <p>"
    },
    {
      "title": "USDT on TRON surpasses $80 billion, strengthening TRON’s position as the leading stablecoin network",
      "link": "https://cryptobriefing.com/usdt-on-tron-stablecoin-leader/",
      "summary": "<p>USDT on TRON exceeds $80 billion in circulation, accounting for over half of global supply and leading active stablecoin network metrics.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Wiki Finance Expo Cyprus 2025: Europe’s Premier Fintech, Crypto & Forex Event!",
      "link": "https://ambcrypto.com/wiki-finance-expo-cyprus-2025-europes-premier-fintech-crypto-forex-event/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"675\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Event-Banner-2-1-scaled-e1751030464441.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1200\" />The highly anticipated Wiki Finance Expo Cyprus 2025 is set to take place in Limassol. [&#8230;]"
    },
    {
      "title": "Altcoins see a bullish shift, but why Ethereum, Dogecoin got left behind",
      "link": "https://ambcrypto.com/altcoins-see-a-bullish-shift-but-why-ethereum-dogecoin-got-left-behind/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-17.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Altcoins are flipping the script as capital moves to faster, utility-driven chains."
    },
    {
      "title": "Ethereum logs largest single-day whale buy since 2018 – Why this matters",
      "link": "https://ambcrypto.com/ethereum-logs-largest-single-day-whale-buy-since-2018-history-says/",
      "summary": "<img alt=\"Ethereum logs largest single-day whale buy since 2018 - History says...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-1-9.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will tightening supply be enough to push ETH toward $5,000?"
    },
    {
      "title": "Bakkt Holding’s $1B Bitcoin play: What this move means amidst market doubts",
      "link": "https://ambcrypto.com/bakkt-holdings-1b-bitcoin-play-what-this-move-means-amidst-market-doubts/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"637\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bakkt-Holdings-Inc.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1132\" />Can a firm with “substantial doubt” about survival lead the next wave of crypto corporates?"
    },
    {
      "title": "Ethereum’s $7.3 billion fee surge – How utility will fuel ETH",
      "link": "https://ambcrypto.com/ethereums-7-3-billion-fee-surge-how-utility-will-fuel-eth/",
      "summary": "<img alt=\"Ethereum&#039;s $7.3 billion fee surge - How utility will fuel ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-20.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Could Ethereum be quietly setting the stage for a Q3 comeback?"
    }
  ]
}