{
  "CoinDesk": [
    {
      "title": "Ripple to Drop Cross-Appeal Against SEC, Ending Years-Long Legal Battle With SEC",
      "link": "https://www.coindesk.com/policy/2025/06/27/ripple-to-drop-cross-appeal-against-sec-ending-years-long-legal-battle-with-sec",
      "summary": ""
    },
    {
      "title": "Bitvavo Secures a MiCA License From the Netherlands",
      "link": "https://www.coindesk.com/policy/2025/06/27/bitvavo-secures-a-mica-license-from-the-netherlands",
      "summary": ""
    },
    {
      "title": "Gemini Rolls Out Tokenized Stocks in EU, Starting With Strategy Shares",
      "link": "https://www.coindesk.com/business/2025/06/27/gemini-rolls-out-tokenized-stocks-in-eu-starting-with-strategy-shares",
      "summary": ""
    },
    {
      "title": "Anchorage to Phase Out USDC, Agora USD Citing Risks, Stirring Fierce Backlash",
      "link": "https://www.coindesk.com/business/2025/06/27/anchorage-to-phase-out-usdc-agora-usd-citing-risks-stirring-fierce-backlash",
      "summary": ""
    },
    {
      "title": "Core Scientific Could Top $30 on CoreWeave Buyout Deal: Cantor Fitzgerald",
      "link": "https://www.coindesk.com/markets/2025/06/27/core-scientific-could-top-30-on-coreweave-buyout-deal-cantor-fitzgerald",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Crypto scammer gets 8 years for $40M eEmpowerCoin, ECoinPlus scams",
      "link": "https://cointelegraph.com/news/crypto-scam-operator-gets-8-years-empowercoin-ecoinplus-jetcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjU5YTYtMzkzZi03N2M2LWE2NTAtYmM2NzQxYzZhNzkw.jpg\" /></p><p>Dwayne Golden sentenced to nearly eight years for defrauding investors in EmpowerCoin, ECoinPlus, and Jet-Coin schemes totaling over $40 million.</p>"
    },
    {
      "title": "XRP spikes 3% after Garlinghouse says Ripple dropping SEC cross-appeal",
      "link": "https://cointelegraph.com/news/xrp-price-ripple-labs-brad-garlinghouse-drops-sec-cross-appeal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDk5YjgtNDVjNi03MmY2LWI0YWYtZTgzYzM3NDU4MTkx.jpg\" /></p><p>XRP spiked Friday after Ripple CEO Brad Garlinghouse said the company is “closing this chapter once and for all” in its legal battle with the US regulator that began in December 2020.</p>"
    },
    {
      "title": "Gemini launches tokenized Michael Saylor&#039;s Strategy stock for EU investors",
      "link": "https://cointelegraph.com/news/crypto-exchange-gemini-tokenized-stock-michael-saylor-strategy-mstr?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2I0NGUtNGFjNy03MWQzLTkyZjYtYWNkZjIzYTNiZmNj.jpg\" /></p><p>Gemini says Strategy (MSTR) is its only tokenized stock for now, with more tokenized stocks and ETFs launching in \"the coming days.\"</p>"
    },
    {
      "title": "XRP price saw month-long 420% rally the last time this metric turned green",
      "link": "https://cointelegraph.com/news/xrp-price-saw-month-long-420percent-rally-the-last-time-this-metric-turned-green?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5Njg4NzUtNmYwYS03YmYzLTkwOWEtNzNjMDQxMDA2YWFj.jpg\" /></p><p>XRP whale flows flipped bullish in May after months of outflows, hinting at a potential triple-digit price rally.</p>"
    },
    {
      "title": "Bitcoin price holds range but needs fresh demand to break higher",
      "link": "https://cointelegraph.com/news/bitcoin-price-holds-range-but-needs-fresh-demand-to-break-higher?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2IyMDYtZjBmOS03ZDQ1LWJhMTktMGE4MjE0M2YwZTBi.jpg\" /></p><p>Bitcoin trades near key support at $104,000, but weak volume, fading onchain metrics, and sticky inflation point to more price consolidation.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Gemini launches tokenized US stock trading in EU starting with MSTR",
      "link": "https://cryptoslate.com/gemini-launches-tokenized-us-stock-trading-in-eu-starting-with-mstr/",
      "summary": "<p>Crypto exchange Gemini has launched tokenized Strategy (MSTR) shares for customers in the EU, marking the beginning of its rollout of tokenized U.S. equities on blockchain networks. The offering, enabled through a partnership with tokenization platform Dinari, allows Gemini users to buy fractional shares of Strategy as on-chain tokens backed by real securities. MSTR tokens [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto payments soar 630% in Bolivia, central bank reports $430M since lifting ban",
      "link": "https://cryptoslate.com/crypto-payments-soar-630-in-bolivia-central-bank-reports-430m-since-lifting-ban/",
      "summary": "<p>The Bolivian central bank reported on June 27 that domestic crypto transactions totaled $430 million in the 12 months since regulators reopened formal payment rails, a 630% jump over the previous year. The Banco Central de Bolivia (BCB) reported that users processed 10,193 operations worth BOB 611 million as of May 31, 2025, approximately $88 [&#8230;]</p> <p>"
    },
    {
      "title": "Ripple, SEC agree to mutually abandon appeals, ending 5-year legal battle",
      "link": "https://cryptoslate.com/ripple-sec-agree-to-mutually-abandon-appeals-ending-5-year-legal-battle/",
      "summary": "<p>Ripple will drop its cross-appeal in its prolonged legal battle with the U.S. Securities and Exchange Commission, signaling an end to one of the crypto industry’s most consequential court cases. Ripple CEO Brad Garlinghouse announced the move on social media on June 27 and also revealed that the SEC is expected to drop its appeal [&#8230;]</p> <p>"
    },
    {
      "title": "FATF sounds alarm over rising stablecoin misuse as global crypto rules lag",
      "link": "https://cryptoslate.com/fatf-sounds-alarm-over-rising-stablecoin-misuse-as-global-crypto-rules-lag/",
      "summary": "<p>The Financial Action Task Force (FATF) said in a report released this week that global efforts to regulate virtual assets and service providers have improved but remain incomplete, with illicit use of stablecoins accelerating sharply in 2025. The intergovernmental watchdog’s sixth targeted update on the implementation of its standards found that although 73% of jurisdictions [&#8230;]</p> <p>"
    },
    {
      "title": "Moonshot unveils memecoin creation with just a photo and Apple Pay",
      "link": "https://cryptoslate.com/moonshot-unveils-memecoin-creation-with-just-a-photo-and-apple-pay/",
      "summary": "<p>Moonshot added Apple Pay support for launching new memecoins on June 27, expanding its iOS application beyond buying and trading tokens to include a creation workflow that requires only a photo upload and a tap on the “Create” tab. Branded Moonshot Create, the product allows any user to mint a Solana-based coin by submitting an [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Stablecoin Skepticism Grows As IMF Official Challenges Their Money Role",
      "link": "https://www.newsbtc.com/stablecoin/stablecoin-skepticism-grows-as-imf-official-challenges-their-money-role/",
      "summary": "According to a recent analytics, stablecoins handled 35 trillion in on-chain transaction volume over the past year, with their average supply hovering around 195 billion. Related Reading: TRUMP Token In Trouble? Over $4 Million Liquidity Exit Sparks Crash Fears Those numbers show how much these tokens fuel trades, loans and cross-border transfers. Yet questions about whether they really count as “money” are now front and center. Stablecoin On-Chain Traffic Based on reports, stablecoins have become the workhorses of crypto trading. Volume hit 35 trillion in the last 12 months. At the same time, their circulating supply stayed at 194.6 billion. That steady supply suggests tokens like USDC and USDT are parked, ready for the next move. Traders shift them in and out of Bitcoin and altcoins. Payment platforms weave them into digital rails. The scale is hard to ignore. IMF Deputy MD Raises Money Question According to IMF Deputy Managing Director Bo Li, the big challenge is classification. Are stablecoins part of M0, M1 or a new category altogether? He posed those questions at the 2025 World Economic Forum in Davos. Getting that wrong could reshape how banks set reserves and how regulators cut red tape. Li also pointed out that policy experiments are popping up all over. Some of them may not survive a real stress test. Key Takeaways: IMF’s Bo Li said regulatory uncertainty around stablecoins persists, especially regarding classification and enforcement. Global financial bodies are working to align frameworks but… https://t.co/V75hFYV5pX #Stablecoin #Cryptocurrency #IMF #Regulation #Finance — Entrepreneur_cm (@entrepreneur_cm) June 25, 2025 National Rules Diverge Based on policy outlines, the US is moving ahead with the GENIUS Act. Europe has drafted its own rulebook. Over in Asia, Hong Kong plans to roll out its Stablecoin Ordinance in August 2025. Those efforts show a strong push to make rules more clear. But they also underscore a lack of global unity. Businesses could face one set of rules in New York, another in Brussels and a third in Hong Kong. That patchwork approach risks adding costs for firms and confusion for users. Global Bodies Seek Cooperation According to Bo Li’s remarks, fragmented rules carry real risks. He warned that gaps in enforcement might let bad actors slip through. To avoid that, the IMF is teaming up with the Financial Stability Board and the Basel Committee. Their goal is to craft more consistent guidance. If they pull it off, regulators in different countries might follow a shared playbook rather than compete by cutting corners. Related Reading: Bitcoin Braces For Fed Shake-Up As Trump Eyes Powell Exit Market Keeps Growing Based on market data, stablecoin supply has now topped 250 billion. A large share of that capital is parked in Bitcoin, waiting for the next rally. Some analysts spot chart patterns that echo early altcoin breakouts. That could signal a fresh surge of trading across tokens once confidence builds. For now, stablecoins sit at the center of crypto plumbing. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Ethereum Daily Transactions Just Hit Its Highest Level Since January 2024, Will Price Follow?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-daily-transactions/",
      "summary": "Ethereum has seen a notable spike in its daily transactions after a week filled with uncertain market movement. While the rise in the daily transactions has caught attention, what is really essential to point out is that it has been a long time since the daily transactions have been this high. In fact, the spike has led to the highest level that Ethereum&#8217;s daily transactions have been in over 16 months, showing a return to the blockchain that seemed previously abandoned. Ethereum Daily Transactions Cross 1.7 Million According to data from the on-chain data aggregation website, Nansen, the Ethereum daily transaction count has spiked by almost 50% over the last few days. The week had begun with the daily transaction count sitting at 1.2 million on Monday. However, by Wednesday, this figure was already changing rapidly to reach new yearly peaks. Related Reading: Extended Wave 5 Scenario Puts Bitcoin Price Above $300,000 With Step-Like Structure In Place As the Ethereum price rose above $2,400, so did participation on the blockchain, leading daily transactions to rise to 1.729 million. This sharp spike has led to the highest level so far in 2025, and is the first time since January 2024 that the daily transactions has crossed the 1.7 million mark. At the same time, there was also an unusual spike in the daily active addresses, which rose by almost 50% as well in the same time period. The daily active addresses rose from 345,406 addresses to 593,637 addresses in the space of four days. All of these have happened as the Ethereum price has recovered, suggesting that the spike in on-chain participation is actually more from investors buying than selling. If this trend continues, then it could send the Ethereum price soaring higher from here. Sell Volume Begins Dominating ETH Price In contrast to the rise in Ethereum on-chain participation, there has also been an increase in the on-chain sell volume compared to the buy volume. Nansen data points out that in the $168.37 million on-chain buy volume recorded in a 24-hour period, approximately $78.15 million was going toward buys, while a little over $90 million was from sellers. Related Reading: Ethereum Not Out Of The Woods Yet: Why Another 30% Crash To $1,800 Is Coming Furthermore, when it comes to individual transactions involved in buying and selling Ethereum, the sellers remain in the lead. There were more than 52,000 buy transactions recorded during this period, with around 24,300 buyers. While the sell transactions ran up towards 74,000, with sellers at more than 32,000. This shows a higher percentage of sellers compared to buyers, which would explain why the price has been unable to reach other support levels. This rise in the selling volume suggests that the buys are not enough to absorb the selling volume. This could fight off any buying momentum that could lead to a price recovery and keep the Ethereum price down while the crypto market struggles to find its footing. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum’s Network Is Heating Up While Price Stalls, Is a Breakout Coming?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-network-is-heating-up-while-price-stalls-is-a-breakout-coming/",
      "summary": "Ethereum is currently trading in a period of subdued price movement, reflecting broader consolidation across the crypto asset market. At the time of writing, ETH is trading around $2,423, marking a slight 0.9% daily decrease and standing more than 50% below its all-time high of $4,878. This stagnation has coincided with a broader lack of catalysts to drive a sustained rally, leaving traders cautious about Ethereum&#8217;s near-term trajectory. Despite this lack of price momentum, network activity on Ethereum tells a different story. Related Reading: Ethereum Reclaims $2,444 Level – Bullish Continuation In Focus Ethereum On-Chain Metrics Point to Increased Network Engagement According to CryptoQuant analyst Carmelo Alemán, the number of confirmed transactions on the Ethereum network recently spiked to 1,750,940, making it the third-highest daily transaction count in its history. Alemán notes this trend may signal underlying usage strength, even as market participants wait for a more significant price response. Alemán’s analysis focuses on Ethereum’s “Transaction Count (Total)” metric, which captures all forms of activity, including ETH transfers, smart contract executions, and interactions with decentralized applications and DeFi protocols. The recent surge reverses a months-long downtrend and represents the highest transaction count since January 14, when Ethereum recorded 1.96 million transactions. According to Alemán, this spike may be driven by increased arbitrage, trading activity, and interactions with Layer 2 networks, which continue to absorb substantial transaction volume. Platforms like Arbitrum and Optimism remain key contributors to Ethereum’s broader usage. He further points out that, despite ETH price volatility within the $2,100–$2,880 range in recent weeks, the uptick in network traffic may hint at early-stage accumulation or renewed DeFi interest. This dynamic, while not immediately reflected in the asset’s valuation, suggests that Ethereum’s core infrastructure continues to see meaningful use. Speculative Behavior and Exchange Flows Raise Short-Term Concerns Separately, another CryptoQuant analyst, Amr Taha, has examined Ethereum’s recent technical setup from a derivatives market perspective. Taha highlights that ETH funding rates on Binance have shifted from negative to positive territory, a sign that leveraged long positions are building, which may reflect expectations of continued price upside. However, this shift also raises the potential for overextension, particularly if longs begin to dominate positioning. Related Reading: Ethereum Fakes Out Bears – Altcoin Rally Depends On Key Level Breakout Taha also references a recent retest of a key short-squeeze zone, during which market participants who had shorted ETH were forced to close positions, triggering rapid buy orders. Such moves can generate short-term surges, but they’re often followed by correction phases once speculative energy fades. Meanwhile, exchange data showed more than 177,000 ETH deposited on Binance over three days, indicating potential sell pressure or repositioning by large holders. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "SEI Leads Crypto Market With 43% Weekly Surge – $0.5 Reclaim In The Horizon?",
      "link": "https://www.newsbtc.com/news/sei-leads-crypto-market-with-43-weekly-surge-0-5-reclaim-in-the-horizon/",
      "summary": "After breaking out of a bullish formation, SEI is attempting to reclaim a crucial level to continue its rally. Some analysts suggest that the cryptocurrency is preparing for another massive rally toward the $0.50 resistance. Related Reading: Bitcoin Next Price Discovery Coming? Analyst Shares BTC’s 2025 Roadmap SEI Leads Crypto Market As the market recovers from the recent pullback, SEI has soared from its local low and broken out of crucial levels. Earlier this week, the cryptocurrency pulled a nearly 100% rally from its 16% drop. Notably, SEI’s price followed the rest of the market last week and retested the $0.15 level, a support not seen since early April. Over the weekend, the altcoin recovered the crucial $0.20 area before jumping nearly 70% at the start of the week. Since then, the token has been hovering between $0.24 and $0.29, attempting to break out of the $0.30 resistance on Friday morning. Following this performance, analyst Sjuul from AltCryptoGems named SEI the “Bull of the week,” highlighting the cryptocurrency’s “beast mode” fueled by “the record on-chain activity of the token that has brought in new investors and whales” to the network after the breakout. Notably, the cryptocurrency is leading the top 100 cryptocurrencies list with a 43% weekly surge, surpassing the performance of market leaders Bitcoin (BTC) and Ethereum (ETH). Crypto Raven noted that SEI “has done a great job of breaking out as the market is looking very fresh right now,” suggesting the cryptocurrency could rally another 70%. Per"
    },
    {
      "title": "You Won’t Believe Who’s Moving Millions in Bitcoin on Binance Right Now",
      "link": "https://www.newsbtc.com/bitcoin-news/you-wont-believe-whos-moving-millions-in-bitcoin-on-binance-right-now/",
      "summary": "Bitcoin is treading cautiously below the $110,000 level, signaling a pause in momentum after recent highs. At the time of writing, the asset is priced at $106,841, marking a mild 0.4% decline over the past 24 hours. Despite brushing a daily high of $107,884, BTC appears to be consolidating in a narrow range, with market participants watching for the next significant move. Amid this relatively flat price action, on-chain trends suggest that not all is quiet under the surface. A new analysis by CryptoQuant contributor “oinonen” sheds light on wallet activity within Binance, one of the largest crypto exchanges by trading volume. Related Reading: Bitcoin Retests $108,000, But Holders Disagree On Direction Bitcoin Mid-Tier Investors Take Center Stage on Binance Oinonen&#8217;s findings point to a sharp increase in whale-level participation, as well as a notable contribution from mid-tier investors, which could have implications for broader market behavior. Citing CryptoQuant’s on-chain metrics, the analyst revealed that Binance’s inflow data shows that wallets depositing between 10 and 100 BTC now account for 40% of all Bitcoin inflows. These wallet sizes typically belong to high-net-worth individuals, trading firms, or mid-sized institutions—those who sit between retail traders and deep-pocketed whales. In contrast, whale-level inflows (100–1,000 BTC) currently represent 20% of the total, highlighting that mid-tier players may be driving more exchange activity than larger whales at this time. Interestingly, whale activity still made a major appearance recently. On June 16, inflows of 10,000 BTC surged and made up 83% of total exchange inflows on Binance that day, reinforcing earlier observations from Oinonen about increased whale presence over the past year. According to CryptoQuant’s whale ratio metric, that presence has reportedly jumped by as much as 400% since mid-2023. Binance Deposit Data Points to Rising Institutional Interest Beyond just inflow ratios, Binance’s overall deposit metrics suggest a growing trend of larger average deposits. The average Bitcoin deposit rose from 0.36 BTC in 2023 to 1.65 BTC in 2024. The exchange processed $21.6 billion in user fund deposits in 2024, roughly 40% more than the combined totals of the next ten crypto exchanges. Despite the growing institutional footprint, the significant portion of deposits in the 10–100 BTC range shows that mid-level market participants remain active contributors to the trading ecosystem. Related Reading: Is The Bitcoin Top In? Bitcoin MVRV-Score Has The Answer This data may reflect a broader shift in how BTC is being accumulated and moved, where influence is shared between whales and mid-sized investors. While whale flows often generate headlines, the consistent presence of mid-tier wallets can signal healthier market participation and a more distributed form of liquidity provision across the board. With Bitcoin still consolidating near key price levels, these on-chain trends could help shape its next breakout, whenever it comes. Featured image created with DALL-E. Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Takes a Lot of Pressure Off The Dollar, Says Donald Trump",
      "link": "https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Takes-a-Lot-of-Pressure-Off-The-Dollar-Says-Donald-Trump.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump\" rel=\"nofollow\"> </a></p> <p>President Donald Trump is backing Bitcoin, calling it a vital American asset that the US must continue to dominate.</p> <p>"
    },
    {
      "title": "How The IMF Prevents Global Bitcoin Adoption (And Why They Do It)",
      "link": "https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/IMF-Blocking-Bitcoin-Adoption.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it\" rel=\"nofollow\"> </a></p> <p>IMF loans halt nation-state Bitcoin plans—only debt-free countries like Bhutan push forward. Grassroots use still thrives.</p> <p>"
    },
    {
      "title": "Lnfi Network Integrates RGB Protocol to Enhance Lightning Network",
      "link": "https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_A_futuristic_digital_dashboard_glowing_wit_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network\" rel=\"nofollow\"> </a></p> <p>Lnfi Network adopts RGB for Bitcoin’s Lightning, enabling secure asset trading. Nostr’s encryption stops manipulation.</p> <p>"
    },
    {
      "title": "If Institutions Are Buying Why Isn’t The Bitcoin Price Going Up?",
      "link": "https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/If-Institutions-Are-Buying-Why-Isnt-The-Bitcoin-Price-Going-Up.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up\" rel=\"nofollow\"> </a></p> <p>Bitcoin price not soaring despite institutional billions? Uncover why profit-taking and derivatives hold it back, with a breakout looming!</p> <p>"
    },
    {
      "title": "Tahini’s Bitcoin Treasury: How a Family Chain Outsmarted Inflation",
      "link": "https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/tahini-bitcoin-2020-treasury-playbook.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation\" rel=\"nofollow\"> </a></p> <p>Tahini’s, a Canadian fast-casual chain, embraced Bitcoin in 2020, leveraging it to compete with giants like McDonald’s. Here’s their treasury playbook.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Trump Blames Biden for Banks Blocking Crypto: 'There Is a Lot of Debanking'",
      "link": "https://decrypt.co/327531/trump-blames-biden-banks-blocking-crypto-debanking",
      "summary": "President Trump unloaded on the issue of crypto debanking Friday, but stopped short of committing to issuing an executive order on the subject."
    },
    {
      "title": "'Rogue' Police Are Destroying Bitcoin ATMs: Bitcoin Depot Legal Chief",
      "link": "https://decrypt.co/327503/rogue-police-are-destroying-bitcoin-atms-bitcoin-depot-legal-chief",
      "summary": "Chris Ryan said that police may be breaking the law in some instances and that the provider of the machines is entitled to the funds."
    },
    {
      "title": "Ripple to Drop Appeal in SEC Case Over XRP Sales, Ending Case 'Once and for All'",
      "link": "https://decrypt.co/327524/ripple-drop-appeal-sec-case-xrp-sales-ending-case",
      "summary": "Ripple says it'll drop its appeal in the long-running SEC case over XRP sales, finally putting the legal battle to bed."
    },
    {
      "title": "Public Keys: Copycat Lawsuits for Bitcoin Giant Strategy, Coinbase Hits All-Time High",
      "link": "https://decrypt.co/327495/public-keys-strategy-bitcoin-lawsuits-coinbase-all-time-high",
      "summary": "Why Bitcoin treasury giant Strategy is facing down multiple identical lawsuits, plus Coinbase hits a record closing price as perps near."
    },
    {
      "title": "White House Weighs Federal Land and Fast-Tracked Permits to Drive AI Boom: Reuters",
      "link": "https://decrypt.co/327489/white-house-weighs-federal-land-fast-tracked-permits-ai-boom",
      "summary": "President Trump is reportedly mulling executive orders to boost AI infrastructure in the U.S. amid soaring energy demands."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Ripple drops cross-appeal as SEC set to follow, closing XRP case",
      "link": "https://cryptobriefing.com/ripple-sec-agreement-ends/",
      "summary": "<p>Ripple and SEC end their prolonged legal dispute as both sides drop appeals, marking a pivotal ripple sec agreement in crypto regulation.</p> <p>"
    },
    {
      "title": "Robinhood rolls out micro XRP, Solana futures following token relisting",
      "link": "https://cryptobriefing.com/micro-futures-contracts-xrp-solana/",
      "summary": "<p>Robinhood's expansion into micro crypto futures could democratize access to digital asset trading, potentially increasing market participation.</p> <p>"
    },
    {
      "title": "Trump backs Bitcoin adoption amid claims it could ease pressure on the dollar",
      "link": "https://cryptobriefing.com/trump-bitcoin-adoption-dollar/",
      "summary": "<p>Trump's endorsement of Bitcoin could accelerate its mainstream adoption, potentially reshaping global financial dynamics and US economic policy.</p> <p>"
    },
    {
      "title": "The power of crypto journaling: how tracking your trades can transform your success",
      "link": "https://cryptobriefing.com/crypto-trading-journal-success/",
      "summary": "<p>A crypto trading journal helps track trades, refine strategies, manage emotions, and boost discipline for better results.</p> <p>"
    },
    {
      "title": "Bitcoin retreats after Fed’s preferred inflation gauge shows mild uptick",
      "link": "https://cryptobriefing.com/bitcoin-pce-inflation-gauge-impact/",
      "summary": "<p>Bitcoin's volatility highlights economic uncertainty, with inflation concerns and potential Fed rate decisions impacting market stability.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ripple Labs ‘closes chapter once and for all,’ drops cross appeal against SEC",
      "link": "https://ambcrypto.com/ripple-labs-closes-chapter-once-and-for-all-drops-cross-appeal-against-sec/",
      "summary": "<img alt=\"Ripple Labs &#039;closes chapter once and for all,&#039; drops cross appeal against SEC\" class=\"attachment-full size-full wp-post-image\" height=\"626\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/XRPSECFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1113\" />With the Ripple-SEC case out of the way, what does the future hold?"
    },
    {
      "title": "U.S. stock Futures hit record highs – Could Bitcoin be next to break out?",
      "link": "https://ambcrypto.com/u-s-stock-futures-hit-record-highs-could-bitcoin-be-next-to-break-out/",
      "summary": "<img alt=\"U.S. stock Futures hit record highs - Could Bitcoin be next to break out?\" class=\"attachment-full size-full wp-post-image\" height=\"713\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/US-Stock-Futures-Hit-Record-Highs.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1267\" />Is Bitcoin set for liftoff or has Q3’s seasonal curse already begun to sneak in?"
    },
    {
      "title": "Bitcoin beat war FUD, but tariff shocks can rattle BTC even more",
      "link": "https://ambcrypto.com/bitcoin-beat-war-fud-but-tariff-shocks-can-rattle-btc-even-more/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-21.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Q3 pressure builds as Bitcoin’s $100k level faces its next big test."
    },
    {
      "title": "AI tokens dive by 29% even as Web3 adoption skyrockets – What’s going on?",
      "link": "https://ambcrypto.com/ai-tokens-dive-by-29-even-as-web3-adoption-skyrockets-whats-going-on/",
      "summary": "<img alt=\"AI tokens dive by 29% even as Web3 adoption skyrockets - What’s going on?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-16-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Why has the correlation between AI tokens and Nvidia stock broken?"
    },
    {
      "title": "SUI’s $22 dream: Raoul Pal sees a ‘top 5’ path for the ‘Solana killer’",
      "link": "https://ambcrypto.com/suis-22-dream-raoul-pal-sees-a-top-5-path-for-the-solana-killer/",
      "summary": "<img alt=\"SUI&#039;s $22 dream: Raoul Pal sees a &#039;top 5&#039; path for the &#039;Solana killer&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Sui-price-prediction.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Sui's DEX volume dropped 50% in June to $7B compared to May's $14B."
    }
  ]
}