{
  "CoinDesk": [
    {
      "title": "Dogecoin Bulls Defend 16 Cent Support as Elon Musk’s X Payments Speculations Loom",
      "link": "https://www.coindesk.com/markets/2025/06/26/dogecoin-bulls-defend-16-cent-support-as-elon-musks-x-payments-speculations-loom",
      "summary": ""
    },
    {
      "title": "‘XRP to $3’ Searches Rise as Token Shows Whale Activity Spike",
      "link": "https://www.coindesk.com/markets/2025/06/26/xrp-to-3-searches-rise-as-token-shows-whale-activity-spike",
      "summary": ""
    },
    {
      "title": "Bitcoin's Bull Case Strengthens as Dollar Index Slides, Nvidia Hits Record High Amid Recession Cues",
      "link": "https://www.coindesk.com/markets/2025/06/26/bitcoin-s-bull-case-strengthens-as-dollar-index-slides-nvidia-hits-record-high-amid-recession-cues",
      "summary": ""
    },
    {
      "title": "Bitcoin Nears $108K as Fed Rate Cut Bets Rise; Traders Eye Ether, Solana, Cardano",
      "link": "https://www.coindesk.com/markets/2025/06/26/bitcoin-nears-108k-as-fed-rate-cut-bets-rise-traders-eye-ether-solana-cardano",
      "summary": ""
    },
    {
      "title": "World Liberty Makes Narrative U-Turn, Says WLFI Token Will Become Tradable Soon",
      "link": "https://www.coindesk.com/markets/2025/06/26/world-liberty-makes-narrative-u-turn-says-wlfi-token-will-become-tradable-soon",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "‘Major bummer’ — Users discover Ledger is sunsetting the ‘OG’ Nano S",
      "link": "https://cointelegraph.com/news/ledger-sunsetting-support-nano-s-community-reaction?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FhOTQtMTQ3MC03OTBiLTlhYTEtMjVjNDMxZmUyMGIx.jpg\" /></p><p>Some users were questioning whether the Nano S would still work after support ends, and whether there was a security risk involved if they decided to keep using it.</p>"
    },
    {
      "title": "Citibank accused of ignoring signs of $20M crypto romance scam",
      "link": "https://cointelegraph.com/news/citibank-accused-ignoring-signs-20m-crypto-romance-scam?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E5ZWUtM2RkOS03N2UwLWJkN2ItNjc4OWMzZGVmMjEz.jpg\" /></p><p>The victim of a $20 million crypto pig butchering scam has sued Citibank, alleging it ignored “red flags” and should have investigated suspicious activity.</p>"
    },
    {
      "title": "Bit Digital falls 4% as it ditches Bitcoin mining for Ethereum",
      "link": "https://cointelegraph.com/news/bit-digital-ditches-bitcoin-mining-for-ethereum?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FhMmEtNTA5My03ZDU0LWE1YmItYTQ4YTZkOTEzNWYx.jpg\" /></p><p>The crypto mining firm will additionally sell its own stock to purchase more ETH for its treasury.</p>"
    },
    {
      "title": "Coinme pays $300K fine for violating California crypto ATM laws",
      "link": "https://cointelegraph.com/news/coinme-pays-300k-fine-violating-california-crypto-atm-laws?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FhNmUtOGVhNi03NzIyLWI3YTAtNjIyNzJjYzJhYTI5.jpg\" /></p><p>The case marks California DFPI’s first enforcement action under the state’s Digital Financial Assets Law.</p>"
    },
    {
      "title": "GameStop fails to woo traders with $450M raise, possibly for Bitcoin",
      "link": "https://cointelegraph.com/news/gamestop-trades-flat-capital-raise-buy-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVjOTEtNWYwYi03ZTcxLWIyM2MtZTE5MjM1NzY2NmJk.jpg\" /></p><p>Vincent Liu, the chief investment officer at Kronos Research, said buying Bitcoin alone isn’t enough to increase a company’s stock price; there needs to be a clear plan.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Iran and Israel spent over $25B during the ’12-day war,’ equivalent to 1% of total Bitcoin supply",
      "link": "https://cryptoslate.com/insights/iran-and-israel-spent-over-25b-during-the-12-day-war-equivalent-to-1-of-total-bitcoin-supply/",
      "summary": "<p>The Iran-Israel conflict reportedly cost the two nations roughly $25.5 billion, worth over 240,837 BTC at current prices, according to a report by Opportunity Cost, a digital tool that translates global spending into Bitcoin and Satoshi equivalents. According to the platform, Israel fired Arrow interceptor missiles, each costing around $3 million or 28.3 BTC, to counter Iranian missiles [&#8230;]</p> <p>"
    },
    {
      "title": "Binance Bitcoin inflows plunge to 5,700 BTC, less than 50% of the monthly average since 2020",
      "link": "https://cryptoslate.com/binance-bitcoin-inflows-plunge-to-5700-btc-less-than-50-of-the-monthly-average-since-2020/",
      "summary": "<p>Binance’s monthly Bitcoin (BTC) inflows have fallen to 5,700 BTC, less than half the 12,000 BTC average recorded since 2020 and 25% of the 24,000 BTC that hit the exchange during the FTX panic of late 2022, CryptoQuant analyst Darkfost shared in a June 24 note. Darkfost’s data showed that every material deposit surge of [&#8230;]</p> <p>"
    },
    {
      "title": "European Commission to ease rules on foreign stablecoins despite ECB opposition",
      "link": "https://cryptoslate.com/european-commission-to-ease-rules-on-foreign-stablecoins-despite-ecb-opposition/",
      "summary": "<p>The European Union is preparing to relax its stance on foreign-issued stablecoins, potentially allowing U.S. dollar-backed tokens like USDC and USDT to circulate freely within the bloc, the Financial Times reported on June 25. According to the report, the European Commission will soon issue formal guidance enabling stablecoins issued outside the EU to be treated [&#8230;]</p> <p>"
    },
    {
      "title": "US adopts crypto in mortgage risks as Fannie Mae and Freddie Mac update asset models",
      "link": "https://cryptoslate.com/us-adopts-crypto-in-mortgage-risks-as-fannie-mae-and-freddie-mac-update-asset-models/",
      "summary": "<p>US Federal Housing Finance Agency (FHFA) Director Willian J. Pulte ordered on June 25 that Fannie Mae and Freddie Mac treat cryptocurrency reserves as eligible assets when they measure risk on single-family mortgage loans, effective immediately. The two government-sponsored enterprises must draft plans that show how they will recognize borrower crypto holdings without first converting [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase launches Cardano and Litecoin wrapped tokens cbADA, cbLTC on Base",
      "link": "https://cryptoslate.com/coinbase-launches-cardano-and-litecoin-wrapped-tokens-cbada-cbltc-on-base/",
      "summary": "<p>Coinbase launched wrapped tokens for Cardano (cbADA) and Litecoin (cbLTC) on its Base layer-2 network, the exchange said in a June 25 post. Each synthetic token is backed 1:1 by the underlying asset held in Coinbase custody, and proof-of-reserves pages list the on-chain addresses securing the collateral. The transparency pages already show 11,364 LTC and [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana Price At ‘A Very Delicate Level’ – Analyst Says $148 Reclaim Is Key",
      "link": "https://www.newsbtc.com/news/solana-price-at-a-very-delicate-level-analyst-says-148-reclaim-is-key/",
      "summary": "Despite recovering from the weekend retrace, Solana (SOL) is trading between two levels that could make or break the altcoin’s rally. Nonetheless, some analysts suggest that the cryptocurrency could be gearing up for a massive breakout beyond the local highs. Related Reading: Injective Prepares For Bullish Reversal Amid 25% Recovery – Analyst Forecasts Massive Breakout Solana Sits At Decisive Level On Wednesday, Solana fell to the $143 mark after failing to reclaim a crucial area lost over a week ago. Following the May breakout, the cryptocurrency hovered between the $148-$184 price range, hitting a four-month high of $187 at the end of last month. However, the June market pullback saw SOL lose its range and move toward the $144-$148 levels. This area was briefly lost during the weekend retrace, with Solana falling to the $125 support level before recovering. Over the past three days, the altcoin has surged nearly 15%, touching the $148 barrier on Wednesday morning, which has been one of the key levels since May. After recovering from the recent drop, SOL has attempted to reclaim this level, but was rejected once again. Analyst Sjuul from AltCryptoGems highlighted that Solana “just completed a very nice V-shaped recovery from the low,” but noted that the cryptocurrency is at a “very delicate level” as it trades within the $144-$148 zone. He suggested that investors should pay attention to this area, as a reclaim of the $148 resistance could propel the price to a “quick move to the upside.” On the contrary, rejection from this level and losing the $144 range low could signal that the recent price action was a bearish retest. Analyst Man of Bitcoin affirmed that a “sustained break above the resistance zone would be the first signal that the chart has formed a low. He detailed that a confirmed break above the $148 resistance would support the case for a reversal. Nonetheless, he warned that a potential scenario “with one more low in wave-5.” SOL Ready For A Rally Continuation? As price hovers between the $143-$144 levels, market watcher Altcoin Hunter considers that SOL is “dancing with the devil.” He pointed out that the cryptocurrency has been trading within a one-month falling wedge, with the $148-$150 rejection zone “coming in HOT.” Per"
    },
    {
      "title": "Chainlink Holders Set Record As 1-Yr MVRV Signals ‘Opportunity’",
      "link": "https://www.newsbtc.com/news/chainlink/chainlink-holders-set-record-1-yr-mvrv-opportunity/",
      "summary": "On-chain data shows new investors have been coming into Chainlink (LINK) as the MVRV Ratio signals a potential long-term opportunity for the asset. Chainlink Has Seen Its Total Holder Count Reach A New High In a new post on X, the analytics firm Santiment has discussed about the latest trend in the Total Amount of Holders metric for Chainlink. This indicator measures, as its name suggests, the total number of addresses on the LINK network that are carrying some non-zero balance. Related Reading: Tron’s 374% Profit-Taking Spree Uncovered—Here’s Who Was Behind It Below is the chart shared by Santiment that shows how the value of the metric has changed during the past year. As displayed in the graph, the Total Amount of Holders observed an inflection point earlier this year and has since been climbing up at a notable rate. This suggests that new non-empty wallets are popping up on the network. This kind of trend can arise due to a number of reasons. Fresh investors coming into the space or old ones who sold before making a return naturally contribute to an increase in the indicator. Another factor could be existing users creating new wallets to distribute their holdings or for privacy purposes. In general, all of these could be assumed to be occurring simultaneously to a degree whenever the Total Amount of Holders goes up. As such, the recent uptrend in the metric could indicate that some net adoption (that is, the influx of new investors) has steadily been taking place for Chainlink. Over the past month, 7,903 new non-zero balance addresses have joined the chain, bringing the Total Amount of Holders to a fresh all-time high (ATH) of 769,380. In the same chart, the analytics firm has also attached the data of another indicator: the Market Value to Realized Value (MVRV) Ratio. This metric basically compares how the value held by the BTC investors (the market cap) compares against the value put in by them (the realized cap). In other words, the indicator tells us about the profit-loss balance of the holders. Here, the version of the MVRV Ratio that&#8217;s relevant is the 365-day version, capturing the situation of the investors who bought their coins within the past year. Related Reading: Crypto Bears Rekt: $359M Gone As Bitcoin, Ethereum Rebound From the graph, it&#8217;s visible that the 1-year MVRV Ratio of Chainlink is currently sitting at a negative 17.3%, an indication that these traders are, on average, holding a loss of 17.3%. Generally, however, investors being underwater isn&#8217;t actually a bad thing for the cryptocurrency. This is because holders in profit are the ones more likely to participate in selling. As such, Santiment notes that the trend in the 365-day MVRV Ratio could suggest the asset&#8217;s &#8220;long-term investing timeframe is in an opportunity zone.&#8221; LINK Price At the time of writing, Chainlink is trading around $13.15, up more than 2% in the last seven days. Featured image from Dall-E, Santiment.net, chart from TradingView.com"
    },
    {
      "title": "Dogecoin (DOGE) Eyes Upside, Yet $0.20 Remains Out of Reach for Now",
      "link": "https://www.newsbtc.com/analysis/doge/dogecoin-doge-eyes-upside-0-1680/",
      "summary": "Dogecoin started a fresh increase above the $0.1550 zone against the US Dollar. DOGE is now consolidating and might aim for a move above $0.1680. DOGE price started a fresh increase above the $0.150 and $0.1550 levels. The price is trading above the $0.160 level and the 100-hourly simple moving average. There is a key rising channel forming with resistance at $0.1680 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could start a fresh decline if it stays below the $0.180 zone. Dogecoin Price Faces Resistance Dogecoin price started a fresh increase above the $0.1420 zone, like Bitcoin and Ethereum. DOGE was able to climb above the $0.150 and $0.1550 resistance levels. The bulls even pushed the price above the $0.1620 resistance. A high was formed at $0.1677 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $0.1427 swing low to the $0.1677 high. Dogecoin price is now trading above the $0.160 level and the 100-hourly simple moving average. Immediate resistance on the upside is near the $0.1680 level. There is also a key rising channel forming with resistance at $0.1680 on the hourly chart of the DOGE/USD pair. The first major resistance for the bulls could be near the $0.1720 level. The next major resistance is near the $0.1750 level. A close above the $0.1750 resistance might send the price toward the $0.180 resistance. Any more gains might send the price toward the $0.200 level. The next major stop for the bulls might be $0.2120. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.1680 level, it could start another decline. Initial support on the downside is near the $0.1620 level. The next major support is near the $0.1550 level and the 50% Fib retracement level of the upward move from the $0.1427 swing low to the $0.1677 high. The main support sits at $0.1550. If there is a downside break below the $0.1550 support, the price could decline further. In the stated case, the price might decline toward the $0.1420 level or even $0.1350 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1620 and $0.1550. Major Resistance Levels – $0.1680 and $0.1800."
    },
    {
      "title": "Bitcoin Eyes $120K? Analyst Reveals What Comes After BTC’s 50-Day EMA Breakout",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-eyes-120k-analyst-reveals-what-comes-after-btcs-50-day-ema-breakout/",
      "summary": "Bitcoin has resumed its upward movement, maintaining strength above the $107,000 level as market momentum builds toward the asset’s recent all-time high above $111,000. As of this writing, BTC is trading at $107,242, reflecting a 1.3% gain over the past 24 hours and a 2.7% rise in the past week. The market’s rebound comes after a brief dip last weekend, suggesting that investor confidence remains resilient heading into the next potential leg up. Contributing to the bullish outlook, CryptoQuant analyst İbrahim COŞAR recently highlighted Bitcoin’s successful reclaim of the 50-day Exponential Moving Average (EMA), which he described as a key level to track for short-term price trends. Related Reading: Fast-Tracking A Bitcoin Rally: Expert Identifies 3 Bullish Catalysts Bitcoin Reclaims Key Technical Level, Eyes $120K Potential According to COŞAR, the 50-day EMA often acts as dynamic support during corrections, and regaining this level typically precedes a price rally. In past cycles, similar conditions have led to gains between 10% to 20% shortly after the level was reclaimed. COŞAR further noted that Bitcoin’s reclaim of the 50-day EMA occurred after a short-lived breakdown, which was quickly reversed with three consecutive daily closes above the level. This technical setup mirrors previous instances that preceded substantial upward moves. COŞAR also cautioned that while the technical structure favors continued gains, geopolitical uncertainties, especially involving the US, Israel, and Iran, could introduce sudden volatility. As a result, he advised market participants to avoid leveraged positions in the short term and remain prepared for potential price swings. COŞAR wrote: That said, geopolitical developments—particularly any positive or negative news involving the U.S., Israel, and Iran—could trigger sudden volatility in BTC’s price. Please avoid using leverage during this period and remain cautious in the face of potential market swings. Further Into Technicals: Analyst Points to Bullish Flag Adding to the conversation, independent crypto analyst Captain Faibik suggested that Bitcoin’s price pattern is forming a bullish flag, a common continuation pattern in technical analysis. According to Faibik, while the structure indicates a likely breakout, a final corrective dip to the $97,000–$98,000 range may occur before upward momentum resumes. Related Reading: Bitcoin Poised For Rally As Geopolitical Tensions Ease And Inflation Expectations Fall He emphasized that a confirmed breakout above the $108,000 resistance would be a key signal, potentially setting the stage for a mid-term target of $130,000. $BTC is currently forming Bullish flag Pattern, but there’s a chance we could see one more correction before the massive Bullish Rally begins.. I expect Bitcoin to dip towards the 97–98k zone before bouncing back towards the 108k Crucial Resistance.. Bulls need to break and… pic.twitter.com/YwOOREZTe7 — Captain Faibik 🐺 (@CryptoFaibik) June 25, 2025 Notably, while short-term price forecasts vary, both analysts agree on the broader direction: Bitcoin remains in a bullish phase supported by technical trends. These insights align with broader market sentiment, including the increased inflow from institutional investors. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "XRP Price Trades Sideways — Bulls Preparing for Next Push?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-trades-sideways-2-20/",
      "summary": "XRP price started a fresh increase from the $2.150 zone. The price is consolidating gains and might aim for a move above the $2.220 zone. XRP price started a fresh increase above the $2.150 zone. The price is now trading above $2.150 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2.1320 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move up if it closes above the $2.220 resistance zone. XRP Price Eyes Upside Break XRP price remained supported and started a fresh increase above the $2.050 zone, like Bitcoin and Ethereum. The price recovered above the $2.080 and $2.120 resistance levels. The pair even cleared the $2.180 resistance and recently spiked above the $2.220 zone. A high was formed at $2.2294 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $1.910 swing low to the $2.2294 high. The price is now trading above $2.180 and the 100-hourly Simple Moving Average. Besides, there is a bullish trend line forming with support at $2.1320 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.220 level. The first major resistance is near the $2.250 level. The next resistance is $2.320. A clear move above the $2.320 resistance might send the price toward the $2.40 resistance. Any more gains might send the price toward the $2.480 resistance or even $2.50 in the near term. The next major hurdle for the bulls might be $2.550. Downside Correction? If XRP fails to clear the $2.220 resistance zone, it could start another decline. Initial support on the downside is near the $2.150 level. The next major support is near the $2.1320 level and the trend line. If there is a downside break and a close below the $2.1320 level, the price might continue to decline toward the $2.050 support or the 50% Fib retracement level of the upward move from the $1.910 swing low to the $2.2294 high. The next major support sits near the $2.00 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.150 and $2.1320. Major Resistance Levels – $2.220 and $2.250."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "FHFA Orders to Recognize Bitcoin And Other Cryptos in Mortgage Assessments",
      "link": "https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FHFA-Orders-to-Recognize-Bitcoin-And-Other-Cryptos-in-Mortgage-Assessments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments\" rel=\"nofollow\"> </a></p> <p>Fannie Mae and Freddie Mac are now directed to treat properly documented Bitcoin and other crypto assets as part of borrower reserves for mortgages.</p> <p>"
    },
    {
      "title": "Kraken Secures MiCA License To Offer Bitcoin And Crypto In Europe",
      "link": "https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Becomes-First-Global-Bitcoin-Crypto-Platform-to-Secure-MiCA-License.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe\" rel=\"nofollow\"> </a></p> <p>The license allows Kraken to offer regulated bitcoin and crypto services across all 30 EEA countries.</p> <p>"
    },
    {
      "title": "GameStop Raising $450 Million From Convertible Senior Notes To Make Investments",
      "link": "https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/GameStop-Raising-450-Million-From-Convertible-Senior-Notes-To-Make-Investments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments\" rel=\"nofollow\"> </a></p> <p>GameStop boosts its convertible note offering to $2.7 billion, potentially for a Bitcoin allocation under its updated investment policy.</p> <p>"
    },
    {
      "title": "Mega Matrix Announces First Purchase Of 12 BTC For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Mega-Matrix-Announces-First-Purchase-of-12-BTC-for-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Mega Matrix Inc., a Singapore based holding company that operates the FlexTV streaming platform, announced today its first Bitcoin purchase as part of a new treasury strategy. The company acquired 12 Bitcoin at an average price of approximately $105,554 per coin, including all fees and expenses.&#160; The purchase, completed at the end of May 2025, [&#8230;]</p> <p>"
    },
    {
      "title": "Digital Commodities Secures $3 Million to Expand Bitcoin Holdings",
      "link": "https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Digital-Commodities-Secures-3-Million-to-Expand-Bitcoin-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings\" rel=\"nofollow\"> </a></p> <p>The company now holds two Bitcoin and is raising $3 million through a private placement to accelerate its Bitcoin treasury strategy.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Kraken Becomes Latest to Win a License Under Europe's New Rules",
      "link": "https://decrypt.co/327112/kraken-license-europes-new-rules",
      "summary": "Approval from Ireland's central bank gives Kraken the ability to operate across 27 EU states as it races to catch up to rival Coinbase."
    },
    {
      "title": "ASIC Appoints Panel to Probe ASX Following Failed Blockchain Project",
      "link": "https://decrypt.co/327103/asic-appoints-panel-to-probe-asx-following-failed-blockchain-project",
      "summary": "The inquiry will assess the ASX’s governance, capability, and risk management frameworks across its group operations."
    },
    {
      "title": "ASX-Listed Biotech Firm Latest to Adopt a Bitcoin Strategy to Stay Afloat",
      "link": "https://decrypt.co/327099/asx-listed-biotech-firm-bitcoin-strategy",
      "summary": "Opyl is betting on the so-called Bitcoin treasury strategy to navigate its financial chop and follow recent examples set by others."
    },
    {
      "title": "US Housing Chief Orders Fannie Mae, Freddie Mac to Prepare for Crypto Assessment in Mortgages",
      "link": "https://decrypt.co/327087/us-housing-head-orders-fannie-mae-freddie-mac-accept-crypto",
      "summary": "Under a directive from the FHFA, Fannie Mae and Freddie Mac were ordered to prepare for crypto mortgage payments."
    },
    {
      "title": "Solana, Pudgy Penguins ETF Filings Added to SEC's Crypto To-Do List",
      "link": "https://decrypt.co/327076/solana-pudgy-penguins-etf-filings-sec-crypto",
      "summary": "A proposal for a Solana ETF and a new fund tied to Pudgy Penguins tokens have joined a growing list of products offering crypto exposure."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Mortgage giants Fannie Mae, Freddie Mac directed to consider crypto as valid assets for home loan eligibility",
      "link": "https://cryptobriefing.com/fannie-mae-freddie-mac-crypto-mortgage-underwriting/",
      "summary": "<p>Integrating crypto assets into mortgage finance could broaden access to home loans, potentially reshaping financial inclusion and asset evaluation.</p> <p>"
    },
    {
      "title": "Fed’s Powell says Bitcoin and crypto have matured and become more mainstream",
      "link": "https://cryptobriefing.com/crypto-mainstream-adoption-fed/",
      "summary": "<p>The mainstreaming of crypto prompts regulatory reassessment, potentially reshaping financial policies and banking practices globally.</p> <p>"
    },
    {
      "title": "Starknet-based zkLend shuts down following exploit and ZEND token delisting from major exchanges",
      "link": "https://cryptobriefing.com/zklend-shutdown-zend-delisting/",
      "summary": "<p>The shutdown highlights the vulnerabilities in DeFi protocols and may deter investor confidence, impacting future decentralized finance projects.</p> <p>"
    },
    {
      "title": "Banking giant Barclays to block all crypto transactions on credit cards over debt and fraud concerns",
      "link": "https://cryptobriefing.com/barclays-crypto-ban-cards/",
      "summary": "<p>Barclays' crypto credit card ban highlights growing financial institutions' caution, potentially influencing global regulatory approaches.</p> <p>"
    },
    {
      "title": "Blockchain venture Republic to offer digital tokens tracking shares of Elon Musk’s SpaceX",
      "link": "https://cryptobriefing.com/tokenized-private-shares-spacex/",
      "summary": "<p>Republic's token initiative could democratize access to high-value private firms, but regulatory hurdles may challenge its long-term viability.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "MELANIA loses 90% after 8% supply dump – Is recovery still possible?",
      "link": "https://ambcrypto.com/melania-loses-90-after-8-supply-dump-is-recovery-still-possible/",
      "summary": "<img alt=\"MELANIA\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/MELANIA-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />MELANIA's trading volume declined over 80% in Q2."
    },
    {
      "title": "Bitcoin reclaims $107K – What’s next as 3 factors align for BTC",
      "link": "https://ambcrypto.com/bitcoin-reclaims-107k-whats-next-as-3-factors-align-for-btc/",
      "summary": "<img alt=\"Bitcoin reclaims $107K - What&#039;s next as 3 factors align for BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/1000001592_1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin could be on the verge of setting a new high."
    },
    {
      "title": "Zama Raises $57M in Series B to Bring End-to-End Encryption to Public Blockchains",
      "link": "https://ambcrypto.com/zama-raises-57m-in-series-b-to-bring-end-to-end-encryption-to-public-blockchains/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"432\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-26-111110.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"621\" />Zama, the open-source cryptography company building state-of-the-art Fully Homomorphic Encryption (FHE) solutions for blockchain, announced [&#8230;]"
    },
    {
      "title": "Dogecoin price prediction: Here’s why bulls should prepare for a 20% rally",
      "link": "https://ambcrypto.com/dogecoin-price-prediction-heres-why-bulls-should-prepare-for-a-20-rally/",
      "summary": "<img alt=\"Dogecoin price prediction: Here&#039;s why bulls should prepare for a 20% rally\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Dogecoin-Featured-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The range lows saw a bullish reaction from Dogecoin, and the CMF signaled sizeable capital inflows recently."
    },
    {
      "title": "Solana traders bet on a bounce, but is the market ready to move?",
      "link": "https://ambcrypto.com/solana-traders-bet-on-a-bounce-but-is-the-market-ready-to-move/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-10-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />High-volume optimism meets hesitant momentum as SOL stands at a technical crossroads."
    }
  ]
}