{
  "CoinDesk": [
    {
      "title": "Cardano (ADA) Breaks Above $0.64 as Staking Addresses Top 1.3 Million",
      "link": "https://www.coindesk.com/markets/2025/06/16/cardano-ada-breaks-above-usd0-64-as-staking-addresses-top-1-3-million",
      "summary": ""
    },
    {
      "title": "Strategy Adds Over 10K BTC to Its Bitcoin Treasury, Funded by New STRD Offering",
      "link": "https://www.coindesk.com/markets/2025/06/16/strategy-adds-over-10k-btc-to-its-bitcoin-treasury-funded-by-strd-offering",
      "summary": ""
    },
    {
      "title": "Ether Price Surges 4% as Markets Mostly Shrug Off Escalating Middle East Tensions",
      "link": "https://www.coindesk.com/markets/2025/06/16/ether-price-surges-4-as-markets-mostly-shrug-off-escalating-middle-east-tensions",
      "summary": ""
    },
    {
      "title": "Crypto Daybook Americas: Bitcoin Holds Above $100K as Iran, Israel Trade Blows",
      "link": "https://www.coindesk.com/daybook-us/2025/06/16/crypto-daybook-americas-bitcoin-holds-above-100k-as-iran-israel-trade-blows",
      "summary": ""
    },
    {
      "title": "UNI Jumps 7%; Crypto Analyst Sees Breakout Momentum Toward $10",
      "link": "https://www.coindesk.com/markets/2025/06/16/uni-jumps-7-crypto-analyst-sees-breakout-momentum-toward-usd10",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Can you mine Bitcoin with a gaming PC? Here’s what you need to know",
      "link": "https://cointelegraph.com/explained/can-you-mine-bitcoin-with-a-gaming-pc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy85OTNlNDUwNmZhMjkxYjAzMDRhOGVhMjAxY2EzMWE1NC5qcGc=.jpg\" /></p><p> Yes, you can mine Bitcoin with a gaming PC — but between low performance, high electricity costs and tough competition from ASIC miners, it’s rarely worth the effort. </p>"
    },
    {
      "title": "How VCs trade token unlocks (and what you can learn from them)",
      "link": "https://cointelegraph.com/news/how-vcs-trade-token-unlocks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzc4ZTAtNDMzOC03N2MyLTgxMTItYmM2ZjRmODhlNDA1.jpg\" /></p><p>VCs time exits around unlock schedules, use OTC deals, stagger sells and monitor market sentiment to maximize profits and minimize impact.</p>"
    },
    {
      "title": "How to use AI (ChatGPT + Grok) to find the next big altcoin",
      "link": "https://cointelegraph.com/news/how-to-research-altcoins-using-chatgpt-and-grok?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzExZDUtMmUzNC03Nzg0LWIxYjMtYTYyMzAxNTk0NTY3.jpg\" /></p><p>ChatGPT and Grok can help you analyze altcoins, compare projects, and stay ahead in crypto research.</p>"
    },
    {
      "title": "El Salvador has bought 240 Bitcoin since IMF non-accumulation agreement",
      "link": "https://cointelegraph.com/news/el-salvador-buys-240-bitcoin-imf-deal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2RiZTQtZTQzZS03NjI2LTk5MmEtNzMwMmU3MGFjM2Iw.jpg\" /></p><p>The Central American country has continued its daily Bitcoin investments despite a non-accumulation deal struck with the IMF in December 2024.</p>"
    },
    {
      "title": "Strategy adds $1B in Bitcoin as Israel-Iran conflict pressures markets",
      "link": "https://cointelegraph.com/news/strategy-bags-10100-bitcoin-amid-israel-iran-escalation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzc4ODItNGE2ZC03ZGNkLTgxMGUtZTZlNWY3OGE2NTYz.jpg\" /></p><p>Strategy’s latest Bitcoin purchases were made following Strategy’s STRD, its third Bitcoin-backed preferred stock, launching on the Nasdaq on Wednesday.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Tron’s Justin Sun plans to public in US with Eric Trump through $210M SRM reverse merger deal",
      "link": "https://cryptoslate.com/trons-justin-sun-plans-to-public-in-us-with-eric-trump-through-210m-srm-reverse-merger-deal/",
      "summary": "<p>The Tron blockchain is reportedly planning a backdoor entry to the US public markets through a reverse merger with SRM Entertainment, a Nasdaq-listed company, the Financial Times reported on June 16. If completed, the merger would create a new company, Tron Inc., holding large amounts of TRX, Tron&#8217;s native token. The report also suggested that [&#8230;]</p> <p>"
    },
    {
      "title": "Investors price Metaplanet’s 10k Bitcoin holdings at $759k each as stock hits ¥1 trillion",
      "link": "https://cryptoslate.com/investors-price-metaplanets-10k-bitcoin-holdings-at-759k-each-as-stock-hits-%c2%a51-trillion/",
      "summary": "<p>Japanese investment firm Metaplanet has reached its short-term goal of acquiring 10,000 Bitcoin, following a recent purchase of 1,112 BTC for approximately $117 million. The acquisition was completed at an average price of $105,405 per coin, pushing Metaplanet past Coinbase in the rankings of public companies with the most significant Bitcoin holdings. The milestone means [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin hashrate hits new high of 943 EH/s as difficulty adjusted down 0.45%",
      "link": "https://cryptoslate.com/insights/bitcoin-hashrate-hits-new-high-of-943-eh-s-as-difficulty-adjusted-down-0-45/",
      "summary": "<p>Amid the minor 0.45% drop in Bitcoin mining difficulty on June 14, the network’s total hashrate surged to a fresh record of 943 EH/s. This juxtaposition emphasizes a resilient and increasingly concentrated mining sector in which top players are accelerating hardware upgrades to maintain margins in a post-halving environment. The difficulty dip offered a fleeting [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin, Ethereum lead $1.9 billion crypto inflows as investors look beyond Middle East tensions",
      "link": "https://cryptoslate.com/bitcoin-ethereum-lead-1-9-billion-crypto-inflows-as-investors-look-beyond-middle-east-tensions/",
      "summary": "<p>Digital asset funds continued their winning streak last week, pulling in $1.9 billion in new investments, according to CoinShares&#8216; latest weekly report. This marks the ninth week in a row of positive inflows, pushing the cumulative total over the period to $12.9 billion. Year-to-date, digital asset investment products have now seen a record $13.2 billion [&#8230;]</p> <p>"
    },
    {
      "title": "France eyes Bitcoin mining to cut energy waste and boost grid stability",
      "link": "https://cryptoslate.com/france-eyes-bitcoin-mining-to-cut-energy-waste-and-boost-grid-stability/",
      "summary": "<p>A group of lawmakers in France is advocating for a national review on how Bitcoin mining can help address the country&#8217;s persistent surplus in electricity production. The proposal, submitted to the French National Assembly on June 12, urges the government to examine whether Bitcoin&#8217;s energy-intensive mining process could be harnessed to absorb excess power, especially [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Will The Bitcoin Price Move Above $110,000 Again? Global M2 Money Supply Shows What’s Next",
      "link": "https://www.newsbtc.com/news/bitcoin/will-bitcoin-move-above-110000/",
      "summary": "Bitcoin&#8217;s current trading range is all part of a consolidation move before a return above $110,000. Although the leading cryptocurrency has largely held above the $105,000 support zones in recent days, its rally has taken a hit in the past two weeks. Technical analysis of Bitcoin&#8217;s price action, when overlapped with the Global M2 Money Supply metric, shows that it is only a matter of time before it enters into a new all-time high. Global M2 Offset Models Says Something Interesting According to a detailed post by crypto analyst Colin, also known as &#8220;The M2 Guy,&#8221; on the social media platform X, Bitcoin’s price action appears to be tracking the global M2 money supply with a high degree of correlation when the data is offset by 68 to 76 days. Related Reading: Bitcoin Bears Back In Control After $110,000 Rejection, What Comes Next? Two separate charts presented by Colin reveal this trend vividly, showing how Bitcoin price movements have followed the trajectory of the Global M2 Money Supply when adjusted for time. The short-term 68-day offset chart aligns closely with Bitcoin’s behavior since April 2025, while the 76-day offset chart offers a longer-term view of the relationship. In both cases, the analyst highlighted that the M2 curve is pointing upward, where Bitcoin has yet to play out, implying a similarly bullish trajectory for its price action. Colin describes this as a form of confluence, noting that when two correlated indicators show the same directional outcome, the probability of that outcome increases. Particularly, the average correlation across both charts is around 76.6 to 76.9%, both of which are very high and lend statistical weight to the prediction. What Does This Mean For Bitcoin Price? The 68-day offset chart shows Bitcoin trailing the M2 curve with high precision since April, with the highest 89.9% degree of accuracy on the 90-day timeframe. Similarly, the 76-day offset, while less accurate in the short term, displays a strong correlation over longer intervals of 92.2% over one and a half years and 86.2% across two years. These correlation values shows that Bitcoin is increasingly sensitive to global liquidity trends, especially now that its price movement is tied to inflows/outflows surrounding Spot Bitcoin ETFs. Related Reading: Can Bitcoin Price Bounce To $120,000 Or Will It Break Below $100,000? This relationship becomes even more notable considering the M2 money supply itself has been climbing within a rising channel. If the alignment continues, Bitcoin may soon follow suit, lifting it back above the $110,000 level and breaking above its all-time high. Bitcoin’s price action will be very interesting to follow in the next few days. In Colin’s view, this next move up is not only likely but could happen within days. If Bitcoin follows this alignment, the projection shows that Bitcoin will continue to move within a channel of higher highs and higher lows before eventually crossing above $150,000 in August. At the time of writing, Bitcoin is trading at $106,549, up by 1% in the past 24 hours. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Vietnam’s Historic Move to Legalize Crypto Could Add Rocket Fuel to These Top Altcoins",
      "link": "https://www.newsbtc.com/news/vietnams-historic-move-to-legalize-crypto-could-add-rocket-fuel-to-these-top-altcoins/",
      "summary": "Did the next major move in blockchain technology just come from Vietnam? Developing nations are becoming key crypto drivers, with Vietnam and Pakistan emerging in recent days as potential leaders. Establishing country-level crypto standards like Vietnam has done, or developing frameworks and planning a national Bitcoin reserve, the way Pakistan is doing, can only boost crypto adoption at home and abroad. It also showcases how Bitcoin and broader blockchain technology can help emerging economies fuel growth and innovation. As we&#8217;ll discuss later, it could also add rocket fuel to some of the top altcoins. Vietnam, Saylor, Pakistan: 4 Takeaways What do the moves in Pakistan and Vietnam mean for the broader crypto economy? Here are four takeaways: Groundbreaking Legal Clarity in Vietnam On June 14, 2025, Vietnam passed its Law on Digital Technology Industry, effective January 1, 2026, categorizing crypto as a distinct, regulated asset class. This law affects 17M crypto holders and $105B in inflows over 2023–24, and provides much-needed stability, boosting investor confidence. Frameworks that Foster Innovation Vietnam’s approach goes beyond crypto legalization. The law introduces incentives, such as tax breaks, R&#38;D support, and land-use benefits for sectors like AI and blockchain infrastructure, signaling a national pivot toward a tech-first economy. Pakistan’s Strategic Crypto Pivot Pakistan followed Vietnam’s lead a day later, on June 15, 2025, when Michael Saylor engaged with Pakistan’s finance leadership to champion Bitcoin as a sovereign reserve asset. Pakistan launched the Pakistan Crypto Council in March 2025, developing frameworks and planning a national Bitcoin reserve, along with crypto mining infrastructure. Emerging Economies Leading the Way? Vietnam and Pakistan’s moves reflect a global trend: emerging economies are leveraging digital assets to level up economically, rather than merely following Western nations. Demonstrating a greater appetite for crypto’s revolutionary potential, Pakistan, Vietnam, and others are pushing the limits of crypto’s potential in ways that could send leading altcoins soaring. Let&#8217;s investigate how top altcoins like Bitcoin Hyper, Uniswap, and Snorter Token could fare as global adoption grows. 1. Bitcoin Hyper ($HYPER) – Bitcoin’s First-Ever Layer 2 Launches with SVM Bitcoin’s great, we can all agree – 230% AAR, a $2T+ market cap, etc. But could that be just the start? Bitcoin Hyper ($HYPER) unleashes Bitcoin&#8217;s full potential. While right now, $BTC is one of the world’s best store-of-value assets, when it comes to crypto applications, it&#8217;s somewhat limited due to its original architecture. Bitcoin Hyper builds a Layer 2 on top of Bitcoin, leveraging the Bitcoin Relay Program on the Solana Virtual Machine (SVM) to verify Bitcoin block headers and transaction proofs for any $BTC deposited to Bitcoin Hyper’s Canonical Bridge. The result is lightning-fast transaction resolution and the ability to build out an entire DeFi ecosystem on Bitcoin. There’s a growing interest in Layer 2 solutions; another hot crypto presale – Solaxy ($SOLX) – just smashed through $50M raised with a Solana Layer-2. Could $HYPER surpass that with its Layer-2 solution for the world’s largest crypto asset? $HYPER tokens cost $0.0119, with $1.3M raised in the presale so far. Check out the whitepaper, or learn how to buy Bitcoin Hyper, and see why we think the token could go from $0.0119 to $0.02595 for 118% gains. Visit the Bitcoin Hyper ($HYPER) presale page. 2. Uniswap ($UNI) – Utility Token for Leading DeFi Protocol Seeks to Regain Previous Highs It’s a leading DEX, with over $1.78B traded in the past 24 hours. But Uniswap is also the 27th-largest crypto token, with a market cap of $4.91B. That’s impressive enough, but could $UNI be ready to make another run? The token trades well below its all-time high of $44.97 in the heady days of the 2021 bull run. But $UNI is on the list of assets currently held by the US government – and therefore eligible for the US Digital Assets Stockpile. Uniswap officials have also been involved in talks with the US Congress over pending legislation and decentralized finance. Add in global shifts towards more formal, organized crypto frameworks, and $UNI might be ready to make big moves. 3. Snorter Token ($SNORT) – Dominate the New World of Solana Meme Coins with Snorter Bot With new meme coins launching on Solana daily, some of the best opportunities to 10x your investment live underground. Finding and trading them takes time and effort, but $SNORT and the Snorter Bot make the process easy. The Snorter Bot sniffs out the best trading opportunities. Find them, snipe them, and stay safe from rug pulls and honeypots – all with the Snorter Bot. The $SNORT token facilitates lightning-fast swapping with the lowest fees possible on Solana. As DeFi grows alongside crypto adoption, it could set the stage for tokens like $SNORT. The meme coin market is flourishing, even as traders get more and more sophisticated. Give your meme coin trading a leg up with $SNORT, currently priced at $0.0953. The presale has raised over $1M so far, showing rapid investor interest. Visit the Snorter Token ($SNORT) presale page. Vietnam, Pakistan Embrace Crypto, Set Stage for Altcoins As countries like Vietnam and Pakistan take the lead in embracing crypto, the message is clear: digital assets are no longer just speculative tools, but strategic economic levers. Vietnam’s legislative clarity and Pakistan’s sovereign Bitcoin ambitions show that emerging economies are helping define the future of finance. Whether it’s foundational DeFi tokens like Uniswap, revolutionary Layer-2s like Bitcoin Hyper, or cutting-edge trading tools like Snorter Token, the next wave of growth could be here. Don’t take our word for it – do your own research. Crypto is volatile, and this isn’t financial advice."
    },
    {
      "title": "Still Sleeping On XRP? Analyst Says $8 Breakout Is ‘Just Waiting’",
      "link": "https://www.newsbtc.com/xrp-news/still-sleeping-on-xrp-8-breakout-just-waiting/",
      "summary": "In a livestream on June 15, crypto analyst Cantonese Cat delivered a firm verdict on XRP’s prolonged consolidation: don’t be fooled by the sideways drift. Despite trading in a tight range for over half a year, the chart veteran argued XRP is building energy for a powerful move, one that could take it as high as $6 to $8 once it breaks out of its multi-month technical cage. XRP To $8? “This thing has been going sideways for seven months,” he said. “But the entire time, it’s just hugging this GAN line.” He referred to a long-standing monthly Gann arc structure that XRP has been grinding against since late 2024. In his interpretation, the repeated tests of that arc—combined with price holding above key support zones—signal strength rather than weakness. “It’s just waiting for its thing,” he added, implying that the eventual move could be sharp and sudden. Related Reading: XRP Price Still On Track For $1.5T Market Cap And 27% Crypto Market Dominance Cantonese Cat highlighted that the current price action is sitting just beneath the next major Gann resistance level, which aligns closely with a Fibonacci extension target between $6 and $8. That arc, he believes, will be the trigger. “I think the next level is going to end up breaking up to the GAN arc up above,” he said, adding that a clean breach of this level could mark the start of XRP’s long-awaited parabolic run. He also pulled up the monthly Ichimoku Cloud, pointing out that XRP had already broken above it—a significant bullish milestone in Ichimoku analysis. “Initially it had a rejection of the Ichimoku cloud,” he explained, “and now we have a true breakout.” Most importantly, XRP has held the Tenkan and Kijun without falling back into the cloud. “This is basically a look of bullishness,” he noted, citing the textbook structure of a confirmed trend reversal. The broader structure, according to his analysis, is a classic breakout setup: a horizontal level was cleared, back-tested, and is now serving as support. “You’re basically breaking above a horizontal level here and back testing it. And so far, you’re holding it pretty convincingly.” To reinforce his thesis, he pointed to Fibonacci retracements—specifically, XRP’s behavior around the 0.86 level, which the asset has been flirting with. “If you’re able to convincingly break above 0.86 here,” he said, “then all-time high stuff could happen.” Asked by viewers why the market isn’t moving yet, he dismissed the apparent stagnation as noise. “It’s just going sideways, guys,” he said. “It’s just waiting for its thing.” In his view, the lack of momentum is not a sign of weakness, but rather a signal that XRP is compressing in a low-volatility zone—a typical prelude to a high-volatility expansion. “Whenever it decides to get done with this shenanigans,” he added, “it’s probably going to go up.” Despite XRP’s muted performance while other assets like Bitcoin and Solana have captured headlines, Cantonese Cat made clear that he sees no structural damage on the chart. Quite the opposite: he views the persistent adherence to long-term support levels, especially on the monthly timeframe, as an indication that XRP is simply coiling beneath resistance. Related Reading: XRP Has A 70% Shot To Beat Bitcoin, Says Analyst In a cycle increasingly defined by breakout-driven flows and rotational capital, he framed XRP’s dormancy not as a failure, but as a delayed opportunity. “Still holding the Tenkan and Kijun just fine,” he said. “This is what bullish looks like.” The analyst didn’t offer a date, but was blunt about the price levels to watch. If XRP clears the monthly Gann arc and maintains strength above the 0.86 Fibonacci zone, the $6–$8 range comes into play—levels that would not only exceed previous all-time highs, but also flip sentiment from apathy to euphoria in a matter of weeks. Until then, he warned, XRP’s breakout might not announce itself loudly. But when it comes, few will be positioned. “Still sleeping on XRP?” he asked. “You might want to wake up soon.” At press time, XRP traded at $2.20 Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Whales Feast While Retail Flees—ETH Ocean Just Got Hungrier",
      "link": "https://www.newsbtc.com/altcoin/ethereum-whales-feast-while-retail-flees-eth-ocean-just-got-hungrier/",
      "summary": "In the past month, big Ethereum wallets have been quietly piling on more Ether while small investors pull their profits. Activity on the network has been choppy but the heavy hitters have not slowed down. Retail traders, by contrast, have been cashing out as prices hover in a narrow range. Related Reading: Crypto Bloodbath: Over $1 Billion Liquidated As Iran-Israel Tensions Erupt Whales And Sharks Increasing Holdings According to data from Santiment, wallets holding between 1,000 and 100,000 ETH have added a net total of nearly 1.5 million ETH over the last 30 days. That boost represents a 3.70% rise in their combined holdings. These so‑called whales and sharks now control over 41 million ETH, or about a quarter of all Ether in circulation. It’s a clear sign that large traders see value in Ethereum at these levels, even as the market trades sideways. 🐳 There are currently 6,392 wallets holding between 1K and 100K Ethereum. Over the past month alone, these key whale and shark wallets have rapidly added more coins as retail traders have taken profit. During these past 30 days, a net of +1.49M more $ETH has been accumulated by… pic.twitter.com/1hPBTuAOrL — Santiment (@santimentfeed) June 13, 2025 Sideways Trading And Price Moves Ethereum’s price action has been muted. Based on reports from CoinGecko, Ether is up 5% in the last 14 days and 5.4% over the past month. It’s trading around $2,625 almost 45% below its all‑time high. The slow grind suggests neither buyers nor sellers have full conviction. Still, big holders continue to stack coins, waiting for the next catalyst. Rising Activity On Layer 2 And Services On‑chain data shows whales directing attention to specific services. Transaction volume in Ethereum Name Service jumped over 300% in the second week of July. Lending protocols on Ethereum saw a more than 200% rise. Meanwhile, transfers of USDC on layer 2 networks—Base, Arbitrum and Optimism—all posted triple‑digit gains. These numbers point to growing use of scaling layers and services beyond simple trading. Spot ETF Inflows Update Institutional interest has been strong too. US spot Ether products saw inflows for 19 straight days before a small pullback. That streak brought in $1.37 billion, mostly into BlackRock’s iShares Ethereum Trust. On the day the run ended, the funds recorded just a little over $2 million in outflows. It’s a minor wobble in what has so far been a solid embrace of Ether by big financial firms. Related Reading: Amid Bitcoin Hype, Seasoned Trader Predicts Sudden Drop To This Level Big Appetite Meanwhile, big wallets keep buying while smaller traders lock in gains. Network activity on services and layer 2s is surging. And institutions are still putting fresh dollars into Ethereum via ETFs. For now, Ether sits in a tight range. But when demand meets a clear price trigger, that quiet build‑up of coins in big wallets could push things to the upside. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "$8 Dogecoin? Analyst Says You’ll Regret Sleeping On This Chart",
      "link": "https://www.newsbtc.com/news/dogecoin/8-dogecoin-youll-regret-sleeping-on-this-chart/",
      "summary": "Cantonese Cat’s first livestream in weeks, broadcast on 15 June, devoted an extended segment to Dogecoin’s long-term structure—and the veteran technician was unequivocal about the upside he still sees. In his words, “this is still a cup and this is still a handle,” and if that formation completes he expects the meme-coin to break “anywhere from like $5 to $8.” That target, he added, is anchored by the intersection of a monthly GAN arc and Fibonacci extensions that have governed Dogecoin’s entire post-2020 advance. Dogecoin Price Could Hit $8 The analyst began by stripping the chart to its monthly timeframe and toggling off short-term clutter. He noted that Dogecoin has already tested the lower boundary of the Ichimoku cloud and, despite failing to “penetrate the monthly cloud” on the first attempt, continues to coil beneath it. “Even if it goes sideways for another month or two,” he said, “it’s going to enter the Ichimoku cloud one way or another—you can either push up like that or you can just go sideways and you get inside the cloud.” Under either scenario, the tenor remains constructive because the price is “forming higher highs and higher lows.” Related Reading: This Analyst Predicted The Dogecoin Price Crash – Here’s The Rest Of The Forecast Central to his conviction is the 20-month simple moving average, a line he regards as the spine of every major Dogecoin bull cycle. During the manic run of early 2021, price action “rode the 20[-month SMA] up” without once breaking it; when that moving average finally failed, the bear market ensued. Today, Dogecoin sits on top of the same level. “It looks like we’re able to use that as support,” he argued, and that support zone—currently just below the handle—doubles as what he calls a “buy zone” for long-horizon traders. The analyst himself “was buying more DOGE the last 4-5 days,” he revealed via X. Cantonese Cat also addressed the coin’s lethargy since April, insisting that the compression is constructive rather than dangerous. He pointed to the fact that Dogecoin is grinding just beneath the 0.5 log-scale retracement of the entire 2021–2022 decline, a behaviour he interprets as “building up some energy.” The longer the coil, the sharper the eventual expansion, he argued, provided the higher-timeframe moving averages remain intact. Related Reading: Will Dogecoin Moon Or Crash? This Indicator Holds The Answer Pressed by viewers about timing, the analyst declined to publish a timetable and reminded his audience that the breakout will almost certainly coincide with a broader alt-season. He did, however, flag the moment price re-enters the Ichimoku cloud as the technical “green light” for acceleration. Once that happens, the measured-move objective from the cup-and-handle and the GAN arc intersection converge in the $5–$8 zone—levels that would represent new all-time highs and deliver returns of roughly 3,000–5,000 percent from current prices. “Anything that’s closer to the twenty-one moving average is a good area to add,” he concluded, cautioning newcomers not to chase sudden green candles but to accumulate methodically while the chart remains “boring.” The implication is clear: Dogecoin’s dormancy may be the final shakeout before the largest impulse of the cycle, and those ignoring the calm may indeed “regret sleeping on this chart” if—and only if—the structural signals Cantonese Cat tracks fall into place. At press time, DOGE traded at $0.177. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Japan’s Metaplanet Hits 10,000 Bitcoin, Overtakes Coinbase",
      "link": "https://bitcoinmagazine.com/news/japans-metaplanet-hits-10000-bitcoin-overtakes-coinbase",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2024/11/japan-scaled.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-metaplanet-hits-10000-bitcoin-overtakes-coinbase\" rel=\"nofollow\">Japan&#8217;s Metaplanet Hits 10,000 Bitcoin, Overtakes Coinbase</a></p> <p>Metaplanet has acquired an additional 1,112 Bitcoin for $117.2 million, bringing its total holdings to 10,000 BTC and overtaking Coinbase to become the ninth-largest publicly traded holder of Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: Statechains",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Statechains-fotor-20250613161023.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains\" rel=\"nofollow\"> </a></p> <p>The second article in the Bitcoin Layer 2 series. This article covers Statechains, originally designed by Ruben Somsen, and implemented by CommerceBlock.</p> <p>"
    },
    {
      "title": "Pakistan’s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?",
      "link": "https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Pakistan-Bitcoin-Reserve.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation\" rel=\"nofollow\">Pakistan&#8217;s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?</a></p> <p>A strategic Bitcoin reserve is a step in the right direction for Pakistan, but only mass adoption will truly unlock the immense potential Bitcoin can offer.</p> <p>"
    },
    {
      "title": "The 30,000-Foot View of the Oslo Freedom Forum",
      "link": "https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Oslo-Freedom-Forum.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum\" rel=\"nofollow\"> </a></p> <p>Stories of courage and repression, and the tools defending civil liberties at the 17th Annual Oslo Freedom Forum in Norway.</p> <p>"
    },
    {
      "title": "UK Gold Mining Company Bluebird to Convert Gold Revenues into Bitcoin",
      "link": "https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/UK-Gold-Mining-Company-Bluebird-to-Convert-Gold-Revenues-into-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bluebird Mining Ventures Ltd. will adopt bitcoin as a treasury reserve asset and convert future gold revenues into Bitcoin.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Hyperliquid, Solana Lead Altcoin Rally as Institutions Pour $1.9B Into Crypto Funds",
      "link": "https://decrypt.co/325330/hyperliquid-solana-lead-altcoin-rally-as-institutions-pour-1-9b-into-crypto-funds",
      "summary": "Major altcoins posted gains Monday morning, as nearly $2 billion flowed into institutional crypto funds."
    },
    {
      "title": "Kidnappers Release TikTok Crypto Influencer After Finding Out He’s Broke",
      "link": "https://decrypt.co/325319/kidnappers-release-tiktok-crypto-influencer-after-finding-out-hes-broke",
      "summary": "The kidnapping case is one of a growing number of “$5 wrench attacks” targeting cryptocurrency holders in France."
    },
    {
      "title": "Alabama Regulator Recovers $125K in Crypto Lost to Pig Butchering Scams",
      "link": "https://decrypt.co/325321/alabama-recovers-125k-crypto-pig-butchering",
      "summary": "Alabama recovers $125K+ in crypto for victims of romance scams that cost them nearly $580K through fake dating app relationships and platforms."
    },
    {
      "title": "Vietnam Passes Landmark Law Defining Digital Assets, Boosting AI and Chip Sectors",
      "link": "https://decrypt.co/325317/vietnam-passes-landmark-law-digital-assets",
      "summary": "The new law ends regulatory limbo for crypto while establishing massive incentives for semiconductors, AI, and digital startups."
    },
    {
      "title": "Trump Discloses $57M Windfall From Crypto Venture World Liberty Financial",
      "link": "https://decrypt.co/325314/trump-57m-windfall-crypto-venture-world-liberty-financial",
      "summary": "Trump has reported over $600 million in income from crypto, golf clubs, and licensing ventures in his latest federal financial disclosure."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Justin Sun’s Tron set to go public in US in deal backed by Eric Trump-linked firm: FT",
      "link": "https://cryptobriefing.com/tron-reverse-merger-srm/",
      "summary": "<p>Tron's public listing could significantly impact the crypto market, highlighting the growing intersection of blockchain and political influence.</p> <p>"
    },
    {
      "title": "Polyhedra Network’s ZKJ token crashes over 80% after Binance Alpha LPs reportedly pull liquidity",
      "link": "https://cryptobriefing.com/zkj-token-crash-after-liquidity-withdrawals/",
      "summary": "<p>The ZKJ token's crash highlights the vulnerability of crypto markets to liquidity shifts, impacting investor confidence and market stability.</p> <p>"
    },
    {
      "title": "Bybit to launch Byreal, its first onchain DEX on Solana, on June 30",
      "link": "https://cryptobriefing.com/byreal-on-solana-dex/",
      "summary": "<p>Bybit's launch of Byreal on Solana signifies a strategic shift towards hybrid finance, potentially reshaping the DeFi landscape.</p> <p>"
    },
    {
      "title": "Invesco, Galaxy Digital file to launch Solana ETF in Delaware amid SEC approval buzz",
      "link": "https://cryptobriefing.com/solana-etf-sec-approval/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional interest and investment in the Solana blockchain ecosystem.</p> <p>"
    },
    {
      "title": "Cardano founder Charles Hoskinson proposes converting $100M ADA to Bitcoin and stablecoins",
      "link": "https://cryptobriefing.com/cardano-treasury-conversion-proposal/",
      "summary": "<p>Hoskinson's proposal could enhance Cardano's DeFi competitiveness, potentially increasing its market share and attracting more developers.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin mining difficulty eases from all-time high – Here’s why miners aren’t backing down",
      "link": "https://ambcrypto.com/bitcoin-mining-difficulty-eases-from-all-time-high-heres-why-miners-arent-backing-down/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-25.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Public miners are thriving by increasing output and stacking BTC."
    },
    {
      "title": "POPCAT defends $0.30 – THESE bullish crossovers indicate a move to…",
      "link": "https://ambcrypto.com/popcat-defends-0-30-these-bullish-crossovers-indicate-a-move-to/",
      "summary": "<img alt=\"Popcat\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-23.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Popcat is attempting a breakout from a descending channel as it surges 9.08% over the past day, amid a higher buying pressure."
    },
    {
      "title": "Metaplanet surpasses Coinbase with 10,000 BTC – Stock soars 17% on $117M Bitcoin buy",
      "link": "https://ambcrypto.com/metaplanet-surpasses-coinbase-with-10000-btc-stock-soars-17-on-117m-bitcoin-buy/",
      "summary": "<img alt=\"Metaplanet\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Metaplanet-FIII.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Metaplanet's mNAV was 7.56, suggesting strong investor confidence in its BTC strategy"
    },
    {
      "title": "Ethereum recovers 20% in June -Will $3K be ETH’s next stop in Q3?",
      "link": "https://ambcrypto.com/ethereum-recovers-20-in-june-will-3k-be-eths-next-stop-in-q3/",
      "summary": "<img alt=\"Ethereum ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-12.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Leverage is bleeding out, with liquidity slipping into spot hands - Fuel for Ethereum’s next real move?"
    },
    {
      "title": "Bitcoin traders are shorting BTC at its peak – Here’s why that’s risky!",
      "link": "https://ambcrypto.com/bitcoin-traders-are-shorting-btc-at-its-peak-heres-why-thats-risky/",
      "summary": "<img alt=\"bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-24.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Binance Bitcoin Futures are trading at an unusual discount, hinting at institutional hedging and a looming short squeeze opportunity."
    }
  ]
}