{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Are Distributed Compute Tokens Undervalued vs. CoreWeave (CRWV)?",
      "link": "https://www.coindesk.com/markets/2025/06/30/asia-morning-briefing-are-distributed-compute-tokens-undervalued-vs-coreweave-crwv",
      "summary": ""
    },
    {
      "title": "Senator Seeks to Waive U.S. Taxes on Small-Scale Crypto Activity in Big Budget Bill",
      "link": "https://www.coindesk.com/policy/2025/06/30/senator-seeks-to-waive-us-taxes-on-small-scale-crypto-activity-in-big-budget-bill",
      "summary": ""
    },
    {
      "title": "ETH Price Surges as $2.9B Inflows, EthCC, and Robinhood’s L2 Fuel Bullish Sentiment",
      "link": "https://www.coindesk.com/markets/2025/06/30/eth-price-surges-as-usd2-9b-inflows-ethcc-and-robinhood-s-l2-fuel-bullish-sentiment",
      "summary": ""
    },
    {
      "title": "Circle Applies for National Trust Bank Charter",
      "link": "https://www.coindesk.com/business/2025/06/30/circle-applies-for-national-trust-bank-charter",
      "summary": ""
    },
    {
      "title": "HBAR Climbs 2.1% as Traders Digest ETF Review, AI Launch, and Energy Governance Move",
      "link": "https://www.coindesk.com/markets/2025/06/30/hbar-climbs-2-1-as-traders-digest-etf-review-ai-launch-and-energy-governance-move",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin ‘vertical acceleration’ off the table for now: Bitfinex",
      "link": "https://cointelegraph.com/news/bitcoin-price-uptrend-lagging-onchain-metrics-traders-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzY2ODgtYzEyNC03Mzc4LWJlMzUtNzllNmFhYTAwNDhm.jpg\" /></p><p>Bitfinex analysts say declining Bitcoin spot volume may indicate a “local top” but all eyes will be on the performance of spot Bitcoin ETFs this week.</p>"
    },
    {
      "title": "Analysts raise chance of SOL, XRP and LTC ETF approval to 95%",
      "link": "https://cointelegraph.com/news/analysts-tip-95-chance-solana-xrp-litecoin-etf?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2MzZDUtYWRlNC03NzU5LWFiN2MtMzIyMmJlYThiNzky.jpg\" /></p><p>Crypto ETF summer has arrived with America’s first staked Solana ETP and increased odds for other spot altcoin funds, according to analysts.</p>"
    },
    {
      "title": "TradFi could move onchain due to ‘horrible banking experiences’",
      "link": "https://cointelegraph.com/news/tradfi-consider-blockchain-after-banking-let-down-aave-founder?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2MzNGEtZDJiNi03MjZkLWIwZGEtZmU3OWU2Y2M4MWVl.jpg\" /></p><p>Aave Labs founder Stani Kulechov says traditional finance has largely moved on from banks into fintech, and blockchain could be the sector’s next move.</p>"
    },
    {
      "title": "Circle applies for US trust bank charter to manage its USDC reserve",
      "link": "https://cointelegraph.com/news/circle-applies-for-us-national-trust-bank-license?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2MzMTItYWE5NS03MDJkLWFhZWYtMjAwNzQxZjYwODli.jpg\" /></p><p>Other crypto firms are also reportedly considering applying for a national bank charter, following in the footsteps of Anchorage Digital Bank, which received a license in 2021.</p>"
    },
    {
      "title": "SOL price rallies to $161 after ETF news, but is the rally sustainable?",
      "link": "https://cointelegraph.com/news/sol-price-rallies-to-dollar161-after-etf-news-but-is-the-rally-sustainable?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2MyN2YtYWJlMi03MTlhLTgyNTAtOTJkNmE3ZWZiOTA4.jpg\" /></p><p>Solana's ETF launch sparks a brief rally, but fundamentals and institutional demand remain weak amid competition.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "DEXs capture almost 30% of CEX spot activity in June, setting new record",
      "link": "https://cryptoslate.com/dexs-capture-almost-30-of-cex-spot-activity-in-june-setting-new-record/",
      "summary": "<p>Decentralized exchanges (DEX) processed roughly $385 billion of spot trades in June, equal to almost 30% of the turnover recorded by centralized venues, according to DefiLlama and The Block data. The 30-day DEX figure represents a 12% decline from May, but centralized exchange (CEX) spot volume contracted nearly 30% in the same period. Notably, this [&#8230;]</p> <p>"
    },
    {
      "title": "German banking giant Sparkassen to offer crypto trading to 50 million customers by 2026",
      "link": "https://cryptoslate.com/german-banking-giant-sparkassen-to-offer-crypto-trading-to-50-million-customers-by-2026/",
      "summary": "<p>Germany’s largest banking group, Sparkassen-Finanzgruppe, is preparing to offer crypto trading services to its retail clients by summer 2026, Bloomberg News reported on June 30. The move represents a significant policy shift for Sparkassen, which had previously avoided crypto offerings due to concerns about volatility and risk. According to the report, the bank’s board of [&#8230;]</p> <p>"
    },
    {
      "title": "Circle targets federally regulated trust status to manage stablecoin reserves, offer custody services",
      "link": "https://cryptoslate.com/circle-targets-federally-regulated-trust-status-to-manage-stablecoin-reserves-offer-custody-services/",
      "summary": "<p>Circle applied to charter First National Digital Currency Bank to become a federally regulated trust that would manage USDC reserves and expand custody services for institutional clients. According to a June 30 announcement, Circle applied to the Office of the Comptroller of the Currency (OCC), seeking authority to operate as a national trust bank subject [&#8230;]</p> <p>"
    },
    {
      "title": "Macro conditions keep Bitcoin boxed between $100k and $110k, bulls awaiting catalyst",
      "link": "https://cryptoslate.com/macro-conditions-keep-bitcoin-boxed-between-100k-and-110k-bulls-awaiting-catalyst/",
      "summary": "<p>Bitcoin (BTC) is in a &#8220;waiting game,&#8221; trading between $100,000 and $110,000, with analysts highlighting the need for a macro catalyst to break the top of the channel. The latest &#8220;Bitfinex Alpha&#8221; report noted lighter spot activity, softer taker-buy flow, and profit-taking by wallets that had bought below $80,000 in April as the reasons behind [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum poised for $3,000 with regulatory tailwinds and ETF demand",
      "link": "https://cryptoslate.com/ethereum-poised-for-3000-with-regulatory-tailwinds-and-etf-demand/",
      "summary": "<p>Recent tailwinds such as staking on exchange-traded funds (ETFs) and regulatory clarity may drive Ethereum (ETH) toward $3,000 in the coming weeks, according to a note by MEXC Research. As of press time, ETH was trading at $2,510, up 3% over the past 24 hours. MEXC Research linked the upside scenario to two key drivers: [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Surges, Then Cools — Will Bulls Return for Round Two?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-surges-then-cools-2-20/",
      "summary": "XRP price started a steady increase above the $2.220 zone. The price is now correcting gains and might find bids near the $2.20 zone. XRP price started a fresh increase above the $2.220 zone. The price is now trading above $2.180 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.20 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could gain bullish momentum if it clears the $2.280 resistance zone. XRP Price Regains Traction XRP price formed a base above the $2.120 level and started a fresh increase, beating Bitcoin and Ethereum. The price was able to climb above the $2.180 and $2.20 resistance levels. The pair even surged above the $2.30 level. A high was formed at $2.327 and the price is now correcting gains. There was a move below the $2.280 level. It dipped below the 50% Fib retracement level of the upward move from the $2.165 swing low to the $2.327 high. The price is now trading above $2.180 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.20 on the hourly chart of the XRP/USD pair. It is close to the 76.4% Fib retracement level of the upward move from the $2.165 swing low to the $2.327 high. On the upside, the price might face resistance near the $2.280 level. The first major resistance is near the $2.30 level. The next resistance is $2.320. A clear move above the $2.320 resistance might send the price toward the $2.350 resistance. Any more gains might send the price toward the $2.40 resistance or even $2.450 in the near term. The next major hurdle for the bulls might be $2.50. Fresh Decline? If XRP fails to clear the $2.280 resistance zone, it could start another decline. Initial support on the downside is near the $2.220 level. The next major support is near the $2.20 level. If there is a downside break and a close below the $2.20 level, the price might continue to decline toward the $2.150 support. The next major support sits near the $2.120 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.220 and $2.20. Major Resistance Levels – $2.280 and $2.320."
    },
    {
      "title": "Big Money Buys Ethereum as Retail FOMOs Into Bitcoin, What Happens Next?",
      "link": "https://www.newsbtc.com/bitcoin-news/big-money-buys-ethereum-as-retail-fomos-into-bitcoin-what-happens-next/",
      "summary": "Bitcoin and Ethereum both posted modest gains in the past week, with BTC rising 6.2% and ETH up by 9.6%. However, momentum appears to have paused at the start of the new week. As of Monday, Bitcoin trades just above $107,000 after a slight 0.6% daily dip, while Ethereum has remained flat over the past 24 hours. Analysts have turned to blockchain data and macro signals for cues on where the market may head next. Related Reading: Bitcoin Freezes Over $100,000 As OG Whales ‘Dump On Wall Street’: Expert Bitcoin and Ethereum Onchain Trend Recent insights from CryptoQuant Quicktake platform contributor Amr Taha provide some context behind the price action. In a detailed post, Taha noted that Ethereum inflows to Binance have continued for five consecutive days, a trend that could suggest either rising sell pressure or repositioning by major players. At the same time, data from Bitcoin’s short-term holder (STH) Net Position Realized Cap shows a notable reversal, increasing from negative $49 billion to over $5 billion. This pattern is typically associated with increased activity from retail investors, especially during periods of upward price movement. Taha noted: Historically, spikes in (STH) occur near potential market tops, as retail investors tend to FOMO into Bitcoin rallies. While this doesn&#8217;t necessarily signal a reversal, it has often preceded short-term corrections or periods of sideways consolidation. Bitcoin’s steady climb in June, despite occasional pullbacks, appears to have encouraged smaller investors to re-enter the market. In the case of Ethereum, another CryptoQuant analyst, “crypto sunmoon,” pointed to continued accumulation by long-term holders during last month’s price consolidation. This suggests a different dynamic is at play on the Ethereum side, with more patient capital building positions amid ongoing price suppression. Long-term holder accumulation often indicates growing confidence in an asset’s future, even if current market conditions appear lackluster. US Policy and Macro Risk Add Layers to Market Outlook Beyond market behavior, external factors may also shape crypto price action. Amr Taha highlighted recent political developments in the United States, particularly former President Donald Trump’s announcement of a proposed Senate bill promising wide-reaching tax cuts. The bill, which excludes taxes on tips, overtime, and Social Security income, could lead to an increase in consumer liquidity. If passed, this could impact investor appetite across both traditional and digital markets by temporarily boosting household spending power. Related Reading: Bitcoin Bears Are Taking Fresh Market Positions, But Are They Safe? However, not everybody is convinced of the bill’s long-term implications. Tesla CEO Elon Musk warned that the measure, if not accompanied by spending cuts, could expand the federal deficit and lead to economic instability over time. Large fiscal imbalances often have ripple effects on monetary policy, potentially affecting interest rates, inflation expectations, and risk sentiment, all of which can influence investor behavior in crypto markets. Taha concluded: Geopolitical disturbances can significantly impact investor sentiment. In response, investors might reconsider their positions in asset markets, possibly moving away from riskier assets and equities toward more stable options like bonds or safe-haven currencies. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Ethereum Price Readies for Takeoff — Bulls Eye Fresh Highs",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-readies-takeoff-2520/",
      "summary": "Ethereum price started a fresh increase above the $2,485 zone. ETH is now consolidating gains and might soon aim for a move above the $2,520 resistance. Ethereum started a fresh upward move above the $2,465 level. The price is trading above $2,460 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,450 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it remains stable above the $2,400 zone in the near term. Ethereum Price Eyes Fresh Gains Ethereum price started a fresh increase above the $2,440 support level, like Bitcoin. ETH price was able to clear the $2,460 and $2,480 resistance levels to move into a positive zone. The bulls even pushed the price above the $2,500 zone. However, the bears were active near the $2,520 level. A high was formed at $2,522 and the price is now consolidating gains. The price dipped below the 23.6% Fib retracement level of the upward move from the $2,435 swing low to the $2,522 high. Ethereum price is now trading above $2,460 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $2,450 on the hourly chart of ETH/USD. It is close to the 76.4% Fib retracement level of the upward move from the $2,435 swing low to the $2,522 high. On the upside, the price could face resistance near the $2,520 level. The next key resistance is near the $2,550 level. The first major resistance is near the $2,600 level. A clear move above the $2,600 resistance might send the price toward the $2,680 resistance. An upside break above the $2,680 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,750 resistance zone or even $2,800 in the near term. Downside Break In ETH? If Ethereum fails to clear the $2,520 resistance, it could start a fresh decline. Initial support on the downside is near the $2,450 level and the trend line. The first major support sits near the $2,420 zone. A clear move below the $2,420 support might push the price toward the $2,400 support. Any more losses might send the price toward the $2,350 support level in the near term. The next key support sits at $2,320. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,420 Major Resistance Level – $2,520"
    },
    {
      "title": "Bitcoin July Preview: History Says Don’t Trust The Quiet",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-july-preview-history-dont-trust-the-quiet/",
      "summary": "Market tactician Daan Crypto Trades (@DaanCrypto) has put a statistical spotlight on Bitcoin’s habit of dozing through June before rewarding – and sometimes punishing – traders in the following quarter. “BTC June has historically been a pretty slow month,” he wrote, noting that the just-ended period was no exception, with spot prices meandering in a narrow band and finishing “pretty flat.” The comment was accompanied by a Coinglass heat-map of monthly returns that reaches back to 2013 and vividly illustrates the summer pattern he is talking about. What July Hides For Bitcoin The numbers support the observation. According to the Coinglass dataset, the mean return for June over the past twelve years is essentially zero (-0.12 %), while July posts a respectable +7.56% on average and an even stronger +8.90 % on the median. August cools to a modest +1.75% mean, and September is where the sell-side pressure historically bites, averaging -3.77% with a negative median of -4.35%. Related Reading: Bitcoin Freezes Over $100,000 As OG Whales ‘Dump On Wall Street’: Expert A simple frequency count underscores the asymmetry: July has finished green in eight of the last twelve years, whereas August and September managed only four positive outcomes each. Years that veterans still recall – 2017’s +65.32 % August melt-up followed by a -7.44 % September slide, or 2020’s +24.03 % July rally that surrendered to a -7.51 % September pullback – appear to have etched the “big flush-out” narrative into collective memory. Daan’s takeaway is behavioural rather than predictive: “August &#38; September are where we often see a big flush-out but are also the dips you often want to be buying into the end-of-the-year rally… it’s good to be aware of these seasonalities. That way you can focus more on the larger timeframe and won’t get spooked or get over-excited too easily.” The comment arrives just as Bitcoin tests a cluster of long-timeframe resistances. In a post on Saturday he reminded followers that BTC is “close to all-time high but at resistance… [it] is yet to close a weekly or more than two consecutive daily candles above that resistance. Once it does, we can start getting excited for a larger move.” Related Reading: Bitcoin Bears Are Taking Fresh Market Positions, But Are They Safe? The seasonality conversation matters because it collides with a crowded macro calendar and a notoriously illiquid holiday stretch. While historical averages do not guarantee future performance, the heat-map suggests that directional conviction often returns in October – the best-performing month on the table with a +21.89 % mean. For traders, that leaves a two-month corridor in which whipsaw moves are common and positioning discipline becomes paramount. Daan extends the framework to altcoins via the TOTAL3 index (crypto market cap excluding Bitcoin and Ether). “The TOTAL Altcoin Market Cap has held on to its local support but is still not showing any clear trend… to really get this high timeframe move going you want to break those local highs above the ~$950 B mark. At that point you can start aiming for cycle highs.” Whether 2025 repeats the seasonality script will hinge on the macro environment, ETF inflows and, above all, Bitcoin’s ability to convert resistance into fresh price discovery. Until that weekly close arrives, seasoned traders appear content to keep summer expectations firmly tethered to the data – exactly as Daan recommends. At press time, BTC traded at $107,344. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Holds Steady — Bullish Monthly Structure Suggests Rally Continuation",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-holds-steady-106k/",
      "summary": "Bitcoin price started trading in a range below the $108,800 zone. BTC is now consolidating and might aim for a move above the $108,000 resistance. Bitcoin started a downside correction from the $108,800 zone. The price is trading below $107,500 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $107,400 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $105,500 zone. Bitcoin Price Eyes Fresh Gains Bitcoin price started a fresh increase above the $105,500 zone. BTC gained pace and was able to climb above the $106,500 and $107,200 levels to enter a positive zone. The bulls pushed the price above the $108,000 resistance and the price tested the $108,800 zone. A high was formed at $108,792 and the price recently corrected gains. There was a move below the $107,500 level. A low was formed at $106,800 and the price is now consolidating losses. There was a recovery above the 23.6% Fib retracement level of the downward move from the $108,792 swing high to the $106,800 low. Bitcoin is now trading below $107,500 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $107,400 level. There is also a bearish trend line forming with resistance at $107,400 on the hourly chart of the BTC/USD pair. The first key resistance is near the $108,000 level and the 50% Fib level of the downward move from the $108,792 swing high to the $106,800 low. A close above the $108,000 resistance might send the price further higher. In the stated case, the price could rise and test the $108,800 resistance level. Any more gains might send the price toward the $110,000 level. More Losses In BTC? If Bitcoin fails to rise above the $108,000 resistance zone, it could start another decline. Immediate support is near the $106,800 level. The first major support is near the $106,500 level. The next support is now near the $105,500 zone. Any more losses might send the price toward the $105,000 support in the near term. The main support sits at $103,500, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $106,800, followed by $106,500. Major Resistance Levels – $108,000 and $108,800."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "German Bank Sparkassen-Finanzgruppe Plans to Offer Bitcoin For Private Customers",
      "link": "https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/German-Bank-Sparkassen-Finanzgruppe-Plans-to-Offer-Bitcoin-For-Private-Customers.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers\" rel=\"nofollow\"> </a></p> <p>Germany's largest savings bank financial group will allow private customers to trade Bitcoin and other cryptocurrencies by 2026, in partnership with DekaBank.</p> <p>"
    },
    {
      "title": "How Institutional Flows and Market Cycles Are Shifting",
      "link": "https://bitcoinmagazine.com/markets/how-institutional-flows-and-market-cycles-are-shifting",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/How-Institutional-Flows-and-Market-Cycles-Are-Shifting.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/how-institutional-flows-and-market-cycles-are-shifting\" rel=\"nofollow\"> </a></p> <p>Is bitcoin going higher or lower? Fundamentals are still strong, and post-halving trends show a predictable pattern.</p> <p>"
    },
    {
      "title": "Are Bitcoin Treasury Companies Ponzi Schemes?",
      "link": "https://bitcoinmagazine.com/takes/are-bitcoin-treasury-companies-ponzis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_Generated_Image_xrkcodxrkcodxrkc-1.jpeg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/are-bitcoin-treasury-companies-ponzis\" rel=\"nofollow\"> </a></p> <p>Financial machines of perpetual motion don’t work but bitcoin treasury companies are certainly trying. Why would this fad be any different?</p> <p>"
    },
    {
      "title": "Vanadi Coffee Shareholders Approve €1 Billion Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/vanadi-coffee-shareholders-approve-e1-billion-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Vanadi-Coffee.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/vanadi-coffee-shareholders-approve-e1-billion-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Shareholders of Vanadi Coffee have approved a plan to invest up to €1 billion in Bitcoin as part of a new strategy to manage the company’s finances. This move puts the small café chain, which runs six locations in Alicante, on track to become the largest publicly listed Bitcoin-holding company in Spain.&#160; According to an [&#8230;]</p> <p>"
    },
    {
      "title": "Strategy Acquires $531.9 Million in Bitcoin, Now Holds 597,325 BTC",
      "link": "https://bitcoinmagazine.com/news/strategy-acquires-531-9-million-in-bitcoin-now-holds-597325-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Strategy-Acquires-531.9-Million-in-Bitcoin-Now-Holds-597325-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/strategy-acquires-531-9-million-in-bitcoin-now-holds-597325-btc\" rel=\"nofollow\"> </a></p> <p>Strategy, formerly Microstrategy, has announced the acquisition of an additional 4,980 Bitcoin for approximately $531.9 million, according to a new SEC Form 8-K filed on June 30, 2025. The average purchase price was $106,801 per Bitcoin, inclusive of fees and expenses. The purchase was funded by an equity raise from June 23–29, 2025, across its [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Rex-Osprey Solana ETF to Debut 'First-Ever' US Crypto Fund With Staking",
      "link": "https://decrypt.co/327872/rex-osprey-solana-etf-debut-first-ever-us-crypto-fund-staking",
      "summary": "Rex Shares and Osprey Funds is set to launch the first U.S. ETF offering direct Solana exposure with staking rewards."
    },
    {
      "title": "Mark Zuckerberg Unveils New Meta AI Lab After Poaching OpenAI Talent",
      "link": "https://decrypt.co/327894/after-poaching-openai-talent-mark-zuckerberg-unveils-new-meta-ai-lab",
      "summary": "Meta is throwing huge bucks to lure away top talent in the high-stakes AI race, prompting the company to give its employees the week off to cool down."
    },
    {
      "title": "Solana Advisor Nikita Bier Joins Elon Musk's X, Reigniting Crypto Payments Speculation",
      "link": "https://decrypt.co/327908/solana-advisor-nikita-bier-joins-elon-musk-x-crypto-payments",
      "summary": "Bier’s announcement is fueling speculation about X's future crypto payment plans, including long-rumored Dogecoin integration."
    },
    {
      "title": "Trump Admin Beats Coinbase, Privacy Advocates in Supreme Court IRS Showdown",
      "link": "https://decrypt.co/327898/trump-admin-beats-coinbase-privacy-advocates-supreme-court-irs-showdown",
      "summary": "The Supreme Court declined on Monday to hear a case that could have re-examined whether crypto exchanges like Coinbase need to comply with government requests for customer data."
    },
    {
      "title": "How GameStop Inspired This Lingerie MMA League to Bet on Bitcoin",
      "link": "https://decrypt.co/327861/how-gamestop-inspired-lingerie-mma-league-bet-bitcoin",
      "summary": "Lingerie Fighting Championships started to seriously consider Bitcoin as a treasury asset following GameStop's recent buy."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Circle applies for national trust bank license to expand USDC reserve custody",
      "link": "https://cryptobriefing.com/circle-trust-bank-license-tokenized/",
      "summary": "<p>Circle seeks a trust bank license to directly manage USDC reserves and offer custody for tokenized stocks and bonds onchain.</p> <p>"
    },
    {
      "title": "SEC to rule on Grayscale’s proposal to convert Bitcoin, Ether, XRP, and ADA large-cap fund into a spot ETF this week",
      "link": "https://cryptobriefing.com/crypto-etf-approval-grayscale/",
      "summary": "<p>Approval could set a precedent for broader crypto ETF adoption, potentially transforming investment landscapes and regulatory approaches.</p> <p>"
    },
    {
      "title": "Ripple-backed XRP Ledger launches EVM-compatible sidechain to unlock cross-chain DeFi",
      "link": "https://cryptobriefing.com/xrpl-evm-sidechain-cross-chain-defi/",
      "summary": "<p>The launch of the EVM-compatible sidechain on the XRP Ledger could significantly enhance cross-chain DeFi, fostering broader blockchain interoperability.</p> <p>"
    },
    {
      "title": "Backed rolls out tokenized Apple, Microsoft, and Amazon stocks on Bybit and Kraken",
      "link": "https://cryptobriefing.com/kraken-tokenized-stock-trading/",
      "summary": "<p>Kraken's xStocks could revolutionize global equity access, challenging traditional markets and enhancing blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Kazakhstan plans to establish national crypto reserve using seized and state-mined assets",
      "link": "https://cryptobriefing.com/kazakhstan-crypto-asset-reserve/",
      "summary": "<p>Kazakhstan's crypto reserve initiative could enhance financial innovation and regulatory frameworks, potentially influencing global crypto policies.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "TRON’s KEY metric points to a possible TRX breakout – Assessing odds…",
      "link": "https://ambcrypto.com/trons-key-metric-points-to-a-possible-trx-breakout-assessing-odds/",
      "summary": "<img alt=\"TRX\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-30T160118.387-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TRX trades within a tightening structure as large holders accumulate and retail waits on the sidelines."
    },
    {
      "title": "Solana stalls, whale dumps 240K SOL – Time to worry about the price?",
      "link": "https://ambcrypto.com/solana-stalls-whale-dumps-240k-sol-time-to-worry-about-the-price/",
      "summary": "<img alt=\"Solana\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-22-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana faces whale sell pressure, but retail accumulation and futures activity hint at bullish recovery."
    },
    {
      "title": "Identifying Cardano’s next short-term target as bulls seek reversal",
      "link": "https://ambcrypto.com/identifying-cardanos-next-short-term-target-as-bulls-seek-reversal/",
      "summary": "<img alt=\"Identifying Cardano&#039;s next short-term target as bulls seek reversal\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Cardano-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Weak bearish pressure over the past week could allow ADA to establish a bullish structure."
    },
    {
      "title": "Bitcoin to $130K? –  BTC traders, watch THESE levels next",
      "link": "https://ambcrypto.com/bitcoin-to-130k-btc-traders-watch-these-levels-next/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-1-1.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Heightened liquidations clusters around the current Bitcoin price could define the next targets."
    },
    {
      "title": "Toncoin: Can a 42% hike in whale inflows propel TON to $3.28?",
      "link": "https://ambcrypto.com/toncoin-can-a-42-hike-in-whale-inflows-propel-ton-to-3-28/",
      "summary": "<img alt=\"TON\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-30T120257.392-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Toncoin’s breakout potential strengthens as on-chain growth aligns with rising trading and user activity."
    }
  ]
}