{
  "CoinDesk": [
    {
      "title": "ProShares Launches Leveraged Solana and XRP ETFs Following NYSE Arca Approval",
      "link": "https://www.coindesk.com/markets/2025/07/15/proshares-launches-leveraged-solana-and-xrp-etfs-following-nyse-arca-approval",
      "summary": ""
    },
    {
      "title": "U.S. Prosecutors, CFTC Drop Polymarket Investigations",
      "link": "https://www.coindesk.com/policy/2025/07/15/us-prosecutors-cftc-drop-polymarket-investigations",
      "summary": ""
    },
    {
      "title": "ICP Slides 3% But Caffeine Launch Sparks Rebound",
      "link": "https://www.coindesk.com/markets/2025/07/15/icp-slides-3-but-caffeine-launch-sparks-rebound",
      "summary": ""
    },
    {
      "title": "Stablecoins May Reshape U.S. Treasury Market at $750B Threshold, Standard Chartered Says",
      "link": "https://www.coindesk.com/markets/2025/07/15/stablecoins-may-reshape-u-s-treasury-market-at-usd750b-threshold-standard-chartered-says",
      "summary": ""
    },
    {
      "title": "BNB Slips Nearly 2% as Traders Cash Out After Run Higher",
      "link": "https://www.coindesk.com/markets/2025/07/15/bnb-slips-nearly-2-as-traders-cash-out-after-run-higher",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "New Zealand woman accused of killing mother after stealing cash for crypto",
      "link": "https://cointelegraph.com/news/new-zealand-woman-accused-killing-mother-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5ODBjZDktYzJjYi03MWE1LWE2MjYtNmI2YmQwM2I0YWU2.jpg\" /></p><p>New Zealander Julia DeLuney is accused of murdering her mother, Helen Gregory, after allegedly stealing tens of thousands of dollars in hidden cash to invest in cryptocurrency.</p>"
    },
    {
      "title": "XRP news update: Uptick in whale volumes could catalyze rally to $4",
      "link": "https://cointelegraph.com/news/xrp-news-update-uptick-in-whale-volumes-could-catalyze-rally-to-dollar4?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzg3MTUtNGYwNS03MDE5LTlhNzAtNGIzN2U2YmY3NDU0.jpg\" /></p><p>XRP saw profit booking at $3 but steady buying by large investors suggests the rally could send the altcoin’s price to $4.</p>"
    },
    {
      "title": "Ripple, Coinbase, MoonPay execs to advise California on gov’t efficiency",
      "link": "https://cointelegraph.com/news/california-blockchain-task-force-ripple-coinbase-launch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWM4ODItMjA4My03YTAxLWE4NzUtZTEwNDAwNTgxY2Zh.jpg\" /></p><p>The California Breakthrough Project held its first meeting at Ripple’s San Francisco headquarters, according to journalist Eleanor Terrett.</p>"
    },
    {
      "title": "The Bitcoin treasury model is breaking, but Strategy’s isn’t. Here’s why",
      "link": "https://cointelegraph.com/explained/the-bitcoin-treasury-model-is-breaking-but-strategys-isnt-heres-why?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy85ZTE5ZTFlMjg0ODY0MGEyNGU1YjI0NDI0ZmM3MzRlNi5qcGc=.jpg\" /></p><p>As Bitcoin treasury bets stumble in 2025, Strategy thrives with disciplined capital, mNAV premiums and long-term focus.</p>"
    },
    {
      "title": "US Justice Department, CFTC end Polymarket investigations — Report",
      "link": "https://cointelegraph.com/news/justice-department-ends-investigation-polymarket?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5ODBlYjQtNjNhZi03ZDU3LWIwYTktYmMxYjA4N2RiZDhk.jpg\" /></p><p>With investigations from two major US agencies now reportedly closed, Polymarket has reached a critical regulatory milestone ahead of its $200 million funding round.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Fidelity subsidiary becomes largest Metaplanet shareholder with $816M stake",
      "link": "https://cryptoslate.com/fidelity-subsidiary-becomes-largest-metaplanet-shareholder-with-816m-stake/",
      "summary": "<p>Metaplanet has announced that National Financial Services LLC (NFS), a subsidiary of Fidelity Investments, is now its largest shareholder. In a July 15 disclosure, the firm revealed that NFS holds 84.4 million shares, equivalent to 12.9% of its total equity. Based on current valuations, this stake is worth approximately ¥121 billion or around $816 million. [&#8230;]</p> <p>"
    },
    {
      "title": "$100M investor in Trump’s World Liberty Financial denies links to banned Chinese market maker",
      "link": "https://cryptoslate.com/100m-investor-in-trumps-world-liberty-financial-denies-links-to-banned-chinese-market-maker/",
      "summary": "<p>Aqua1 Foundation, a UAE-based investor in the World Liberty Financial (WLFI) DeFi project, has publicly denied affiliation with Chinese market-making firm Web3Port. The clarification comes in response to growing speculation surrounding the fund&#8217;s recent $100 million investment in World Liberty Financial, a blockchain project with ties to US President Donald Trump. Relationship with Web3Port? On [&#8230;]</p> <p>"
    },
    {
      "title": "Solana RWAs surge 217% hitting $553 million in real world assets as memecoins lose focus",
      "link": "https://cryptoslate.com/solana-rwas-surge-217-to-hit-553-million-in-real-world-assets-as-memecoins-lose-focus/",
      "summary": "<p>Solana&#8217;s tokenized Real-World Asset (RWA) market surpassed $550 million and rocketed up 217% year-to-date in 2025. The explosive growth, more than double the pace of the broader market, positions the high-speed blockchain as a serious challenger to Ethereum&#8217;s long-held dominance in one of crypto&#8217;s most promising sectors. As of press time, Solana has reached $558 [&#8230;]</p> <p>"
    },
    {
      "title": "OpenEden and Ceffu Introduce First Yield-Bearing Collateral for Institutional Clients on Binance",
      "link": "https://cryptoslate.com/openeden-and-ceffu-introduce-first-yield-bearing-collateral-for-institutional-clients-on-binance/",
      "summary": "<p>OpenEden, a firm focused on real-world asset (RWA) tokenization, has announced the integration of its yield-bearing token cUSDO with Ceffu’s MirrorRSV platform. The collaboration enables institutional clients to use cUSDO as off-exchange collateral for margin trading on Binance while maintaining segregated custody through Ceffu. The development introduces the first instance of yield-bearing collateral being accepted [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin’s new all-time high triggers $3.5 billion profit-taking spree in 24 hours",
      "link": "https://cryptoslate.com/insights/bitcoins-new-all-time-high-triggers-3-5-billion-profit-taking-spree-in-24-hours/",
      "summary": "<p>Profit-taking activity surged across the Bitcoin network during the last 24 hours after the leading crypto asset reached a new all-time high of over $123,000. Data from blockchain analytics firm Glassnode shows that total realized profits in the market jumped to $3.5 billion, marking one of the largest single-day profit realizations for Bitcoin this year. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Bears Strike Back After ATH: Long/Short Ratio Flips Negative",
      "link": "https://www.newsbtc.com/news/bitcoin-bears-strike-back-after-ath-long-short-ratio-flips-negative/",
      "summary": "Bitcoin is undergoing a slight retrace after hitting a new all-time high of $123,000 on Monday. While the broader trend remains bullish, short-term sentiment has shifted as selling pressure begins to build. Bulls are now defending key support levels, with the $117,000 zone emerging as a critical line that could determine whether the uptrend holds or deeper corrections follow. Related Reading: Ethereum Supply Locked Hits New ATH: Smart Money Bets On Long-Term Growth The pullback has introduced fresh uncertainty into the market. According to new data from CryptoQuant, Bitcoin Futures Position Dominance has started to lean bearish, suggesting that short positions are gaining momentum across major derivatives platforms. This shift reflects growing caution among traders, particularly as long-to-short ratios weaken and funding rates normalize after weeks of elevated bullish activity. Although Bitcoin remains far above its 2024 highs and the macro structure still favors bulls, the current pause is being closely watched. Investors are looking for confirmation that the recent all-time high was not a local top. With fear slowly creeping in and derivatives data flashing early warning signs, the coming days could be pivotal. Whether bulls can hold the line—or whether bears take control—will likely set the tone for Bitcoin’s next major move. Bitcoin Retraces As Bearish Sentiment Rises Bitcoin has pulled back more than 5% since reaching its all-time high of $123,000 earlier this week, with current price action testing the strength of short-term support levels. While retracements are common after major breakouts, some analysts note that Bitcoin’s decline has been sharper than that of Ethereum and many altcoins, which have either held their ground or continued to climb. Top analyst Axel Adler pointed out a significant shift in sentiment following the ATH. According to his insights, bears began aggressively shorting immediately after the price peak, leading to a sharp drop in bullish dominance. Most notably, the long-to-short ratio flipped into negative territory for the first time in weeks, signaling a clear rise in short interest across derivatives platforms. This pivot in positioning reflects growing caution among traders and raises the stakes for bulls. The $117,000 level is now seen as a key support zone—if Bitcoin fails to hold above it, a deeper correction could follow, potentially dragging the broader market down with it. The timing is especially critical. This week, the US Congress kicks off “Crypto Week,” a series of discussions and potential votes on important legislation that could reshape the regulatory landscape for digital assets. The outcome of these debates may act as a catalyst for renewed bullish momentum—or deepen the correction if uncertainty dominates. As markets brace for clarity, all eyes remain on Bitcoin’s ability to defend $117K and reclaim its short-term trend. Related Reading: $30B In Bitcoin Added By Accumulator Wallets: Are Long-Term Players Preparing Early? BTC Pulls Back: $114K–$117K Key Zone to Watch The 4-hour chart shows Bitcoin retracing sharply after reaching an all-time high of $123,200 earlier this week. Currently trading at $116,900, BTC has dropped over 5% from its recent peak, marking its first significant correction since the breakout above $109,300. This pullback brings Bitcoin back toward the $114,000–$117,000 zone, which now acts as short-term support. This area coincides with the rising 50-period simple moving average (SMA) at $114,466 and is closely aligned with the previous breakout structure. A successful retest of this level could provide the foundation for a new leg higher. Related Reading: Bitcoin Long-Term Holders Remain Steady As CDD Normalizes After False Alarm However, failure to hold this zone could open the door for a deeper correction toward the $109,300 support level, which served as a multi-week resistance throughout May and June. The bearish momentum on the latest candles, combined with high sell volume, reflects rising short-term uncertainty. Despite this, Bitcoin remains above all major moving averages on this timeframe (50, 100, and 200 SMAs), indicating that the broader trend is still intact. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Ethereum Shines Bright As Bank Of America Begins Digital Asset Tracking",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-shines-bright-as-bank-of-america-begins-digital-asset-tracking/",
      "summary": "A new weekly “On Chain” report from Bank of America is shining a spotlight on Ethereum. According to the report, the network is set to draw steady interest from stablecoin investors as lawmakers in Washington take up crypto bills in Congress. Ethereum’s role as the home for over 50% of all dollar‑pegged coins has caught the eyes of big banks and asset managers alike. Related Reading: XRP To Hit $4 This Week? This Crypto Expert Thinks So Stablecoin Legislation Under The Lens Based on reports, this week’s Crypto Week in the US House of Representatives could reshape the stablecoin sector. Lawmakers are debating three major bills: the GENIUS Act, the CLARITY Act, and the Anti‑CBDC Surveillance bill. House Financial Services Chair French Hill told a “Think Crypto” podcast that dollar‑backed coins would solidify the US dollar’s global lead. If Congress backs clear rules, the rails that already carry the most volumes could see fresh inflows. BofA launches new weekly periodical &#8216;On Chain,&#8217; designed to &#8220;drill into the various facets of the fast-evolving digital assets ecosystem.&#8221; First call: Bullish ETH pic.twitter.com/sERRZiTgMq — matthew sigel, recovering CFA (@matthew_sigel) July 14, 2025 Rails For The Future Bank of America called out infrastructure providers like Stripe and the Ethereum network as prime plays for anyone looking to get stablecoin exposure. That nod isn’t just for the token itself. It’s a bet on the whole stack—wallets, apps and payment tools that ride on Ethereum’s code. Investors who pick up Ether now could tap growing on‑chain activity as stablecoin use climbs. Institutions Bet On Ether The report also mentioned Treasury Secretary Scott Bessent predicting that the dollar‑pegged stablecoin market may swell to $2 trillion in the next five years. That forecast has fund managers circling the charts. Thomas Lee, Fundstart CIO and new chairman of BitMine, even dubbed stablecoins the “ChatGPT of crypto.” His firm now holds Ether in its treasury. The move shows how big players are gearing up for a stablecoin surge on Ethereum. Related Reading: Avalanche Shatters Record With 20M Transactions—Is Real-World Use Finally Here? Other sectors are racing alongside stablecoins. BlackRock CEO Larry Fink said tokenization could expand 4,000 times over time. He sees on‑chain assets tied to real‑world items booming soon. Some say XRP and Ether are the go‑to tokens for that play. But Ethereum already has the advantage of scale. It isn’t all smooth sailing. Regulation could tighten or split along different chains. New networks chase faster speeds and lower fees. That competition could chip away at Ethereum’s lead. Still, the network’s mix of smart‑contract tools and high stablecoin volumes gives it a strong head start. For now, plenty of eyes are on Congress and on‑chain data. If US lawmakers set clear stablecoin rules, Ethereum may keep its crown as the top hub. Investors looking for exposure will likely track Ether flows and watch the bills as they move through committee. The weeks ahead could spell out the next big chapter for the network. Featured image from Pexels, chart from TradingView"
    },
    {
      "title": "Unraveling The Bitcoin Boom: Experts Decode Record $123,000 Surge",
      "link": "https://www.newsbtc.com/bitcoin-news/unraveling-the-bitcoin-boom-experts-decode-record-123000-surge/",
      "summary": "In a major display of bullish momentum, the market’s leading cryptocurrency, Bitcoin (BTC), surged to a new record high on Monday, surpassing $123,000 for the first time. US House Kicks Off &#8216;Crypto Week The Bitcoin price climbed more than 90% year-to-date with Monday’s rally, reaching $123,200, and reflecting a nearly 15% increase over the past month. This upward momentum coincides with the US House of Representatives&#8217; “crypto week,” which will feature debates on legislation aimed at reducing regulatory hurdles that have long been viewed as obstacles for the cryptocurrency sector. Related Reading: Fibonacci Maps Dogecoin Path To $23—Is It Too Far-Fetched? One of the key pieces of legislation set for discussion in the House is the GENIUS Act, which aims to establish regulatory frameworks for stablecoins. Proponents of the GENIUS Act argue that it is a groundbreaking initiative that formalizes a critical aspect of the cryptocurrency industry. They believe it will enhance consumer protections, facilitate the entry of traditional financial institutions, and contribute to the growth of the digital currency market. Conversely, critics assert that the bill represents a “weak set of regulations” that may not adequately safeguard consumers or prevent illicit trading activities involving stablecoins. Growing Support For Crypto Regulation In addition to the GENIUS Act, the House will also debate measures to clarify the federal government&#8217;s regulatory approach to cryptocurrencies and proposals that could prevent the Federal Reserve from issuing its own digital currency. Bryan Armour, director of passive strategies research at Morningstar, remarked that this legislative push reflects a series of favorable developments for the crypto industry since President Donald Trump&#8217;s election in November. Since then, Bitcoin&#8217;s price has surged nearly 80%. As “crypto week” unfolds, Armour suggests it signals a continuation of supportive policies under the Trump administration. However, Trump’s involvement in the cryptocurrency space has raised concerns about potential conflicts of interest. For instance, his backing of World Liberty Financial&#8217;s stablecoin, USD1, has led to significant investments in major exchanges like Binance, which critics say creates opportunities for Trump’s business to profit. Despite these concerns, Trump has denied any wrongdoing, and a White House spokesperson has stated that his financial assets are managed in a trust to avoid conflicts. Bitcoin ETFs Propel Price Surge The recent surge in Bitcoin prices has also been fueled by the US approval of Bitcoin exchange-traded funds (ETFs) last year. These investment vehicles have proven to be successful, with record-breaking amounts of capital moving into them. Related Reading: Prepare For ATHs: ‘XRP Train Has Left The Station – Analyst The overall asset value of Bitcoin ETFs has reached a record high of over $158 billion, driven by a wave of investments that included over a billion dollars flowing into these funds on consecutive days last week. Nikhil Bhatia, a finance professor at the University of Southern California, noted that the approval of Bitcoin ETFs has contributed significantly to institutional adoption of Bitcoin, signaling a return to a bullish market sentiment. As of this writing, BTC’s price has retraced back to the $117,000 level, 4.3% below its recently achieved all-time high. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Dogecoin Poised For A Monster Rally Amid Brewing Altcoin Season",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-monster-rally-amid-brewing-altcoin-season/",
      "summary": "In livestream that stretched beyond the hour‑mark, technical analyst Kevin (Kev Capital TA) laid out the most compelling bullish case for Dogecoin since the meme‑coin’s April lows. Speaking to a cross‑platform audience, Kevin argued that the market is standing “right on the verge of a genuine altcoin season,” and that the textbook double‑bottom visible on Dogecoin’s higher‑time‑frame chart positions the asset for what he called “a monster move” once resistance levels yield. Dogecoin Chart Turns Bullish Kevin began by situating Dogecoin inside a broader macro chessboard. This week’s cascade of inflation data—CPI and PPI prints bracketed by near‑continuous Federal Reserve commentary—could inject volatility, he conceded, but the direction of trend is already set by structural forces. “Trueflation is sitting at 1.71 percent,” he noted, adding that the crowdsourced gauge routinely prints about sixty to seventy basis points beneath official Bureau of Labor Statistics data. “Anything under two is good. It means inflation isn’t the story.” Related Reading: Fibonacci Maps Dogecoin Path To $23—Is It Too Far-Fetched? With macro risks in check, his focus narrowed to USDT dominance, the metric he has used all cycle to time rotations into riskier assets. Tether’s market‑share chart has completed a bear‑flag breakdown and is now pressing the 0.786 Fibonacci support band at roughly 4.14 percent. “When money‑flow is deep red on USDT‑D, that’s the green light for altcoins,” he said, emphasising that fresh downside in the stablecoin gauge would coincide almost mechanically with upside in DOGE. A hotter‑than‑expected CPI could deliver a short, counter‑trend bounce in USDT‑D, “but the path of least resistance is lower,” he insisted. The anchor for Kevin’s bullish thesis is an unmistakable double‑bottom on Dogecoin’s weekly chart that formed exactly on the macro 0.382 retracement of the 2024–25 advance and directly atop a multi‑year down‑trend line. “Flip the chart upside‑down,” he told viewers, “and you’d run from it—it looks like a perfect double‑top. Flip it back and it’s a gift.” Volume profiles confirm the pattern: sellers exhausted themselves on the second dip, while relative‑strength momentum created a higher low, an early signal that bulls are wresting control. Kevin’s conviction draws added weight from what is unfolding in the aggregate altcoin indices. Total 3—market‑cap ex‑Bitcoin and ex‑Ether—has slammed into a resistance “yellow box” that capped rallies all spring, yet the analyst believes the ceiling will crack soon. A pending daily golden cross on Total 2 (market‑cap ex‑Bitcoin) marks the fourth of the cycle; each prior cross generated a brief pullback of 9‑19 percent before giving way to fresh highs. “Golden crosses are lagging, so you manage risk here—pay yourself a little—but the trend is higher once the dust settles,” he said. For Dogecoin specifically, Kevin identified a hierarchy of breakout objectives: the local range high at $0.21, the $0.48 pivot from 2024, and the former all‑time high near $0.74. Beyond that he flagged extensions at $1.32 and $2.00, noting that targets lose utility if projected too far in advance. “We analyse the here and now; we let the chart earn the next level,” he cautioned, before reminding newcomers that DOGE is already a ten‑bagger off its June 2024 trough—a feat matched by few large‑cap tokens. Related Reading: Dogecoin To $3.94 This Cycle? This Chart Says It’s No Meme While audience questions repeatedly drifted towards Elon Musk and X and Tesla integration rumors, Kevin waved off the cult of personality. “Dogecoin doesn’t need Elon,” he said bluntly. The meme‑coin’s 10× rebound happened “with zero help from the world’s richest man,” and any future endorsement would likely serve as accelerant rather than spark. What matters, in his view, is liquidity: specifically, the Federal Reserve’s balance‑sheet trajectory and the timing of its eventual pivot away from quantitative tightening. “When QT ends, Bitcoin dominance tops. Then you get the real alt‑season,” he said, pointing to a perfect inverse correlation between Fed asset‑runoff periods and historical altcoin booms. Ending the session, the analyst projected that a decisive weekly close above Bitcoin’s 1.886 fib at $120,000—and a simultaneous rollover in USDT dominance—would ignite the next leg. In that scenario, Dogecoin’s double‑bottom would evolve into a full trend‑reversal, vaulting price into territory last visited during the meme‑mania of 2021. “You haven’t seen anything yet,” he concluded. “Stay calm, stay cool, and let the chart do the work.” At press time, DOGE traded at $0.19126. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "TD Cowen Projects Bitcoin At $155K By Year-End, Raises Strategy’s Price Target",
      "link": "https://www.newsbtc.com/bitcoin-news/td-cowen-projects-bitcoin-at-155k-by-year-end-raises-strategys-price-target/",
      "summary": "Global investment bank TD Cowen has recently revised its price target for Strategy&#8217;s (previously MicroStrategy) stock, MSTR, raising it from $590 to $680 per share and a bullish prediction for Bitcoin (BTC) prices, which could soar to $155,000 by December. Possible 53% Drop For Bitcoin The firm’s study outlines a base-case scenario for Bitcoin at $128,000 by year-end, with a more pessimistic outlook placing it as low as $55,000, which could mean a major 53% crash from current prices. TD Cowen analysts assert that a significant increase in Bitcoin prices is expected to positively impact Strategy’s share price, given its status as the world’s largest corporate holder of Bitcoin. Related Reading: Prepare For ATHs: ‘XRP Train Has Left The Station – Analyst On July 14, Strategy purchased an additional 4,225 BTC for $472.5 million, averaging $111,827 per coin. This latest acquisition brings the company’s total Bitcoin holdings to an impressive 601,550 BTC. Analysts at TD Cowen noted that what began as a defensive measure to preserve the value of its assets has evolved into a proactive strategy aimed at enhancing shareholder value. Strategy plans to continue acquiring Bitcoin through proceeds from upcoming debt and equity offerings. The firm anticipates that Strategy will raise around $84 billion through its innovative “42/42” plan, which involves an equal mix of debt and equity, potentially increasing its Bitcoin reserves to 900,000 BTC by the end of 2027. Strategy As Strong Investment Option TD Cowen has initiated buy ratings on Strategy’s preferred shares, emphasizing their attractive income potential and price appreciation, which are expected to be less volatile than common shares or Bitcoin itself. This endorsement comes after the firm first recognized Strategy’s Bitcoin strategy in 2023, describing it as a “paradigm shift.” At that time, they highlighted the company&#8217;s approach of utilizing cash from its software business to invest in Bitcoin as a long-term hedge against dollar inflation. Analysts believe that Bitcoin’s finite supply makes it a more reliable store of value compared to traditional currencies or gold, presenting Strategy as an appealing option for investors looking to gain Bitcoin exposure. Related Reading: Avalanche Shatters Record With 20M Transactions—Is Real-World Use Finally Here? As institutional adoption of cryptocurrencies accelerates, Strategy’s acquisition strategy has become a blueprint for other corporate treasuries. The company&#8217;s total investment in Bitcoin now stands at $29.27 billion, yielding substantial unrealized gains with a cost basis of $71,268 per BTC. The latest report and Strategy’s recent purchase coincided with Bitcoin hitting a new all-time high, surpassing $123,000, underscoring the growing acceptance and adoption of BTC in the financial landscape. Nevertheless, the cryptocurrency has retraced to $117,000 in an attempt to find its next support level before moving on to uncharted territory once again if buying demand persists among investors. Featured image from DALL-E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "New Bitcoin Improvement Proposal Aims to Solve Future Quantum Security Risks",
      "link": "https://bitcoinmagazine.com/news/new-bitcoin-improvement-proposal-aims-to-solve-future-quantum-security-risks",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/New-Bitcoin-Improvement-Proposal-Aims-to-Solve-Future-Quantum-Security-Risks.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/new-bitcoin-improvement-proposal-aims-to-solve-future-quantum-security-risks\" rel=\"nofollow\"> </a></p> <p>The BIP outlines a phased shift to post-quantum cryptography, warning users, “fail to upgrade and you will certainly lose access to your funds.”</p> <p>"
    },
    {
      "title": "LQWD Increases Bitcoin Holdings to 238.5 BTC, Achieves 54.6% BTC Yield YTD",
      "link": "https://bitcoinmagazine.com/news/lqwd-increases-bitcoin-holdings-to-238-5-btc-achieves-54-6-btc-yield-ytd",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/LQWD-Increases-Bitcoin-Holdings-to-238.5-BTC-Achieves-54.6-BTC-Yield-YTD.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lqwd-increases-bitcoin-holdings-to-238-5-btc-achieves-54-6-btc-yield-ytd\" rel=\"nofollow\"> </a></p> <p> LQWD Technologies Corp., a Canadian-based Bitcoin infrastructure company, has announced the acquisition of an additional 57.5 Bitcoin for approximately $6.8 million at an average price of $118,162 per Bitcoin. Following the purchase, LQWD now holds approximately 238.5 Bitcoin in its treasury, valued at roughly $17.98 million with an average acquisition price of $75,331 per BTC. [&#8230;]</p> <p>"
    },
    {
      "title": "Have We Just Seen the Bitcoin Cycle Peak?",
      "link": "https://bitcoinmagazine.com/markets/has-bitcoin-cycle-peaked",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Have-We-Just-Seen-the-Bitcoin-Cycle-Peak.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/has-bitcoin-cycle-peaked\" rel=\"nofollow\"> </a></p> <p>Bitcoin crosses $123K all-time high before retracing. Pro analyst Matt Crosby breaks down what on-chain and macro data reveal about the market.</p> <p>"
    },
    {
      "title": "Standard Chartered Launches Institutional Bitcoin And Crypto Spot Trading Platform",
      "link": "https://bitcoinmagazine.com/news/standard-chartered-launches-institutional-bitcoin-and-crypto-spot-trading-platform",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Standard-Chartered-Launches-Institutional-Bitcoin-And-Crypto-Spot-Trading-Platform.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/standard-chartered-launches-institutional-bitcoin-and-crypto-spot-trading-platform\" rel=\"nofollow\"> </a></p> <p>Standard Chartered has officially launched spot Bitcoin trading for institutional clients through its UK branch, according to a press release sent to . The move expands the bank’s growing suite of regulated Bitcoin and crypto services, highlighting accelerating institutional demand.&#160; “As client demand accelerates further, we want to offer clients a route to transact, [&#8230;]</p> <p>"
    },
    {
      "title": "The Blockchain Group Raises €6 Million For Bitcoin Strategy, Purchases More Bitcoin",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-raises-e6-million-for-bitcoin-strategy-purchases-more-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/The-Blockchain-Group-Raises-E6-Million-For-Bitcoin-Strategy-Purchases-More-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-raises-e6-million-for-bitcoin-strategy-purchases-more-bitcoin\" rel=\"nofollow\"> </a></p> <p>The company secures €5M from Adam Back and adds 29 BTC to its reserve, bringing its total holdings to 1,933 BTC.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Pump.fun Token Tops $2 Billion in Market Cap Following Massive ICO—But It Hasn't Caught Bonk Yet",
      "link": "https://decrypt.co/330222/pump-fun-token-600m-ico-bonk",
      "summary": "Most public sale participants either sold or transferred their PUMP tokens on its first day, following Pump.fun’s massive ICO."
    },
    {
      "title": "SharpLink Adds $225 Million in Ethereum to Industry-Leading ETH Treasury",
      "link": "https://decrypt.co/330200/sharplink-adds-225-million-ethereum-leading-eth-treasury",
      "summary": "The company started accumulating the asset just over a month ago."
    },
    {
      "title": "Polymarket Investigations Dropped by Justice Department, CFTC",
      "link": "https://decrypt.co/330214/polymarket-investigations-dropped-justice-department-cftc",
      "summary": "U.S. authorities have stopped investigating crypto prediction markets platform Polymarket, Bloomberg reported Tuesday."
    },
    {
      "title": "CRYPTO DIPS, STOCKS KEEP HITTING ATHS, SHARPLINK TOP ETH HOLDER",
      "link": "https://decrypt.co/videos/interviews/TAOPt7BO/crypto-dips-stocks-keep-hitting-aths-sharplink-top-eth-holder",
      "summary": "DOGE leads majors in crypto selloff. Banks can hold crypto under strict rules: Fed. Whale sends $2b BTC to Galaxy Digital for sale. Sequans buys $79m BTC. BTC backed loans cross $1b collateral on Coinbase. StanChart first global bank to offer BTC, ETH trading. Bitmine immersion buys $500m ETH. Sharplink bought another $73m ETH, now top holder. BofA launches crypto weekly research, bullish on ETH. Ripple, Circle, BitGo seek US bank trust license. xStocks can now be used as collateral on Kamino. Grayscale files for IPO. Revolut Pay on Moonpay available across UK, EEA. Tornado cash trial to begin today. Kazakhstan details crypto reserve plans"
    },
    {
      "title": "Dormant Satoshi-Era Bitcoin Whale Moves $4 Billion—But It May Not Be a Sell-Off Indicator",
      "link": "https://decrypt.co/330197/satoshi-era-bitcoin-whale-4-billion",
      "summary": "Dormant Bitcoin whale from 2011 awakens, moving $4.7 billion to exchanges amid speculation of potential massive sell-off."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "California launches task force with Ripple, Coinbase, MoonPay to improve government efficiency and operations",
      "link": "https://cryptobriefing.com/government-efficiency-initiative-california/",
      "summary": "<p>The collaboration could set a precedent for other states, enhancing public sector efficiency and fostering tech-driven government innovation.</p> <p>"
    },
    {
      "title": "DOJ and CFTC drop investigations into Polymarket",
      "link": "https://cryptobriefing.com/polymarket-investigation-end-crypto/",
      "summary": "<p>The end of investigations may boost crypto-betting legitimacy, influencing future regulatory frameworks and market re-entry strategies.</p> <p>"
    },
    {
      "title": "ProShares debuts 2x leveraged XRP, Solana ETFs following NYSE Arca clearance",
      "link": "https://cryptobriefing.com/leveraged-crypto-etfs-solana-xrp/",
      "summary": "<p>The launch of leveraged ETFs for Solana and XRP by ProShares could increase investor interest and volatility in these digital assets.</p> <p>"
    },
    {
      "title": "GameStop will invest in Bitcoin when upside beats downside, may accept crypto for trading cards: CEO Ryan Cohen",
      "link": "https://cryptobriefing.com/gamestop-bitcoin-investment-trading-cards/",
      "summary": "<p>GameStop's cautious crypto strategy could influence broader retail adoption, highlighting the potential of digital assets in mainstream commerce.</p> <p>"
    },
    {
      "title": "MARA Holdings invests $20M in Two Prime, boosts Bitcoin allocation to 2,000 BTC",
      "link": "https://cryptobriefing.com/mara-bitcoin-yield-strategy-expansion/",
      "summary": "<p>MARA Holdings' investment signals a strategic shift towards active Bitcoin management, potentially influencing institutional adoption and market dynamics.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Sonic activity surges 89% – Will price catch up or stall again?",
      "link": "https://ambcrypto.com/sonic-activity-surges-89-will-price-catch-up-or-stall-again/",
      "summary": "<img alt=\"Sonic activity surges 89% - Will price catch up or stall again?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-15T123747.883-min-2.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite bullish on-chain growth, Sonic faces strong sell pressure and weakening market confidence."
    },
    {
      "title": "Cronos’ 11% drop: Just a short-term correction, or is something bigger coming?",
      "link": "https://ambcrypto.com/cronos-11-drop-just-a-short-term-correction-or-is-something-bigger-coming/",
      "summary": "<img alt=\"Cronos&#039; 11% drop: Just a short-term correction, or is something bigger coming?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Kelvin-64.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Cronos sees a sharp dip, but whale activity and buyer dominance hint at a bullish continuation."
    },
    {
      "title": "Bitcoin slips from $123K peak, but here’s why bulls aren’t breaking",
      "link": "https://ambcrypto.com/bitcoin-slips-from-123k-peak-but-why-the-bulls-arent-breaking/",
      "summary": "<img alt=\"BITCOIN\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-5-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite a swift correction, the conviction behind Bitcoin’s climb remains intact."
    },
    {
      "title": "Bitcoin under pressure as Satoshi-era whale sells: Will BTC drop to $108K?",
      "link": "https://ambcrypto.com/bitcoin-under-pressure-as-satoshi-era-whale-sells-will-btc-drop-to-108k/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-6.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will Bitcoin drop to $108K before resuming trend continuation?"
    },
    {
      "title": "MicroStrategy’s Bitcoin blueprint goes mainstream: Wall Street now holds 6% BTC",
      "link": "https://ambcrypto.com/microstrategys-bitcoin-blueprint-goes-mainstream-wall-street-now-holds-6-btc/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika-1-6.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />From MSTR’s first bet to global rotation, is Bitcoin’s institutional era just warming up?"
    }
  ]
}