{
  "CoinDesk": [
    {
      "title": "Hut 8 Doubles Bitcoin-Backed Loan With Coinbase to $130M, Locks in Lower Rate",
      "link": "https://www.coindesk.com/markets/2025/06/24/hut-8-doubles-bitcoin-backed-loan-with-coinbase-to-130m-locks-in-lower-rate",
      "summary": ""
    },
    {
      "title": "BCH Stumbles at $467 After Triple Rejection, Ends Slightly Down Despite High-Volume Rebound",
      "link": "https://www.coindesk.com/markets/2025/06/24/bch-stumbles-at-usd467-after-triple-rejection-ends-slightly-down-despite-high-volume-rebound",
      "summary": ""
    },
    {
      "title": "ZKsync’s Airbender zkVM Proves Ethereum Blocks in 35 Seconds",
      "link": "https://www.coindesk.com/tech/2025/06/24/zksyncs-airbender-zkvm-proves-ethereum-blocks-in-35-seconds",
      "summary": ""
    },
    {
      "title": "Chainlink's LINK Surges 13% as Mastercard Partnership Fuels Rally Amid Crypto Recovery",
      "link": "https://www.coindesk.com/markets/2025/06/24/chainlinks-link-surges-13-as-mastercard-partnership-fuels-rally-amid-crypto-recovery",
      "summary": ""
    },
    {
      "title": "The Future of Money Is Streaming Now",
      "link": "https://www.coindesk.com/opinion/2025/06/24/the-future-of-money-is-streaming-now",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Many senators absent from ‘bipartisan’ crypto market structure hearing",
      "link": "https://cointelegraph.com/news/bipartisan-crypto-market-structure-hearing-absence?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2I2M2EtMDY2My03NDQwLWJjNmYtYTBiNjczNjAzZjhh.jpg\" /></p><p>Only five US senators out of the 11 typically on the digital assets subcommittee were available to ask questions about a potential market structure bill.</p>"
    },
    {
      "title": "FalconX joins Crypto.com as partner for Lynq institutional settlement network",
      "link": "https://cointelegraph.com/news/falconx-joins-crypto-com-others-partners-lynq-institutional-settlement-network?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2EzYzMtM2FkZS03NTM4LWIyZGItNjcyZWM3ZTRmMzA0.jpg\" /></p><p>Rising institutional interest in crypto may include the settlement sector, especially stablecoins, which have seen a 55.5% growth in market cap in one year.</p>"
    },
    {
      "title": "Ether liquidity sits above $2.5K: Will ETH bulls grab it?",
      "link": "https://cointelegraph.com/news/ether-liquidity-sits-above-2-5k-will-eth-bulls-grab-it?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NGJhZjQtMmJiMy03NTI5LWE4NTMtYmYxY2U4ZjA3NWZm.jpg\" /></p><p>Ether gains bullish momentum as technical indicators, rising ETF inflows, and a potential capital rotation from Bitcoin signal a possible breakout above $2,500.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Bitcoin rebounds to $105K as Coinbase premium hits second 2025 high",
      "link": "https://cointelegraph.com/news/bitcoin-rallies-to-105k-as-coinbase-premium-hits-another-2025-high?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2EyOWYtNzBhNi03YTM3LWEyYTYtN2Q0ZTk4NDc5ZmVm.jpg\" /></p><p>Bitcoin recovers as the Coinbase premium soars, but retail investors’ inflows are rising at Binance, and open interest is falling, proving that traders remain cautious.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "WazirX gains crucial extension to revive post-hack restructuring plan",
      "link": "https://cryptoslate.com/wazirx-gains-crucial-extension-to-revive-post-hack-restructuring-plan/",
      "summary": "<p>WazirX, once India’s largest crypto exchange by trading volume, has secured a crucial extension from Singapore’s High Court as it struggles to recover from a devastating $234 million hack and a year of growing user frustration. In a statement posted on social media, WazirX confirmed that the court will allow it to present new arguments [&#8230;]</p> <p>"
    },
    {
      "title": "Spot Ethereum ETFs record $1B inflows in 15 trading days, hitting $4B for the first time",
      "link": "https://cryptoslate.com/spot-ethereum-etfs-record-1b-inflows-in-15-trading-days-hitting-4b-for-the-first-time/",
      "summary": "<p>Spot Ethereum (ETH) exchange-traded funds (ETFs) listed in the US crossed $4 billion in cumulative net inflows on June 23, only eleven months after their market debut. The products launched on July 23, 2024, and required 216 US trading sessions to accumulate their first $3 billion by May 30. Following the $3 billion mark, spot [&#8230;]</p> <p>"
    },
    {
      "title": "Grayscale launches Space and Time Trust to capture surging interest in data infrastructure",
      "link": "https://cryptoslate.com/grayscale-launches-space-and-time-trust-to-capture-surging-interest-in-data-infrastructure/",
      "summary": "<p>Grayscale has unveiled a new single-asset investment vehicle centered on the Space and Time (SXT) token, according to a June 24 announcement. The fund, officially named the Space and Time Trust, offers accredited investors direct exposure to one of the crypto sector’s newest data infrastructure projects. Individual and institutional participants can subscribe to the Trust [&#8230;]</p> <p>"
    },
    {
      "title": "Number of XRP holders almost doubled within six months, overtaking Solana",
      "link": "https://cryptoslate.com/number-of-xrp-holders-almost-doubled-within-six-months-overtaking-solana/",
      "summary": "<p>The number of XRP holders has nearly doubled between October 2024 and May 2025, expanding from 1.29% to 2.42%, while Solana (SOL) experienced the opposite, falling 35% from 2.72% to 1.76%. According to Bybit’s &#8220;H1 2025 asset allocation report,&#8221; the rebalancing stems from a shift in sentiment as both retail and institutional investors have begun [&#8230;]</p> <p>"
    },
    {
      "title": "Chainlink surges 14% after partnering with Mastercard to bring 3 billion users direct access to crypto",
      "link": "https://cryptoslate.com/chainlink-surges-14-after-partnering-with-mastercard-to-bring-3-billion-users-direct-access-to-crypto/",
      "summary": "<p>Chainlink has announced a new partnership with Mastercard to make crypto purchases easier and more secure for mainstream users, according to a July 24 statement. The collaboration will allow over 3 billion Mastercard cardholders worldwide to buy digital assets directly on-chain using fiat. This marks a significant step forward in integrating traditional finance with blockchain [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Analyst Says XRP Is Moving According To Plan, Here’s Why $1.90 Is Important",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-is-moving-according-to-plan/",
      "summary": "A crypto analyst has reaffirmed a bullish outlook for XRP, suggesting that the cryptocurrency’s price action is unfolding exactly as anticipated. The analyst points out that XRP is now approaching the critical support level at $1.90, which could signal a potential bullish reversal if the price manages to hold above it. XRP Eyes $1.90 As Key Reversal Zone Crypto market expert CasiTrades believes that the XRP price behavior is moving exactly as predicted following its recent price drop below $2. According to the chart and analysis published on X (formerly Twitter), XRP’s retracement toward the $1.90 region is not a sign of weakness but a textbook setup for a potential reversal. Related Reading: Daily Timeframe Says XRP Price Is On The Verge Of Breakout The $1.90 level represents a major Fibonacci Retracement zone, specifically the 0.5 retracement from the macro correction, which the analyst has been closely watching for a possible price reaction. According to CasiTrades, this zone is more than just a random support level—it aligns with a pattern that the analyst described in earlier updates. In these previous reports, CasiTrades was watching out for distinct price movements during XRP’s decline, including a bounce off a key Fibonacci level, a short-term fakeout upward to trap late buyers, and a final drop back into the support zone, where Bullish Divergence can develop. This distinct price pattern now appears to be playing out exactly as expected on the XRP price chart. If XRP holds above the $1.90 level while forming a Bullish Divergence on the Relative Strength Index (RSI), it could confirm a textbook bottom setup and potentially signal the start of a new impulsive rally. XRP And Bitcoin Display Synchronized Patterns CasiTrades&#8217; price chart shows XRP forming a Descending Triangle, with its latest move dipping just into a high-demand zone marked by previous price reactions. In line with the Elliott Wave Theory, this pattern suggests the upcoming completion of Wave 2 with a massive breakout in Wave 3 potentially taking shape if the $1.90 support level holds. Additional support from key Fibonacci levels, such as the 0.618 and 2.136 extensions at $2.0 and $2.1, respectively, reinforces strength in XRP’s potential for a rebound. Related Reading: XRP Price Enters Perfect Setup After Buy Retest – Next Stop $3.7 Interestingly, the analyst points to the Bitcoin price action mirroring this exact behavior—bouncing from just under its own 0.236 retracement near $97,000, and potentially setting up for a final dip into support. This synchronized structure across both XRP and BTC adds heavy confluence. CasiTrades notes that this current downturn is not a breakdown, but rather a final calculated shakeout before a broader rally. If both Bitcoin and XRP reach as expected while positioned at $0.19 and $97,000 respectively, the analyst believes it could trigger a new bullish leg in the crypto cycle. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Shiba Inu Breakout Incoming? Bullish Setup Hints At Big Jump, Experts Say",
      "link": "https://www.newsbtc.com/altcoin/shiba-inu-breakout-incoming-bullish-setup-hints-at-big-jump-experts-say/",
      "summary": "Shiba Inu tumbled to an intraday bottom of $0.000010 on Sunday, marking its weakest point in 16 months. According to market analyst Tom Tucker, that low could set the stage for a sharp turnaround. Related Reading: Stablecoin Wars Ignite: Peter Schiff Champions Gold-Backed Digital Assets The meme coin has slipped 14% since June began and is off 37% from its May high of $0.00001764. Big holders are growing cautious too, with whale wallets down about 80% and open interest in Shiba Inu futures falling to $123 million—a level last seen in early April. Double Bottom Pattern Offers Hope Based on reports from Tucker’s June 22 chart examination, the meme coin appears to be forming a classic double bottom on its daily price graph. That pattern often signals that a sell-off has run its course. SHIB first bounced off roughly $0.00001028 on April 7, climbing 70% to reach $0.00001765 by May 12. Now that the coin has revisited that support zone at around $0.00001030, traders will be watching closely to see if history repeats itself. $SHIB crashed 7.5% to $0.000011 as geopolitical tensions spooked markets. Down 38% from May highs, with whale holdings -80% and futures OI at a 1-month low. TA shows deep oversold levels, but a double-bottom near $0.00001030 could spark a 62% rebound if support holds.#SHIB pic.twitter.com/uEo3ebjxXD — Tom Tucker (@WhatzTheTicker) June 22, 2025 Support Zone Holds Crucial Key According to Tucker, Shiba Inu needs to stay above $0.000010 to confirm the double bottom. The token has already climbed 7.7% from Sunday’s trough to trade around $0.00001081 today. If the support holds firm, he predicts a 62% rally that would lift SHIB to about $0.00001752—practically matching last month’s peak. Whales Exit As Risk Appetite Fades The most recent decline in major holder balances suggests that there could be a shift in market sentiment among Shiba Inu biggest fan base. Whale positions have been 80% lower from its May high, and the decline in open interest hints that leveraged speculators are not taking as much risk. Those moves suggest caution is likely to persist until the buyers return en masse. Shiba Inu Team Urges Patience Meanwhile, the Shiba Inu ecosystem’s marketing lead, Lucie, has asked the community to stay calm. Based on statements from the team, the rally to $0.01 is still the long-term goal, but reaching that milestone means to not &#8220;panic&#8221; and stay resilient. Panic is not an option. If we haven’t won yet, it’s because it’s not over. — 𝐋𝐔𝐂𝐈𝐄 (@LucieSHIB) June 22, 2025 Related Reading: Bitcoin Wobbles? Metaplanet Buys Big, Breaks $1 Billion Mark Lucie reminded supporters that market swings are part of the journey and that holding through downturns could pay off down the line. Investors seeking a clear entry point might find the present price action appealing. If SHIB manages to hold above that $0.000010 support, a rapid recovery is in the cards. But if the coin goes below that line, the next move down might take it to even lower levels. Traders should be observing volume, whale actions, and the larger crypto market sentiment before making their next move. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Bitcoin Buy-Side Pressure Surges: Taker Buy Volume Spikes Sharply",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-buy-side-pressure-surges-taker-buy-volume-spikes-sharply/",
      "summary": "Bitcoin is trading above the $105,000 level after a sharp rebound triggered by the announcement of a ceasefire between Israel and Iran. The geopolitical relief provided a strong tailwind for risk assets, and BTC responded with a powerful surge, regaining a critical psychological level that had previously flipped into resistance. Now, as bulls regain momentum, Bitcoin is flirting with a potential breakout above the $110,000 mark — a key level that capped rallies throughout June. Related Reading: Bitcoin Battles Key Support: Daily EMA-100 Must Hold to Prevent Deep Correction This renewed strength comes after several days of volatility and fear, where BTC dipped to as low as $98,200 amid escalating conflict in the Middle East. However, the swift recovery has shifted sentiment back in favor of the bulls. According to on-chain data from CryptoQuant, there has been a heavy spike in Taker Buy Volume over the past 48 hours — a strong signal that aggressive market participants are stepping in with conviction. These buy-side imbalances suggest that institutional and high-conviction traders are positioning for further upside. As the market heats up and risk appetite grows, a breakout above the $110K resistance could confirm the start of a new bullish impulse. For now, all eyes are on whether BTC can hold and extend above current levels. Bitcoin Faces Uncertainty As Bulls Defend Structure Bitcoin is currently facing a critical test, trading in a tight range after failing to break above its all-time high. Although bulls have managed to defend the overall structure and keep BTC above key moving averages, the price action has not provided a clear directional signal. The asset is roughly 6% down from its $112K peak, and while some traders expect an imminent breakout toward new highs, others warn of a potential retrace below the $100K psychological level. This divide among analysts stems from ongoing geopolitical instability — particularly in the Middle East — and tightening macroeconomic conditions. The Fed’s commitment to elevated interest rates and rising US Treasury yields continues to weigh on risk sentiment, making it difficult for BTC to build sustained momentum. Despite the uncertainty, buyers have shown signs of strength, with many looking to confirm the recent bounce as a solid bottom. Top analyst Maartunn highlighted one key bullish signal: heavy spikes in Taker Buy Volume, which indicate aggressive market orders being filled on the buy side. This suggests that high-conviction buyers are stepping in at current levels, potentially front-running a larger move to the upside. While this is a positive sign for short-term sentiment, Bitcoin must still reclaim the $109K–$112K range to invalidate the risk of a broader correction. Until then, traders remain cautious. If BTC closes a daily candle below the $103.6K support or loses the $100K level again, it could trigger a wave of liquidations and send prices lower. On the other hand, holding above $105K and building volume could set the stage for the next leg up. The coming days will be crucial in defining Bitcoin’s path forward. Related Reading: Ethereum Holds Critical Support – $2,350 Level Could Define The Next Move BTC Surges Above Key Support As Buyers Step In The 12-hour chart for Bitcoin reveals a strong bullish reaction after a brief dip below the $103,600 support level. The price rebounded sharply, reclaiming both the 100 and 50-period moving averages (green and blue lines, respectively), with BTC now trading around $105,357. This move confirms the importance of the $103,600 zone as a high-demand area, which has acted as a launchpad multiple times since early May. Volume surged on the recent bounce, indicating aggressive buying activity. The spike suggests whales and institutional buyers likely absorbed the panic selling triggered by geopolitical events earlier in the week. Price is now approaching the $109,300 resistance level, a key ceiling that capped multiple rallies in May and June. Related Reading: Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106 The short-term momentum remains constructive as long as BTC holds above the moving averages. However, a rejection near $109K could confirm a broader consolidation range between $103K and $109K. If bulls manage to flip $109,300 into support, the path to retest the all-time highs around $112K opens up. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Ethereum Price Crash To $2,100 Triggers Fear, But Why Are Analysts Predicting A Rally To $6,000?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-price-rally-to-6000/",
      "summary": "Ethereum&#8217;s price action in the past 24 hours has been characterized by a fall toward $2,100 before rebounding to the upside very quickly. Ethereum’s price dropped to $2,130 in the past 24 hours on crypto exchange Coinbase amidst a broader fall in the crypto industry, which also saw Bitcoin break below $100,000 very briefly. Despite the sudden Ethereum price correction, analysts have presented arguments that hint at a strong Ethereum rally once this current downturn is complete. Notably, their projections are not short-term, and one of them puts Ethereum’s next major target around $6,000. Wave A Complete, But Downside Likely Before Rally The first detailed analysis came from @CryptoWaveV, a trader who uses Elliott Wave Theory to forecast market structure. According to his recent post, Ethereum’s price has now completed what he considers to be wave A of a larger corrective structure. His chart shows Ethereum breaking down from a high around $2,900 and falling almost directly into a Fibonacci-based support zone between $2,134 and $1,957. Related Reading: Ethereum Bullish Wave Towards ATH Coming? Here Are The Targets Now that the Wave A pattern is complete, the prediction is a short-term bounce to as high as $2,792 as part of a wave B retracement. However, this upward move would likely be temporary before another Wave C leg downward, which could drive the Ethereum price to as low as $1,706 before a meaningful bottom is confirmed. This level is what the analyst refers to as his “ideal buy zone” for long-term accumulation. Although the short-term view includes price crashes, a full bullish impulse will resume once this corrective phase is complete. Wyckoff Structure Points $6,000 ETH Price Merlijn, a popular analyst on X, shared a contrasting yet converging perspective. In this case, the analyst&#8217;s outlook is based on Wyckoff’s accumulation framework. Merlijn stated, “Ethereum: Wyckoff says go.” Related Reading: The 5 Bullish Cases That Says Ethereum Price Could Reach $10,000 In 2025 According to the daily price chart that followed his analysis, the analyst showed that the crypto had already completed the spring and test phases, which are both components of a Wyckoff accumulation pattern. What comes next, according to the Wyckoff method, is the markup phase. The chart Merlijn posted aligns with this outlook. The chart projected that Ethereum will reclaim a horizontal range between $2,150 and $2,450, followed by a steady progression above $3,850, and then another strong move past $4,800, before ultimately culminating around $6,800 to $7,000. This bullish setup suggests that while the recent dip to $2,100 might have shaken confidence, it may have served a larger structural purpose. The spring and test patterns imply a final shakeout of weak hands, clearing the path for long-term buyers to step in. Finally, the outlooks from both analysts converge on a six-month to one-year trajectory that could see Ethereum breaking into the $6,000 range, if not higher. At the time of writing, Ethereum is trading at $2,420, up by 7.4% in the past 24 hours. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Whale Loads Up: $422M In ETH Bought In Under a Month",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-whale-loads-up-422m-in-eth-bought-in-under-a-month/",
      "summary": "Ethereum has experienced significant volatility in recent days, driven largely by escalating geopolitical tensions in the Middle East. After breaking down from the range that had held since early May, ETH fell sharply to $2,100, triggering widespread concern among investors. The breakdown was largely attributed to the market&#8217;s reaction to the US attack on Iranian nuclear facilities, which escalated the conflict between Israel and Iran. Related Reading: Bitcoin Battles Key Support: Daily EMA-100 Must Hold to Prevent Deep Correction However, markets quickly responded to positive developments. Ethereum rebounded strongly above the $2,400 level following reports that Iran and Israel had agreed to a ceasefire, temporarily easing global risk sentiment. This relief rally brought new optimism to the Ethereum market, especially amid signs of institutional confidence. According to data shared by top analyst Ted Pillows, a major whale or institutional entity purchased another $8.91 million worth of ETH, continuing an aggressive accumulation streak. Over the past three weeks, this same entity has reportedly bought $422 million in Ethereum, signaling strong conviction despite recent market stress. This wave of accumulation suggests that long-term players may view the current price zone as a key opportunity, reinforcing the idea that Ethereum could be building a base for its next major move once broader conditions stabilize. Ethereum Surges As Ceasefire Ignites Market Optimism Ethereum surged over 14% following reports of a ceasefire agreement between Israel and Iran, providing a much-needed relief rally after weeks of geopolitical tension and uncertainty. The news sparked a wave of bullish momentum across the market, with ETH rebounding sharply from recent lows near $2,100 to trade firmly above the $2,400 mark. Bulls, who had lost control amid panic selling, are now showing signs of strength as the market prepares for its next decisive move. Despite this rebound, caution remains. The broader macroeconomic environment continues to tighten, with rising concerns over a potential US recession, high Treasury yields, and sustained hawkishness from the Federal Reserve. These factors could weigh on risk assets in the weeks ahead, putting Ethereum’s rally to the test. Nonetheless, optimism is building, especially around the possibility of the long-awaited altseason—one that many believe will be led by Ethereum. Adding fuel to this narrative is the growing trend of whale accumulation. According to insights shared by analyst Ted Pillows, a major whale or institutional entity has just acquired another $8.91 million worth of ETH. This purchase adds to a staggering $422 million in Ethereum accumulated over the past three weeks. Such aggressive buying suggests that large players are positioning themselves for a major move ahead, likely expecting Ethereum to be at the forefront of the next market cycle. As ETH consolidates above key levels, the accumulation trend could act as a foundational force supporting higher prices, especially if macro and geopolitical risks stabilize. Related Reading: Ethereum Holds Critical Support – $2,350 Level Could Define The Next Move ETH Reclaims $2,400 Following Sharp Rebound Ethereum has reclaimed the $2,400 level after a swift rebound from a breakdown near $2,100. The recent candle structure on the 3-day chart shows a strong wick to the downside, followed by a recovery, reflecting the impact of geopolitical developments, most notably the ceasefire between Iran and Israel. This bounce prevented a deeper selloff and has brought Ethereum back above a key psychological level. Looking at the chart, ETH remains under pressure from the 100-day and 200-day moving averages, currently acting as resistance around the $2,638 and $2,779 zones. Price also recently broke a short-term descending trendline and is now attempting to consolidate above it. This suggests the potential for a trend reversal if bulls can sustain momentum and push through the moving average cluster. Related Reading: Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106 Volume remains subdued but shows signs of recovery, signaling early interest returning after the fear-driven flush. A break and close above the $2,600 range would likely open the path to retest the $2,800 zone, which was a major supply area in previous months. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Lightning Labs Releases Taproot Assets v0.6 With Updates to Stablecoin Support On Bitcoin",
      "link": "https://bitcoinmagazine.com/news/lightning-labs-releases-taproot-assets-v0-6-with-updates-to-stablecoin-support-on-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Lightning-Labs-Releases-Taproot-Assets-v0.6-With-Updates-to-Stablecoin-Support-On-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lightning-labs-releases-taproot-assets-v0-6-with-updates-to-stablecoin-support-on-bitcoin\" rel=\"nofollow\"> </a></p> <p>The update adds grouped asset identifiers, improves Lightning Network payment flows, and expands support for stablecoin transactions on Bitcoin.</p> <p>"
    },
    {
      "title": "Republican Senators Scott, Lummis, Tillis, Hagerty Push For Digital Asset Market Structure Rules",
      "link": "https://bitcoinmagazine.com/news/republican-senators-scott-lummis-tillis-hagerty-push-for-digital-asset-market-structure-rules",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Republican-Senators-Scott-Lummis-Tillis-Hagerty-Push-For-Digital-Asset-Market-Structure-Rules.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/republican-senators-scott-lummis-tillis-hagerty-push-for-digital-asset-market-structure-rules\" rel=\"nofollow\"> </a></p> <p>Republican senators have released principles to guide digital asset market structure legislation, marking a significant step toward regulatory clarity that could benefit Bitcoin and the broader crypto industry. Senate Banking Chairman Tim Scott (R-SC), along with Senators Cynthia Lummis (R-WY), Thom Tillis (R-NC), and Bill Hagerty (R-TN), announced the framework balancing innovation with consumer protection.&#160; [&#8230;]</p> <p>"
    },
    {
      "title": "Anthony Pompliano’s ProCap BTC Buys $386M in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/anthony-pomplianos-procap-btc-buys-386m-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Anthony-Pomplianos-ProCap-BTC-Buys-386M-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pomplianos-procap-btc-buys-386m-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>ProCap BTC acquires 3,724 bitcoin as part of a strategy to build a $1 billion Bitcoin treasury.</p> <p>"
    },
    {
      "title": "The Smarter Web Company Expands Bitcoin Holdings With £15.2M Purchase",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-expands-bitcoin-holdings-with-15-2m-purchase",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Smarter-Web-Comp._imresizer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-expands-bitcoin-holdings-with-15-2m-purchase\" rel=\"nofollow\"> </a></p> <p>The Smarter Web Company, a web design, development, and online marketing services provider, has announced another Bitcoin purchase, acquiring 196.90 Bitcoin for £15,185,259 as part of its &#8220;10 Year Plan&#8221; treasury strategy. The London listed technology company paid an average price of £77,122 per Bitcoin ($103,290 per Bitcoin) for the acquisition.&#160; This purchase brings The [&#8230;]</p> <p>"
    },
    {
      "title": "Amazing AI Announces Adoption of A Bitcoin Treasury Policy",
      "link": "https://bitcoinmagazine.com/news/amazing-ai-announces-adoption-of-a-bitcoin-treasury-policy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Amazing-AI-Announces-Adoption-of-A-Bitcoin-Treasury-Policy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/amazing-ai-announces-adoption-of-a-bitcoin-treasury-policy\" rel=\"nofollow\"> </a></p> <p>The fintech group plans to begin bitcoin acquisitions in July 2025, viewing bitcoin as a long-term store of value.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "BNB Over Bitcoin? Chinese Company's Stock Skyrockets on $1 Billion Crypto Treasury Plan",
      "link": "https://decrypt.co/326837/bnb-over-bitcoin-chinese-company-stock-skyrockets-1-billion-treasury",
      "summary": "Could BNB be the next cryptocurrency after Bitcoin to trend big on Wall Street? Two companies have announced treasury plans this week."
    },
    {
      "title": "Pompliano Bitcoin Treasury ProCap Buys $395 Million in BTC",
      "link": "https://decrypt.co/326824/pompliano-bitcoin-treasury-procap-buys-395-million-in-btc",
      "summary": "The firm, which intends to go public via a SPAC deal with Columbus Circle Capital, added 3,724 Bitcoin to its balance sheet this week."
    },
    {
      "title": "Til Death Do Us Part: The Weirdest Meme Coin Livestreams We've Seen Just This Week",
      "link": "https://decrypt.co/326814/weirdest-solana-meme-coin-livestreams-weve-seen-this-week",
      "summary": "Solana token launchpad Pump.fun is heating up with wild livestreams, including a wedding and one guy saying \"Pumpfun\" a million times."
    },
    {
      "title": "Largest Bitcoin Leverage Unwind in Nearly a Year Triggered by Iran-Israel Tensions",
      "link": "https://decrypt.co/326812/largest-bitcoin-leverage-unwind-nearly-a-year-triggered-iran-israel-tensions",
      "summary": "Notional open interest in BTC perps saw the sharpest decline since the yen-led global market crash in August 2024."
    },
    {
      "title": "FinTech Digital Asset Raises $135M for Its Institutional Blockchain Canton Network",
      "link": "https://decrypt.co/326745/fintech-digital-asset-raises-135m-for-its-institutional-blockchain-canton-network",
      "summary": "DRW Venture Capital and Tradeweb Markets led the funding round, which also included Circle Ventures, Goldman Sachs, and Citadel Securities."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "CME XRP futures hit $542 million volume in first month, strengthening case for spot XRP ETFs",
      "link": "https://cryptobriefing.com/cme-xrp-futures-global-demand/",
      "summary": "<p>The surge in XRP futures trading volume bolsters the likelihood of SEC approval for spot XRP ETFs, potentially transforming crypto investment.</p> <p>"
    },
    {
      "title": "Mastercard and Chainlink team up to enable nearly 3 billion cardholders to buy crypto on-chain",
      "link": "https://cryptobriefing.com/mastercard-chainlink-partnership-crypto/",
      "summary": "<p>This collaboration could significantly accelerate mainstream crypto adoption, bridging traditional finance with decentralized finance seamlessly.</p> <p>"
    },
    {
      "title": "Aptos Labs and Jump Crypto launch Shelby, a decentralized hot-storage protocol built for speed",
      "link": "https://cryptobriefing.com/decentralized-hot-storage-shelby-launch/",
      "summary": "<p>Shelby could revolutionize web3 by enabling real-time applications, enhancing data control, and bridging speed-centralization gaps.</p> <p>"
    },
    {
      "title": "Ripple’s co-founder Arthur Britto breaks 14-year silence as SEC case enters final stage",
      "link": "https://cryptobriefing.com/arthur-britto-silence-xrp/",
      "summary": "<p>Arthur Britto's reemergence highlights the potential for significant shifts in the crypto regulatory landscape as the SEC case nears resolution.</p> <p>"
    },
    {
      "title": "Michael Saylor pitches Strategy’s Bitcoin credit model to Trump’s FHFA Director",
      "link": "https://cryptobriefing.com/bitcoin-credit-model-mortgages/",
      "summary": "<p>Integrating Bitcoin into housing finance could revolutionize mortgage eligibility, potentially reshaping financial systems and credit models.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum’s next big leap? Dev proposes halving block times for faster DeFi",
      "link": "https://ambcrypto.com/ethereums-next-big-leap-dev-proposes-halving-block-times-for-faster-defi/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-16.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Could halving slot times make Ethereum faster for DeFi and rollups?"
    },
    {
      "title": "AERO signals to $1.5 target – Here’s what traders need to know",
      "link": "https://ambcrypto.com/aero-signals-to-1-5-target-heres-what-traders-need-to-know/",
      "summary": "<img alt=\"AERO signals to $1.5 target – Here&#039;s what traders need to know\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox3.jpeg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whale accumulation and new on-chain projects on Aerodrome could spark an upward move for AERO."
    },
    {
      "title": "Jupiter token in freefall: 80% crash has holders fleeing – What’s next?",
      "link": "https://ambcrypto.com/jupiter-token-in-freefall-80-crash-has-holders-fleeing-whats-next/",
      "summary": "<img alt=\"Jupiter token in freefall: 80% crash has holders fleeing - What’s next?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-6-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With community confidence unraveling, Jupiter scrambles to redefine its token’s role in DeFi."
    },
    {
      "title": "DeFi Dev Corp’s $11.5M Solana bet: Blockchain-driven equity ahead?",
      "link": "https://ambcrypto.com/defi-dev-corps-11-5m-solana-bet-blockchain-driven-equity-ahead/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"723\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/DeFi-Dev-Corp.-Partners-with-Kraken.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1286\" />Solana shakes off its memecoin image as institutions flood in with serious financial projects."
    },
    {
      "title": "XRP’s 8% weekly gain faces big test – Will $2.2 break or lead to sell-off?",
      "link": "https://ambcrypto.com/xrps-8-weekly-gain-faces-big-test-will-2-2-break-or-lead-to-sell-off/",
      "summary": "<img alt=\"XRP&#039;s 8% weekly gain faces big test - Will $2.2 break or lead to sell-off?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/XRP-Ripple-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP's chances of extending its 8% weekly recovery may be tested at $2.2."
    }
  ]
}