{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Analysts Say BTC’s Long-Term Focus Is Easing War Jitters",
      "link": "https://www.coindesk.com/markets/2025/06/24/asia-morning-briefing-analysts-say-btcs-long-term-focus-is-easing-war-jitters",
      "summary": ""
    },
    {
      "title": "Hut 8 Doubles Bitcoin-Backed Loan With Coinbase to $130M, Locks in Lower Rate",
      "link": "https://www.coindesk.com/markets/2025/06/24/hut-8-doubles-bitcoin-backed-loan-with-coinbase-to-130m-locks-in-lower-rate",
      "summary": ""
    },
    {
      "title": "BCH Stumbles at $467 After Triple Rejection, Ends Slightly Down Despite High-Volume Rebound",
      "link": "https://www.coindesk.com/markets/2025/06/24/bch-stumbles-at-usd467-after-triple-rejection-ends-slightly-down-despite-high-volume-rebound",
      "summary": ""
    },
    {
      "title": "ZKsync’s Airbender zkVM Proves Ethereum Blocks in 35 Seconds",
      "link": "https://www.coindesk.com/tech/2025/06/24/zksyncs-airbender-zkvm-proves-ethereum-blocks-in-35-seconds",
      "summary": ""
    },
    {
      "title": "Chainlink's LINK Surges 13% as Mastercard Partnership Fuels Rally Amid Crypto Recovery",
      "link": "https://www.coindesk.com/markets/2025/06/24/chainlinks-link-surges-13-as-mastercard-partnership-fuels-rally-amid-crypto-recovery",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Many senators absent from ‘bipartisan’ crypto market structure hearing",
      "link": "https://cointelegraph.com/news/bipartisan-crypto-market-structure-hearing-absence?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2I2M2EtMDY2My03NDQwLWJjNmYtYTBiNjczNjAzZjhh.jpg\" /></p><p>Only five US senators out of the 11 typically on the digital assets subcommittee were available to ask questions about a potential market structure bill.</p>"
    },
    {
      "title": "FalconX joins Crypto.com as partner for Lynq institutional settlement network",
      "link": "https://cointelegraph.com/news/falconx-joins-crypto-com-others-partners-lynq-institutional-settlement-network?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2EzYzMtM2FkZS03NTM4LWIyZGItNjcyZWM3ZTRmMzA0.jpg\" /></p><p>Rising institutional interest in crypto may include the settlement sector, especially stablecoins, which have seen a 55.5% growth in market cap in one year.</p>"
    },
    {
      "title": "Ether liquidity sits above $2.5K: Will ETH bulls grab it?",
      "link": "https://cointelegraph.com/news/ether-liquidity-sits-above-2-5k-will-eth-bulls-grab-it?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NGJhZjQtMmJiMy03NTI5LWE4NTMtYmYxY2U4ZjA3NWZm.jpg\" /></p><p>Ether gains bullish momentum as technical indicators, rising ETF inflows and a potential capital rotation from Bitcoin signal a possible breakout above $2,500.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Bitcoin rebounds to $105K as Coinbase premium hits second 2025 high",
      "link": "https://cointelegraph.com/news/bitcoin-rallies-to-105k-as-coinbase-premium-hits-another-2025-high?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2EyOWYtNzBhNi03YTM3LWEyYTYtN2Q0ZTk4NDc5ZmVm.jpg\" /></p><p>Bitcoin recovers as the Coinbase premium soars, but retail investors’ inflows are rising at Binance, and open interest is falling, proving that traders remain cautious.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US academic institutions urge SEC to implement stringent crypto staking rules, oversight",
      "link": "https://cryptoslate.com/us-academic-institutions-urge-sec-to-implement-stringent-crypto-staking-rules-oversight/",
      "summary": "<p>Representatives from multiple universities met with the US Securities and Exchange Commission’s (SEC) Crypto Task Force on June 23 to discuss a staking rulebook. The meeting included representatives from the University of California, Berkeley School of Law, Georgetown University Law Center, the University of Chicago Law School, and venture firm Placeholder. According to the logs, [&#8230;]</p> <p>"
    },
    {
      "title": "Senate Banking Committee pushes for rapid legislative action on crypto market framework",
      "link": "https://cryptoslate.com/senate-banking-committee-pushes-for-rapid-legislative-action-on-crypto-market-framework/",
      "summary": "<p>The Senate Banking Committee released a seven-point framework for digital asset market structure and heard testimony urging Congress to translate those principles into statute without delay on June 23. Committee Chair Tim Scott and Senators Cynthia Lummis, Thom Tillis, and Bill Hagerty set out a plan that draws a statutory line between digital asset securities [&#8230;]</p> <p>"
    },
    {
      "title": "WazirX gains crucial extension to revive post-hack restructuring plan",
      "link": "https://cryptoslate.com/wazirx-gains-crucial-extension-to-revive-post-hack-restructuring-plan/",
      "summary": "<p>WazirX, once India’s largest crypto exchange by trading volume, has secured a crucial extension from Singapore’s High Court as it struggles to recover from a devastating $234 million hack and a year of growing user frustration. In a statement posted on social media, WazirX confirmed that the court will allow it to present new arguments [&#8230;]</p> <p>"
    },
    {
      "title": "Spot Ethereum ETFs record $1B inflows in 15 trading days, hitting $4B for the first time",
      "link": "https://cryptoslate.com/spot-ethereum-etfs-record-1b-inflows-in-15-trading-days-hitting-4b-for-the-first-time/",
      "summary": "<p>Spot Ethereum (ETH) exchange-traded funds (ETFs) listed in the US crossed $4 billion in cumulative net inflows on June 23, only eleven months after their market debut. The products launched on July 23, 2024, and required 216 US trading sessions to accumulate their first $3 billion by May 30. Following the $3 billion mark, spot [&#8230;]</p> <p>"
    },
    {
      "title": "Grayscale launches Space and Time Trust to capture surging interest in data infrastructure",
      "link": "https://cryptoslate.com/grayscale-launches-space-and-time-trust-to-capture-surging-interest-in-data-infrastructure/",
      "summary": "<p>Grayscale has unveiled a new single-asset investment vehicle centered on the Space and Time (SXT) token, according to a June 24 announcement. The fund, officially named the Space and Time Trust, offers accredited investors direct exposure to one of the crypto sector’s newest data infrastructure projects. Individual and institutional participants can subscribe to the Trust [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bunker Buster: Ethereum Titans Stake $100 Million Amid US-Iran Hostilities",
      "link": "https://www.newsbtc.com/altcoin/bunker-buster-ethereum-whales-stake-100-million-amid-us-iran-hostilities/",
      "summary": "Ethereum&#8217;s price roller-coaster has drawn a dramatic wager from big players. While many smaller traders are bracing for more losses, a handful of massive accounts have broken the surface and put millions in a massive show of force. Related Reading: Bitcoin Paces $15 Billion YTD Influx Amid 10-Week Fund Flow Streak Ethereum Whale Bets Surface According to on-chain data, one whale opened a long position worth $101 million at an entry price of $2,247, using 25x leverage. That bet paid off with roughly $950,000 in profit, but it also cost $2.5 million in fees. These numbers show just how high the stakes have become. High Fees Cut Into Gains This whale further withdrew 18,000 $ETH worth $40.38M from #Binance. Now, the whale holds 50,256 $ETH worth $112.62M, currently down $2.24M Address: 0x3952d69643f7a87237c7fc8bb33f8453c0b45500 https://t.co/49vC0iqMZP pic.twitter.com/rF5cX2gsXZ — Onchain Lens (@OnchainLens) June 23, 2025 Based on reports from On-Chain Lens, another whale moved over $40 million in Ether from Binance before opening its own leveraged trade. Combine the two wallets and you’ve got about $112 million riding on an ETH bounce. Yet those $2.5 million in fees highlight the hidden cost of big bets. Middle East Tension Hits Prices ETH slipped to about $2,113 on Sunday, marking its lowest level in 30 days. That drop came after US military strikes on Iran’s nuclear sites. United States President Donald Trump called the operation a “spectacular success” and warned of more action if Iran didn’t back down. Traders say the fallout from those strikes rattled global markets and fed crypto volatility. Retail Traders Watch Closely Retail traders tend to sell when prices drop. But these whales have the scope to weather downswings. Their large purchases indicate that they find value at current levels. Short traders might not agree, however. They&#8217;re sitting in many short positions, expecting ETH to decline further before it will rise. What The Whales See Experts say large holders tend to have lower break-even points. They can afford to wait months or years for a payoff. Some also use complex strategies across multiple markets. That makes their moves hard to read from the outside. Still, when you see $112 million on the line, it’s a hint that smart money senses a buying window. Related Reading: Bitcoin Paces $15 Billion YTD Influx Amid 10-Week Fund Flow Streak Risks On Both Sides Leveraged trades amplify gains and losses equally. A 5% drop would trigger a forced sell-off on a 25x position. That could feed a sharp decline in ETH’s price. On the other hand, if the market turns up, those whales could pocket big returns well beyond what retail traders see. Investors will be watching every market swing. If geopolitical tensions cool and big money stays bullish, ETH could find footing above $2,200. But another shock—political or technical—might send the price tumbling again. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "XRP Pullback Nearly Complete—Next Stop: $8 To $12, Says Analyst",
      "link": "https://www.newsbtc.com/xrp-news/xrp-pullback-nearly-complete-next-stop-12/",
      "summary": "The cryptocurrency market’s sharp retracement may be approaching its denouement, according to prominent trader and YouTuber CryptoInsightUK, who told his followers on 23 June that XRP is “really flipping close” to completing the final leg of a corrective structure that began in early April. Final Trap Or Final Chance For XRP? In his latest video analysis, the analyst sketched a scenario in which Bitcoin grinds lower toward the $92,000–$95,000 liquidity pocket “to sweep the last standing bids,” dragging major altcoins with it. “We’ve had the extra bit of flush down that we were talking about and looking for,” he said, noting that Bitcoin already wicked to $98,200 but has yet to produce the higher-low/higher-high sequence or the bullish RSI divergence that stamped the April capitulation bottom. “I think we’re close to a bottom. I don’t quite think we’re there.” Related Reading: XRP To $30 Beyond 2026? Analyst Reveals Key BTC Ratio To Watch XRP, he argues, is tracing the same pattern at a different scale. The 4-hour chart shows a conspicuous liquidity shelf at $1.89 and a deeper block stretching to $1.73. “In a world where Bitcoin does get the flush to ninety,” he observed, “could we come and take that? Yes. … Maybe $1.85, potentially on a wick.” Although he concedes a tail-risk dip toward $1.60–$1.55, that move is “not my base case.” What makes the area compelling, in CryptoInsightUK’s view, is the clustering of spot demand on each successive stab lower. He highlighted the “big red bar” of sell-side volume that marked last week’s sweep and the immediate spike in spot bids, calling it evidence of “real accumulation rather than derivative games.” Funding rates across major venues have turned modestly positive, confirming that “people are going long,” a dynamic that could yet trigger one more liquidity vacuum as over-leveraged latecomers are forced out. Related Reading: XRP Price At Risk Of 20% Crash To $1.55 If This Level Fails To Hold Springboard For $11 XRP? Technically, the trader is watching for a textbook bullish divergence: price carves a marginally lower low while the 4-hour RSI prints a higher one, mirroring the set-up that preceded April’s 140% rally. The fixed-range volume profile on Bitcoin—where the point of control sits near $97,000—offers confluence, suggesting the broader market is attempting to base on a major support shelf before rotation into altcoins. If that pattern holds, CryptoInsightUK believes XRP is positioned for a “drastic” expansionary phase that would lift the token first to the oft-cited $8 target and then, in an over-extension, to “realistically $11 to $12.” From an idealised $1.85 entry the projection implies an upside of roughly 475%. “I put my neck on the line,” he said. “Everyone’s thinking eight. I think we over-extend that a little bit.” The analyst’s conviction rests in part on his read of Bitcoin dominance, now hovering in what he calls the “reversal box.” A final push to the upper edge could spark the long-awaited altseason, he argued, with XRP—as a large-cap, high-beta play—capturing disproportionate flows once Bitcoin volatility subsides. At press time, XRP traded at $2.1781. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "CME Gap At $92,000: Is A 12% Retrace Inevitable For Bitcoin?",
      "link": "https://www.newsbtc.com/bitcoin-news/cme-gap-at-92000-is-a-12-retrace-inevitable-for-bitcoin/",
      "summary": "The Bitcoin market has been marked by notable volatility recently, with prices fluctuating significantly, dropping close to the $98,400 level before rebounding above $105,000 on Monday. Potential 12% Retrace To $92,000 Technical analyst Doctor Profit recently shared key notes on the social media platform X (formerly Twitter), indicating that a substantial Chicago Mercantile Exchange (CME) gap exists at $92,000. The analyst predicts that this level will likely be eventually reached, suggesting that closing this gap could create additional fear in the market, which often plays into the hands of market makers. Related Reading: Dogecoin Crash Far From Over? Analyst Reveals The Target Doctor Profit also highlighted in his analysis the presence of significant liquidity in that area, making it a probable target for Bitcoin in the near term. This could potentially mean a 12% retrace of BTC’s price. Doctor Profit also pointed to several technical indicators that suggest a bearish trend for Bitcoin. He highlighted the Moving average convergence/divergence (MACD) crossing on the daily chart and the breakdown of the critical $104,000 level. Additionally, the analyst mentioned the temporary loss of what he calls the &#8220;golden line,&#8221; which is currently situated around $103,000 for BTC, another key level to watch in order to accomplish further recoveries. Doctor Profit warned that caution is necessary, especially near pivotal levels like $100,000 and the CME gap at $92,000. He even posited that a worst-case scenario could see Bitcoin correcting all the way down to the $82,000–$84,000 range. Bitcoin Fate Hangs On Golden Line Doctor Profit further elaborated that the situation hinges on the golden line, which serves as a critical retest to confirm the breakdown that occurred yesterday. For Bitcoin to secure a bullish continuation, it needs to close above this level. Moreover, he identified a significant liquidity cluster around the $113,000 mark, noting that this area is rife with short liquidations. Should Bitcoin consolidate above the golden line, the uncertainty that has plagued traders could dissipate, allowing for a shift from protective strategies back to a more bullish outlook. Related Reading: XRP Price At Risk Of 20% Crash To $1.55 If This Level Fails To Hold In his analysis, Doctor Profit concluded by stating that while he initially expected Bitcoin to reach $90,000 before any new all-time highs (ATH), the resolution of current market uncertainty indicates that this may no longer be necessary. With the war between Israel and Iran, along with the volatility seemingly over, he believes Bitcoin can accelerate toward new all-time highs without the need to revisit the $90,000 mark. When writing, BTC trades at $105,560, recording a 3% price surge in the 24-hour time frame. At this level, the market’s leading cryptocurrency trails 5.3% below its record high of $111,800. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Crypto Bears Rekt: $359M Gone As Bitcoin, Ethereum Rebound",
      "link": "https://www.newsbtc.com/bitcoin-news/crypto-bears-rekt-359m-bitcoin-ethereum-rebound/",
      "summary": "Data shows the rebound in Bitcoin and other cryptocurrencies has punished the bears, triggering a massive wave of short liquidations. Crypto Sector Has Just Witnessed A Mass Liquidation Event According to data from CoinGlass, a large amount of liquidations have piled up on the cryptocurrency derivatives market. &#8220;Liquidation&#8221; refers to the forceful shutdown that any open contract has to go through if its losses exceed the threshold defined by its platform. Related Reading: This Bitcoin Zone Could Be Market’s Next True ‘Pivot,’ Says Glassnode Below is a table that shows the numbers related to the latest liquidations in the market. As displayed, the cryptocurrency sector has seen a derivatives flush of over half a billion dollars during the past day. Out of these, 73.7% of the liquidations, equivalent to $371 million, came from the short investors alone. The short-heavy mass liquidations have come as Bitcoin and company have rebounded following the news of a ceasefire between Israel and Iran. Earlier, US strikes on Iranian nuclear facilities had induced a crash in the market that ended up unleashing a flurry of long liquidations. This time, it seems the bears have been the ones caught out instead. As usual, Bitcoin and Ethereum have topped the list of liquidations, but interestingly, the latter ($168 million) has managed to outweigh the former ($153 million), which is generally not the case. Ethereum observing a higher amount of liquidations could come down to the fact that its price has seen a larger jump during the past day (7% vs 3.5%). It could also be an indication of an elevated level of speculative interest in the cryptocurrency. Out of the altcoins, Solana and XRP have topped the charts with $29 million and $13 million in liquidations, respectively. Though clearly, these numbers are quite small compared to the figures of the top two titans, showcasing the sheer difference in capital involved. In some other news, Bitcoin taker buy volume has shot up on the cryptocurrency exchange Bybit, as an analyst has pointed out in a CryptoQuant Quicktake post. In the chart, the data of the Bitcoin Taker Buy Sell Ratio is shown. This metric measures the ratio between the taker buy and taker sell volumes for a given platform. Here, the exchange involved is Bybit. Related Reading: Bitcoin STHs Capitulate: 14,700 BTC Moved To Exchanges At Loss It would appear that the indicator has recently seen a sharp spike above the 1 mark, a sign that long volume has started to sharply outpace the short one. According to the quant, spikes in the metric on Bybit have often preceded a surge in the BTC price. BTC Price Following the recovery run over the last 24 hours, Bitcoin has returned to the $105,100 mark. Featured image from Dall-E, CryptoQuant.com, CoinGlass.com, chart from TradingView.com"
    },
    {
      "title": "Analyst Says XRP Is Moving According To Plan, Here’s Why $1.90 Is Important",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-is-moving-according-to-plan/",
      "summary": "A crypto analyst has reaffirmed a bullish outlook for XRP, suggesting that the cryptocurrency’s price action is unfolding exactly as anticipated. The analyst points out that XRP is now approaching the critical support level at $1.90, which could signal a potential bullish reversal if the price manages to hold above it. XRP Eyes $1.90 As Key Reversal Zone Crypto market expert CasiTrades believes that the XRP price behavior is moving exactly as predicted following its recent price drop below $2. According to the chart and analysis published on X (formerly Twitter), XRP’s retracement toward the $1.90 region is not a sign of weakness but a textbook setup for a potential reversal. Related Reading: Daily Timeframe Says XRP Price Is On The Verge Of Breakout The $1.90 level represents a major Fibonacci Retracement zone, specifically the 0.5 retracement from the macro correction, which the analyst has been closely watching for a possible price reaction. According to CasiTrades, this zone is more than just a random support level—it aligns with a pattern that the analyst described in earlier updates. In these previous reports, CasiTrades was watching out for distinct price movements during XRP’s decline, including a bounce off a key Fibonacci level, a short-term fakeout upward to trap late buyers, and a final drop back into the support zone, where Bullish Divergence can develop. This distinct price pattern now appears to be playing out exactly as expected on the XRP price chart. If XRP holds above the $1.90 level while forming a Bullish Divergence on the Relative Strength Index (RSI), it could confirm a textbook bottom setup and potentially signal the start of a new impulsive rally. XRP And Bitcoin Display Synchronized Patterns CasiTrades&#8217; price chart shows XRP forming a Descending Triangle, with its latest move dipping just into a high-demand zone marked by previous price reactions. In line with the Elliott Wave Theory, this pattern suggests the upcoming completion of Wave 2 with a massive breakout in Wave 3 potentially taking shape if the $1.90 support level holds. Additional support from key Fibonacci levels, such as the 0.618 and 2.136 extensions at $2.0 and $2.1, respectively, reinforces strength in XRP’s potential for a rebound. Related Reading: XRP Price Enters Perfect Setup After Buy Retest – Next Stop $3.7 Interestingly, the analyst points to the Bitcoin price action mirroring this exact behavior—bouncing from just under its own 0.236 retracement near $97,000, and potentially setting up for a final dip into support. This synchronized structure across both XRP and BTC adds heavy confluence. CasiTrades notes that this current downturn is not a breakdown, but rather a final calculated shakeout before a broader rally. If both Bitcoin and XRP reach as expected while positioned at $0.19 and $97,000 respectively, the analyst believes it could trigger a new bullish leg in the crypto cycle. Featured image from Getty Images, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Panelists at Senate Banking Hearing on Crypto Market Structure Call for Regulation ASAP",
      "link": "https://bitcoinmagazine.com/news/panelists-at-senate-banking-hearing-on-crypto-market-structure-call-for-regulation-asap",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/US-Senate-Hearing-on-Crypto-Market-Structure.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/panelists-at-senate-banking-hearing-on-crypto-market-structure-call-for-regulation-asap\" rel=\"nofollow\"> </a></p> <p>Members of the crypto industry and digital asset specialists argue that if the U.S. doesn’t pass legislation on digital asset market structure soon, it might cede authority to legal regimes from other countries.</p> <p>"
    },
    {
      "title": "Lightning Labs Releases Taproot Assets v0.6 With Updates to Stablecoin Support On Bitcoin",
      "link": "https://bitcoinmagazine.com/news/lightning-labs-releases-taproot-assets-v0-6-with-updates-to-stablecoin-support-on-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Lightning-Labs-Releases-Taproot-Assets-v0.6-With-Updates-to-Stablecoin-Support-On-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lightning-labs-releases-taproot-assets-v0-6-with-updates-to-stablecoin-support-on-bitcoin\" rel=\"nofollow\"> </a></p> <p>The update adds grouped asset identifiers, improves Lightning Network payment flows, and expands support for stablecoin transactions on Bitcoin.</p> <p>"
    },
    {
      "title": "Republican Senators Scott, Lummis, Tillis, Hagerty Push For Digital Asset Market Structure Rules",
      "link": "https://bitcoinmagazine.com/news/republican-senators-scott-lummis-tillis-hagerty-push-for-digital-asset-market-structure-rules",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Republican-Senators-Scott-Lummis-Tillis-Hagerty-Push-For-Digital-Asset-Market-Structure-Rules.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/republican-senators-scott-lummis-tillis-hagerty-push-for-digital-asset-market-structure-rules\" rel=\"nofollow\"> </a></p> <p>Republican senators have released principles to guide digital asset market structure legislation, marking a significant step toward regulatory clarity that could benefit Bitcoin and the broader crypto industry. Senate Banking Chairman Tim Scott (R-SC), along with Senators Cynthia Lummis (R-WY), Thom Tillis (R-NC), and Bill Hagerty (R-TN), announced the framework balancing innovation with consumer protection.&#160; [&#8230;]</p> <p>"
    },
    {
      "title": "Anthony Pompliano’s ProCap BTC Buys $386M in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/anthony-pomplianos-procap-btc-buys-386m-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Anthony-Pomplianos-ProCap-BTC-Buys-386M-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pomplianos-procap-btc-buys-386m-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>ProCap BTC acquires 3,724 bitcoin as part of a strategy to build a $1 billion Bitcoin treasury.</p> <p>"
    },
    {
      "title": "The Smarter Web Company Expands Bitcoin Holdings With £15.2M Purchase",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-expands-bitcoin-holdings-with-15-2m-purchase",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Smarter-Web-Comp._imresizer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-expands-bitcoin-holdings-with-15-2m-purchase\" rel=\"nofollow\"> </a></p> <p>The Smarter Web Company, a web design, development, and online marketing services provider, has announced another Bitcoin purchase, acquiring 196.90 Bitcoin for £15,185,259 as part of its &#8220;10 Year Plan&#8221; treasury strategy. The London listed technology company paid an average price of £77,122 per Bitcoin ($103,290 per Bitcoin) for the acquisition.&#160; This purchase brings The [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "NYSE Files for Rule Change to List Trump Bitcoin Ethereum ETF",
      "link": "https://decrypt.co/326858/nyse-files-rule-change-list-trump-bitcoin-ethereum-etf",
      "summary": "NYSE applied for a rule change enabling the listing of a BTC-ETH ETF proposed by President Donald Trump’s media and tech company."
    },
    {
      "title": "Norwegian Mineral Mining Firm Eyes $1.2 Billion Raise for Bitcoin Treasury",
      "link": "https://decrypt.co/326856/norwegian-mineral-mining-firm-1-2-billion-raise-bitcoin-treasury",
      "summary": "Green Minerals has adopted the Bitcoin treasury strategy as a step towards broader blockchain implementation."
    },
    {
      "title": "Ozempic's Newest Miracle: Dramatically Cutting Dementia Risk",
      "link": "https://decrypt.co/326841/ozempics-newest-miracle-dramatically-cutting-dementia-risk",
      "summary": "New research tracking 1.7 million diabetics shows the weight-loss drug slashes dementia risk by up to 70%."
    },
    {
      "title": "Bitcoin in the Buckeye State: Ohio Eyes Its Own Crypto Reserve",
      "link": "https://decrypt.co/326826/bitcoin-buckeye-state-ohio-eyes-crypto-reserve",
      "summary": "Ohio Rep. Steve Demetriou, a Bitcoin advocate, said lawmakers should follow the lead of nearly 2 million Ohioans who own digital assets."
    },
    {
      "title": "BNB Over Bitcoin? Chinese Company's Stock Skyrockets on $1 Billion Crypto Treasury Plan",
      "link": "https://decrypt.co/326837/bnb-over-bitcoin-chinese-company-stock-skyrockets-1-billion-treasury",
      "summary": "Could BNB be the next cryptocurrency after Bitcoin to trend big on Wall Street? Two companies have announced treasury plans this week."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Majority Whip Tom Emmer says House will vote on GENIUS stablecoin bill if paired with CLARITY Act",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house-vote/",
      "summary": "<p>The potential passage of these bills could significantly shape the regulatory landscape for digital assets, impacting innovation and market dynamics.</p> <p>"
    },
    {
      "title": "CME XRP futures hit $542 million volume in first month, strengthening case for spot XRP ETFs",
      "link": "https://cryptobriefing.com/cme-xrp-futures-global-demand/",
      "summary": "<p>The surge in XRP futures trading volume bolsters the likelihood of SEC approval for spot XRP ETFs, potentially transforming crypto investment.</p> <p>"
    },
    {
      "title": "Mastercard and Chainlink team up to enable nearly 3 billion cardholders to buy crypto on-chain",
      "link": "https://cryptobriefing.com/mastercard-chainlink-partnership-crypto/",
      "summary": "<p>This collaboration could significantly accelerate mainstream crypto adoption, bridging traditional finance with decentralized finance seamlessly.</p> <p>"
    },
    {
      "title": "Aptos Labs and Jump Crypto launch Shelby, a decentralized hot-storage protocol built for speed",
      "link": "https://cryptobriefing.com/decentralized-hot-storage-shelby-launch/",
      "summary": "<p>Shelby could revolutionize web3 by enabling real-time applications, enhancing data control, and bridging speed-centralization gaps.</p> <p>"
    },
    {
      "title": "Ripple’s co-founder Arthur Britto breaks 14-year silence as SEC case enters final stage",
      "link": "https://cryptobriefing.com/arthur-britto-silence-xrp/",
      "summary": "<p>Arthur Britto's reemergence highlights the potential for significant shifts in the crypto regulatory landscape as the SEC case nears resolution.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Trump Media: $400M buyback won’t derail $2.3B Bitcoin Treasury plan",
      "link": "https://ambcrypto.com/trump-media-400m-buyback-wont-derail-2-3b-bitcoin-treasury-plan/",
      "summary": "<img alt=\"Trump Media $400M Buyback\" class=\"attachment-full size-full wp-post-image\" height=\"875\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Trump-Media-400M-Buyback.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1555\" />Trump Media’s $2.5B Bitcoin pivot fuels crypto ambitions, but financial risks and volatility still loom."
    },
    {
      "title": "SPX6900 gains 18% – But traders, watch out, THIS risk could ruin it all",
      "link": "https://ambcrypto.com/spx6900-gains-18-but-traders-watch-out-this-risk-could-ruin-it-all/",
      "summary": "<img alt=\"SPX6900 gains 18% – But traders, watch out - THIS metric could ruin it all\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-9-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is the memecoin facing hidden sell pressure from whales and oversupply?"
    },
    {
      "title": "Fed reverses course on ‘reputational risk’ – Will banks embrace crypto now?",
      "link": "https://ambcrypto.com/fed-reverses-course-on-reputational-risk-will-banks-embrace-crypto-now/",
      "summary": "<img alt=\"Fed\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Fed-reverses.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Crypto community cheered Fed's reversal on key risk standard."
    },
    {
      "title": "Ethereum’s next big leap? Dev proposes halving block times for faster DeFi",
      "link": "https://ambcrypto.com/ethereums-next-big-leap-dev-proposes-halving-block-times-for-faster-defi/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-16.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Could halving slot times make Ethereum faster for DeFi and rollups?"
    },
    {
      "title": "AERO signals to $1.5 target – Here’s what traders need to know",
      "link": "https://ambcrypto.com/aero-signals-to-1-5-target-heres-what-traders-need-to-know/",
      "summary": "<img alt=\"AERO signals to $1.5 target – Here&#039;s what traders need to know\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox3.jpeg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whale accumulation and new on-chain projects on Aerodrome could spark an upward move for AERO."
    }
  ]
}