{
  "CoinDesk": [
    {
      "title": "Suspect in French Crypto Kidnappings Arrested in Morocco",
      "link": "https://www.coindesk.com/policy/2025/06/04/suspect-in-french-crypto-kidnappings-arrested-in-morocco",
      "summary": ""
    },
    {
      "title": "Circle Debuts on NYSE at $31 Per Share, Valuing Stablecoin Issuer at $6.2 Billion",
      "link": "https://www.coindesk.com/markets/2025/06/04/circle-debuts-on-nyse-at-31-per-share-valuing-stablecoin-issuer-at-62-billion",
      "summary": ""
    },
    {
      "title": "Vitalik Buterin Uses Privacy Tool Railgun Again, Signaling Ongoing Embrace of On-Chain Anonymity",
      "link": "https://www.coindesk.com/tech/2025/06/04/vitalik-buterin-uses-privacy-tool-railgun-again-signaling-ongoing-embrace-of-on-chain-anonymity",
      "summary": ""
    },
    {
      "title": "The Protocol: Berachain Follows Ethereum’s Pectra Upgrade With ‘Bectra’",
      "link": "https://www.coindesk.com/tech/2025/06/04/the-protocol-berachain-follows-ethereum-s-pectra-upgrade-with-bectra",
      "summary": ""
    },
    {
      "title": "Trio of Soft Economic Reports Boost Fed Rate Cut Odds, but What About Bitcoin?",
      "link": "https://www.coindesk.com/markets/2025/06/04/trio-of-soft-economic-reports-boost-fed-rate-cut-odds-but-what-about-bitcoin",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Stablecoin giant Circle again boosts IPO to over $1 billion",
      "link": "https://cointelegraph.com/news/stablecoin-issuer-circle-upsize-ipo-1-billion?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNkMzEtNmNlOS03ODViLTljNmYtZmZmYmJhOWEwZTAz.jpg\" /></p><p>USDC issuer Circle has again upsized its initial public offering above the marketed range, selling 34 million shares at $31 each.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Trump’s crypto ties cloud digital assets legislation in Congress",
      "link": "https://cointelegraph.com/news/trump-crypto-ties-cloud-digital-assets-legislation-congress?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDZhNWMtZGYzMS03MzA4LTkzZjUtNzJmYjY2MmMwMTM0.jpg\" /></p><p>Members in two House committee hearings debated a framework for digital assets while raising concerns about the US president using his position to profit from the industry.</p>"
    },
    {
      "title": "JPMorgan to accept crypto ETFs as collateral for loans — Report",
      "link": "https://cointelegraph.com/news/jpmorgan-accept-crypto-etfs-collateral-loans-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNjOTItOTJmZC03MjJjLWFhZmUtNDgxOTY5MTc3M2Jh.jpg\" /></p><p>In some cases, the bank will look at crypto holdings when determining net worth, which may affect how much can be borrowed.</p>"
    },
    {
      "title": "Senate committee to consider Trump’s pick for CFTC chair",
      "link": "https://cointelegraph.com/news/senate-committee-consider-trump-pick-cftc-chair?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNjNTYtZGFhZS03MWU4LWI4OGItNmFmMmVjZGYzNjFi.jpg\" /></p><p>Roughly four months since his nomination and amid announced departures at the CFTC, Brian Quintenz’s nomination to head the financial regulator is moving forward.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Systemic risk on the rise as leverage interdependencies tighten between CeFi, DeFi and crypto treasuries",
      "link": "https://cryptoslate.com/systemic-risk-on-the-rise-as-leverage-interdependencies-tighten-between-cefi-defi-and-crypto-treasuries/",
      "summary": "<p>Interconnections between centralized and decentralized crypto lending are heightening systemic risk, Galaxy Digital&#8217;s research arm said in a June 4 report on first-quarter borrowing data. The report estimated that as of March 31, over $39 billion in crypto-collateralized debt was outstanding across decentralized lending apps, centralized lenders, and crypto-backed stablecoin issuers. DeFi protocols accounted for [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation unveils comprehensive treasury plan to balance capital and privacy commitments",
      "link": "https://cryptoslate.com/ethereum-foundation-unveils-comprehensive-treasury-plan-to-balance-capital-and-privacy-commitments/",
      "summary": "<p>Ethereum Foundation has released a sweeping update to its treasury management strategy, signaling a more mature, structured approach to capital allocation amid ETH&#8217;s growing global influence and rising institutional scrutiny. The new framework, published on June 4, outlines how the foundation will manage reserves, deploy capital in DeFi protocols, and assess privacy standards, while maintaining [&#8230;]</p> <p>"
    },
    {
      "title": "Brazil’s central bank plans to use CBDC data to guide interest rate decisions",
      "link": "https://cryptoslate.com/brazils-central-bank-plans-to-use-cbdc-data-to-guide-interest-rate-decisions/",
      "summary": "<p>Brazil’s Central Bank plans to treat transaction data from its central bank digital currency (CBDC) infrastructure, called Drex, as a direct input for setting the country’s interest rate benchmark. Central bank executive Henrique Videira said on June 4 at the Token Nation conference in São Paulo that every payment and asset transfer recorded on Drex’s [&#8230;]</p> <p>"
    },
    {
      "title": "Circle set to exceed IPO expectations after overwhelming investor demand",
      "link": "https://cryptoslate.com/circle-set-to-exceed-ipo-expectations-after-overwhelming-investor-demand/",
      "summary": "<p>Circle is poised to price its initial public offering above its marketed range after receiving investor orders for more than 25x the number of shares available, Bloomberg reported on June 4, citing people familiar with the matter. The stablecoin issuer and its backers are offering 32 million shares at a price range of $27 to [&#8230;]</p> <p>"
    },
    {
      "title": "US-based ETFs offering staking set for growth despite some regulatory, macro tailwinds",
      "link": "https://cryptoslate.com/us-based-etfs-offering-staking-set-for-growth-despite-some-regulatory-macro-tailwinds/",
      "summary": "<p>Upcoming exchange-traded funds (ETFs) that integrate staking yields stand to benefit significantly as US lawmakers and regulators clarify the legal status of on-chain rewards, according to a June 3 report. The report noted points to two parallel policy moves. First, the US Securities and Exchange Commission (SEC) confirmed on May 29 that staking does not [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "American Rapper Cardi B Endorses WAP Token Again—But Is It A Rugpull?",
      "link": "https://www.newsbtc.com/meme-coins/american-rapper-cardi-b-endorses-wap-token-again-but-is-it-a-rugpull/",
      "summary": "Cardi B’s recent post about the meme token Wet A*s P*ssy (WAP) turned into a dramatic market shakeup. Within minutes, WAP’s market cap plunged from $2 million to just $150,000. The token’s price shot up to $0.0020 briefly, then tumbled over 90% back to $0.00019, wiping away almost all of this week’s gains. Related Reading: Is $250K Bitcoin Possible This Year? This Research Chief Thinks So Celebrity Tweet Sparks Chaos According to reports, Cardi B shared a wallet address on her official X account with the caption “even wetter than last time.” That single message sent ripples through the crypto world. Prices leaped, then crashed. Market watchers were left scratching their heads as billions of dollars in value seemed to vanish in mere moments. Suspicious Wallet Activity Blockchain trackers spotted something odd. A handful of wallets bought big chunks of WAP just five days before the tweet. They offloaded their tokens almost immediately after Cardi B’s post, banking roughly 10 times their original stake. So today, @iamcardib remembered that she still held a large portion of the $WAP supply and decided to run another pump and dump. The token went from 2.5M to 139k a couple of minutes after the tweet The dump was triggered by some wallets that bought the token around five days… pic.twitter.com/7Nwr27rcZA — dethective (@dethective) June 3, 2025 These sudden sells helped push the token’s price back down to around $0.00019. Based on reports, this pattern looks like a classic pump-and-dump. It raises questions about whether insiders planned the entire move. POV you might owe millions pic.twitter.com/j9FGLgoSBM — ZachXBT (@zachxbt) June 4, 2025 History Of WAP Controversies This isn’t the first time WAP caused trouble. Back in October 2024, Cardi B gave it a shout-out, and security firm PeckShield flagged the token for possible malicious deeds. That earlier buzz even led to an investigation by the UAE’s Securities and Commodities Authority after investors raised alarms over fraud and market manipulation. Many in the crypto community thought everyone would steer clear this time. Instead, the past slipped from memory, leading to heavy losses all over again. Investors Left Holding The Bag In the last 24 hours, WAP’s value dropped another 80%. Now it trades near the same levels it was at the end of May. Everyday traders who jumped on the hype found themselves staring at red numbers. Based on reports, some wallets walked away with tenfold returns in minutes. Meanwhile, others ended up with nearly worthless tokens. The speed of this rise-and-fall serves as a harsh reminder: if you buy a token right as it peaks, you might be stuck when the next crash hits. Related Reading: $500M Bet On Solana: Education Platform Aims To Supercharge Its Treasury Cardi B’s follow-up post clarified that her account was not hacked, promising more from “$WAP space” soon. Yet this explanation did little to calm nerves. Critics say it’s hard to separate the artist’s genuine interest from a planned marketing push. Some point out that even if she didn’t directly benefit, her endorsement gave insiders exactly the spotlight they needed to unload their shares. Featured image from Andrew Kelly/Reuters/USA Today, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Crash Below $100,000 Still Possible: Analysts Issue Downtrend Warnings",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-crash-below-100000/",
      "summary": "Despite the recent rally to a new all-time high (ATH) of $111,900, crypto analysts have warned that the Bitcoin price could still witness a massive crash that will send it below $100,000. These analysts highlighted fundamentals and technicals that could spark this price crash. Analysts Highlight Why Bitcoin Price Could Still Crash Below $100,000 In a TradingView post, crypto analyst Stephan mentioned the geopolitical tensions, with the Russia-Ukraine conflict intensifying as one of the factors that could spark the Bitcoin price crash. He explained how this conflict could drive investors toward safe-haven assets, such as gold. The analyst also noted that Bitcoin ETFs experienced modest outflows last week. Related Reading: Bitcoin Price Crash To $104,000: What You Need To Know In June Stephan’s accompanying chart showed that the Bitcoin price could drop to as low as $96,765 as it retests the psychological $100,000 support level. Crypto analyst Nova also warned that Bitcoin could drop to $100,000 while providing a technical analysis of the flagship crypto’s current price action. In a TradingView post, Nova stated that if the Bitcoin price faces resistance around the $106,406 daily level and continues to correct, it could extend the decline to retest the psychologically important $100,000 mark. She further revealed that the Relative Strength Index (RSI) on the daily chart is at 53, trending downwards to the neutral level of 50. This indicates weakening bullish momentum. Nova also stated that the Moving Average Convergence Divergence (MACD) showed a bearish crossover last week. Meanwhile, the analyst alluded to the increasing red histogram bars below the baseline, which she claimed further signal a potential correction ahead. Her accompanying chart showed that the Bitcoin price could drop to $99,000 as it retests the $100,000 level. Crypto analyst Kevin Capital also called for caution at the current Bitcoin price level. He stated that nothing has changed for the flagship crypto and indicated that there was no need to be ultra bullish at this current level. The analyst earlier warned that things could get sketchy looking for BTC if it fails to reclaim $106,800 soon enough. BTC Could Still Rally To $135,000 This Year In an X post, crypto analyst Titan of Crypto raised the possibility of the Bitcoin price rallying to $135,000 this year. He noted that BTC has broken out of a right-angled descending broadening wedge, and if the price holds above the breakout zone, $135,000 becomes a realistic target. The analyst added that the structure is clean. Related Reading: Head And Shoulders Pattern Says Bitcoin Price Is Headed Down Toward $95,000 Crypto analyst Mikybull Crypto stated that the Bitcoin price is gearing up for a new all-time high. He further remarked that $120,000 remains a magnet for the flagship crypto in this market cycle. Meanwhile, veteran trader Peter Brandt predicted that BTC could reach $150,000 by late summer 2025. At the time of writing, the Bitcoin price is trading at around $105,400, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin ATH Fails To Hype Retail—Demand Is Actually Down",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-ath-fails-hype-retail-demand-actually-down/",
      "summary": "On-chain data shows the retail interest in Bitcoin has been waning as small-holder volume has gone down during the past month. Bitcoin Retail Investor Demand Has Seen A Negative 30-Day Change In a CryptoQuant Quicktake post, an analyst has talked about the latest trend in the &#8220;Retail Investor Demand&#8221; of Bitcoin. This indicator provides an estimate for, as its name suggests, the amount of demand that the smallest of investors, the &#8216;retail,&#8217; have toward the cryptocurrency right now. The metric does so by referring to the transaction volume associated with this cohort. Considering the small wallet size attached to these holders, their transfers would typically remain under a value of $10,000, so the volume related to them can be separated from the rest of the market by only restricting to transfers below this size. Related Reading: Bitcoin 3–5 Year Holders Slow Selloff—Waiting for Higher Prices? Now, here is the chart shared by the quant that shows the 30-day percentage change in the Bitcoin Retail Investor Demand over the past year: As is visible in the above graph, the Bitcoin Retail Investor Demand saw its 30-day change enter into the positive territory when the latest bull rally first started, suggesting that the small investors increased their transfer activity. The 30-day change continued a gradual rise as the run played out, but after the cryptocurrency set its new all-time high (ATH), it noted a reversal in direction. Today, the metric has declined enough to dip back into the negative territory, meaning that retail investor volume is now going down on the monthly timeframe. From the chart, it&#8217;s also apparent that even at its peak, the 30-day change in the Retail Investor Demand never actually touched a high level this rally, which is in sharp contrast to the run from the end of 2024. Thus, it would appear that the recent price surge not only failed to ignite any notable level of interest among the small hands but also failed to maintain the attention that it did gather. The switch to a negative monthly change for the Retail Investor Demand could be down to the bearish action that the coin&#8217;s price has seen since the ATH, but the fact of the matter is that Bitcoin is currently still very much in range of this record, so it&#8217;s interesting to see this sentiment among the group. Related Reading: Bitcoin Could Go ‘Bananas’ If Price Closes Above This Level, Top Analyst Says Speaking of transaction volume, the institutional DeFi solutions provider Sentora (formerly IntoTheBlock) has talked about the latest trend in the volume share of the Bitcoin miners. As displayed in the chart, the Bitcoin miners have seen their volume share sharply go down recently and drop to the lowest level since 2022. This implies these chain validators have seen their activity plummet relative to the rest of the network. BTC Price Bitcoin has taken to sideways movement recently as its price is still trading around the $105,200 mark. Featured image from Dall-E, IntoTheBlock.com, CryptoQuant.com, chart from TradingView.com"
    },
    {
      "title": "Trump Crypto Venture Charges Into Digital Space With Wallet Launch Amid Uproar",
      "link": "https://www.newsbtc.com/altcoin/trump-crypto-venture-charges-into-digital-space-with-wallet-launch-amid-uproar/",
      "summary": "US President Donald Trump’s circle moved closer to rolling out two big crypto products this week. One announcement sparked a public mix‐up over who’s doing what. The other took a formal step toward a Bitcoin exchange‐traded fund. Both moves show the family’s push for more crypto ties. Related Reading: XRP Could Transform Your Finances Long Before $10K, Angel Investor Says Trump Token Wallet Claim Fuels Confusion According to reports, @GetTrumpMemes on X said on Tuesday that a new crypto wallet branded with US President Trump’s picture is coming."
    },
    {
      "title": "XRP Price Could Hit $21 This Bull Cycle With 1.618 Fib Level As Next Target",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-to-21-this-bull-cycle/",
      "summary": "According to expert analysts, the XRP price is showing renewed bullish momentum, with projections suggesting a potential rally to the 1.618 Fib at $21 this bull cycle. While this projection may seem ambitious, the analyst’s bullish outlook doesn’t stop there. Once XRP hits $21, it is expected to continue its upward trajectory toward its next target of $152. XRP Price Eyes Powerful Breakout To New Targets A recent technical analysis of XRP’s long-term price chart is igniting significant buzz in the crypto community, as the altcoin appears to be forming a familiar pattern that previously led to exponential gains. The chart, published by a well-known crypto expert, Javon Marks, suggests that XRP could be on the brink of a powerful price breakout, with expectations pointing toward the $21 price level and beyond. Related Reading: Wave Structure Puts XRP Price In The $18.22-$23.20 Range In The Short Term Marks’ analysis identifies two major symmetrical triangle formations in XRP’s price history—one that preceded its explosive rally in 2017 and another that concluded with a fresh breakout in 2024. In the earlier cycle, XRP surged thousands of percent after breaking out of its consolidation pattern, topping near the 2.272 Fibonacci level. This historical price movement is now being used to forecast what could come next for the altcoin. According to the chart, XRP recently rose to the 1.0 Fibonacci level near $3.31 but retraced back toward $2. If the current cycle mirrors the previous one, Marks predicts that the next significant level of interest lies at the 1.618 Fibonacci Extension level, which aligns with the $21 price target. Notably, a surge to this double-digit territory would represent an over 800% increase from current levels around $2.23. However, Marks’ optimistic projection does not stop there. Should XRP replicate the full extension it made in the past, the price is forecasted to reach the 2.272 Fibonacci level once again, this time sitting around a jaw-dropping $152. While this forecast may seem over the top, the analyst has shown strong confidence in XRP’s future price outlook, utilizing past price action as a blueprint and technical indicator to determine the altcoin’s upside potential. Analyst’s XRP Forecast Met With Skepticism On one hand, Marks’ bullish XRP price forecast was met with excitement, and on the other, the majority of crypto community members expressed doubts about the overly ambitious targets. The projection of a move to $21 and possibly even higher to $152 has been met with caution and skepticism among community members. Related Reading: Bullish Candle Formation Suggests The XRP Price Could Touch $22 While historical patterns can provide a roadmap to a potential price rally, critics responding to Marks’ analysis argue that reaching the triple-digit territory is virtually impossible for XRP currently. One member suggested that a more realistic target for the altcoin was between $13 and $20. Others questioned the feasibility of hitting these bullish targets within the proposed timeline, debating whether it could happen by the end of 2025 or even Q1 2026. Featured image from Getty Images, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Matador Technologies Raises C$1.64M To Invest in Their Bitcoin Reserve",
      "link": "https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Matador-Technologies-Raising-C1-Million-to-Invest-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve\" rel=\"nofollow\"> </a></p> <p>Matador Technologies announced it raised C$1,644,300 across the issuance of 2,652,097 units to add more bitcoin to their reserve.</p> <p>"
    },
    {
      "title": "Support The Blockchain Regulatory Certainty Act (BRCA) To Protect Noncustodial Services",
      "link": "https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Blockchain-Regulatory-Certainty-Act-Save-Our-Wallets-Bitcoin-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services\" rel=\"nofollow\"> </a></p> <p>Call your local elected officials and tell them to support the BRCA, which protects developers of noncustodial technology as well as a variety of services that preserve privacy and make it easier to scale Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: The Key To Scaling Bitcoin",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Layer2-Introduction.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bitcoin and other blockchains are robust and decentralized systems, but they do not scale. In order to make them work, a layered approach is necessary.</p> <p>"
    },
    {
      "title": "JPMorgan to Offer Clients Financing Against Bitcoin & Crypto ETFs",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-Morgan-Plans-to-Offer-Clients-Financing-Against-Crypto-ETFS.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs\" rel=\"nofollow\">JPMorgan to Offer Clients Financing Against Bitcoin &#038; Crypto ETFs</a></p> <p>JPMorgan Chase &#38; Co. plans to allow its trading and wealth-management clients to use cryptocurrency-linked assets, including spot Bitcoin exchange-traded funds (ETFs), as collateral for loans, according to Bloomberg. The bank will begin with BlackRock’s iShares Bitcoin Trust (IBIT), and additional ETFs are expected to be added over time. The policy will apply globally, spanning [&#8230;]</p> <p>"
    },
    {
      "title": "BTCPay Server: The Backbone of Bitcoin Commerce, 2025",
      "link": "https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_young_modern_wizard_male_futuristic_clothi_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025\" rel=\"nofollow\"> </a></p> <p>With plugins for Boltz swaps and WooCommerce, BTCPay Server’s open-source platform supports merchants globally, no middleman required.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "'Unclaimed' Bitcoin in California Could Be Seized—But There's a Catch",
      "link": "https://decrypt.co/323787/unclaimed-bitcoin-california-seized-theres-catch",
      "summary": "The California House passed a bill that would let the state seize crypto sitting on exchanges—but advocates say it's actually a good thing."
    },
    {
      "title": "Bitcoin Dips But XRP and Dogecoin Fall Further Amid Tariff, Economic Uncertainty",
      "link": "https://decrypt.co/323742/bitcoin-dips-xrp-dogecoin-fall-further",
      "summary": "Bitcoin dropped by about 1% but major altcoins fell deeper into the red as investors weighed steel tariffs and wider macro uncertainties."
    },
    {
      "title": "'Flappy Bird' Is Making a Crypto Gaming Push After All",
      "link": "https://decrypt.co/323735/flappy-bird-crypto-gaming-push",
      "summary": "Popular mobile game Flappy Bird is once more taking flight in Web3 after closing down its Telegram game and launching on Android."
    },
    {
      "title": "‘Take Rent, Invest That’: How Grant Cardone Is Mixing Real Estate and Bitcoin",
      "link": "https://decrypt.co/323697/take-rent-invest-that-how-grant-cardone-is-mixing-real-estate-and-bitcoin",
      "summary": "Real estate entrepreneur Grant Cardone wants his tenants to buy Bitcoin for you."
    },
    {
      "title": "Chinese Company Takes a Shot at the Moon With $300 Million XRP Play",
      "link": "https://decrypt.co/323720/chinese-company-webus-300-million-xrp-play",
      "summary": "Nasdaq-listed travel booking firm Webus filed a Form 6-K to inform U.S. investors and regulators of its plans for a $300 million XRP treasury."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "JPMorgan Chase set to accept Bitcoin, crypto ETFs as loan collateral",
      "link": "https://cryptobriefing.com/jpmorgan-crypto-loan-collateral/",
      "summary": "<p>JPMorgan's move to accept crypto ETFs as collateral could accelerate mainstream adoption and integration of digital assets in traditional finance.</p> <p>"
    },
    {
      "title": "BlackRock’s Bitcoin ETF futures go live on Moscow Exchange as fund surpasses $70 billion AUM",
      "link": "https://cryptobriefing.com/bitcoin-futures-moscow-exchange/",
      "summary": "<p>The integration of Bitcoin ETFs into Russia's financial markets may signal a shift towards broader acceptance and regulation of crypto assets.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus files with SEC for potential $300M XRP reserve strategy, stock surges pre-market",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy/",
      "summary": "<p>Webus's strategic XRP reserve plan could enhance global payment solutions, potentially transforming cross-border transactions and boosting investor confidence.</p> <p>"
    },
    {
      "title": "Trump’s top crypto advisor meets with Pakistan blockchain chief to discuss Bitcoin",
      "link": "https://cryptobriefing.com/bitcoin-strategic-cooperation-pakistan/",
      "summary": "<p>Pakistan's strategic Bitcoin initiatives could strain IMF relations, highlighting challenges for emerging markets in crypto adoption.</p> <p>"
    },
    {
      "title": "Eric Trump threatens legal action over unauthorized Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/eric-trump-crypto-wallet-warning/",
      "summary": "<p>The incident highlights the complexities and potential legal challenges of using high-profile branding in the rapidly evolving crypto space.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Satoshi Nakamoto surpasses Bill Gates in wealth with $116.7B net worth – Elon Musk next?",
      "link": "https://ambcrypto.com/satoshi-nakamoto-surpasses-bill-gates-in-wealth-with-116-7b-net-worth-elon-musk-next/",
      "summary": "<img alt=\"Satoshi Nakamoto surpasses Bill Gates in wealth with $116.7B net worth - Elon Musk next?\" class=\"attachment-full size-full wp-post-image\" height=\"1091\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Nakamoto-Is-Now-Richer-Than-Bill-Gate.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1939\" />He’s never been seen, but his crypto stash could soon overtake Zuckerberg, Buffett, and maybe Musk next."
    },
    {
      "title": "Miners may shape Bitcoin’s fate – But first, ETF outflows need to stop",
      "link": "https://ambcrypto.com/miners-may-shape-bitcoins-fate-but-first-etf-outflows-need-to-stop/",
      "summary": "<img alt=\"Miners may shape Bitcoin’s fate - But first, ETF outflows need to stop\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_32_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />MARA Digital's BTC accumulation grows as ETF outflows surge, raising hopes for potential price stability."
    },
    {
      "title": "Solana’s memecoin powerhouse Pump.fun eyes $1B raise at $4B valuation",
      "link": "https://ambcrypto.com/solanas-memecoin-powerhouse-pump-fun-eyes-1b-raise-at-4b-valuation/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Solana-Pumpfun-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here's experts' outlook on Pump.fun's expected token launch."
    },
    {
      "title": "Shiba Inu burn surges 2,408%: Can SHIB finally escape bearish pressure?",
      "link": "https://ambcrypto.com/shiba-inu-burn-surges-2408-can-shib-finally-escape-bearish-pressure/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-84-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SHIB’s massive burn rate fails to offset bearish on-chain signals and resistance levels."
    },
    {
      "title": "Bitcoin: How the $113K level can trigger a major price surge",
      "link": "https://ambcrypto.com/bitcoin-how-the-113k-level-can-trigger-a-major-price-surge/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-14.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bullish for now, but a long-term correction may follow."
    }
  ]
}