{
  "CoinDesk": [
    {
      "title": "Tether/Circle Stablecoin Supply Growth Signals Strong Liquidity Backing Crypto Rally",
      "link": "https://www.coindesk.com/markets/2025/07/11/tethercircle-stablecoin-supply-growth-signals-strong-liquidity-backing-crypto-rally",
      "summary": ""
    },
    {
      "title": "Robinhood Probed by Florida AG’s Office Over Allegedly ‘Deceptive’ Crypto Pricing Claims",
      "link": "https://www.coindesk.com/policy/2025/07/11/robinhood-probed-by-florida-ag-s-office-over-allegedly-deceptive-crypto-pricing-claims",
      "summary": ""
    },
    {
      "title": "Grayscale Challenges SEC’s Delay of GDLC ETF Launch, Calls Stay Order Unlawful",
      "link": "https://www.coindesk.com/policy/2025/07/11/grayscale-challenges-sec-s-delay-of-gdlc-etf-launch-calls-stay-order-unlawful",
      "summary": ""
    },
    {
      "title": "Defi Tokens Are Soaring, Leaving Behind OG Coins Like LTC, BCH and XMR",
      "link": "https://www.coindesk.com/markets/2025/07/11/defi-tokens-are-soaring-leaving-behind-og-coins-like-ltc-bch-and-xmr",
      "summary": ""
    },
    {
      "title": "Spot Bitcoin ETFs See $1B of Inflows as IBIT Becomes Fastest Fund to Hit $80B in Assets",
      "link": "https://www.coindesk.com/markets/2025/07/11/spot-bitcoin-etfs-see-usd1b-inflows-as-ibit-becomes-fastest-fund-to-hit-usd80b-in-assets",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "HIVE Digital stock soars on BTC mining, revenue milestones",
      "link": "https://cointelegraph.com/news/hive-digital-bitcoin-rally-ai-pivot?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Q0NzMtNDU3OS03YjJhLWI4MzItNTYzOGFkMWRkNjJj.jpg\" /></p><p>The blockchain and AI infrastructure company has doubled its Bitcoin hashrate and boosted its annual revenue run rate to $250 million.</p>"
    },
    {
      "title": "Dubai won the real estate tokenization play",
      "link": "https://cointelegraph.com/news/dubai-real-estate-tokenization?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2NhZTUtYTNiYi03MWVjLThmMTAtNWYxNzg5OTQwNjY0.jpg\" /></p><p>Dubai is pioneering real estate tokenization with a regulated, blockchain-based framework that democratizes property investment, enabling global retail investors to buy fractional shares in prime properties.</p>"
    },
    {
      "title": "How crypto scammers used dating apps to steal $36.9M and launder it to Cambodia",
      "link": "https://cointelegraph.com/explained/how-crypto-scammers-used-dating-apps-to-steal-369m-and-launder-it-to-cambodia?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy80ODQ5ODZkOTY2ZTFiOTNmN2M5NmM4NWIzZGU5OTYxOS5qcGc=.jpg\" /></p><p> Looking for love lost $36.9 million to crypto scammers: A story of how Axis Digital turned sweet words into stolen coins and laundered it all to Cambodia. </p>"
    },
    {
      "title": "TRON strengthens its role in stablecoin settlements: Mid-year report",
      "link": "https://cointelegraph.com/news/tron-strengthens-its-role-in-stablecoin-settlements-mid-year-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Y2MmEtYmRlYi03ZGY4LWIzYWItMWNlNDRiYTkwMGUy.jpg\" /></p><p>TRON’s strong position in the stablecoin market continues with steady user growth, transaction volume and ecosystem expansion.</p>"
    },
    {
      "title": "‘Crypto Week’ approaches: Will these three pro-crypto bills pass?",
      "link": "https://cointelegraph.com/news/crypto-week-will-three-pro-crypto-bills-pass?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5Njk5YWYtNzBkZS03YmIzLWJhZjktMmVmMGQwYmQzYWMy.jpg\" /></p><p>“Crypto week” is approaching as lawmakers in Washington aim to pass three bills related to digital assets.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Ethereum advances toward censorship-resistant scaling with zkEVM layer-1 shift",
      "link": "https://cryptoslate.com/ethereum-advances-toward-censorship-resistant-scaling-with-zkevm-layer-1-shift/",
      "summary": "<p>Ethereum is advancing its long-term scalability strategy with a substantial technical shift to integrate the zero-knowledge Ethereum Virtual Machine (zkEVM) into the layer-1 blockchain. On July 10, Sophia Gold, an Ethereum Foundation developer, stated that the foundation aims to ship the L1 zkEVM within a year, marking a critical evolution in Ethereum’s pursuit of efficient, [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum futures volume surpasses Bitcoin for first time amid 5 month high",
      "link": "https://cryptoslate.com/ethereum-futures-volume-surpasses-bitcoin-for-first-time-amid-5-month-high/",
      "summary": "<p>Ethereum’s daily futures trading volume exceeded Bitcoin’s for the first time on July 10, a landmark development that coincided with the asset’s price testing the $3,000 level. The technical flip in the derivatives market indicates a potential shift in trader sentiment and capital allocation, lending credence to narratives of a changing market structure. Data from [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation denies selling assets amid ETH’s climb past $3,000",
      "link": "https://cryptoslate.com/ethereum-foundation-denies-selling-assets-amid-eths-climb-past-3000/",
      "summary": "<p>Ethereum has surged past the $3,000 mark for the first time since February, riding on the renewed momentum sweeping across the broader crypto market. According to data, ETH&#8217;s price peaked at $3,033 during the last 24 hours amid a 9% increase. However, its value has slightly retraced to $2,991 as of press time. This [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin ETFs see record $1.2B inflow as market hits all-time high in dollars",
      "link": "https://cryptoslate.com/bitcoin-etfs-see-record-1-2b-inflows-as-market-hits-all-time-high-in-dollars/",
      "summary": "<p>US-based spot Bitcoin ETFs saw a dramatic uptick in investor activity as the top crypto price reached a new all-time high of over $118,000, at least in dollars. According to SoSoValue data, the 12 funds saw cumulative inflows of $1.2 billion, the second strongest daily performance since launch in 2024, and the best this year. [&#8230;]</p> <p>"
    },
    {
      "title": "European watchdog warns of ‘inadequate’ Malta crypto licensing for MiCA regulations",
      "link": "https://cryptoslate.com/european-watchdog-warns-of-inadequate-malta-crypto-licensing-for-mica-regulations/",
      "summary": "<p>The European Securities and Markets Authority (ESMA) has raised red flags over Malta’s handling of license approvals under the EU’s Markets in Crypto-Assets (MiCA) regulation. In a peer review report released on July 10, ESMA highlighted deficiencies in how the Malta Financial Services Authority (MFSA) approved a recent crypto asset service provider (CASP), urging tighter [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "99Bitcoins Q2 Report Unveils What’s Powering the 2025 Crypto Boom",
      "link": "https://www.newsbtc.com/news/99bitcoins-q2-report-unveils-whats-powering-2025-crypto-boom/",
      "summary": "The crypto market has been on a tear in 2025, and the latest 99Bitcoins Q2 State of Crypto Market Report, authored by Manisha Mishra and sponsored by KCEX, lays it all out. The quarter saw institutional demand surge, Bitcoin ($BTC) hit a then-ATH of $111,980, and crypto hiring spike 753%. Despite the rally, the total market cap was still 12% below its $3.7 trillion peak, hinting at room to run. With stablecoin adoption booming and long-term holders stacking, Q2 may have been the real start of this cycle’s breakout. Read the full report here: State of Crypto Q2 2025 – 99Bitcoins A Record-Breaking Quarter for Bitcoin Bitcoin lit up Q2 with a 25.66% gain, smashing past resistance to hit a then-record $111,980 on May 22. That put it well ahead of gold’s 7.21% rise and most equity indices, marking a sharp reversal from Q1’s pullback. According to 99Bitcoins’ Q2 report, the rally was driven by institutional inflows, ETF demand, and growing sovereign interest, with governments now holding 2.5% of Bitcoin’s total supply. Meanwhile, spot ETF flows consistently outpaced miner issuance, tightening supply just as demand surged. Chris Wright of 21Shares summed it up: “We believe that Bitcoin ETFs will attract 50% more inflows this year compared to last year. This would result in net inflows of approximately $55 billion in 2025, representing an increase of around $20 billion year-over-year.” A golden cross in late May confirmed the uptrend, following a clean breakout from months of consolidation. It’s a textbook bullish structure. With price action and fundamentals in sync, Q2 marked the clearest shift yet: Bitcoin is back, but powered by institutions, not retail. Institutions Took the Wheel, Retail Turned to Altcoins According to the 99Bitcoins report, this bull run has a different driver behind the wheel. And it’s not Reddit. 9 out of 10 experts interviewed in the Q2 report said retail traders have shifted their focus to the best altcoins, chasing faster gains while institutions quietly accumulated Bitcoin. The on-chain data backs it up. Glassnode shows that 30% of $BTC’s supply is now held by centralized entities, with large players dominating inflows. Meanwhile, Google Trends reveals that retail interest in “Bitcoin” searches stayed surprisingly low throughout Q2, even as $BTC hit new highs. Confidence among long-term holders also climbed. UTXO activity dropped, and the amount of BTC in long-term storage kept rising. A sign that serious capital isn’t looking to sell anytime soon. Stablecoins and DeFi Picked Up Steam If Q2 proved anything, it’s that stablecoins aren’t just stable, they’re also scaling. The Circle IPO popped 168% on day one, marking the first stablecoin issuer to go public and signaling TradFi’s growing appetite for crypto exposure without the volatility. According to 99Bitcoins, 81% of crypto-aware SMBs now want to use stablecoins for daily ops, and the number of Fortune 500s planning to integrate them has tripled since last year. On the DeFi side, Ethereum ($ETH) held L1 dominance, Chainlink ($LINK) led dev activity, and $HYPE – the native token of Hyperliquid – saw serious traction, fueled by the DEX’s rise to 70%+ of all perp DEX volume. While others chased memes, HYPE rallied on actual utility. In short: DeFi’s still cooking, and stablecoins are fueling the fire. Memecoin Mayhem After tanking in Q1, the memecoin market bounced back slightly in Q2, though volatility stayed extreme and price action remained erratic. Q2 saw the meme coins hit new heights, with over 5.9 million new tokens launched and most of them churned out via pump.fun. It was chaotic, noisy, and pure degen energy. While most faded instantly, tokens like $FARTCOIN and $SPX kept riding the wave. That said, the surge in token activity came with a dark side: phishing and wallet-targeted hacks climbed, especially among memecoin holders. Regulatory Wins and Macro Shifts Driving Confidence If Q2 had a theme, it was relief on both the policy and economic fronts. The U.S. pulled back on crypto enforcement, scrapped IRS reporting rules for DeFi, and signaled a more constructive stance overall. Meanwhile, the Fed held rates steady for the fourth straight time, hinting at a possible cut in July. With unemployment flat and growth slowing, capital started flowing into safe-haven assets, and this time, Bitcoin was firmly on that list. The result? Confidence surged. Bitcoin ETF inflows accelerated, volatility dropped, and $BTC’s macro narrative strengthened. It’s no longer just a risk asset; it’s becoming part of the defensive playbook. Elsewhere, $XRP finally closed its long-running legal battle with the SEC, potentially clearing the runway for a new ATH later this year. What’s Next for Q3? Back in Q2, 99Bitcoins forecasted that if BTC could flip $111K–$112K resistance, the path to $120K would open, with $135K as a stretch target. Fast forward to now, and that prediction is aging well: Bitcoin is already trading at above $118K, edging toward that psychological milestone. The report also noted $BTC was holding firm above $103K support, forming a bullish structure backed by rising miner wallet balances, shrinking exchange reserves, and growing illiquid supply – all signs of confidence from long-term holders. Still, Q3 isn’t without risk. ETF inflows could slow, and macro headwinds, from global conflict to sudden rate hikes, remain on the radar. But if institutional flows stay hot and the Fed delivers a rate cut, $135K no longer feels like a moonshot. It’s just part of the next leg up. Final Thoughts: A Bull Market With Depth The 99Bitcoins Q2 report by Manisha Mishra paints a clear picture: this bull market isn’t built on retail hype. Institutions, regulatory tailwinds, and real product traction are powering it. From ETF inflows to stablecoin adoption and supply-side tightening, the signals all point toward a more mature, resilient crypto cycle. And with Bitcoin already pushing towards $120K, many of the Q2 projections are already playing out. If momentum holds, and macro conditions don’t throw a curveball, Q4 could be the real breakout. Read the full report here: State of Crypto Q2 2025 – 99Bitcoins This article is for informational purposes only and does not constitute financial advice. Please always do your own research (DYOR) before investing in crypto."
    },
    {
      "title": "Bitcoin Dominance Falls: 9 Factors To Watch For That Says The Altcoin Season Has Begun",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-dominance-falls/",
      "summary": "Bitcoin’s price is holding firm despite growing chatter about the end of its market dominance. However, analysts are turning their attention not to Bitcoin’s price but to its waning market share as signs that altcoins may finally be ready to take center stage in what could become a full-blown altcoin season. A post on X has highlighted a specific breakdown structure in BTC dominance, which is linked to nine factors indicating that the altcoin season has begun. Technical Factors Showing Fall Of Bitcoin Dominance According to the analyst, Bitcoin dominance reached a peak of exactly 66% on June 27, 2025, a date he calls significant for its esoteric code 434 and its occurrence on a new moon. From a technical perspective, the 66% mark coincided precisely with the 0.786 Fibonacci retracement level, a region many traders consider a reversal zone. More importantly, several warning signals are flashing for Bitcoin traders. Related Reading: Altcoin Season Not Remotely Close, Bitcoin Dominance Still Too High: Market Expert Says The analyst&#8217;s post on the social media platform X features a few price charts to emphasize how the Bitcoin dominance might be fading, alongside nine factors. From a purely technical lens, the dominance chart looks increasingly exhausted. The first factor is the most recent highest monthly RSI in the history of the Bitcoin dominance chart. This event has created an overbought condition, and the next outlook is a possible crash of the RSI. The MACD, in fact, has already crossed into bearish territory. Furthermore, the histogram has turned negative, and the faster line has moved below the slower one, which is a classic signal of an impending downtrend. Another interesting factor is that Bitcoin dominance has now broken a key diagonal support line that held firm through much of 2024 and 2025, which is another possible structural breakdown. Fundamental Factors Show Strong Rotation Into Altcoin Pairs While the technical picture is deteriorating, the fundamentals are also stacking in favor of altcoins very quickly. The first fundamental factor is the importance of upcoming altcoin spot ETFs, which have the possibility to redirect institutional flows from Bitcoin into Ethereum, XRP, and others. Related Reading: Time To Forget Altcoin Season? Bitcoin Dominance At This Level Is This Only Hope ETFs such as the Spot XRP, Dogecoin, and Solana ETFs could rapidly increase inflows into the rest of the crypto market, similar to how Spot Bitcoin ETFs caused massive inflows into Bitcoin. The analyst also highlighted the likelihood of upcoming U.S. Federal Reserve rate cuts, which would tilt market conditions in favor of altcoins over Bitcoin. Momentum has also begun to shift in some trading pairs, particularly XRP/BTC and ETH/BTC, both of which are showing reversal signs from critical levels. The XRP/BTC chart displays repeated failed attempts to break above 0.0000215 BTC, a horizontal resistance that has now been tested five times on the daily candlestick timeframe chart. At the time of writing, the XRP/BTC pair has returned to this level yet again, and based on this pattern, any clean breakout here could confirm a decisive rotation into XRP. Likewise, Ethereum has begun to recover from long-term oversold conditions when measured against Bitcoin. The rounded bottom pattern forming on the ETH/BTC weekly chart shows a reversal from undervaluation, which in past cycles has caused substantial gains for Ethereum relative to BTC. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "The Last Time This Happened Cardano Rose 55%, ADA Analyst Makes Bold Prediction",
      "link": "https://www.newsbtc.com/news/cardano/the-last-time-this-happened-cardano-rose-55-ada-analyst-makes-bold-prediction/",
      "summary": "Cardano has been one of the best performing assets on low timeframes. The top cryptocurrency is hinting at further profits, as the Bitcoin price crosses a new all time high and the much awaited altcoin season approaches. Related Reading: Bitcoin Moving With Stocks, But Ethereum’s Correlation Is Fading At the time of writing, Cardano trades at $0.74 with a 18% profit over the past 24 hours. On higher timeframes, the cryptocurrency records a 28% profit followed by XRP’s 20% gains over the same period. ADA's price trends to the upside on the daily chart. Source: ADAUSD on Tradingview Analyst Says Cardano Will Replicate a Historical Bull Run Unlike Ethereum and XRP, the Cardano price has been more consistent with its past performance. In that sense, analyst Ali Martinez pointed to the formation of a bullish pattern for ADA that could propel the digital asset above the critical level around $1. The analyst claims that the $0.55 support for Cardano has been a key support on high timeframes. The last time the cryptocurrency dropped to this level in April this year, as seen on the chart below, ADA was able to rise to over 55% and touched the $0.85 mark. ‘It’s happening again’ said Martinez while pointing at the bullish momentum driving Cardano since it touched the bottom of this parallel channel. If the cryptocurrency can sustain this drive, it is likely to touch its May highs before meeting critical resistance. ADA price trends to the upside after touching a critical support level, aiming for $0.82. Source: Ali Martinez via X ADA Could Trend Even Higher, Bullish Price Targets A separate analyst also took note of the Cardano price action and the way it seems to be mirroring past patterns. The analyst claims that Cardano is entering a critical breakout zone. However, unlike Martinez, the analyst is more bullish and believes the ADA price might rally as much as 212% over the coming weeks. The analyst placed a bullish price target for the Cardano price at around $1.7. Related Reading: Bitcoin 30-Day Average Funding Rate Drops – Bullish Setup Takes Shape The analyst stated the following while sharing the chart below: $ADA is now testing the 50-week EMA. The last 2 times it crossed this line, it went up 212% and 128%. If history repeats, we will be looking at $1.77 $ADA. Are you ready for the pump? Cardano price to enter the $1 area over the next few weeks. Source: MinswapIntern via X In the long term, the analyst expects to see ADA hit $5 driven by its recent announcements, including a partnership with Tx Pipe to accelerate developer growth in Argentina that is set to benefit the Cardano ecosystem. On this partnership, Charles Hoskinson, CEO of IO, said: Their team represents the best of what Argentina’s developer community has to offer, and together we are building a foundation for long-term ecosystem growth. Our collaboration also fulfills the broader vision of making IO Buenos Aires a crypto hub. Cover image from ChatGPT, ADAUSD chart from Tradingview"
    },
    {
      "title": "Chainlink Uptrend Weakening As Signs Of Fatigue Emerge: Why $14.20 Is Important",
      "link": "https://www.newsbtc.com/news/chainlink/chainlink-uptrend-weakening/",
      "summary": "Sharing fresh insights on X, Crypto Analysis AI observed that Chainlink is maintaining its upward trajectory, but not without signs of fading strength, identifying $14.20 as a key level to watch. Holding above this level could preserve the bullish structure, while a breakdown might trigger a deeper pullback. Mixed Signals In Focus: Chainlink Short-Term Strength Vs. Medium-Term Caution According to Crypto Analysis AI, LINK/USDT is currently showing mixed signals, with a slight bullish bias in the short term but potential consolidation or pullback risks in the medium term. The 1H timeframe shows more buy signals, while the 4H timeframe indicates weakening momentum after a strong uptrend. Related Reading: Chainlink Consolidates Above Key Support – Bulls Eye $20 Range In the 1H timeframe, the following bullish signals are active: ADX (35.47, strong trend), EMA (EMA9 &#62; EMA20), KDJ (buy), ICHIMOKU (buy), and TRIX (buy). At the same time, several indicators are flashing bearish signals, including MACD (histogram negative), PSAR (sell), and Keltner Channels (sell). Some metrics remain neutral, with RSI at 57.60 (not overbought) and OBV showing neutral. For the 4H timeframe, bullish signals include ADX (34.17, strong trend), MACD (positive histogram), and Supertrend (buy). However, KDJ (sell), SMI (sell), and Schaff Trend Cycle (overbought) are signaling possible weakness. RSI at 66.94 (nearing overbought) and neutral OBV further support a cautious medium-term view, which increases the risk of a pullback. Key Observations from Crypto Analysis AI note that short-term momentum favors bulls. However, medium-term indicators suggest exhaustion, pointing to the 4H RSI reading. Fluctuations And Consolidation Signal Caution Crypto Analysis AI reports that the current trend for Chainlink remains an uptrend, but is slowing. Looking at recent price action, Crypto Analysis AI observed that on the 1H timeframe, LINK fluctuated between $14.25 and $14.48, closing at $14.34. Related Reading: Chainlink (LINK) On Standby: Bitcoin’s Next Move Holds The Key Meanwhile, on the 4H chart, there was a strong rally from $13.50 to $14.49, which is now consolidating near $14.30 and $14.40. The analyst also mentioned that volume is declining in the recent 1H candles, which suggests weakening momentum. Crypto Analysis AI identified the following key resistance levels: $14.48 (recent high) and $14.65 (upper Bollinger Band, 1H). In terms of key support, he pointed out $14.20 (recent swing low, 4H), followed by $13.90-$14.00 (psychological support, 4H EMA20) and $13.50 (strong support, previous breakout zone). Outlining potential bullish scenarios, Crypto Analysis AI explained that if LINK holds above $14.20, it could retest $14.48 and $14.65. In a bearish scenario, a break below $14.20 may lead to a deeper correction toward $13.90-$14.00. Meanwhile, for a neutral scenario, Chainlink may continue to consolidate between $14.20 and $14.48 before the next directional move. Finally, Crypto Analysis AI flagged several cautionary signals: 4H RSI near 67 could trigger profit-taking while the MACD histogram is declining despite higher highs. Furthermore, there is lower volume on recent up moves, suggesting weakening demand. Featured image from Shutterstock, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin MVRV Oscillator Predicts First Sell Pressure Level At $130,900 – Details",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-mvrv-oscillator-predicts-first-sell-pressure-level-at-130900-details/",
      "summary": "Bitcoin has officially broken through its previous all-time high of $112,000, surging to $118,000 just hours ago and entering uncharted territory for the first time since late May. The breakout confirms bullish momentum after weeks of consolidation and failed attempts, with price action now showing clear strength. With the psychological and technical barrier of $112K cleared, many analysts believe this move could mark the beginning of Bitcoin’s next expansive rally. Related Reading: Altcoins Jump Off Critical Support Level – Relief Or Reversal? Bulls are firmly in control, and on-chain metrics support this breakout narrative. According to fresh data from CryptoQuant, the MVRV (Market Value to Realized Value) Extreme Deviation Pricing Bands currently stand at 2.25. Historically, Bitcoin enters the overheated zone around 3.0 or higher, suggesting there is still room for growth before reaching excessive valuation territory. This metric, which measures the deviation between market price and realized value, helps identify when BTC is overbought or undervalued relative to past performance. At current levels, the data points to continued upside potential without major overheating concerns, fueling confidence that this breakout could extend further. Bitcoin Enters Expansion Phase As Market Eyes $130K After weeks of tight consolidation below the $110,000 mark, Bitcoin has finally broken out, signaling the start of a new market phase. The breakout above previous highs has reignited investor optimism, not only for BTC but also for the broader altcoin market, with many altcoins now pushing above key resistance levels for the first time in months. This move comes amid growing anticipation of a weakening US dollar and renewed inflationary pressures as Washington adopts looser fiscal policies. The market is increasingly pricing in the effects of tax cuts, high government spending, and dovish political rhetoric—all of which create a favorable environment for risk assets like Bitcoin. Still, the macro backdrop is not without risks. US Treasury yields remain elevated, flashing warnings of underlying systemic stress in credit markets. This tension underscores the fragility of the current rally and the importance of monitoring fundamental shifts. Top analyst Axel Adler shared insights using the MVRV oscillator, a model that compares Bitcoin’s market value to its realized value. According to Adler, historical data over the last four years suggests that when MVRV reaches 2.75, Bitcoin tends to face its first wave of meaningful selling pressure. If the same pattern holds true in this cycle, Bitcoin could reach approximately $130,900 before seeing notable profit-taking activity. While the current MVRV reading remains below that threshold, the model offers a clear signal of where long-term holders may begin offloading. Until then, the breakout sets the stage for a potential leg higher, with bulls now in control, pushing toward price discovery and a possible test of the $130K zone. Related Reading: Ethereum Back At Range Highs: Breakout Above $2,800 Could Ignite Altseason BTC Enters Uncharted Territory With Strong Momentum Bitcoin has officially broken into price discovery after blasting through its all-time high resistance near $112,000. The 3-day chart shows a massive bullish candle pushing BTC up to $118,683, representing an 8.94% gain in the last session. This breakout is the first clear sign of a strong bullish continuation after weeks of sideways consolidation below key resistance. The chart highlights a textbook breakout structure. BTC respected the $103,600 and $109,300 support zones multiple times throughout May and June before finally gaining enough momentum to pierce through the upper resistance. The recent surge came with a noticeable spike in volume, adding confidence to the breakout’s sustainability. Moving averages also confirm the bullish trend. The 50, 100, and 200 SMA lines remain aligned upward with increasing separation, suggesting that market structure remains strong and trend continuation is likely. Bitcoin is now trading well above all major moving averages, reinforcing the strength of the rally. Related Reading: Bitcoin 30-Day Average Funding Rate Drops – Bullish Setup Takes Shape With no historical resistance levels above, BTC enters a price discovery phase. The next psychological target for bulls will likely be $120,000, followed by the MVRV-based resistance level around $130,900. As long as BTC holds above $112K, the momentum remains decisively in favor of the bulls. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Hits New All Time High as IBIT Breaks ETF Records",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-as-ibit-breaks-etf-records",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-as-IBIT-Breaks-ETF-Records.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-as-ibit-breaks-etf-records\" rel=\"nofollow\"> </a></p> <p>IBIT sits at $83 billion and holds over 706,000 BTC, making it the 21st largest ETF in the US market.</p> <p>"
    },
    {
      "title": "Bitcoin Hits New All Time High of $113,900 as Adoption Accelerates",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-of-113000-as-Adoption-Accelerates.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates\" rel=\"nofollow\"> </a></p> <p>Bitcoin’s surge to $113,900 signals rising adoption, and Fed rate cut expectations.</p> <p>"
    },
    {
      "title": "Rumble Partners with MoonPay to Launch Bitcoin Wallet for Creators",
      "link": "https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Rumble-Partners-with-MoonPay-to-Launch-Bitcoin-Wallet-for-Creators-Today.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators\" rel=\"nofollow\"> </a></p> <p>Today, Rumble announced an exclusive partnership with MoonPay to launch a Bitcoin and crypto wallet that will let creators handle their earnings outside traditional banking systems.&#160; The new Rumble Wallet, set to arrive in Q3 2025, will use MoonPay&#8217;s infrastructure to power all digital currency transactions on the platform. Users will be able to buy, [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Technology Increases Bitcoin Holdings to $101 Million",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million\" rel=\"nofollow\"> </a></p> <p>KULR now holds 1,021 BTC, reporting a 291% BTC yield year to date.</p> <p>"
    },
    {
      "title": "K Wave Media Raises $1 Billion For Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/K-Wave-Media-Raises-1-Billion-For-Bitcoin-Treasury-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>K Wave Media Inc. has announced a $500 million convertible note agreement with Anson Funds to support its Bitcoin treasury strategy. This financing follows an earlier $500 million standby equity purchase agreement with Bitcoin Strategic Reserve, bringing the company’s total capital capacity to $1 billion. As part of the Anson agreement, K Wave will issue [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Dogecoin Barks Up Huge Gains as Meme Coin Traders Await Pump.fun Token Sale",
      "link": "https://decrypt.co/329754/dogecoin-barks-meme-coin-traders-await-pump-fun-sale",
      "summary": "Meme coins, led by Dogecoin, are jumping higher Friday as Bitcoin hits new highs—and the Pump.fun Solana token sale is only hours away."
    },
    {
      "title": "BTC & ETH SOAR, S&P HITS ATH, MOG LEADS MEMES",
      "link": "https://decrypt.co/videos/interviews/F3YFwCDO/btc-eth-soar-sp-hits-ath-mog-leads-memes",
      "summary": "BTC hits ATH, ETH breaks $3k on huge ETF inflows. One of biggest BTC short liquidation event in years. China may be reassessing crypto stance. IBIT hits record $76b AUM. Trump talks up impact of tariffs in crypto, stocks rally. US treasury removes crypto broker reporting rules. K Wave Media raises $1b to buy BTC. Companies bought $17.7b BTC in Q2. BIT Mining to raise $300m to buy SOL. ETH Foundation sells $3.5m ETH. Sharplink up 35% in 5 days as ETH treasury play. GameSquare buys $5m ETH. Coinbase, Perplexity collab on real time data. Robinhood launches ETH, SOL staking in the US. Rate on OKX USDT ‘Simple Earn’ jumps to 53%. Germany’s NRW issues blockchain bond. PlasmaFDN X account hacked"
    },
    {
      "title": "Will Pump.fun's Solana Token Pump After Launch? Experts Weigh In",
      "link": "https://decrypt.co/329699/pump-fun-solana-token-pump",
      "summary": "At its earliest, Pump.fun's token will become tradable on Monday and traders are starting to question whether it'll pump or dump."
    },
    {
      "title": "Bitcoin ETFs Post Second-Biggest Day Ever: Why It Matters",
      "link": "https://decrypt.co/329677/bitcoin-etfs-post-second-biggest-day-ever-why-it-matters",
      "summary": "BlackRock’s IBIT led Thursday’s ETF inflows with $448.5 million, as capital consolidated into top issuers despite outflows from GBTC."
    },
    {
      "title": "Bitcoin Price Reaches Pivotal Moment—Is $120K Next?",
      "link": "https://decrypt.co/329674/bitcoin-price-reaches-pivotal-moment-is-120k-next",
      "summary": "Bitcoin hit a new all-time high above $118,000 as institutions drove the rally—while analysts predicted a $120K target by month-end."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Grayscale challenges SEC stay on approval of BTC, ETH, XRP, ADA large-cap fund",
      "link": "https://cryptobriefing.com/sec-grayscale-approval-large-cap-fund/",
      "summary": "<p>Grayscale's challenge to the SEC's stay highlights ongoing regulatory tensions, potentially impacting future crypto fund approvals and market dynamics.</p> <p>"
    },
    {
      "title": "Bitcoin creator Satoshi Nakamoto may now be richer than Dell CEO Michael Dell",
      "link": "https://cryptobriefing.com/satoshi-nakamoto-wealth-bitcoin/",
      "summary": "<p>Satoshi Nakamoto's rising wealth underscores Bitcoin's potential to disrupt traditional wealth hierarchies and influence global financial systems.</p> <p>"
    },
    {
      "title": "REX Shares files for 2X leveraged TRON ETF",
      "link": "https://cryptobriefing.com/2x-tron-etf-launch/",
      "summary": "<p>The filing highlights the increasing diversification in crypto investment products, potentially broadening market participation and innovation.</p> <p>"
    },
    {
      "title": "Pump.fun acquires Kolscan ahead of PUMP token launch",
      "link": "https://cryptobriefing.com/pump-fun-acquires-kolscan-onchain-wallet-tracking/",
      "summary": "<p>Pump.fun acquires wallet tracker Kolscan to boost social trading tools ahead of its PUMP token ICO on July 12.</p> <p>"
    },
    {
      "title": "Why is Bitcoin going up today? Rising US demand, strong ETF inflows, and steady corporate accumulation",
      "link": "https://cryptobriefing.com/bitcoin-price-surge-etf-corporate/",
      "summary": "<p>Bitcoin's sustained growth signals its maturation as a stable asset, attracting institutional interest amid economic and geopolitical uncertainties.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin – How $1.18B in ETF inflows could push BTC’s price higher",
      "link": "https://ambcrypto.com/bitcoin-how-1-18b-in-etf-inflows-could-push-btcs-price-higher/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Benjamin-2025-07-11T135431.102.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Selling pressure from miners increased slightly as BTC hit a new ATH."
    },
    {
      "title": "Hyperliquid breaks ATH at $46.32 – Can HYPE sustain its run?",
      "link": "https://ambcrypto.com/hyperliquid-breaks-ath-at-46-32-can-hype-sustain-its-run/",
      "summary": "<img alt=\"HYPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-3.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Hyperliquid whales and Assistance Fund continue accumulation despite price trading at the peak."
    },
    {
      "title": "Top 12 Telegram games of July 2025",
      "link": "https://ambcrypto.com/top-12-telegram-games-of-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/andrey-metelev-DEuansgqjns-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Telegram has become much more than just a messaging platform, and its importance in the [&#8230;]"
    },
    {
      "title": "Top 11 casinos to watch out for in July 2025",
      "link": "https://ambcrypto.com/top-11-casinos-to-watch-out-for-in-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1440\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/chris-liverani-MJX7-BAdkt0-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Crypto casinos are online gambling platforms similar to traditional casinos, offering players live dealer games, [&#8230;]"
    },
    {
      "title": "Top 11 staking platforms of July 2025",
      "link": "https://ambcrypto.com/top-11-staking-platforms-of-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/markus-spiske-vrbZVyX2k4I-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Staking is the system of earning rewards and interest by the process of holding or [&#8230;]"
    }
  ]
}