{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Analysts Say BTC’s Long-Term Focus Is Easing War Jitters",
      "link": "https://www.coindesk.com/markets/2025/06/24/asia-morning-briefing-analysts-say-btcs-long-term-focus-is-easing-war-jitters",
      "summary": ""
    },
    {
      "title": "Hut 8 Doubles Bitcoin-Backed Loan With Coinbase to $130M, Locks in Lower Rate",
      "link": "https://www.coindesk.com/markets/2025/06/24/hut-8-doubles-bitcoin-backed-loan-with-coinbase-to-130m-locks-in-lower-rate",
      "summary": ""
    },
    {
      "title": "BCH Stumbles at $467 After Triple Rejection, Ends Slightly Down Despite High-Volume Rebound",
      "link": "https://www.coindesk.com/markets/2025/06/24/bch-stumbles-at-usd467-after-triple-rejection-ends-slightly-down-despite-high-volume-rebound",
      "summary": ""
    },
    {
      "title": "ZKsync’s Airbender zkVM Proves Ethereum Blocks in 35 Seconds",
      "link": "https://www.coindesk.com/tech/2025/06/24/zksyncs-airbender-zkvm-proves-ethereum-blocks-in-35-seconds",
      "summary": ""
    },
    {
      "title": "Chainlink's LINK Surges 13% as Mastercard Partnership Fuels Rally Amid Crypto Recovery",
      "link": "https://www.coindesk.com/markets/2025/06/24/chainlinks-link-surges-13-as-mastercard-partnership-fuels-rally-amid-crypto-recovery",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Polymarket set for $200M raise at $1B valuation: Reports",
      "link": "https://cointelegraph.com/news/polymarket-set-for-200m-raise-1b-valuation-reports?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E0ZTctNmU1Zi03MGFmLWEzYTktZjk5Mzg4ZmQzYWYx.jpg\" /></p><p>Betting platform Polymarket is reportedly set to be valued at $1 billion in a $200 million raise led by Peter Thiel’s Founders Fund.</p>"
    },
    {
      "title": "US crypto stocks surge amid fragile Iran-Israel ceasefire",
      "link": "https://cointelegraph.com/news/us-crypto-stocks-surge-donald-trump-iran-israel-ceasefire?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E0YmItMDhmNS03ZmE2LWI1YWYtNGY1OTA2MGQ4NmVm.jpg\" /></p><p>US crypto stocks surged on Tuesday amid a shaky Donald Trump-brokered ceasefire agreement between Iran and Israel.</p>"
    },
    {
      "title": "Coinbase claims ‘key role’ in Secret Service’s biggest-ever crypto seizure",
      "link": "https://cointelegraph.com/news/coinbase-key-role-secret-service-crypto-seizure?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5Mzc2MTYtNTdjYi03MjMyLWFkNTEtZGQ2MWQ1NWNmYzcy.jpg\" /></p><p>Coinbase says it helped the US Secret Service seize $225 million in crypto allegedly stolen by scammers, the largest crypto seizure in the agency’s history.</p>"
    },
    {
      "title": "Many senators absent from ‘bipartisan’ crypto market structure hearing",
      "link": "https://cointelegraph.com/news/bipartisan-crypto-market-structure-hearing-absence?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2I2M2EtMDY2My03NDQwLWJjNmYtYTBiNjczNjAzZjhh.jpg\" /></p><p>Only five US senators out of the 11 typically on the digital assets subcommittee were available to ask questions about a potential market structure bill.</p>"
    },
    {
      "title": "FalconX joins Crypto.com as partner for Lynq institutional settlement network",
      "link": "https://cointelegraph.com/news/falconx-joins-crypto-com-others-partners-lynq-institutional-settlement-network?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2EzYzMtM2FkZS03NTM4LWIyZGItNjcyZWM3ZTRmMzA0.jpg\" /></p><p>Rising institutional interest in crypto may include the settlement sector, especially stablecoins, which have seen a 55.5% growth in market cap in one year.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US academic institutions urge SEC to implement stringent crypto staking rules, oversight",
      "link": "https://cryptoslate.com/us-academic-institutions-urge-sec-to-implement-stringent-crypto-staking-rules-oversight/",
      "summary": "<p>Representatives from multiple universities met with the US Securities and Exchange Commission’s (SEC) Crypto Task Force on June 23 to discuss a staking rulebook. The meeting included representatives from the University of California, Berkeley School of Law, Georgetown University Law Center, the University of Chicago Law School, and venture firm Placeholder. According to the logs, [&#8230;]</p> <p>"
    },
    {
      "title": "Senate Banking Committee pushes for rapid legislative action on crypto market framework",
      "link": "https://cryptoslate.com/senate-banking-committee-pushes-for-rapid-legislative-action-on-crypto-market-framework/",
      "summary": "<p>The Senate Banking Committee released a seven-point framework for digital asset market structure and heard testimony urging Congress to translate those principles into statute without delay on June 23. Committee Chair Tim Scott and Senators Cynthia Lummis, Thom Tillis, and Bill Hagerty set out a plan that draws a statutory line between digital asset securities [&#8230;]</p> <p>"
    },
    {
      "title": "WazirX gains crucial extension to revive post-hack restructuring plan",
      "link": "https://cryptoslate.com/wazirx-gains-crucial-extension-to-revive-post-hack-restructuring-plan/",
      "summary": "<p>WazirX, once India’s largest crypto exchange by trading volume, has secured a crucial extension from Singapore’s High Court as it struggles to recover from a devastating $234 million hack and a year of growing user frustration. In a statement posted on social media, WazirX confirmed that the court will allow it to present new arguments [&#8230;]</p> <p>"
    },
    {
      "title": "Spot Ethereum ETFs record $1B inflows in 15 trading days, hitting $4B for the first time",
      "link": "https://cryptoslate.com/spot-ethereum-etfs-record-1b-inflows-in-15-trading-days-hitting-4b-for-the-first-time/",
      "summary": "<p>Spot Ethereum (ETH) exchange-traded funds (ETFs) listed in the US crossed $4 billion in cumulative net inflows on June 23, only eleven months after their market debut. The products launched on July 23, 2024, and required 216 US trading sessions to accumulate their first $3 billion by May 30. Following the $3 billion mark, spot [&#8230;]</p> <p>"
    },
    {
      "title": "Grayscale launches Space and Time Trust to capture surging interest in data infrastructure",
      "link": "https://cryptoslate.com/grayscale-launches-space-and-time-trust-to-capture-surging-interest-in-data-infrastructure/",
      "summary": "<p>Grayscale has unveiled a new single-asset investment vehicle centered on the Space and Time (SXT) token, according to a June 24 announcement. The fund, officially named the Space and Time Trust, offers accredited investors direct exposure to one of the crypto sector’s newest data infrastructure projects. Individual and institutional participants can subscribe to the Trust [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Price Targets Upside Break — Will Momentum Carry It Past the Hurdles?",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-targets-upside-2500/",
      "summary": "Ethereum price started a fresh increase above the $2,220 zone. ETH is now showing positive signs and might aim for a move above the $2,550 zone. Ethereum started a fresh upward move above the $2,220 level. The price is trading above $2,320 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support at $2,390 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it settles above the $2,500 resistance zone in the near term. Ethereum Price Eyes More Gains Ethereum price started a fresh increase above the $2,200 support level, like Bitcoin. ETH price was able to clear the $2,220 and $2,250 resistance levels to move into a positive zone. The bulls even pushed the price above the 61.8% Fib retracement level of the downward wave from the $2,568 swing high to the $2,115 low. However, they are now facing hurdles near the $2,480 and $2,500 levels. Ethereum price is now trading above $2,320 and the 100-hourly Simple Moving Average. The price is now just above the 76.4% Fib retracement level of the downward wave from the $2,568 swing high to the $2,115 low. On the upside, the price could face resistance near the $2,500 level. The next key resistance is near the $2,550 level. The first major resistance is near the $2,565 level. A clear move above the $2,565 resistance might send the price toward the $2,650 resistance. An upside break above the $2,650 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,720 resistance zone or even $2,800 in the near term. Another Decline In ETH? If Ethereum fails to clear the $2,500 resistance, it could start a fresh decline. Initial support on the downside is near the $2,390 level and the trend line. The first major support sits near the $2,350 zone. A clear move below the $2,350 support might push the price toward the $2,320 support. Any more losses might send the price toward the $2,250 support level in the near term. The next key support sits at $2,150. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,350 Major Resistance Level – $2,500"
    },
    {
      "title": "Bitcoin Poised For Rally As Geopolitical Tensions Ease And Inflation Expectations Fall",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-poised-for-rally-as-geopolitical-tensions-ease-and-inflation-expectations-fall/",
      "summary": "Leading crypto exchange Binance witnessed a significant outflow of Bitcoin (BTC) and Ethereum (ETH) on June 23, with investors pulling out over 4,000 BTC and 61,000 ETH in a single day. This shift comes amid easing geopolitical tensions and declining inflation, fuelling speculation about a renewed rally. Bitcoin Likely To Rally As Global Tensions Simmer According to a recent CryptoQuant Quicktake post by contributor Amr Taha, Bitcoin is likely to resume its upward trajectory, bolstered by a series of recent macroeconomic and geopolitical developments. The analyst highlighted multiple positive signals that could propel the top digital asset closer to its all-time high (ATH). Related Reading: Bitcoin Yearly Trend Suggests Cycle Top Near $205,000 By Year-End, Analyst Says One of the key developments was an announcement by US President Donald Trump, who stated that a ceasefire agreement had been reached between Israel and Iran. This deal removes the immediate threat of Iran closing the Strait of Hormuz, a vital chokepoint for global oil supply. The ceasefire had an immediate and positive effect on global equity markets, with the S&#38;P 500 index surpassing 6,000 for the first time since February 2025. This recovery signals growing investor confidence as geopolitical risks subside. In addition, crude oil prices dropped by 14%, adding to the disinflationary narrative. Lower energy costs help reduce production and transportation expenses, thereby supporting a broader decline in inflationary pressures. Taha concluded: The convergence of significant crypto outflows from Binance, falling oil prices, a bullish breakout in US equities, and the reduction of Middle Eastern tensions presents a striking scenario. With the geopolitical overhang removed, inflation easing, and macro markets stabilizing, Bitcoin is now well-positioned to resume its upward trajectory. Meanwhile, Bitcoin whales &#8211; wallets holding large amounts of BTC &#8211; appear to be quietly accumulating in anticipation of a breakout. In another CryptoQuant post, contributor Mignolet noted that whale accumulation has been rising steadily since BTC bottomed in April. Mignolet pointed out that whale activity typically increases during periods of low market attention or heightened fear, often foreshadowing bullish reversals. Historical data supports this trend, showing that increased accumulation often precedes significant price surges. Bullish Quarter For BTC In an X post published today, seasoned crypto analyst Titan of Crypto stated that BTC is set to close a bullish monthly candle, reinforcing the long-term uptrend for the flagship cryptocurrency. Several other on-chain and technical indicators also suggest further upside potential. For example, Bitcoin Binary CDD shows that long-term holders are continuing to hold rather than sell, indicating strong conviction in BTC’s long-term value. Related Reading: Bitcoin Forming Inverse Head And Shoulders Pattern – Is $150,000 The Next Target? At the same time, the number of short positions is climbing as BTC consolidates between $100,000 and $110,000. This dynamic raises the probability of a short squeeze, potentially propelling Bitcoin to a new ATH. At press time, BTC trades at $105,408, up 5.2% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant, X, and TradingView.com"
    },
    {
      "title": "Bitcoin Price Pushes Up — ATH in Sight if Bulls Maintain Pressure",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-pushes-up-106500/",
      "summary": "Bitcoin price started a fresh increase above the $103,250 zone. BTC is now consolidating and might aim for a move above the $106,500 resistance. Bitcoin started a fresh increase above the $105,000 zone. The price is trading above $103,500 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $106,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $104,200 zone. Bitcoin Price Eyes More Gains Bitcoin price started a fresh increase above the $102,500 zone. BTC gained pace and was able to climb above the $103,200 and $103,500 levels to enter a positive zone. The bulls pushed the price above the 76.4% Fib retracement level of the downward move from the $106,470 swing high to the $98,276 low. It opened the doors for a push above the $106,000 resistance and the price tested the $106,500 zone. Bitcoin is now trading above $105,000 and the 100 hourly Simple moving average. There is also a bullish trend line forming with support at $106,000 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $106,500 level. The first key resistance is near the $107,200 level. The next key resistance could be $108,500 or the 1.236 Fib extension level of the downward move from the $106,470 swing high to the $98,276 low. A close above the $108,500 resistance might send the price further higher. In the stated case, the price could rise and test the $110,000 resistance level. Any more gains might send the price toward the $112,000 level. Another Drop In BTC? If Bitcoin fails to rise above the $106,500 resistance zone, it could start another decline. Immediate support is near the $106,000 level. The first major support is near the $105,500 level. The next support is now near the $104,200 zone. Any more losses might send the price toward the $103,500 support in the near term. The main support sits at $102,000, below which BTC might struggle to find bids. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $106,000, followed by $105,500. Major Resistance Levels – $106,500 and $108,500."
    },
    {
      "title": "Bitcoin Exchange Activity Declines as Accumulation Patterns Persist",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-exchange-activity-declines-as-accumulation-patterns-persist/",
      "summary": "Following a weekend dip, Bitcoin has reclaimed the $100,000 price mark, signaling renewed short-term strength amid geopolitical tensions. As of the time of writing, BTC is trading at $105,323, up by 4% in the last 24 hours. The price recovery arrives in broader investor sentiment shifts, both in on-chain behavior and exchange activity. A recent analysis from CryptoQuant’s analyst Darkfost sheds light on a multi-year transition among Bitcoin holders. The analyst observes that fewer Bitcoin addresses are depositing coins onto exchanges, a trend that has persisted since the end of the 2021 market cycle. This declining activity may not necessarily suggest fading interest in BTC, but rather a transformation in how investors interact with the asset, potentially hinting at longer-term strategies becoming the norm. Related Reading: Bitcoin’s Drop Below $100k Sparks Bearish Chatter, But Data Says Something Else Decline in Exchange Deposits Suggests Structural Market Shift According to Darkfost, between 2015 and 2021, the number of Bitcoin addresses depositing funds to exchanges steadily increased, peaking at an annual average of around 180,000. However, this upward trend has reversed sharply in the years since. The 10-year moving average now hovers around 90,000, while the 30-day average has fallen to 48,000. Most recently, the daily figure dropped to just 37,000. Darkfost mentioned: This reflects a significant behavioral change among BTC investors, which can likely be attributed to several key factors : &#8211; One major factor is the arrival of ETFs, which allow exposure to Bitcoin&#8217;s price performance without the complexity or risk of directly managing the asset. Additionally, the current market cycle has seen relatively low retail participation, which historically contributed to exchange deposits. More notably, an increasing number of investors, ranging from individuals to institutions, are treating Bitcoin as a long-term store of value or treasury reserve asset rather than a short-term speculative vehicle. The CryptoQuant analyst added: These shifts, which have emerged gradually over time, are precisely what drive Bitcoin&#8217;s evolving identity in financial markets. It may well be this transformation that ultimately solidifies BTC’s role as a store of value. Bitcoin Whale Accumulation Patterns Emerge Amid Lower Volume In a separate analysis, another CryptoQuant analyst, Mignolet, focused on activity by large holders on the Bybit exchange. He highlighted that as general market interest and trading volume diminish, the trading patterns of whales become more visible. Mignolet noted that previous periods of reduced sentiment and low volume often saw significant whale accumulation, which historically preceded upward price movements. Related Reading: Bitcoin Repeats Its 2021 Pattern—Analyst Warns Final Crash Still Ahead This pattern, according to Mignolet, appears to be repeating. Since Bitcoin&#8217;s local bottom in April, consistent accumulation by large entities has been observed on Bybit. He suggested this could be a signal of underlying market confidence, particularly when retail activity is minimal. While not a guaranteed forecast, historical parallels imply that such behavior may again precede broader price strength, lending weight to ongoing consolidation as a potential setup for future momentum. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bunker Buster: Ethereum Titans Stake $100 Million Amid US-Iran Hostilities",
      "link": "https://www.newsbtc.com/altcoin/bunker-buster-ethereum-whales-stake-100-million-amid-us-iran-hostilities/",
      "summary": "Ethereum&#8217;s price roller-coaster has drawn a dramatic wager from big players. While many smaller traders are bracing for more losses, a handful of massive accounts have broken the surface and put millions in a massive show of force. Related Reading: Bitcoin Paces $15 Billion YTD Influx Amid 10-Week Fund Flow Streak Ethereum Whale Bets Surface According to on-chain data, one whale opened a long position worth $101 million at an entry price of $2,247, using 25x leverage. That bet paid off with roughly $950,000 in profit, but it also cost $2.5 million in fees. These numbers show just how high the stakes have become. High Fees Cut Into Gains This whale further withdrew 18,000 $ETH worth $40.38M from #Binance. Now, the whale holds 50,256 $ETH worth $112.62M, currently down $2.24M Address: 0x3952d69643f7a87237c7fc8bb33f8453c0b45500 https://t.co/49vC0iqMZP pic.twitter.com/rF5cX2gsXZ — Onchain Lens (@OnchainLens) June 23, 2025 Based on reports from On-Chain Lens, another whale moved over $40 million in Ether from Binance before opening its own leveraged trade. Combine the two wallets and you’ve got about $112 million riding on an ETH bounce. Yet those $2.5 million in fees highlight the hidden cost of big bets. Middle East Tension Hits Prices ETH slipped to about $2,113 on Sunday, marking its lowest level in 30 days. That drop came after US military strikes on Iran’s nuclear sites. United States President Donald Trump called the operation a “spectacular success” and warned of more action if Iran didn’t back down. Traders say the fallout from those strikes rattled global markets and fed crypto volatility. Retail Traders Watch Closely Retail traders tend to sell when prices drop. But these whales have the scope to weather downswings. Their large purchases indicate that they find value at current levels. Short traders might not agree, however. They&#8217;re sitting in many short positions, expecting ETH to decline further before it will rise. What The Whales See Experts say large holders tend to have lower break-even points. They can afford to wait months or years for a payoff. Some also use complex strategies across multiple markets. That makes their moves hard to read from the outside. Still, when you see $112 million on the line, it’s a hint that smart money senses a buying window. Related Reading: Bitcoin Paces $15 Billion YTD Influx Amid 10-Week Fund Flow Streak Risks On Both Sides Leveraged trades amplify gains and losses equally. A 5% drop would trigger a forced sell-off on a 25x position. That could feed a sharp decline in ETH’s price. On the other hand, if the market turns up, those whales could pocket big returns well beyond what retail traders see. Investors will be watching every market swing. If geopolitical tensions cool and big money stays bullish, ETH could find footing above $2,200. But another shock—political or technical—might send the price tumbling again. Featured image from Imagen, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Panelists at Senate Banking Hearing on Crypto Market Structure Call for Regulation ASAP",
      "link": "https://bitcoinmagazine.com/news/panelists-at-senate-banking-hearing-on-crypto-market-structure-call-for-regulation-asap",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/US-Senate-Hearing-on-Crypto-Market-Structure.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/panelists-at-senate-banking-hearing-on-crypto-market-structure-call-for-regulation-asap\" rel=\"nofollow\"> </a></p> <p>Members of the crypto industry and digital asset specialists argue that if the U.S. doesn’t pass legislation on digital asset market structure soon, it might cede authority to legal regimes from other countries.</p> <p>"
    },
    {
      "title": "Lightning Labs Releases Taproot Assets v0.6 With Updates to Stablecoin Support On Bitcoin",
      "link": "https://bitcoinmagazine.com/news/lightning-labs-releases-taproot-assets-v0-6-with-updates-to-stablecoin-support-on-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Lightning-Labs-Releases-Taproot-Assets-v0.6-With-Updates-to-Stablecoin-Support-On-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lightning-labs-releases-taproot-assets-v0-6-with-updates-to-stablecoin-support-on-bitcoin\" rel=\"nofollow\"> </a></p> <p>The update adds grouped asset identifiers, improves Lightning Network payment flows, and expands support for stablecoin transactions on Bitcoin.</p> <p>"
    },
    {
      "title": "Republican Senators Scott, Lummis, Tillis, Hagerty Push For Digital Asset Market Structure Rules",
      "link": "https://bitcoinmagazine.com/news/republican-senators-scott-lummis-tillis-hagerty-push-for-digital-asset-market-structure-rules",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Republican-Senators-Scott-Lummis-Tillis-Hagerty-Push-For-Digital-Asset-Market-Structure-Rules.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/republican-senators-scott-lummis-tillis-hagerty-push-for-digital-asset-market-structure-rules\" rel=\"nofollow\"> </a></p> <p>Republican senators have released principles to guide digital asset market structure legislation, marking a significant step toward regulatory clarity that could benefit Bitcoin and the broader crypto industry. Senate Banking Chairman Tim Scott (R-SC), along with Senators Cynthia Lummis (R-WY), Thom Tillis (R-NC), and Bill Hagerty (R-TN), announced the framework balancing innovation with consumer protection.&#160; [&#8230;]</p> <p>"
    },
    {
      "title": "Anthony Pompliano’s ProCap BTC Buys $386M in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/anthony-pomplianos-procap-btc-buys-386m-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Anthony-Pomplianos-ProCap-BTC-Buys-386M-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pomplianos-procap-btc-buys-386m-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>ProCap BTC acquires 3,724 bitcoin as part of a strategy to build a $1 billion Bitcoin treasury.</p> <p>"
    },
    {
      "title": "The Smarter Web Company Expands Bitcoin Holdings With £15.2M Purchase",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-expands-bitcoin-holdings-with-15-2m-purchase",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Smarter-Web-Comp._imresizer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-expands-bitcoin-holdings-with-15-2m-purchase\" rel=\"nofollow\"> </a></p> <p>The Smarter Web Company, a web design, development, and online marketing services provider, has announced another Bitcoin purchase, acquiring 196.90 Bitcoin for £15,185,259 as part of its &#8220;10 Year Plan&#8221; treasury strategy. The London listed technology company paid an average price of £77,122 per Bitcoin ($103,290 per Bitcoin) for the acquisition.&#160; This purchase brings The [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Senate Banking Committee Sets Out Plan For Crypto Market Rules",
      "link": "https://decrypt.co/326866/senate-banking-committee-plan-crypto-market-rules",
      "summary": "The principles aim to define digital asset oversight as debates over Trump-linked crypto profits and federal legislation intensify."
    },
    {
      "title": "Bernie Sanders Blasts AI Firms Over Jobs Displacement: ‘They Couldn’t Care Less’",
      "link": "https://decrypt.co/326863/bernie-sanders-blasts-ai-firms-job-displacement",
      "summary": "Vermont Senator Bernie Sanders warned that AI will uproot workers unless reforms shift power from CEOs to the American people."
    },
    {
      "title": "NYSE Files for Rule Change to List Trump Bitcoin Ethereum ETF",
      "link": "https://decrypt.co/326858/nyse-files-rule-change-list-trump-bitcoin-ethereum-etf",
      "summary": "NYSE applied for a rule change enabling the listing of a BTC-ETH ETF proposed by President Donald Trump’s media and tech company."
    },
    {
      "title": "Norwegian Mineral Mining Firm Eyes $1.2 Billion Raise for Bitcoin Treasury",
      "link": "https://decrypt.co/326856/norwegian-mineral-mining-firm-1-2-billion-raise-bitcoin-treasury",
      "summary": "Green Minerals has adopted the Bitcoin treasury strategy as a step towards broader blockchain implementation."
    },
    {
      "title": "Ozempic's Newest Miracle: Dramatically Cutting Dementia Risk",
      "link": "https://decrypt.co/326841/ozempics-newest-miracle-dramatically-cutting-dementia-risk",
      "summary": "New research tracking 1.7 million diabetics shows the weight-loss drug slashes dementia risk by up to 70%."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Metaplanet raises $517M in a single day to buy more Bitcoin",
      "link": "https://cryptobriefing.com/metaplanet-bitcoin-investment-strategy/",
      "summary": "<p>Metaplanet's massive Bitcoin investment could accelerate global corporate adoption, influencing market dynamics and digital asset strategies.</p> <p>"
    },
    {
      "title": "Majority Whip Tom Emmer says House will vote on GENIUS stablecoin bill if paired with CLARITY Act",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house-vote/",
      "summary": "<p>The potential passage of these bills could significantly shape the regulatory landscape for digital assets, impacting innovation and market dynamics.</p> <p>"
    },
    {
      "title": "CME XRP futures hit $542 million volume in first month, strengthening case for spot XRP ETFs",
      "link": "https://cryptobriefing.com/cme-xrp-futures-global-demand/",
      "summary": "<p>The surge in XRP futures trading volume bolsters the likelihood of SEC approval for spot XRP ETFs, potentially transforming crypto investment.</p> <p>"
    },
    {
      "title": "Mastercard and Chainlink team up to enable nearly 3 billion cardholders to buy crypto on-chain",
      "link": "https://cryptobriefing.com/mastercard-chainlink-partnership-crypto/",
      "summary": "<p>This collaboration could significantly accelerate mainstream crypto adoption, bridging traditional finance with decentralized finance seamlessly.</p> <p>"
    },
    {
      "title": "Aptos Labs and Jump Crypto launch Shelby, a decentralized hot-storage protocol built for speed",
      "link": "https://cryptobriefing.com/decentralized-hot-storage-shelby-launch/",
      "summary": "<p>Shelby could revolutionize web3 by enabling real-time applications, enhancing data control, and bridging speed-centralization gaps.</p> <p>"
    }
  ],
  "AMBcrypto": []
}