{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: GENIUS Act Positions ETH at the Center of Tokenized Finance, Says Wall Street Veteran",
      "link": "https://www.coindesk.com/markets/2025/06/17/asia-morning-briefing-genius-act-positions-eth-at-the-center-of-tokenized-finance-says-wall-street-veteran",
      "summary": ""
    },
    {
      "title": "Tron Inc. Deal Gives Justin Sun’s Father Control of Public Firm Via $100M Token Deal",
      "link": "https://www.coindesk.com/markets/2025/06/17/tron-inc-deal-gives-justin-suns-father-control-of-public-firm-via-100m-token-deal",
      "summary": ""
    },
    {
      "title": "U.S. Senate Passes GENIUS Act to Regulate Stablecoins, Marking Crypto Industry Win",
      "link": "https://www.coindesk.com/policy/2025/06/17/u-s-senate-passes-genius-act-to-regulate-stablecoins-marking-crypto-industry-win",
      "summary": ""
    },
    {
      "title": "JPMorgan Introduces USD Deposit Token on Coinbase’s Base Blockchain",
      "link": "https://www.coindesk.com/business/2025/06/17/jpmorgan-introduces-usd-deposit-token-on-coinbase-s-base-blockchain",
      "summary": ""
    },
    {
      "title": "Coinbase Seeks SEC Approval to Offer Tokenized Stock Trading",
      "link": "https://www.coindesk.com/business/2025/06/17/coinbase-seeks-sec-approval-to-offer-tokenized-stock-trading",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin downside risk lingers, upside hinges on holding above $102K",
      "link": "https://cointelegraph.com/news/bitcoin-price-downside-risks-102k-level-vital-crypto-analysts-forecast?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MmZmYTYtOWZiMC03ZWI1LTgzYWItMDcxNzk3ZDc4OWE1.jpg\" /></p><p>Bitfinex analysts say Bitcoin’s current market conditions signal the asset “reversing course shortly after aggressive selling.”</p>"
    },
    {
      "title": "Meta Pool hit with $27M exploit, but attacker flees with only $132K",
      "link": "https://cointelegraph.com/news/meta-pool-exploiter-flees-132k-in-27-million-hack?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgwMzAtNDQ4Ni03ZjlhLTg3MDQtNzVlNWJlODNhOTlm.jpg\" /></p><p>Meta Pool says an early detection system discovered the exploit, allowing it to pause the affected smart contract and prevent further losses.</p>"
    },
    {
      "title": "How to legally stake crypto in 2025: What is now allowed after the SEC’s latest move",
      "link": "https://cointelegraph.com/news/how-to-legally-stake-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY5ZjQtODVhYi03MmU0LThlZDEtN2M4MTU3YWMzNzRj.jpg\" /></p><p>The SEC’s 2025 guideline clarifies the regulatory stance regarding crypto staking. It states what is and isn’t allowed and how you can stake lawfully.</p>"
    },
    {
      "title": "JPMorgan, SEC meet to discuss capital markets moving onchain",
      "link": "https://cointelegraph.com/news/jpmorgan-sec-discuss-traditional-capital-markets-moving-onchain?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdmZDktNDdlMC03MDRjLWE4MGQtZjQ2NDRkNTU5MTU1.jpg\" /></p><p>Three JPMorgan executives met with the SEC’s Crypto Task Force to discuss which capital markets instruments could move onchain and how to best navigate the change.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US DOJ, Europol seize world’s largest dark web drug market operating via Monero",
      "link": "https://cryptoslate.com/us-doj-europol-seize-worlds-largest-dark-web-drug-market-operating-via-monero/",
      "summary": "<p>An international law enforcement effort has dismantled one of the world’s largest and longest-running criminal marketplaces on the darknet, arresting its suspected German operator in Spain and seizing millions in illicit assets, according to a June 16 press release. The takedown, coordinated by the Frankfurt Public Prosecutor’s Office, Germany’s Federal Criminal Police Office (BKA), the [&#8230;]</p> <p>"
    },
    {
      "title": "LatAm energy giant executes landmark $75M oil and gas deal via blockchain tokenization",
      "link": "https://cryptoslate.com/latam-energy-giant-executes-landmark-75m-oil-and-gas-deal-via-blockchain-tokenization/",
      "summary": "<p>Feniix Energy, an energy firm based in Latin America, has completed a $75 million acquisition of a live oil and gas operation using blockchain tokenization, according to a statement shared with on June 17. Global Settlement, a blockchain firm specializing in real-world assets (RWAs), executed the deal through its GSX Protocol. The protocol enabled [&#8230;]</p> <p>"
    },
    {
      "title": "DAMA 2: Deutsche Bank unveils institutional tokenization stack to fast-track regulated funds",
      "link": "https://cryptoslate.com/dama-2-deutsche-bank-unveils-institutional-tokenization-stack-to-fast-track-regulated-funds/",
      "summary": "<p>Deutsche Bank, Memento Blockchain, and Interop Labs published a litepaper on June 17 outlining plans for Digital Asset Management Access 2 (DAMA 2), a tokenization platform intended to operate on public blockchains and facilitate the issuance of regulated funds. According to the paper, DAMA 2 would link three layers: Ethereum (ETH) would act as the [&#8230;]</p> <p>"
    },
    {
      "title": "VanEck’s Solana ETF moves closer to market entry with DTCC listing",
      "link": "https://cryptoslate.com/vanecks-solana-etf-moves-closer-to-market-entry-with-dtcc-listing/",
      "summary": "<p>VanEck’s planned Solana (SOL) exchange-traded fund has been listed with the Depository Trust &#38; Clearing Corporation (DTCC) under the ticker symbol VSOL, signaling another step in mainstreaming Solana exposure for traditional investors. According to DTCC records, the fund is labeled “VANECK SOLANA TR COM SHS BEN INT” and falls under the ‘D’ settlement category, an [&#8230;]</p> <p>"
    },
    {
      "title": "US Senate approves landmark GENIUS Act for stablecoin regulation",
      "link": "https://cryptoslate.com/us-senate-approves-landmark-genius-act-for-stablecoin-regulation/",
      "summary": "<p>The Senate approved the Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act in a 51-23 vote on June 17, sending the measure to the House for consideration. The vote followed a 68-30 cloture decision on June 11 that cut off debate and started the mandatory 30-hour countdown to the final roll call. Senator [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Whales Pull 4,500 BTC From Binance, Hinting At Incoming Rally",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-whales-pull-4500-btc-from-binance-hinting-at-incoming-rally/",
      "summary": "Recent on-chain data suggests that Bitcoin (BTC) whales may be preparing for a potential rally, as Binance BTC withdrawals have seen a notable spike. Additionally, rising stablecoin inflows to exchanges indicate growing buy-side liquidity, reinforcing the market’s bullish sentiment. Bitcoin Whales Foreseeing Major Rally Ahead? According to a recent CryptoQuant Quicktake post by contributor Amr Taha, Bitcoin whales recorded one of the largest BTC outflows from Binance this month. The chart below shows that nearly 4,500 BTC were withdrawn on June 16. Bitcoin whales are defined as wallet addresses with significant BTC holdings. Past data suggests that such large withdrawals from whales have typically preceded price rallies, as they reflect a reduction in BTC exchange reserves, leaving fewer coins readily available for trading. Related Reading: Bitcoin Hash Ribbons Indicating Prime Buying Opportunity, Analyst Says Beyond this large-scale withdrawal, on-chain data also reveals dwindling BTC inflows to exchanges from both whales and retail investors. This combination of major outflows and low deposits could be laying the groundwork for a Bitcoin “supply crunch.&#8221; For the uninitiated, a Bitcoin supply crunch occurs when the available BTC on exchanges declines sharply, reducing the immediate supply for buyers. This happens when long-term holders or whales withdraw BTC to cold storage, creating upward pressure on price as demand outpaces liquid supply. Stablecoin Inflows Witness Sharp Increase In parallel with Bitcoin’s exchange exodus, stablecoin inflows to Binance have surged in recent days. Notably, over $400 million in stablecoins flowed in on both June 13 and 15. Historically, such significant stablecoin inflows have been linked to buy-side liquidity preparation. In other words, large investors appear ready to deploy capital into crypto assets like BTC, reflecting renewed risk appetite. Taha concluded: The aggressive Bitcoin withdrawals and concurrent stablecoin deposits create a supply-demand asymmetry. With fewer BTC available on exchanges and growing liquidity to fuel buys, the stage is set for a potential price breakout. Meanwhile, additional exchange data supports the case for further upside in BTC. For example, the coin has been experiencing consistently negative funding rates on Binance &#8211; often a precursor to short squeezes. Related Reading: Bitcoin Following ABCD Pattern? Analyst Sees Path To $137,000 At the same time, Bitcoin’s long-term holder Realized Cap recently surpassed $20 billion, underscoring rising confidence among seasoned investors. In addition, despite the ongoing BTC rally, retail participation remains relatively low, suggesting further room for growth. However, short-term holders are showing signs of caution, increasing their selling amid recent price corrections. At the time of writing, BTC is trading at $105,575, down 1.0% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Bitcoin Price Stumbles at Resistance — Will the Dip Deepen?",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-stumbles-108k/",
      "summary": "Bitcoin price started a fresh decline below the $106,800 zone. BTC is now consolidating and facing resistance near the $106,200 zone. Bitcoin started a fresh decline below the $106,200 zone. The price is trading below $106,800 and the 100 hourly Simple moving average. There is a short-term triangle forming with support at $104,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $103,500 zone. Bitcoin Price Dips Again Bitcoin price started a fresh decline after it failed to clear the $108,800 resistance zone. BTC dipped below the $108,000 and $107,000 levels. There was a clear move below the $106,200 support level. Finally, the price tested the $103,500 zone. A low was formed at $103,400 and the price is now consolidating losses. There was a minor increase above the 23.6% Fib retracement level of the downward move from the $108,924 swing high to the $103,400 low. Bitcoin is now trading below $106,800 and the 100 hourly Simple moving average. Besides, there is a short-term triangle forming with support at $104,200 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $105,200 level. The first key resistance is near the $105,500 level. The next key resistance could be $106,200. It is near the 50% Fib retracement level of the downward move from the $108,924 swing high to the $103,400 low. A close above the $106,200 resistance might send the price further higher. In the stated case, the price could rise and test the $108,000 resistance level. Any more gains might send the price toward the $110,000 level. More Losses In BTC? If Bitcoin fails to rise above the $106,200 resistance zone, it could start another decline. Immediate support is near the $104,200 level. The first major support is near the $103,500 level. The next support is now near the $102,500 zone. Any more losses might send the price toward the $101,200 support in the near term. The main support sits at $100,000, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $104,200, followed by $103,500. Major Resistance Levels – $105,500 and $106,200."
    },
    {
      "title": "Dogecoin Price Enters ‘Alarm Zone,’ Major Move Coming?",
      "link": "https://www.newsbtc.com/dogecoin-2/dogecoin-price-enters-alarm-zone-major-move-coming/",
      "summary": "The Dogecoin price is recording significant losses across multiple timeframes as the crypto market experiences a spike in selling pressure. The memecoin has been one of the worst performing cryptos over the past months as bull fail to push its price above critical levels. Related Reading: On-Chain Analyst Warns: Bitcoin Peak Expected, Altcoins Facing -95% Plunge At the time of writing, the Dogecoin price trades at $0.17, recording a 13% loss over the past seven days. On smaller timeframes, DOGE saw a 3% decline only topped by Solana. Dogecoin price trends to the downside on the daily chart. Source: DOGEUSDT on Tradingview Dogecoin Price On Ropes, Where Is DOGE Heading? According to top analyst Eliz, the Dogecoin price is at risk of falling to a dangerous area if it fails to sustain its current price. This ‘alarm zone’ is sitting around $0.14, if bulls fail to defend this area, the DOGE is at risk of falling deeper into the $0.12 to $0.08 and revisit levels last seen in 2024. Dogecoin price heading for a critical area. Source: Eliz883 via X As seen in the image above, the analyst remains hopeful that the cryptocurrency might rebound if it hits the ‘alarm zone.’ If this scenario comes to fruition, the cryptocurrency might reclaim its current levels and rise slightly towards the $0.2 area. The bullish momentum might push DOGE to previous highs on low timeframes, thus entering the $0.20 to $0.24 range. However, traders should remain cautious and watch closely for the coming price action before taking any position. Altcoin Season Could Save the DOGE Price Chris Burniske, former lead crypto analyst at Ark Invest, believes the altcoin sector is displaying some strength despite the Bitcoin sell off. While the top cryptocurrency seems to be cooling off, Burniske claims that Ethereum and Solana remain relatively healthy. Related Reading: Bear Signal Lingers On Dogecoin—Here’s Why That’s Bullish This factor might play in favor of a Dogecoin price rebound, even if the crypto hits the ‘alarm zone.’ The analyst stated the following on the current altcoin cycle hinting at potential gains for DOGE and other cryptocurrencies: ETH showing more strength than acknowledged, and SOL processing major FTX unlocks that were once viciously FUD’d without much of a sweat. The dynamics of this bull are different from prior runs, largely owing to altcoin fatigue, memecoin mania, and TradFi finally “getting it,” but the bull is still alive. Cover image from ChatGPT, DOGE/USDT chart from Tradingview"
    },
    {
      "title": "XRP Bullish Signal: Shark & Whale Wallets Set New All-Time High",
      "link": "https://www.newsbtc.com/xrp-news/xrp-bullish-shark-whale-set-new-all-time-high/",
      "summary": "On-chain data shows XRP shark and whale population has climbed to a new record alongside a spike in activity on the blockchain. XRP Wallets With 1 Million+ Tokens Have Set A New Record In a new post on X, the on-chain analytics firm Santiment has discussed the latest trend in a couple of indicators related to the XRP network. The first metric of relevance is the &#8220;Supply Distribution,&#8221; which tells us, among other things, the number of wallets that belong to a particular coin range. Related Reading: Stablecoin Exchange Inflows Plummet $61 Billion—Warning Sign For Bitcoin? In the context of the current topic, the range of interest is above 1 million coins (with the upper bound being infinity). This cutoff for the range converts to about $2.2 million at the current exchange rate, which is quite significant. Naturally, the only investors who would qualify for this threshold would be the big-money ones. Such holders are popularly known as the sharks and whales. Generally, the influence of any entity on the network goes up the more coins that they hold, so this cohort, with its large holdings, can carry some degree of power. As such, the behavior of the sharks and whales can be worth keeping an eye on. If nothing else, it can at least inform us about what the sentiment may be like among these humongous investors. Now, here is the chart shared by Santiment that shows the trend in the Supply Distribution of these 1 million+ holders over the past year: As displayed in the above graph, the XRP Supply Distribution has recently registered an uptick for sharks and whales, implying more wallets carrying above a million coins have popped up on the network. This could be an indication that some new big-money investors have potentially joined the chain. Following the increase, the network now has 2,708 wallets of this size, which is a new record. In the same chart, the analytics firm has also attached the data of the second relevant metric: Daily Active Addresses. This indicator measures the unique total number of wallets that are becoming involved in some kind of transaction activity on the network every day, whether as a sender or receiver. Since the smaller entities like retail massively outweigh the large investors in terms of number, this metric essentially represents the amount of activity that the entities on the smaller end of the network are participating in. From the graph, it&#8217;s visible that the XRP Daily Active Addresses have recently observed a large spike. Over the past week, the metric has averaged a value of 295,000 addresses daily, which is a drastic jump over the 35,000 to 40,000 figure witnessed during the last three months. Related Reading: Dogecoin Must Hold This Level—Or Risk A 30% Price Crash &#8220;The XRP ledger is showing serious signs of growth, from both a usage and key stakeholder perspective,&#8221; notes Santiment. It now remains to be seen what effect, if any, these changes in network metrics would have on the cryptocurrency&#8217;s price. XRP Price XRP shot up beyond the $2.33 mark yesterday, but it seems bullish momentum has already faded as the coin has dropped back to $2.20. Featured image from Dall-E, Santiment.net, chart from TradingView.com"
    },
    {
      "title": "Ethereum Golden Cross Approaching – Will History Repeat?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-golden-cross-approaching-will-history-repeat/",
      "summary": "Ethereum has faced intense volatility in recent days as escalating tensions between Israel and Iran continue to rattle global markets. Despite the uncertainty, ETH remains resilient above the $2,500 level, signaling ongoing strength among bulls. However, Ethereum now trades just below a critical resistance level at $2,675 — a zone that has acted as a barrier several times over the past few weeks. A breakout above this mark could trigger renewed upside momentum and set the stage for a rally toward $3,000. Related Reading: Ethereum Consolidation Continues – Altseason May Follow A Clean Break Above Resistance Market participants remain divided on Ethereum’s short-term direction, but the technical landscape offers a potentially bullish clue. According to top analyst Ted Pillows, Ethereum is on the verge of completing a golden cross — a chart pattern where the 50-day moving average crosses above the 200-day moving average. Historically, this signal has preceded strong upward trends in ETH, with the last golden cross resulting in a 35% surge over the following weeks. As Ethereum hovers in a tight range, traders are closely watching this setup. If bulls manage to reclaim $2,675 and the golden cross confirms, Ethereum could enter a powerful breakout phase, potentially sparking broader optimism across the altcoin market. Ethereum Prepares For A Breakout As Bulls Hold Support Ethereum is facing a decisive moment as it continues to trade within a range that has persisted for more than six weeks. The current price structure reflects growing indecision among market participants, largely driven by geopolitical uncertainty stemming from the escalating conflict between Israel and Iran. This macro backdrop has injected volatility across financial markets, and Ethereum has not been immune. While price action remains contained, ETH bulls are showing resilience by defending the $2,500 level — a crucial zone that has repeatedly served as support during the past month. However, to regain momentum, Ethereum must break above the $2,750–$2,800 resistance area, which has proven to be a major barrier since early May. This range remains the threshold separating consolidation from a full bullish breakout. A reclaim of this level would likely trigger a wave of buying, as it would mark the end of the current sideways phase and possibly initiate a fresh trend toward the $3,000 mark. Adding to the bullish thesis, Ted Pillows highlights that a golden cross is approaching on Ethereum’s moving averages. This occurs when the 50-day moving average crosses above the 200-day moving average — a technical signal often associated with trend reversals and sustained upward moves. The last time this setup formed, Ethereum surged over 35% in just a few weeks. With ETH hovering just beneath key resistance and macro conditions remaining uncertain, the coming days may determine whether the golden cross will serve as a launchpad for a major rally. If bulls hold $2,500 and reclaim $2,800, Ethereum could be preparing for a significant breakout, potentially igniting momentum across the altcoin sector. Related Reading: Ethereum Consolidation Continues – Altseason May Follow A Clean Break Above Resistance Ethereum Holds Support But Struggles With Resistance Ethereum (ETH) is showing resilience as it continues to trade above the $2,500 mark, but price action on the 4-hour chart reveals persistent difficulty in breaking through the $2,675–$2,700 resistance zone. This area, highlighted on the chart, has acted as a rejection zone multiple times since early June, capping bullish attempts to break out of the current range. Price recently tapped this resistance area again but failed to sustain momentum, resulting in a pullback toward the 200 EMA and 200 SMA, currently acting as near-term support around $2,575. ETH now hovers slightly above that level, and bulls must defend this zone to avoid slipping into lower support near $2,500. The pattern shows continued consolidation between a clearly defined support and resistance band, with the 50 and 100 moving averages flattening — a sign of market indecision. Volume has also declined slightly, reinforcing the idea that the market is waiting for a catalyst. Related Reading: Ethereum Weekly Candle Hints At Pre-Tower Top Formation – Details If ETH can reclaim $2,675 with conviction and follow through above $2,700, a rally toward the $2,850–$3,000 zone could develop. Until then, this tight range may continue. Holding the current support is crucial to avoid testing lower levels near $2,400, which could shift sentiment bearish. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "U.S. Senate Passes Stablecoin Bill The GENIUS Act",
      "link": "https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/USA-GENIUS-BILLpg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act\" rel=\"nofollow\"> </a></p> <p>The U.S. Senate has passed the Guiding and Establishing National Innovation for U.S. Stablecoins (GENIUS) Act (S. 394) by a vote of 68-30, establishing the first comprehensive federal framework for fiat-backed stablecoins. The bipartisan legislation was introduced by Senator Bill Hagerty and co-sponsored by Senators Tim Scott, Kirsten Gillibrand, and Cynthia Lummis. It passed under [&#8230;]</p> <p>"
    },
    {
      "title": "BBVA Tells Wealthy Clients to Invest Up to 7% in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BBVA.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Spanish bank BBVA is now advising its wealthy clients to invest up to 7% of their portfolios in crypto and Bitcoin, showing how traditional banks are starting to see the potential of Bitcoin.&#160; &#8220;With private customers, since September last year, we started advising on Bitcoin,&#8221; said Philippe Meyer, head of digital &#38; blockchain solutions at [&#8230;]</p> <p>"
    },
    {
      "title": "Ukraine Introduces Bill to Allow Bitcoin in National Reserves",
      "link": "https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Ukraine-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves\" rel=\"nofollow\"> </a></p> <p>Ukraine has introduced a bill that would give its central bank the legal right to hold Bitcoin and other assets as part of its national reserves. The draft law, submitted to the Verkhovna Rada on June 10, 2025, proposes updates to existing legislation to include “virtual assets” in the foreign exchange and gold reserves of [&#8230;]</p> <p>"
    },
    {
      "title": "Fold Holdings Secures $250 Million Equity Deal to Expand Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Fold-Holdings-Secures-250M-Equity-Deal-to-Expand-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>Fold aims to increase its bitcoin treasury through a $250M equity facility, giving the company flexibility to raise funds as needed.</p> <p>"
    },
    {
      "title": "Thailand Approves Five Year Bitcoin And Crypto Tax Break",
      "link": "https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Thailand-Approves-Tax-Exemption-on-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break\" rel=\"nofollow\"> </a></p> <p>Thailand has approved a five year tax exemption on capital gains from cryptocurrency trading made through licensed digital asset platforms. The exemption will be in effect from January 1, 2025, through December 31, 2029. Deputy Finance Minister Julapun Amornvivat announced the measure, calling it a move to increase investment, stimulate economic activity, and drive long [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "China’s JD Eyes Global Stablecoin Licenses to Slash Payment Costs",
      "link": "https://decrypt.co/325723/chinas-jd-eyes-global-stablecoin-licenses",
      "summary": "Chinese e-commerce giant JD.com says it could cut cross-border settlement costs as it plans to acquire stablecoin licenses"
    },
    {
      "title": "OpenAI Lands Pentagon Deal—Musk’s xAI Left Watching From Sidelines",
      "link": "https://decrypt.co/325716/openai-lands-pentagon-deal",
      "summary": "A new $200 million contract with the Department of Defense puts OpenAI ahead in the race to bring AI to government."
    },
    {
      "title": "How to Get Your Chatbot to Talk Dirty",
      "link": "https://decrypt.co/325680/how-get-your-chatbot-talk-dirty",
      "summary": "Users seeking steamy romance from their AI companions are getting yoga guides instead. Here’s how to stop your chatbot from pivoting from passion to wellness."
    },
    {
      "title": "Is Semler Scientific Flashing a Warning Sign for Bitcoin Treasury Firms?",
      "link": "https://decrypt.co/325674/is-semler-scientific-flashing-a-warning-sign-for-bitcoin-treasury-firms",
      "summary": "The company was valued at a razor-thin premium compared to its Bitcoin holdings, as of Tuesday."
    },
    {
      "title": "Bitcoin Miners Face More Trouble as Transaction Fee Share Hits 3-Year Low",
      "link": "https://decrypt.co/325671/bitcoin-miners-face-trouble-transaction-fees-3-year-low",
      "summary": "Bitcoin transaction fee rewards have dropped to their lowest level since 2022, making the already tough BTC mining industry even tougher."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "US Senate passes GENIUS stablecoin bill, advancing it to the House for final approval",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house/",
      "summary": "<p>US Senate passes the GENIUS stablecoin bill, advancing it to the House for a vote in 3 weeks with rules on backing, audits, and oversight.</p> <p>"
    },
    {
      "title": "JPMorgan Chase to pilot stablecoin-like JPMD for institutional clients on Base",
      "link": "https://cryptobriefing.com/jpmorgan-jpmd-deposit-token/",
      "summary": "<p>JPMorgan's pilot of JPMD tokens could accelerate institutional adoption of blockchain technology, influencing future financial systems.</p> <p>"
    },
    {
      "title": "How is technology redefining money and currency?",
      "link": "https://cryptobriefing.com/technology-redefining-money-currency/",
      "summary": "<p>Technology is redefining money with digital assets, smart contracts, and blockchain, shifting value exchange beyond traditional currency.</p> <p>"
    },
    {
      "title": "Kraken-backed layer 2 Ink to launch $INK token",
      "link": "https://cryptobriefing.com/kraken-ink-token-launch/",
      "summary": "<p>The launch of $INK could significantly enhance DeFi ecosystems by fostering user-driven governance and expanding on-chain capital markets.</p> <p>"
    },
    {
      "title": "Coinbase plans to offer tokenized equities to rival Robinhood, Charles Schwab",
      "link": "https://cryptobriefing.com/coinbase-tokenized-equities-sec-approval/",
      "summary": "<p>Coinbase's move into tokenized equities could reshape financial markets by increasing competition, innovation, and accessibility in trading.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Will Chainlink bulls fall as selling pressure rises? Examining…",
      "link": "https://ambcrypto.com/will-chainlink-bulls-fall-as-selling-pressure-rises-examining/",
      "summary": "<img alt=\"Will Chainlink bulls fall as selling pressure rises? Examining...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chainlink-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The weakness of the Chainlink bulls and the fearful short-term market sentiment doesn't bode well for LINK."
    },
    {
      "title": "Bitcoin faces $904M profit-driven pullback – Can BTC’s rally survive?",
      "link": "https://ambcrypto.com/bitcoin-faces-904m-profit-driven-pullback-can-btcs-rally-sustain/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-26.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As the Bitcoin uptrend continues, newer coins are aggressively selling while older ones take a step back."
    },
    {
      "title": "Sonic DEX volume rises 17% – But THIS signals likely trend reversal",
      "link": "https://ambcrypto.com/sonic-dex-volume-rises-17-but-this-signals-likely-trend-reversal/",
      "summary": "<img alt=\"Sonic DEX volume rises 17% - But THIS signals likely trend reversal\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-17T132752.528-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whales accumulate as Sonic holds $0.316 support and TVL consolidates above $2B."
    },
    {
      "title": "Is BNB ready for a bullish breakout? 2 reasons why price shows strength",
      "link": "https://ambcrypto.com/is-bnb-ready-for-a-bullish-breakout-2-reasons-why-price-shows-strength/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-17T145155.651-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB Chain’s usage is soaring, but price action remains confined beneath key resistance."
    },
    {
      "title": "Bitcoin fluctuates below $108K: What’s next amid Israel-Iran tensions?",
      "link": "https://ambcrypto.com/bitcoin-fluctuates-below-108k-whats-next-amid-israel-iran-tensions/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BitcoinFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Per analyst Willy Woo, short-term BTC price action was being driven by liquidity hunt."
    }
  ]
}