{
  "CoinDesk": [
    {
      "title": "Litecoin Slides as ETF Optimism Battles Wider Market Slowdown",
      "link": "https://www.coindesk.com/markets/2025/07/01/litecoin-slides-as-etf-optimism-battles-wider-market-slowdown",
      "summary": ""
    },
    {
      "title": "Mastercard to Expand Crypto Team With Two Senior Hires to Drive Blockchain Initiatives",
      "link": "https://www.coindesk.com/business/2025/07/01/mastercard-expands-crypto-team-with-two-senior-hires-to-drive-blockchain-initiatives",
      "summary": ""
    },
    {
      "title": "NEAR Protocol Falls 2% as Support Level Faces Critical Test",
      "link": "https://www.coindesk.com/markets/2025/07/01/near-protocol-falls-2-as-support-level-faces-critical-test",
      "summary": ""
    },
    {
      "title": "ATOM Plunges Below $4 as Selling Pressure Intensifies",
      "link": "https://www.coindesk.com/markets/2025/07/01/atom-plunges-below-usd4-as-selling-pressure-intensifies",
      "summary": ""
    },
    {
      "title": "Bitcoin Cash Surges 5%, Chalks Out Bullish Golden Cross Against BTC",
      "link": "https://www.coindesk.com/markets/2025/07/01/bitcoin-cash-surges-5-chalks-out-bullish-golden-cross-against-btc",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "How to set up stop-loss and take-profit orders",
      "link": "https://cointelegraph.com/news/how-to-set-up-stop-loss-and-take-profit-orders?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NjliZGYtNWYxYi03ZmY1LTk0MWQtMTllZGVlNzc1NWM1.jpg\" /></p><p>Stop-loss and take-profit orders help Bitcoin traders lock in gains and cut losses automatically. They’re essential tools for managing risk in a 24/7, fast-moving market.</p>"
    },
    {
      "title": "$324M in fees and no roadmap: What’s really going on with the TRUMP memecoin?",
      "link": "https://cointelegraph.com/explained/324m-in-fees-and-no-roadmap-whats-really-going-on-with-the-trump-memecoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8wNDMzNzAzZGM2Zjc1NTIwZjQ2MTY4MjVlZDA4MDFhYS5qcGc=.jpg\" /></p><p>Marketed with Trump’s name but lacking a white paper or utility, the TRUMP token surged to a multibillion-dollar valuation before crashing. </p>"
    },
    {
      "title": "Crypto hacks are a wake-up call for DeFi",
      "link": "https://cointelegraph.com/news/crypto-hacks-are-a-wake-up-call-for-defi?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM1NzEtY2FhMC03MTk3LTg2OGEtMWQ1NzQzOWRjZDI3.jpg\" /></p><p>Crypto hacks underscore the urgent need for CEXs and DeFi to overhaul their security, collaborate on risk management and embrace self-regulation.</p>"
    },
    {
      "title": "Moody’s brings credit ratings onchain via Solana, explained",
      "link": "https://cointelegraph.com/explained/moodys-brings-credit-ratings-onchain-via-solana-explained?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8xOWIyZmQyNDZmYjEzNjBhN2U1NjZhYzhhOGQ4OWNiMC5qcGc=.jpg\" /></p><p>Moody’s and Alphaledger’s pilot on Solana shows how traditional credit ratings can be embedded directly into tokenized bonds.</p>"
    },
    {
      "title": "FATF’s crypto checklist hints at the next regulatory crackdown",
      "link": "https://cointelegraph.com/news/fatf-crypto-checklist-hints-next-regulatory-crackdown?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmYxZTItZWI5MC03NjEwLWEwOWItMWU2Y2U4N2Y2MDcx.jpg\" /></p><p>The FATF is shaping global crypto rules from behind the scenes, with stablecoins and DeFi next in line for scrutiny.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Kraken Elected as Super Representative on the TRON Network",
      "link": "https://cryptoslate.com/kraken-elected-as-super-representative-on-the-tron-network/",
      "summary": "<p>Geneva, Switzerland, July 1, 2025 – TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet through blockchain technology and decentralized applications (dApps), today announced that Kraken, one of the world’s longest-standing and most secure crypto platforms, has been elected as a Super Representative (SR) on the TRON blockchain network. Kraken’s institutional-grade [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto stocks outshine Bitcoin with 119% YTD spike",
      "link": "https://cryptoslate.com/insights/crypto-stocks-outshine-bitcoin-with-119-ytd-spike/",
      "summary": "<p>Crypto equities have surged by an impressive 119% year-to-date, outpacing Bitcoin and almost every major asset class, according to analysts at 10x Research. Data from Yahoo Finance shows that stocks of companies involved in the crypto space, including Coinbase, Circle, and Robinhood, have posted double-digit gains of over 20% in the first half of 2025 [&#8230;]</p> <p>"
    },
    {
      "title": "ZachXBT deletes call out of Ripple RLUSD adoption but questions trust",
      "link": "https://cryptoslate.com/zachxbt-deletes-call-out-of-ripple-rlusd-adoption-but-questions-trust/",
      "summary": "<p>Prominent blockchain investigator ZachXBT has criticized two prominent stablecoins, including Ripple&#8217;s RLUSD and Circle&#8217;s USDC, highlighting concerns about their compliance and adoption strategies. In a now-deleted social media post, ZachXBT questioned Ripple’s RLUSD stablecoin, arguing that it lacked an authentic user base and relied on paid partnerships to create the illusion of organic growth. Due [&#8230;]</p> <p>"
    },
    {
      "title": "South Korea halts CBDC plans, shifting focus to bank-led stablecoins",
      "link": "https://cryptoslate.com/south-korea-halts-cbdc-plans-shifting-focus-to-bank-led-stablecoins/",
      "summary": "<p>Local reports indicate that South Korea’s central bank has suspended its central bank digital currency (CBDC) pilot program, pivoting the nation’s focus toward a private, bank-led stablecoin initiative. The Bank of Korea (BOK) halted its &#8220;Project Han River,&#8221; following mounting pressure from commercial banking partners who cited prohibitive costs and the absence of a viable [&#8230;]</p> <p>"
    },
    {
      "title": "Connecticut closes door on Bitcoin, mandates strict disclosure for crypto firms",
      "link": "https://cryptoslate.com/connecticut-bans-bitcoin-use-for-state-investment/",
      "summary": "<p>Connecticut has taken a firm stance against government involvement in digital assets like Bitcoin. On June 30, Governor Ned Lamont signed a new bill into law that bans state agencies from investing in crypto, including Bitcoin. The legislation, known as House Bill 7082, also prevents state entities from accepting these assets as payment for any [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Here’s What Will Happen If The Bitcoin Price Can Manage A Clean Break Above $108,500",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-break-above-108500/",
      "summary": "A crypto analyst has forecasted a powerful Wave 3 Bitcoin price rally that could take it toward new all-time highs between $160,000 and $200,000. Notably, this surge is expected to come with rising Bitcoin Dominance (BTC.D) and a delayed altcoin season, particularly if BTC can make a clean break above the $108,500 resistance level. Bitcoin Price Breakout To Spark Next Bull Run The Bitcoin price is currently hovering below a critical resistance level at $108,500, and according to a crypto analyst known as ‘BigMike7335’ on the X social media platform, a clean breakout and flip of this level into support could ignite an explosive Wave 3 bull run. Based on Elliott Wave Theory and Fibonacci Extension analysis, a successful move above this threshold could open the door to a bullish price surge with potential targets set in the $160,000 to $200,000 range. Related Reading: Bitcoin Flashes Double Top Above $106,000: FVG Says A Large Crash Is Coming The analyst’s chart shows that Bitcoin has already completed its Wave 1 of a five-wave impulse move, followed by an ABC corrective Wave 2. The market is also currently consolidating, and Bitcoin’s bullish momentum appears to be rebuilding. These positive developments are supported by a rising Stochastic Relative Strength Index (RSI) from the oversold region and a neutral-to-bullish RSI, both of which point toward upward price action. Notably, the 0.618 and 1.0 Fibonacci Extensions around $117,795 and $137,421, respectively, are highlighted as interim resistance zones where price momentum could temporarily slow before continuing upward. A clean breakout above $108,500 could also place Bitcoin above a heavy volume node visible in the volume profile within the chart, suggesting less overhead resistance and a stronger potential for a price rally. Furthermore, the analysis implies that during this powerful Wave 3 phase, Bitcoin Dominance will likely climb toward 70%. This increase in BTC.D would mean capital is concentrating in the leading cryptocurrency, which historically results in altcoins underperforming. As a result, the expected altcoin season for this cycle may be postponed, following the completion or cooling of Wave 3. Analyst Predicts $375,000 Bitcoin Bull Run Peak Crypto analyst TechDave has just sounded the alarm on what he calls the Bitcoin “launch signal”, a rare trigger that has only appeared four times in history and each time marked the start of major bull market rallies. This signal previously appeared in October 2012, July 2016, and July 2020—all preceding major upward moves that ended in new cycle peaks. Related Reading: Fading Spot Volumes And Muted Futures Sentiment Threaten To Send Bitcoin Below $99,000 Again Currently, the same signal is emerging this July, aligning with the previous cycle structures and reinforcing the expectation of a breakout phase. Notably, the formation has led to exponential gains, with each bull market run typically peaking months later. Following this historical pattern, TechDave now predicts a fresh cycle top for Bitcoin at $375,000. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "GameStop Inspired a Lingerie MMA League to Buy Bitcoin: SUBBD Token Soars?",
      "link": "https://www.newsbtc.com/news/gamestop-inspired-a-lingerie-mma-league-to-buy-bitcoin-subbd-token-soars/",
      "summary": "Shaun Donelly knows a hot item when he sees one – and Bitcoin’s the hottest item of them all. The CEO of the Lingerie Fighting Championship plans to build the company’s own Bitcoin treasury, and he’s taking inspiration from an unlikely source: GameStop. Is this a flash in the pan, or is the Lingerie Fighting Championship onto something? And what does it mean for the future of Bitcoin treasuries – and for innovative applications of the blockchain? From GameStop, to Strategy, and Back Again Remember the glory days of GameStop stonks? Back when Robinhood, the trading platform, and GameStop were household names, at least for a certain sector of the trading populace. Since the heady days of $81.25 $GME stock, back in 2021, GameStop has largely trundled along, doing its own thing. Over the past year, it traded in a fairly narrow range, up a little under 5%. But GameStop did make a big splash a few weeks ago, when it announced that it was taking a step back from Michael Saylor’s Strategy approach, and would be amassing its own Bitcoin treasury. Ironically, back in 2020 and 2021, when $GME was soaring, Michael Saylor had already started to take the approach with (Micro)Strategy that would make him famous, purchasing Bitcoin early and often. And as Bitcoin’s price rose, Strategy’s strategy paid off. So when GameStop announced that it would follow in Saylor’s footsteps, some heads turned. And without further ado, GameStop purchased 4,170 Bitcoin. GameStop Inspires LFC Back to Shaun Donelly. The LFC CEO watched GameStop make its big Bitcoin purchase and decided to follow suit. To that end, the LFC will purchase $230K of Bitcoin in the next month; they plan to spend up to $2M in the next six months. The move comes ahead of a series of first-ever UK shows, with key fighters in the LFC ready to take the stage. It’s not a trendsetting move, but rather one that follows a Bitcoin treasury strategy that has been adopted by companies both large and small alike, and even by the US government itself. And there’s every sign that GameStop isn’t done – the company has $450M of a potential $2.25B ready to deploy to bolster its Bitcoin supply, according to a recent SEC filing. Donelly hopes that his company can tap into the same energy Strategy did, and maybe even a bit of the same profit over the next decade; since making its first Bitcoin purchase, $MSTR stock is up 3,170%. There’s another project in the works that aims to take advantage of the healthy crypto climate. SUBBD Token aims to spice up the $85B content creation market with a combination of AI + blockchain. SUBBD Token ($SUBBD) – Bringing Fans and Creators Together with $SUBBD The SUBBD Token ($SUBBD) is another red-hot commodity. The SUBBD platform unleashes AI content management and production, bringing both together in one place for the first time. Creators gain new ways to connect with their fans, who can use $SUBBD to access exclusive content and receive subscription discounts. At the same time, the $SUBBD platform offers several AI tools, including: ✅ AI profile creation ✅ AI voice notes ✅ AI video generator ✅ AI livestream The entire suite can be used to boost AI influencers and to manage content from human creators. And with $SUBBD, both fans and creators alike can token-gate exclusive content to create new and more personal ways of interacting. The SUBBD Token presale, now on, has raised over $714K so far. Tokens are priced at $0.0558. Our price prediction shows the token price could reach $0.438by by the end of 2025, returning 684% to current investors. Learn how to buy SUBBD Token with our guide. Visit the SUBBD Token presale to learn more. From SUBBD to the LFC From GameStop to MicroStrategy and now to the Lingerie Fighting Championship, the Bitcoin treasury strategy continues to ripple across unexpected sectors. Shaun Donelly’s $2M commitment to BTC might seem unconventional, but it reflects a broader realization: Bitcoin – and crypto more broadly – is no longer fringe; it’s foundational. Projects like SUBBD Token are capitalizing on blockchain’s flexibility, merging AI, content creation, and fan engagement in powerful new ways. In the ring and online, the crypto fight is heating up. Remember to always do your own research; this isn’t financial advice."
    },
    {
      "title": "BitMine Stock Soars 700% After $250 Million Raise For Ethereum Treasury",
      "link": "https://www.newsbtc.com/news/ethereum/bitmine-stock-soars-700-after-250-million-raise-for-ethereum-treasury/",
      "summary": "Tom Lee, the market strategist known for his insightful predictions on Bitcoin (BTC) and broader crypto prices, has taken on the role of chairman of the board at BitMine Immersion Technologies, a Bitcoin mining company now setting its sights on becoming the largest publicly traded holder of Ethereum (ETH). Tom Lee Appointed Chairman At BitMine Lee’s appointment comes alongside an ambitious plan to raise $250 million in a private placement aimed at implementing a strategy that positions Ethereum as the primary treasury reserve asset, while still maintaining its core Bitcoin mining operations. This initiative reflects a growing trend within the financial services sector, where the convergence of traditional finance and cryptocurrency is gaining momentum, further highlighted by President Trump’s decision to establish a strategic crypto reserve. Related Reading: Solana Forms Bullish Flag On Daily Chart — Breakout Imminent? Lee highlighted this shift during an appearance on CNBC’s “Squawk Box,” stating, “The financial services industry and crypto are converging, and it really started with stablecoins.” Lee likened stablecoins to the &#8220;ChatGPT of crypto,&#8221; emphasizing their widespread adoption among consumers, businesses, and financial institutions, including major players like Visa. Interestingly, stablecoins have gained a major victory in Congress last week with the passage of the GENIUS Act which aims to provide a new regulatory framework for these crypto assets. Transforming Into An Ethereum Treasury Powerhouse According to Lee, Ethereum serves as the foundational architecture for stablecoins, making it crucial for BitMine to accumulate ETH in order to influence and secure its position within the network. The company&#8217;s strategy will include monitoring the value of Ethereum held per share as a key performance metric, akin to Strategy&#8217;s (previouisly MicroStrategy) well-known “BTC Yield” metric for Bitcoin. During his interview, Lee explained that BitMine plans to enhance the value of ETH per share through reinvestment of cash flows, capital market activities, and the appreciation of Ethereum itself. As more companies explore treasury management strategies beyond Bitcoin, BitMine is not alone in its pivot. It joins other firms like SharpLink Gaming, which initiated its own Ethereum treasury strategy earlier this year, and DeFi Development, which is focusing on Solana. Related Reading: Wave 3 Ignites As XRP Breaks Structure—Analyst Says ‘Fireworks Ahead’ This announcement sparked a major surge for the Bitcoin mining company which started the day with a market capitalization of just $26 million. However, following Lee’s interview, the number skyrocketed beyond the $200 million mark. BitMine&#8217;s stock, trading under the ticker name BMNR, also saw a major surge on Monday closing the day at $33.90 per share. According to Yahoo Finance data, this means a nearly 700% surge for the mining firm’s shares. On the other hand, Ethereum has retraced 1% below the key $2,500 level in the 24-hour time frame to its current price of $2,470 per token. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "XRP Breaks Out Across The Board—But One Thing’s Missing",
      "link": "https://www.newsbtc.com/xrp-news/xrp-breaks-out-across-the-board-but-one-things-missing/",
      "summary": "XRP has slipped the leash that has restrained it since the mid-January peak at $3.40, with the latest weekly candle closing a fraction above the descending trend-line that has defined the upper boundary of its six month trendline. At press time the token is quoting $2.22 on major spot venues, having tagged an intraday high of $2.31 a few hours after the weekly open. XRP Flashes Triple Breakout The technical alignment behind today’s move is unusually tight. The price itself has edged through trend-line resistance traced from the 16 January swing high, but the same behaviour is evident beneath the surface. On the momentum pane the weekly relative-strength index, muted since late March, has poked above its own falling resistance line at 54, ending a sequence of lower RSI highs that mirrored each failed rally in price. A similar story is unfolding on the WaveTrend Oscillator: the fast and slow signal lines have curled upward and printed a tentative positive cross just below the zero-line. Taken together, the trifecta—price above pennant roof, RSI above trend-line, WTO signals turning—constitutes what technicians refer to as confluence: three independent tools broadcasting the same directional bias on the same timeframe. The only missing ingredient is conviction in volume. Seasoned chart-watchers will want to see that metric expand in the coming sessions to validate the move. Related Reading: Analyst Reveals Rational Behind XRP Price Reaching $9.5 And $37.5 Independent analyst Maelius (@MaeliusCrypto), who posted the chart that first drew the community’s attention, summed up the state of play in a single line: “XRP teasing us with a breakout! Asking for volume to follow!” The plea is well-placed. Trendline resolutions that lack a parallel surge in activity are prone to fail-back tests; a decisive influx of bids is required to flip the freshly conquered trend-line into reliable support. Support for the bullish case is also visible on slower-moving gauges. The 50-week exponential moving average now rises through $1.84, its steepest positive slope in more than two years, and the current candle sits comfortably above that long-term trend proxy. Related Reading: Wave 3 Ignites As XRP Breaks Structure—Analyst Says ‘Fireworks Ahead’ Should the breakout hold and attract the liquidity Maelius is watching for, classical chart theory projects an initial objective near the midpoint of January’s supply shelf around $3.00. A weekly close back beneath the trend-line, by contrast, would neutralise the pattern and expose the high-volume node at the demand zone near $2.0 and the $1.84 price tag if bears regain momentum. For now the market is balanced on the knife-edge between promise and proof. Price, RSI and WTO have all stepped over their respective fault lines; only the tape itself remains to confirm that traders are prepared to follow through. Whether this triple breakout marks the beginning of XRP’s next leg higher—or merely another feint within a larger consolidation—will be determined in the sessions ahead. At press time, XRP traded at $2.21. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Shopping Spree: Strategy Continues Accumulation With $530M Purchase",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-shopping-spree-strategy-continues-accumulation-with-530m-purchase/",
      "summary": "Strategy (previously MicroStrategy), the leading corporate holder of Bitcoin (BTC), is on the verge of reaching a significant milestone as it approaches the acquisition of 600,000 tokens. In its latest move, the company purchased 4,980 Bitcoin between June 23 and June 29 for an average price of $106,801 each, totaling approximately $531.9 million. This latest purchase has brought the company’s total Bitcoin holdings to 597,325, acquired for around $42.4 billion. Strategy Shares Surge 4.7% Despite Bitcoin&#8217;s price remaining relatively stable at around $107,000 and $107,500 over the past 24 hours, Strategy&#8217;s shares, MSTR, increased by 4.7% to $402.07 on Monday, reflecting investor confidence in the company&#8217;s financial moves. The value of Strategy&#8217;s Bitcoin holdings now stands at roughly $64 billion. Related Reading: Wave 3 Ignites As XRP Breaks Structure—Analyst Says ‘Fireworks Ahead’ Funding for these latest acquisitions came through the sale of stock under various at-the-market offerings. Benchmark analyst Mark Palmer noted that the company&#8217;s Bitcoin yield, which measures the change in the ratio of its Bitcoin holdings to total shares outstanding, was 19.7% between January 1 and June 29. Strategy&#8217;s Chairman, Michael Saylor, who is often regarded as one of Bitcoin&#8217;s most vocal advocates, hinted at the recent purchase in a social media post over the weekend. He stated, “In 21 years, you’ll wish you’d bought more,” alongside a chart illustrating the performance of Strategy’s Bitcoin portfolio since its initial investment in late 2020, which shows the aggressive purchases that have increased over the past year. Bitcoin Price Hovers Around $107,000 Interestingly, the company had made a smaller purchase of 245 Bitcoins between June 16 and June 22, considerably less than its usual massive acquisitions. For context, Strategy had previously acquired 10,100 Bitcoins in just six days during the period from June 9 to June 15. This shows that while the company often makes large purchases, it can also vary its acquisition strategy based on market conditions. Over the past month, the market’s leading cryptocurrency has seen a notable volatility spike with prices failing to tackle its current record price of $111,800 reached during last month’s rally. Related Reading: Solana Forms Bullish Flag On Daily Chart — Breakout Imminent? Since, Bitcoin has managed to endure subsequent price drops, with the most recent plunging BTC toward the $98,000 zone. However, the cryptocurrency has managed to record a 2.4% recovery on the weekly time frame, currently consolidating at $107,000. Originally founded as an enterprise software firm, Strategy has transformed into a leveraged play on Bitcoin, allowing investors to gain exposure to cryptocurrency without directly owning it. Since August 2020, the company has consistently increased its Bitcoin reserves by selling stock and debt. This has prompted criticism from analysts who believe this could be dangerous if the Bitcoin price drops below the firm’s average buying price. Featured image from DALL-E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Public Companies Are Buying More Bitcoin Than ETFs for Third Quarter in a Row",
      "link": "https://bitcoinmagazine.com/news/public-companies-are-buying-more-bitcoin-than-etfs-for-third-quarter-in-a-row",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Public-companies-are-buying-more-Bitcoin-than-ETFs-for-the-third-quarter-in-a-row-driven-by-favorable-regulations-and-a-desire-to-grow-investor-value.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/public-companies-are-buying-more-bitcoin-than-etfs-for-third-quarter-in-a-row\" rel=\"nofollow\"> </a></p> <p>Corporate treasuries have surpassed exchange-traded funds (ETFs) in Bitcoin accumulation for the third consecutive quarter, according to new data from Bitcoin Treasuries. Public companies acquired approximately 131,000 BTC in Q2 2025—an 18% increase from the previous quarter—compared to an 8% uptick, or 111,000 BTC, among ETFs.&#160; “The institutional buyer who is getting exposure to Bitcoin [&#8230;]</p> <p>"
    },
    {
      "title": "Italian Bank UniCredit SpA Announces Investment On BlackRock’s Bitcoin ETF IBIT",
      "link": "https://bitcoinmagazine.com/news/italian-bank-unicredit-spa-announces-investment-on-blackrocks-bitcoin-etf-ibit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Italian-Bank-UniCredit-SpA-Announces-Investment-On-BlackRocks-Bitcoin-ETF-IBIT.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/italian-bank-unicredit-spa-announces-investment-on-blackrocks-bitcoin-etf-ibit\" rel=\"nofollow\"> </a></p> <p>The bank offers professional clients a five-year structured product with protection against losses and exposure to Bitcoin ETF performance.</p> <p>"
    },
    {
      "title": "Deutsche Bank To Launch Bitcoin and Crypto Custody Services",
      "link": "https://bitcoinmagazine.com/news/deutsche-bank-to-launch-bitcoin-and-crypto-custody-services",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/01/deutsche-bank-banks-must-partner-with-fintech-and-digital-currency-businesses-or-risk-disappearing-altogether.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/deutsche-bank-to-launch-bitcoin-and-crypto-custody-services\" rel=\"nofollow\"> </a></p> <p>According to Bloomberg, Germany's largest bank plans to offer Bitcoin and crypto custody in 2026 as institutional adoption accelerates. </p> <p>"
    },
    {
      "title": "Breez SDK Onboards 12 More Apps To The Bitcoin Lightning Network in Q2",
      "link": "https://bitcoinmagazine.com/news/breez-sdk-onboards-12-more-apps-to-the-bitcoin-lighting-network-in-q2",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Breez-SDK-Announces-Their-Class-of-Q2.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/breez-sdk-onboards-12-more-apps-to-the-bitcoin-lighting-network-in-q2\" rel=\"nofollow\"> </a></p> <p>Grimm App, Klever, Sorted, amongst others, all embraced the Bitcoin Lightning Network this past quarter.</p> <p>"
    },
    {
      "title": "German Bank Sparkassen-Finanzgruppe Plans to Offer Bitcoin For Private Customers",
      "link": "https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/German-Bank-Sparkassen-Finanzgruppe-Plans-to-Offer-Bitcoin-For-Private-Customers.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers\" rel=\"nofollow\"> </a></p> <p>Germany's largest savings bank financial group will allow private customers to trade Bitcoin and other cryptocurrencies by 2026, in partnership with DekaBank.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Coinbase Sags After Dual Blow of Supreme Court Decision, Ark Share Sale",
      "link": "https://decrypt.co/327979/coinbase-sags-ark-invest-supreme-court",
      "summary": "Coinbase faces legal setback and $95M selloff but analysts see upside potential and are predicting $1.33 per share gain in Q2 earnings."
    },
    {
      "title": "BTC RECORD MONTHLY CLOSE, TOKENISED STOCK TRADING BLOOMS, STAKING ETFS COMING",
      "link": "https://decrypt.co/videos/interviews/ouIWXcRV/btc-record-monthly-close-tokenised-stock-trading-blooms-staking-etfs-coming",
      "summary": "XRP, DOGE lead majors with positive funding rates. BTC & ETH ETFs extend inflows streak. RexShares SOL staking ETF to go live Wednesday. SEC delays staking for Bitwise ETH ETF. Robinhood intros staking, tokenised stocks, L2 chain. Robinhood stock hits ATH on announcements. Raydium, XStocks launch tokenised stocks trading. Jupiter allows swap of SOL memecoins to stocks. ByBit, Backed collab for tokenised stocks, ETF. Centrifuge to launch tokenised S&amp;P 500 index. Lummis calls for end to unfair taxes on crypto. Stablecoin bill could be finalised by mid-July. Connecticut bans creation of state BTC reserve. Strategy buys $532m BTC. Bitmine to turn into Strategy of ETH, stock up 7x. Circle applies for National Trust Bank license in US. Baer now Head of Product at X, also SOL advisor. Katana launches L2 after $200m deposits."
    },
    {
      "title": "Bitcoin Layer-2 Network Botanix Launches Mainnet, Touts Decentralization 'From the Start'",
      "link": "https://decrypt.co/327891/bitcoin-layer-2-network-botanix-mainnet-touts-decentralization",
      "summary": "Botanix, a Bitcoin layer-2 blockchain, launched its mainnet Tuesday as it attempts to bring more DeFi capabilities to the BTC network."
    },
    {
      "title": "Feds Charge Man With $1.7M Scheme to Convert Fake Checks Into Bitcoin",
      "link": "https://decrypt.co/327970/feds-charge-man-with-1-7m-scheme-to-convert-fake-checks-into-bitcoin",
      "summary": "The alleged scheme involved laundering the proceeds of counterfeit checks and business email compromise scams into Bitcoin."
    },
    {
      "title": "Bitget Wallet Launches Crypto-Linked Mastercard in Partnership with Immersve",
      "link": "https://decrypt.co/327952/bitget-wallet-launches-crypto-linked-mastercard-in-partnership-with-immersve",
      "summary": "The card will initially launch in the UK and the European Union, before rolling out later in Latin America, Australia and New Zealand."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "SEC considers allowing crypto ETFs to launch without 19b-4 filing",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec/",
      "summary": "<p>Streamlining crypto ETF approvals could accelerate market growth, enhance investor access, and influence global regulatory approaches.</p> <p>"
    },
    {
      "title": "Tuttle Capital targets July 16 to launch 10 leveraged crypto ETFs, including XRP, BNB, TRUMP, and more",
      "link": "https://cryptobriefing.com/leveraged-crypto-etfs-tuttle-launch/",
      "summary": "<p>The launch of leveraged crypto ETFs could increase market volatility and attract both speculative interest and regulatory scrutiny.</p> <p>"
    },
    {
      "title": "Gloria AI links up with Kosher Capital to refine agent strategies using live signal feeds",
      "link": "https://cryptobriefing.com/autonomous-trading-agents-live-feeds/",
      "summary": "<p> Kosher Capital integrates Gloria AIs real-time news feeds to upgrade its 380 autonomous trading agents with macro and crypto intelligence.</p> <p>"
    },
    {
      "title": "Connecticut governor signs law blocking state from establishing Bitcoin, crypto reserves",
      "link": "https://cryptobriefing.com/connecticut-bitcoin-purchase-ban/",
      "summary": "<p>Connecticut's crypto ban may limit innovation in digital finance, contrasting with states exploring crypto reserves, impacting future tech adoption.</p> <p>"
    },
    {
      "title": "World.fun rolls out new launch model with debut of AI Shark Tank",
      "link": "https://cryptobriefing.com/ai-shark-tank-world-launch/",
      "summary": "<p>World.fun launches new platform for AI-powered simulations, kicking off with AI Shark Tank and a token model based on real user interaction.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum Futures spike against Bitcoin: What the 98% volume ratio means",
      "link": "https://ambcrypto.com/ethereum-futures-spike-against-bitcoin-what-the-98-volume-ratio-means/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-7.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can Ethereum truly challenge Bitcoin's dominance, or even lead a new \"altcoin season?\""
    },
    {
      "title": "SUI’s $164 mln token unlock triggers sell-off fears: Price crash ahead?",
      "link": "https://ambcrypto.com/suis-164-mln-token-unlock-triggers-sell-off-fears-price-crash-ahead/",
      "summary": "<img alt=\"SUI&#039;s $164 mln token unlock triggers sell-off fears: Price crash ahead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-01T162701.025_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Sui Network set to unlock 58.35 million tokens, worth $164.44 million."
    },
    {
      "title": "SOL price spikes on ETF launch with staking – Is $200 in sight or just hype?",
      "link": "https://ambcrypto.com/sol-price-spikes-on-etf-launch-with-staking-is-200-in-sight-or-just-hype/",
      "summary": "<img alt=\"SOL price spikes on ETF launch with staking - Is $200 in sight or just hype?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/SOL-ETF-.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />REX-Osprey SOL ETF with staking could make SOL 'unpopular' for earning yield."
    },
    {
      "title": "How OppiWallet’s virtual and physical cards eliminate the crypto-to-fiat hassle",
      "link": "https://ambcrypto.com/how-oppiwallets-virtual-and-physical-cards-eliminate-the-crypto-to-fiat-hassle/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"521\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Screenshot-2025-07-01-144027.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"928\" />OppiWallet today highlighted how its dual virtual and physical cards eliminate the barriers between crypto [&#8230;]"
    },
    {
      "title": "Can XRP make a Q3 comeback, rattle Ethereum’s dominance? Mapping…",
      "link": "https://ambcrypto.com/can-xrp-make-a-q3-comeback-rattle-ethereums-dominance-mapping/",
      "summary": "<img alt=\"Can XRP make a Q3 comeback, rattle Ethereum&#039;s dominance? Mapping...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ripple vs Ethereum: Funding rates rise, ratio rebounds at support."
    }
  ]
}