{
  "CoinDesk": [],
  "Cointelegraph": [
    {
      "title": "Investors are balking at ‘excessive’ Bitcoin miner exec pay: VanEck",
      "link": "https://cointelegraph.com/news/bitcoin-miner-execs-earn-excessive-pay-shareholders-balking-vaneck?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2MwMGYtZjkyZi03YjIxLWFlOGEtYmEzMTE5NmM4NWUz.jpg\" /></p><p>Bitcoin mining executives’ huge pay packages are weakly aligned with shareholder interests, according to new research from VanEck.</p>"
    },
    {
      "title": "Pump.fun buys Kolscan in first acquisition, eyes gamified trading",
      "link": "https://cointelegraph.com/news/pumpfun-acquires-kolscan-for-first-acquisition?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Y2Y2EtMjhmZi03OTFiLWE5ZmItZjE4MGMxNWY5Y2Rl.jpg\" /></p><p>Memecoin creation platform Pump.fun has made its first acquisition, buying the wallet-tracking project Kolscan ahead of its $1 billion ICO.</p>"
    },
    {
      "title": "Florida probes Robinhood’s crypto trading promotion",
      "link": "https://cointelegraph.com/news/florida-investigates-robinhood-crypto-pricing-claims?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Y2ZjAtOTIyZC03YjM1LTlhMTEtMTYyOTFjMjZmNGVi.jpg\" /></p><p>Lucas Moskowitz, Robinhood’s general counsel, told that the platform’s “disclosures are best-in-class,” and “customers can trade crypto at the lowest cost on average”.</p>"
    },
    {
      "title": "SUI bullish chart pattern confirmation sets breakout target at $3.89",
      "link": "https://cointelegraph.com/news/sui-bullish-chart-pattern-confirmation-sets-breakout-target-at-dollar3-89?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Y0Y2UtMTBmYS03OGFkLThjZGYtZjE0ZGYzNTU4MGJh.jpg\" /></p><p>SUI broke out of an inverse head-and-shoulders pattern, opening the door for a rally to $3.89.</p>"
    },
    {
      "title": "US Senate confirms ex-Bitfury exec to lead OCC banking regulator",
      "link": "https://cointelegraph.com/news/us-senate-confirms-jonathan-gould-lead-occ?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzRhZDctZjYxNS03MmYxLWE1OGItY2QwYjE4ZWFkM2I4.jpg\" /></p><p>Jonathan Gould will return to the OCC as Comptroller of the Currency to serve a five-year term following his nomination by US President Donald Trump.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Ethena rockets to $290 million in revenue, seeks SEC clarity on USDe",
      "link": "https://cryptoslate.com/ethena-rockets-to-290-million-in-revenue-seeks-sec-clarity-on-usde/",
      "summary": "<p>Ethena Labs reached $290.2 million in total protocol revenue on July 9, trailing only Tether, Circle, and Sky among stablecoin issuers. Token Terminal data show that the stablecoin issuer reached $100 million in cumulative revenue 251 days after its launch, making it the second-fastest protocol to cross this threshold. Daily fees averaged $3.1 million during [&#8230;]</p> <p>"
    },
    {
      "title": "Shareholders push back against high pay for public Bitcoin miner execs after record equity grants",
      "link": "https://cryptoslate.com/shareholders-push-back-against-high-pay-for-public-bitcoin-miner-execs-after-record-equity-grants/",
      "summary": "<p>Shareholders trimmed support for executive pay packages at leading US Bitcoin (BTC) miners to an average of 64% in this year’s proxy season, far below the over 90% approval norm across the S&#38;P 500, according to a July 10 VanEck research note. VanEck reviewed filings from eight listed miners and found average named-executive-officer (NEO) compensation [&#8230;]</p> <p>"
    },
    {
      "title": "Robinhood launches ETH, SOL staking services for US users with $1 minimum",
      "link": "https://cryptoslate.com/robinhood-launches-eth-sol-staking-services-for-us-users-with-1-minimum/",
      "summary": "<p>Robinhood launched Ethereum (ETH) and Solana (SOL) staking services for U.S. customers on July 10, enabling users to earn staking rewards on their crypto holdings with as little as $1. The new feature expands Robinhood’s staking offerings beyond Europe, allowing American customers to participate in blockchain validation without directly running validators themselves. For Ethereum, Robinhood [&#8230;]</p> <p>"
    },
    {
      "title": "Tornado Cash co-founder may seek trial delay amid witness dispute",
      "link": "https://cryptoslate.com/tornado-cash-co-founder-may-seek-trial-delay-amid-witness-dispute/",
      "summary": "<p>Tornado Cash co-founder Roman Storm&#8217;s lawyers have signaled that they may request a brief delay in his upcoming criminal trial if a judge allows testimony from a hacker who allegedly used the platform, according to July 10 court filings. In a filing with the U.S. District Court for the Southern District of New York, Storm’s [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin climbs to $117k as volatility spikes across markets after compression",
      "link": "https://cryptoslate.com/bitcoin-climbs-to-117k-as-volatility-spikes-across-markets-after-compression/",
      "summary": "<p>Bitcoin (BTC) on-chain and derivatives markets reflect compressed volatility and a tightening supply while registering new all-time highs, according to Glassnode. A July 10 report indicated that the Accumulation Trend Score has shown steady investor buying since June, with the price remaining within a narrow band. The report came hours ahead of Bitcoin exploding into [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Builds Momentum — $2.50 Break Sparks Fresh Bullish Wave",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-builds-momentum-2-50/",
      "summary": "XRP price started a fresh increase above the $2.50 zone. The price is now showing positive signs and might climb above the $2.62 resistance. XRP price started a fresh increase above the $2.50 zone. The price is now trading above $2.50 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.50 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above the $2.50 zone. XRP Price Rallies Over 5% XRP price started a fresh increase after it settled above the $2.40 level, like Bitcoin and Ethereum. The price was able to climb above the $2.450 resistance level. The recent move was positive and the bulls pushed the price above the $2.50 level. A high was formed at $2.5870 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2.250 swing low to the $2.5870 high. The price is now trading above $2.50 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.50 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.5880 level. The first major resistance is near the $2.60 level. A clear move above the $2.60 resistance might send the price toward the $2.620 resistance. Any more gains might send the price toward the $2.650 resistance or even $2.6850 in the near term. The next major hurdle for the bulls might be near the $2.750 zone. Another Decline? If XRP fails to clear the $2.620 resistance zone, it could start another decline. Initial support on the downside is near the $2.50 level and the trend line zone. The next major support is near the $2.450 level. If there is a downside break and a close below the $2.450 level, the price might continue to decline toward the $2.420 support or the 50% Fib retracement level of the upward move from the $2.250 swing low to the $2.5870 high. The next major support sits near the $2.40 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.50 and $2.450. Major Resistance Levels – $2.60 and $2.620."
    },
    {
      "title": "Pump.fun Token Surges in Pre-Market—But Whales Are Shorting It, Why?",
      "link": "https://www.newsbtc.com/news/pump-fun-token-surges-in-pre-market-but-whales-are-shorting-it-why/",
      "summary": "As the official public sale of Pump.fun’s token approaches, significant activity has emerged across decentralized derivatives exchanges, where large investors appear to be managing risk by taking early positions. Market data shows that whales are interacting with pre-market perpetual contracts, particularly on platforms like Hyperliquid and Binance, as they anticipate potential volatility during the token’s initial coin offering (ICO), scheduled for July 12. Related Reading: Crypto Market Cap On Track To $4.5 Trillion As Q3 Unfolds – Details Perpetual Market Signals Whale Hedging Strategy Three prominent wallets have collectively deposited over $11 million in USDC on Hyperliquid to open short positions on the newly listed PUMP perpetual contract. These trades appear to function as hedges against anticipated allocations in the upcoming token generation event. According to on-chain tracker Lookonchain and explorer Hypurrscan, the structure of these positions, utilizing low leverage and modest open interest compared to margin collateral, suggests a defensive rather than speculative stance. One wallet, identified as “0xAc72,” allocated $4 million in margin and opened a 2x leveraged short valued at approximately $1.07 million at an entry price of $0.00504. This trader’s liquidation point sits at $0.02138, offering a wide buffer that implies the position is less about profit from a downturn and more about offsetting potential downside risk from PUMP exposure in the ICO. Two additional wallets deployed a combined $7 million in margin to open 1x leveraged shorts. Together, these positions amount to roughly $2.39 million in open interest, a small portion of their posted collateral. Hyperliquid’s open interest in PUMP has surpassed $43 million since listing the token in the early hours of Thursday’s European session. Binance followed suit by listing a PUMP perpetual contract, which quickly amassed over $12 billion in trading volume, indicating heightened market anticipation. It is worth noting that the early trading could serve multiple purposes, including valuation locking by whales, arbitrage strategies related to expected airdrops, or speculative profit-taking based on retail momentum. Pump.fun Token Launch Nears as Pricing Premium Narrows The PUMP token initially debuted in pre-market trading at a roughly 40% premium to its ICO price of $0.004. It reached a high of $0.0056 on Hyperliquid before retreating to around $0.0047 levels, a level closer to its public sale valuation. The narrowing premium suggests a recalibration in investor expectations as trading stabilizes ahead of the launch. Pump.fun, a meme-coin launchpad built on Solana, announced the token in June alongside a revenue-sharing initiative for token holders. The token has a total supply of 1 trillion, with 33% allocated to early participants via a private sale (18%) and public sale (15%). The ICO will run from July 12 to July 15 on crypto exchange Bybit, providing a limited window for broader participation. Related Reading: ‘Real’ Crypto Bull Run Just Beginning, Says Analyst—Here’s Why While details of the airdrop mechanics have not been fully disclosed, the ongoing activity suggests that large holders are actively managing their exposure before the distribution phase begins. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Ethereum Price Spikes To $3K — Breakout Confirms Bullish Trend",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-spikes-to-3k/",
      "summary": "Ethereum price started a fresh increase above the $2,800 zone. ETH is now consolidating gains and might aim for a fresh move above $3,000. Ethereum started a fresh increase above the $2,850 level. The price is trading above $2,840 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,885 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it remains supported above the $2,840 zone in the near term. Ethereum Price Rallies Above $2,880 Ethereum price started a fresh increase above the $2,750 zone, like Bitcoin. ETH price gained pace for a move above the $2,800 resistance zone and entered a positive zone. The bulls even pumped the price above $2,880. Finally, it tested the $3,000 zone. A high was formed at $3,000 and the price is now consolidating gains. It is stable above the 23.6% Fib retracement level of the upward move from the $2,515 swing low to the $3,000 high. Ethereum price is now trading above $2,880 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2,885 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,980 level. The next key resistance is near the $3,000 level. The first major resistance is near the $3,040 level. A clear move above the $3,040 resistance might send the price toward the $3,120 resistance. An upside break above the $3,120 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $3,200 resistance zone or even $3,220 in the near term. Are Downsides Limited In ETH? If Ethereum fails to clear the $3,000 resistance, it could start a downside correction. Initial support on the downside is near the $2,920 level. The first major support sits near the $2,880 zone and the trend line. A clear move below the $2,880 support might push the price toward the $2,750 support or the 50% Fib retracement level of the upward move from the $2,515 swing low to the $3,000 high. Any more losses might send the price toward the $2,720 support level in the near term. The next key support sits at $2,650. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,880 Major Resistance Level – $3,000"
    },
    {
      "title": "Bitcoin Price Rockets to Record High — Bulls Celebrate Milestone",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-rockets-116800/",
      "summary": "Bitcoin price started a fresh increase above the $110,500 zone. BTC is now up over 5%, traded to a new high, and extend gains above the $116,000 level. Bitcoin started a fresh increase above the $112,500 zone. The price is trading above $113,500 and the 100 hourly Simple moving average. There was a break above a bearish trend line with resistance at $111,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to rise if it clears the $116,800 resistance zone. Bitcoin Price Sets New ATH Bitcoin price started a fresh increase after it cleared the $110,500 resistance zone. BTC gained pace for a move above the $112,000 and $113,500 resistance. Besides, there was a break above a bearish trend line with resistance at $111,000 on the hourly chart of the BTC/USD pair. The bulls even pumped the pair above the $115,000 resistance zone. A new all-time high was formed at $116,800 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $110,600 swing low to the $116,800 high. Bitcoin is now trading above $113,500 and the 100 hourly Simple moving average. Immediate resistance on the upside is near the $116,000 level. The first key resistance is near the $116,200 level. The next resistance could be $116,800. A close above the $116,800 resistance might send the price further higher. In the stated case, the price could rise and test the $118,000 resistance level. Any more gains might send the price toward the $118,800 level. The main target could be $120,000. Downside Correction In BTC? If Bitcoin fails to rise above the $116,800 resistance zone, it could start a downside correction. Immediate support is near the $115,300 level. The first major support is near the $113,700 level or the 50% Fib retracement level of the upward move from the $110,600 swing low to the $116,800 high. The next support is now near the $113,200 zone. Any more losses might send the price toward the $112,500 support in the near term. The main support sits at $110,500, below which BTC might continue to move down. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $115,300, followed by $113,700. Major Resistance Levels – $116,800 and $118,000."
    },
    {
      "title": "Altcoins Jump Off Critical Support Level – Relief Or Reversal?",
      "link": "https://www.newsbtc.com/altcoin/altcoins-jump-off-critical-support-level-relief-or-reversal/",
      "summary": "Altcoins have endured years of underperformance as Bitcoin continues to dominate the crypto market. Despite several short-lived rallies, most altcoins remain far below their previous highs, weighed down by investor skepticism and capital concentration in BTC. However, there are signs that sentiment might be shifting. In recent days, strong altcoins have started to recover, showing resilience as broader market conditions improve. Related Reading: Bitcoin 30-Day Average Funding Rate Drops – Bullish Setup Takes Shape Top analyst Carl Runefelt shared a technical setup revealing that the altcoin market is now bouncing off a major support zone. This move has sparked fresh debates among traders and investors. Is this the start of a long-awaited altseason, or merely a temporary relief bounce before further downside? The bounce comes as macroeconomic uncertainty begins to fade and liquidity returns to the crypto market. Still, key resistance levels remain untouched for many projects, and overall confidence in altcoins hasn’t fully returned. While the current setup is promising, confirmation will depend on whether this rally can break above critical levels and sustain higher prices. Altcoins Eye A Breakout As Ethereum Holds The Key Altcoins remain nearly 50% below their all-time highs, but sentiment is beginning to shift. Bulls are preparing for an expansive move across the board, with growing anticipation that a breakout could materialize once Ethereum clears its current resistance zone. Since early May, ETH has been trading in a well-defined consolidation range, and altcoins have mirrored this sideways behavior, struggling to gain momentum without a clear signal from the market’s second-largest asset. Carl Runefelt recently shared insights suggesting that the altcoin market is showing signs of life. By analyzing the TOTAL3 chart—which tracks the combined market cap of all cryptocurrencies excluding Bitcoin and Ethereum—Runefelt highlights that altcoins are bouncing off key support in BTC terms. This bounce could indicate the beginning of a recovery rally, especially if capital rotation from BTC into altcoins accelerates in the coming sessions. Historically, altcoins thrive when Ethereum leads the charge. A confirmed breakout above the $2,800 resistance zone could ignite broad participation and kickstart a new altseason. The current market structure suggests that many investors are positioning early, anticipating that macroeconomic clarity and market stability will fuel risk-on behavior. However, the rally is not yet confirmed. Bulls still need Ethereum to break out decisively and sustain momentum above recent highs. If that happens, many oversold altcoins could see sharp recoveries and set the stage for a broader market expansion. For now, patience and timing remain key as traders watch ETH and TOTAL3 closely for signals of the next leg up. Related Reading: Ethereum Price Action Signals Momentum Shift: BTC Sleeps And ETH Moves TOTAL3 Chart Shows Key Rebound From Macro Support The TOTAL3 chart, which measures the total crypto market cap excluding Bitcoin and Ethereum, is showing early signs of recovery after a sustained period of weakness. As of now, the chart reflects a bounce from the $830 billion level, which aligns closely with the 100-week simple moving average (SMA), currently acting as dynamic support. This level has historically served as a critical pivot zone, especially in mid-cycle consolidations. The market cap sits near $875 billion, still over 40% below the previous cycle’s peak, but with bullish momentum building. The recent weekly candle has posted a strong green body, suggesting renewed interest in the altcoin segment. Volume has also picked up, showing growing confidence among participants as many altcoins recover from deeply oversold conditions. Related Reading: ERC-20 Stablecoin Supply Hits All-Time High At $121B – Liquidity On The Rise Technically, this bounce could signal the beginning of a new macro leg higher, especially if the 50-week SMA is reclaimed and price holds above $900 billion. The overall structure remains constructive, with higher lows forming since late 2022 and price compressing into a potential breakout formation. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Hits New All Time High of $113,900 as Adoption Accelerates",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-of-113000-as-Adoption-Accelerates.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates\" rel=\"nofollow\"> </a></p> <p>Bitcoin’s surge to $113,900 signals rising adoption, and Fed rate cut expectations.</p> <p>"
    },
    {
      "title": "Rumble Partners with MoonPay to Launch Bitcoin Wallet for Creators",
      "link": "https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Rumble-Partners-with-MoonPay-to-Launch-Bitcoin-Wallet-for-Creators-Today.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators\" rel=\"nofollow\"> </a></p> <p>Today, Rumble announced an exclusive partnership with MoonPay to launch a Bitcoin and crypto wallet that will let creators handle their earnings outside traditional banking systems.&#160; The new Rumble Wallet, set to arrive in Q3 2025, will use MoonPay&#8217;s infrastructure to power all digital currency transactions on the platform. Users will be able to buy, [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Technology Increases Bitcoin Holdings to $101 Million",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million\" rel=\"nofollow\"> </a></p> <p>KULR now holds 1,021 BTC, reporting a 291% BTC yield year to date.</p> <p>"
    },
    {
      "title": "K Wave Media Raises $1 Billion For Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/K-Wave-Media-Raises-1-Billion-For-Bitcoin-Treasury-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>K Wave Media Inc. has announced a $500 million convertible note agreement with Anson Funds to support its Bitcoin treasury strategy. This financing follows an earlier $500 million standby equity purchase agreement with Bitcoin Strategic Reserve, bringing the company’s total capital capacity to $1 billion. As part of the Anson agreement, K Wave will issue [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: Sidechains",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-sidechains",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Layer-2-Sidechains.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-sidechains\" rel=\"nofollow\"> </a></p> <p>The fourth article in the Bitcoin Layer 2 series. This article covers sidechains, a concept originally proposed by the founders of Blockstream.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "SIM Swapper Who Stole $20 Million in Crypto Resentenced to 12 Years in Prison",
      "link": "https://decrypt.co/329658/sim-swapper-20-million-crypto-resentenced-12-years-prison",
      "summary": "Truglia’s original 18-month term was dramatically increased after he failed to pay restitution to crypto investor Michael Terpin."
    },
    {
      "title": "If You Bought Ethereum When Eric Trump Said So, You’re Finally in the Green",
      "link": "https://decrypt.co/329655/ethereum-eric-trump-youre-finally-green",
      "summary": "Ethereum plunged as much as 37% after the president's son called it a buy in February. Five months later, it has slowly clawed its way back."
    },
    {
      "title": "Bitcoin Stablecoin Network Plasma Sets XPL Token Sale After Attracting $1 Billion in Deposits",
      "link": "https://decrypt.co/329578/bitcoin-stablecoin-network-plasma-token-sale-1-billion",
      "summary": "Plasma will feature several unreleased stablecoins upon its \"late summer\" mainnet launch, although it wouldn't confirm who would issue them."
    },
    {
      "title": "Agora Raises $50 Million to Power Next Wave of Stablecoins",
      "link": "https://decrypt.co/329634/agora-raises-50-million-power-next-wave-stablecoins",
      "summary": "Agora, which debuted its platform last year, said the funds will help businesses introduce and manage their own branded stablecoins."
    },
    {
      "title": "Ex-Bitfury Executive Receives Senate Nod to Head Banking Regulator",
      "link": "https://decrypt.co/329637/former-crypto-executive-senate-nod-head-banking-regulator",
      "summary": "Jonathan Gould, a former chief legal officer at blockchain company Bitfury, was confirmed by the U.S. Senate to lead the Office of the Comptroller of the Currency."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "REX Shares files for 2X leveraged TRON ETF",
      "link": "https://cryptobriefing.com/2x-tron-etf-launch/",
      "summary": "<p>The filing highlights the increasing diversification in crypto investment products, potentially broadening market participation and innovation.</p> <p>"
    },
    {
      "title": "Pump.fun acquires Kolscan ahead of PUMP token launch",
      "link": "https://cryptobriefing.com/pump-fun-acquires-kolscan-onchain-wallet-tracking/",
      "summary": "<p>Pump.fun acquires wallet tracker Kolscan to boost social trading tools ahead of its PUMP token ICO on July 12.</p> <p>"
    },
    {
      "title": "Why is Bitcoin going up today? Rising US demand, strong ETF inflows, and steady corporate accumulation",
      "link": "https://cryptobriefing.com/bitcoin-price-surge-etf-corporate/",
      "summary": "<p>Bitcoin's sustained growth signals its maturation as a stable asset, attracting institutional interest amid economic and geopolitical uncertainties.</p> <p>"
    },
    {
      "title": "Aptos Labs expands leadership as tokenized real-world assets surpass $540M in value",
      "link": "https://cryptobriefing.com/aptos-real-world-assets-growth/",
      "summary": "<p>Aptos Labs' leadership expansion and strategic partnerships could accelerate institutional blockchain adoption, reshaping global financial markets.</p> <p>"
    },
    {
      "title": "Robinhood launches Ethereum and Solana staking in the US",
      "link": "https://cryptobriefing.com/robinhood-ethereum-solana-staking-us/",
      "summary": "<p>Robinhood's move into crypto staking could accelerate mainstream adoption and influence regulatory frameworks in the evolving digital asset space.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum: What’s standing between ETH and $3K? – Data suggests…",
      "link": "https://ambcrypto.com/ethereum-whats-standing-between-eth-and-3k-data-suggests/",
      "summary": "<img alt=\"ETHEREUM\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/13858261-C658-4AAF-9FCD-84AE6BCCB1FA.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ETH is showing clearer signs of bullish momentum across the market."
    },
    {
      "title": "Assessing Bitcoin’s current market dynamics – Low Inflows, high leverage, and…",
      "link": "https://ambcrypto.com/assessing-bitcoins-current-market-dynamics-low-inflows-high-leverage-and/",
      "summary": "<img alt=\"Assessing Bitcoin&#039;s current market dynamics - Low Inflows, high leverage, and...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Open Interest and liquidations data had some interesting observations for Bitcoin's price performance."
    },
    {
      "title": "Breaking down dogwifhat’s 13% surge – Can WIF flip $1?",
      "link": "https://ambcrypto.com/breaking-down-dogwifhats-13-surge-can-wif-flip-1/",
      "summary": "<img alt=\"Dogwifhat\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-36.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />dogwifhat rallies to hit a monthly high of $0.982 amid soaring demand. What next?"
    },
    {
      "title": "‘98% of altcoins outperformed Bitcoin in the last 48 hours’ – Altcoin season underway?",
      "link": "https://ambcrypto.com/98-of-altcoins-outperformed-bitcoin-in-the-last-48-hours-altcoin-season-underway/",
      "summary": "<img alt=\"&#039;98% of altcoins outperformed Bitcoin in the last 48 hours&#039; - Altcoin season underway?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-2-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can the mini altcoin season be a precursor to a larger, more significant one?"
    },
    {
      "title": "Dogecoin forms ‘cup and handle’ – Watch THESE levels closely!",
      "link": "https://ambcrypto.com/dogecoin-forms-cup-and-handle-watch-these-levels-closely/",
      "summary": "<img alt=\"DOGE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-10T140054.748-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Dogecoin’s bullish momentum builds as buyers return and derivatives activity surges."
    }
  ]
}