{
  "CoinDesk": [
    {
      "title": "Bitcoin Bounces to $106K After Iran-Israel Jitters, but Analysts Warn of Deeper Pullback",
      "link": "https://www.coindesk.com/markets/2025/06/13/bitcoin-bounces-to-106k-after-iran-israel-jitters-but-analysts-warn-of-deeper-pullback",
      "summary": ""
    },
    {
      "title": "SUI Drops 10% to $3.02, but Is a Turnaround Forming After Buyers Step In Near $3?",
      "link": "https://www.coindesk.com/markets/2025/06/13/sui-drops-10-to-usd3-02-but-is-a-turnaround-forming-after-buyers-step-in-near-usd3",
      "summary": ""
    },
    {
      "title": "Weekly Recap: Milestones Galore for Stablecoins",
      "link": "https://www.coindesk.com/news-analysis/2025/06/13/weekly-recap-milestones-galore-for-stablecoins",
      "summary": ""
    },
    {
      "title": "Solana's SOL Falls 8% to $147 Despite Standard Chartered’s $275 Year-End Target",
      "link": "https://www.coindesk.com/markets/2025/06/13/solana-s-sol-falls-8-to-usd147-despite-standard-chartered-s-usd275-year-end-target",
      "summary": ""
    },
    {
      "title": "ADA Drops 6% as Cardano Community Debates $100M Stablecoin Liquidity Proposal",
      "link": "https://www.coindesk.com/markets/2025/06/13/ada-drops-6-as-cardano-community-debates-usd100m-stablecoin-liquidity-proposal",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "7 Solana ETF hopefuls file S-1s, but more ‘back and forth’ with SEC ahead",
      "link": "https://cointelegraph.com/news/solana-etf-issuers-file-s1-sec-discussions-continue-etf-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTQ3OTQtYzcwZi03NGY5LWEzZjAtMzc0ZDBhMTlkZTlm.jpg\" /></p><p>ETF analyst James Seyffart said all of the updated S-1 filings \"include staking language I believe.\"</p>"
    },
    {
      "title": "ETH price trend data suggests all future dips are for buying",
      "link": "https://cointelegraph.com/news/eth-price-trend-data-suggests-all-future-dips-are-for-buying?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzZhMWYtNDUyYi03MmZhLTg4ZDMtNGMzY2E3NTYzZmE1.jpg\" /></p><p>Technical data and ETH accumulation trends suggest price dips in the $2,100 zone are strategic purchasing opportunities.</p>"
    },
    {
      "title": "Former Blockchain exec joins SEC as director of trading and markets",
      "link": "https://cointelegraph.com/news/former-blockchain-exec-joins-sec?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzZhM2ItNWFiNS03ZTgyLTgyMTUtZTU0OTM5YjllYjk4.jpg\" /></p><p>The former global head of institutional markets for Blockchain.com and a partner at a Washington, DC-based law firm will be the latest additions to SEC staff.</p>"
    },
    {
      "title": "Bitcoin price breakout to $119K possible if oil rally pattern holds",
      "link": "https://cointelegraph.com/news/bitcoin-price-rebound-oil-rally-setup-119k-target?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzZhOWEtOTI2Ny03MmNlLWJkMzMtMjBmNDJlMDAxNTQy.jpg\" /></p><p>Data shows that Bitcoin's price gained at least 16% within a week of sharp oil price rallies.</p>"
    },
    {
      "title": "SEC, Ripple file motion to release $125M in escrow as case winds down",
      "link": "https://cointelegraph.com/news/sec-ripple-motion-release-125-million-case-winds-down?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzZhOTAtZmVkNy03MGE1LTg3ZjctMGUxOWRmYmExMGQy.jpg\" /></p><p>The lawsuit against Ripple, filed by the United States Securities and Exchange Commission in December 2020, is finally wrapping up.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin holds steady at $105k despite escalating tensions between Iran, Israel",
      "link": "https://cryptoslate.com/bitcoin-holds-steady-at-105k-despite-escalating-tensions-between-iran-israel/",
      "summary": "<p>Bitcoin (BTC) remained near the $105,000 mark on June 13, a sign of relative resilience following a sharp dip triggered by escalating conflict between Israel and Iran. As of press time, Bitcoin was trading at $105,600, having recovered the previous night&#8217;s pullback to end the day down 0.11% over the past 24 hours. The turbulence [&#8230;]</p> <p>"
    },
    {
      "title": "Anthony Pompliano planning $750 million Bitcoin-focused investment firm via SPAC",
      "link": "https://cryptoslate.com/anthony-pompliano-planning-750-million-bitcoin-focused-investment-firm-via-spac/",
      "summary": "<p>Morgan Creek Digital Assets co-founder and crypto influencer Anthony Pompliano is preparing to launch a new Bitcoin-focused investment vehicle that aims to raise $750 million through a merger with Columbus Circle Capital 1, the Financial Times reported on June 13, citing people familiar with the matter. The new entity, called ProCapBTC, will reportedly secure $500 [&#8230;]</p> <p>"
    },
    {
      "title": "Tornado Cash support: Ethereum Foundation pledges $1M to Storm’s defense, entities boost Pertsev appeal",
      "link": "https://cryptoslate.com/tornado-cash-support-ethereum-foundation-pledges-1m-to-storms-defense-entities-boost-pertsev-appeal/",
      "summary": "<p>Tornado Cash developers Roman Storm and Alexey Pertsev received renewed support from the crypto community on their respective trials for deploying the open-source code behind the mixer. The Ethereum Foundation on June 12 donated $500,000 to Tornado Cash developer Roman Storm’s legal defense. It said it will match another $750,000 from public contributors as the [&#8230;]</p> <p>"
    },
    {
      "title": "Spot Ethereum ETFs register new inflow record with 19-day streak, capturing nearly $1.4 billion",
      "link": "https://cryptoslate.com/spot-ethereum-etfs-register-new-inflow-record-with-19-day-streak-capturing-nearly-1-4-billion/",
      "summary": "<p>Spot Ethereum exchange-traded funds (ETFs) listed in the US set a new record by attracting net inflows for 19 consecutive trading sessions between May 16 and June 12, adding almost $1.4 billion. According to Farside Investors’ data, the streak began with $35 million on May 16, passed $1 billion on May 29, and reached $1.38 [&#8230;]</p> <p>"
    },
    {
      "title": "Invesco and Galaxy chase Solana ETF dream with Delaware trust registration",
      "link": "https://cryptoslate.com/invesco-and-galaxy-chase-solana-etf-dream-with-delaware-trust-registration/",
      "summary": "<p>Invesco and Galaxy Digital have taken a concrete step toward bringing a Solana exchange-traded fund (ETF) to the US market. Public records show that the firms registered a trust named Invesco Galaxy Solana ETF with Delaware&#8217;s Division of Corporations on June 12. Over the past months, several firms have created Delaware statutory trusts before seeking [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Following ABCD Pattern? Analyst Sees Path To $137,000",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-following-abcd-pattern-analyst-sees-path-to-137000/",
      "summary": "Brewing tensions between Israel and Iran have triggered global de-risking across risk-on assets, including Bitcoin (BTC). The top cryptocurrency by market cap is down 1.7% over the past 24 hours. That said, technical indicators still point toward a potential new all-time high (ATH) for BTC in the coming months. Bitcoin Tracing The ABCD Pattern According to a recent post on X by crypto analyst Titan of Crypto, BTC appears to be following the ABCD pattern. The analyst noted that Bitcoin is currently trading within a wedge formation and could target as high as $137,000 if it breaks out. For the uninitiated, the ABCD pattern is a classic chart setup with four points and three legs &#8211; AB, BC, and CD &#8211; where AB and CD are typically equal in length, and BC serves as the retracement. It helps identify potential reversal zones and signals when a price move may be losing momentum. Related Reading: Bitcoin Sees Negative Funding On Binance – A Classic Setup For A Short Squeeze? Several other technical indicators also point to a potential new ATH for BTC. For instance, crypto analyst Crypto Caesar shared the following 4-hour Bitcoin chart highlighting a bullish double bottom pattern that suggests BTC is primed for recovery. Fellow crypto commentator Jelle identified a cup and handle pattern on the daily BTC chart. Jelle shared the following chart showing that BTC has already formed the &#8220;cup&#8221; and is now beginning to shape the &#8220;handle,&#8221; which typically precedes a sharp upward move. Meanwhile, crypto trader Merlijn the Trader pointed to the Hash Ribbons &#8211; an on-chain indicator historically associated with major rallies. Merlijn shared the following BTC daily chart, noting that the last four appearances of this signal preceded strong Bitcoin uptrends. To explain, Hash Ribbons is an on-chain indicator that uses Bitcoin’s 30-day and 60-day hash rate moving averages (MA) to spot miner capitulation and recovery. A bullish signal appears when the short-term average crosses above the long-term one. Are BTC Bears Regaining Ground? Although BTC remains above the psychologically important $100,000 mark, some concerning signs are beginning to emerge. The cryptocurrency was recently rejected from the $110,000 resistance level again, giving bears temporary control. Related Reading: Bitcoin’s Most Reliable Signal Just Flashed—Next Stop: $170,000 Similarly, on-chain data shows that long-term holders are beginning to exit the Bitcoin market which retail investors are starting to join in. Such dynamics are typically observed during the late phase of a bull cycle. In parallel, short-term holders are showing signs of declining confidence in BTC, as reflected in recent on-chain activity. At the time of writing, BTC trades at $105,568, down 1.7% over the past 24 hours. Featured image with Unsplash, charts from X and TradingView.com"
    },
    {
      "title": "A Rare Bitcoin Signal Is Flashing: Could the Bull Run Just Be Getting Started?",
      "link": "https://www.newsbtc.com/bitcoin-news/a-rare-bitcoin-signal-is-flashing-could-the-bull-run-just-be-getting-started/",
      "summary": "Bitcoin&#8217;s market price has experienced renewed downward pressure, falling to just under $106,000 in the last 24 hours. This marks a 1.8% dip over the past day and places the asset approximately 6% below its all-time high of over $111,000 reached last month. While the correction is not severe compared to historical volatility, it highlights ongoing uncertainty in the market as BTC consolidates near record highs without sustained upward momentum. One metric drawing attention amid this price movement is the Puell Multiple, a tool used to evaluate whether Bitcoin is overvalued or undervalued relative to miner income. Related Reading: Bitcoin’s Most Reliable Signal Just Flashed—Next Stop: $170,000 Bitcoin Puell Multiple Suggests Miner Revenues Have Yet to Catch Up CryptoQuant analyst Gaah highlighted that while prices recently surged above $108,000, the Puell Multiple remains below 1.40, a level typically associated with discounted or non-euphoric market phases. This decoupling between BTC price and miner revenue offers insight into how recent gains may be more demand-driven than organically supported by on-chain mining fundamentals. The Puell Multiple measures the daily issuance of BTC in USD terms relative to its 365-day moving average. Historically, readings below 1.0 are seen during market bottoms or accumulation phases, indicating undervaluation. Gaah points out that current readings hovering around 1.40 suggest miner profitability is still lagging, even as the asset trades near historic highs. This pattern contrasts with previous bull cycles where high prices were often accompanied by elevated miner earnings, driven by both network activity and block rewards. This disparity may be due in part to the April 2024 Bitcoin halving event, which reduced block rewards from 6.25 BTC to 3.125 BTC per block. While halving events typically drive price appreciation through reduced supply, they simultaneously put downward pressure on miner revenue. In this case, despite a climb in market price, the halving’s impact continues to suppress income for miners, implying that the price increase has not yet been accompanied by the kind of broader economic expansion that would traditionally drive a full-fledged bull market. Potential for Continued Growth as Institutional Forces Drive Demand Gaah also points to the possibility that external factors may be playing a more dominant role in driving recent price action. These include increasing institutional inflows through spot Bitcoin ETFs, as well as a tighter circulating supply as long-term holders reduce active selling. These forces could be supporting price without necessarily boosting miner profitability in the short term, especially if the uptick is concentrated in secondary market demand rather than new BTC issuance. The current environment may signal a unique window for participants analyzing Bitcoin&#8217;s valuation. A high market price combined with conservative fundamentals suggests the market is not yet in a speculative excess phase. Related Reading: Bitcoin Bears Back In Control After $110,000 Rejection, What Comes Next? If miner revenues eventually rise in line with growing demand, driven by either increased transaction fees or broader network usage, it could support further upside. As such, both technical and fundamental indicators may continue to evolve in the coming months, offering a clearer view of whether the current cycle has more room to run. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "XRP Has A 70% Shot To Beat Bitcoin, Says Analyst",
      "link": "https://www.newsbtc.com/xrp-news/xrp-70-shot-to-beat-bitcoin-says-analyst/",
      "summary": "A fresh XRP/BTC chart released on 12 June by the market technician known as Dr. Cat has injected new controversy into one of crypto’s most stubborn trading pairs. The analyst, posting to X, argues that despite a bruising six-week slide, conditions still favour an eventual breakout for XRP that would leave Bitcoin lagging. He assigns the scenario a formidable 70 percent probability. XRP Vs. Bitcoin: 70% Chance Of Breakout, But When? At the heart of Dr. Cat’s thesis is the 2,041-satoshi level, where three separate Ichimoku timeframes—monthly, bi-monthly and tri-monthly—intersect. “The price keeps eating support after support with no reaction from bulls at all as if supports don’t exist,” he concedes, but he stresses that this specific shelf is “the most important support.” Related Reading: XRP Could Crash To $1.55 Before Explosive Surge, Analyst Warns Candles on the attached one-month chart already hover fractionally below the line; a decisive monthly close beneath it, he warns, would flip the three-day structure fully bearish and scatter the pair into unpredictable, possibly chaotic ranges. Even so, the strategist insists history is on the side of XRP bulls. “Price has spent years performing very well and coiling up with higher lows for this attack now,” he writes, framing the past twelve quarters as a prolonged accumulation that has never surrendered its series of macro higher lows. That coiling, he believes, will allow XRP to mount at least a “minor … attack in August” toward the 3,000-satoshi region—roughly a 45 percent appreciation from current levels—and perhaps fuel a &#8220;much bigger attack&#8221; once the broader market cycle matures. Related Reading: XRP Price Forms Flag Pattern Above Accumulation Zone That Points To $5 Target The optimism is not unqualified. Dr. Cat calculates a 30 percent chance of a complete flop if 2,041 sats fails on a monthly-close basis. Under that bearish branch, the cross could slice toward 1,800 – 1,900 sats, attempt a feeble rebound, or continue a “slow bleed all the way down to the bottom of the range where it started the monster move.” In such a setback, he would not expect the long-anticipated “monster bullish move” until Q4 2025 at the earliest. For the moment, therefore, the market hangs on a single number. Hold above 2,041 and Dr. Cat sees a clear shot at outperforming Bitcoin—first modestly, then dramatically. Slip beneath it, and the road map dissolves into what he bluntly calls an “unpredictable/choppy” expanse. Either way, XRP traders now know exactly where the cycle’s pivot resides and precisely how thin the margin for error has become. At press time, XRP traded at $2.1287. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Shiba Inu Goes Serious: Shib Alpha Layer Marks End Of Meme Era",
      "link": "https://www.newsbtc.com/shiba-inu/meme-label-is-dead-shiba-inu-makes-big-move-into-serious-crypto/",
      "summary": "The Shiba Inu development crew has rolled out a new tech layer that could shift how people use SHIB. According to reports, the beta version of Shib Alpha Layer went live on June 12, 2025. It’s made in partnership with ElderLabs, and it got built without any VC backing. Now users can test it before the full launch. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Shib Alpha Layer Beta Launch Based on reports, the Shib Alpha Layer brings all the separate rollups in the ecosystem under one hood. You won’t need to jump from bridge to bridge. You transact as if you’re on a single chain, even though dozens of rollups run beneath the surface. The project reached beta in record time, and the team says they did it all with their own funds. User Friendly Experience Users can pay fees in SHIB, BONE, or any token they hold. That cuts out the problem of having to swap tokens just to cover gas. You’ll also get near‑instant finality, so transactions show up almost right away. Those features may seem small, but they could pull in people who find current rollup setups clunky and slow. Shiba Inu: Security And Privacy Features Shib Alpha Layer uses ZAMA’s Fully Homomorphic Encryption. That lets smart contracts run on encrypted data, so the logic stays private. It’s rare to see FHE live in a crypto network, but the beta is already up and running. Security audits have been promised before the public release, which should ease some worries about bugs or hacks. Today we flip the script. For years we’ve been called “just a meme,” spammed with Wen Shibarium?, and drowned in FUD from bots, burnt deadweight ex-team but instead of arguing, we shipped. Introducing Shib Alpha Layer (beta) — our rollup abstraction stack built with ElderLabs… — Kaal (@kaaldhairya) June 12, 2025 Integration With Shibarium Shibarium is set as the settlement layer under this new system. According to lead developer Kaal Dhairya, every rollup becomes an L3 network, picking up the security that Shibarium offers. Future updates will open up rollup deployment to everyone and boost multi‑chain links. Instant bridging is on the roadmap, too, so moving assets between chains could happen in a click. READ THIS: https://t.co/zZcjV0VhHv — Shytoshi Kusama™ (@ShytoshiKusama) June 13, 2025 The team’s main coder, Kaal Dhairya, pointed out that early critics called SHIB a joke coin. They’d ask “Wen Shibarium?” and spread fear, uncertainty and doubt. He said those jibes didn’t slow them down. Instead, they focused on building. Related Reading: Bitcoin Is Just 0.2% Of Global Wealth — And That’s Why It’s Not Too Late: Analyst Shytoshi Kusama, another lead developer, popped back on X after a few weeks off to highlight this work. He’s been drafting a whitepaper on how AI could team up with the Shiba Inu network. He also flagged Shiba’s new Web3 gaming push on Astra Nova’s TokenPlay.ai. Calling an end to SHIB’s “meme era” is a bold claim. But if the new layer works smoothly, it could mark a shift in how people think about Shiba Inu. Either way, June 12, 2025, will go down as the day this project vied for more than just the dog coin tag. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Solana Approaches Critical Support Amid Middle East Conflicts – Can Demand Hold?",
      "link": "https://www.newsbtc.com/news/solana/solana-approaches-critical-support-amid-middle-east-conflicts-can-demand-hold/",
      "summary": "After a volatile but bullish start to June, Solana (SOL) is now facing strong selling pressure amid rising global uncertainty. The sudden escalation in the Middle East—triggered by Israel’s recent strike on Iran—has sparked market-wide volatility, prompting a flight to safety and a pullback across risk assets. Solana, which had been showing momentum alongside Bitcoin and Ethereum, has dropped over 15% since June 11, erasing much of its early-month gains. Related Reading: Ethereum Repeats History – Key Support Holds Again Ahead Of Potential Rally As macro risks continue to rise, the altcoin market remains vulnerable to further downside. SOL is now approaching a critical technical level, and a breakdown could signal deeper losses if global tensions persist. Top analyst Cheds shared a technical analysis revealing that Solana is now re-testing a key daily demand zone, a level that previously supported bullish continuation. If this area fails to hold, Solana could revisit lower support levels seen earlier this year. For now, traders are watching closely to see if buyers step in to defend the zone or if further conflict will fuel more risk-off behavior. The next few days will be critical in determining whether SOL can bounce or if the broader market downturn intensifies. Solana Re-Tests Key Support As Market Tensions Mount Solana is standing below key levels, retracing after a brief rally attempt earlier this week. The asset had spent several days consolidating beneath the $170 level, failing to break above resistance as selling pressure intensified amid rising global tensions. Now, with the broader market on edge following the Israel–Iran conflict escalation, SOL finds itself back at a critical support zone. Bulls remain cautiously optimistic, encouraged by the broader market’s resilience and the potential for Bitcoin and Ethereum to regain strength. However, caution dominates sentiment as Solana, like most altcoins, still trades significantly below its all-time high near $260. The current environment of geopolitical risk and macroeconomic uncertainty has suppressed momentum in the altcoin space, making support levels all the more important. Cheds highlighted in a recent update that Solana is now re-testing a key daily demand zone around the $145 level. This zone has previously acted as a launchpad for bullish moves, and holding above it could provide the structure needed for a new leg higher. However, failure to maintain this level might open the door for further downside, with the next major support below $130. For now, all eyes are on how Solana reacts around $145. A solid bounce with increased volume could attract short-term buyers looking to ride a potential recovery. But with global markets rattled by uncertainty, the coming sessions will be crucial in determining whether this demand zone becomes a springboard—or a trapdoor. Related Reading: Ethereum Tests Previous Resistance As Support – Can Bulls Defend This Level? SOL Price Analysis: Re-Test of Support as Volatility Spikes Solana is currently trading at $145.24 after an aggressive drop from the $165–$170 range. The 4-hour chart shows a clear breakdown below all key moving averages (50, 100, and 200), which had previously served as dynamic support. The red 200 SMA at $165.33 now acts as overhead resistance, capping short-term recovery attempts. The recent sell-off—triggered by broader geopolitical tensions in the Middle East—pushed SOL straight into a key demand zone around $143–$145, where buyers have historically stepped in. The long lower wick from today’s candle reflects strong intraday buying at these levels, suggesting that some participants see this as a value zone. However, volume remains elevated, and the structure appears fragile. Any failure to hold $145 could open the door to a deeper retracement toward the $130 region. On the flip side, reclaiming the 100 SMA at $157.46 would be an early sign of renewed bullish momentum. Related Reading: Solana Forms Higher Low: Charging Toward Range Highs? Momentum indicators likely remain oversold, and if the broader market stabilizes, this level could mark a temporary bottom. Still, with volatility high and macro uncertainty looming, traders may want to stay cautious until a clear direction emerges. For now, $145 is the line in the sand. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Layer 2: Statechains",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Statechains-fotor-20250613161023.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains\" rel=\"nofollow\"> </a></p> <p>The second article in the Bitcoin Layer 2 series. This article covers Statechains, originally designed by Ruben Somsen, and implemented by CommerceBlock.</p> <p>"
    },
    {
      "title": "Pakistan’s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?",
      "link": "https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Pakistan-Bitcoin-Reserve.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation\" rel=\"nofollow\">Pakistan&#8217;s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?</a></p> <p>A strategic Bitcoin reserve is a step in the right direction for Pakistan, but only mass adoption will truly unlock the immense potential Bitcoin can offer.</p> <p>"
    },
    {
      "title": "The 30,000-Foot View of the Oslo Freedom Forum",
      "link": "https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Oslo-Freedom-Forum.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum\" rel=\"nofollow\"> </a></p> <p>Stories of courage and repression, and the tools defending civil liberties at the 17th Annual Oslo Freedom Forum in Norway.</p> <p>"
    },
    {
      "title": "UK Gold Mining Company Bluebird to Convert Gold Revenues into Bitcoin",
      "link": "https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/UK-Gold-Mining-Company-Bluebird-to-Convert-Gold-Revenues-into-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bluebird Mining Ventures Ltd. will adopt bitcoin as a treasury reserve asset and convert future gold revenues into Bitcoin.</p> <p>"
    },
    {
      "title": "JPMorgan Reports Record Profits for Bitcoin Miners in Q1",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-MORGAN.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1\" rel=\"nofollow\"> </a></p> <p>Bitcoin mining companies in the U.S. have kicked off 2025 with record performance, according to a recent report. The first quarter of the year was “one of Bitcoin miners&#8217; best quarters to date,” analysts Reginald Smith and Charles Pearce stated.&#160; &#8220;Four of the five operators in our coverage reported record revenue and profits,&#8221; the report [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "How Will the Israel-Iran Conflict End? Here's What AI Models Predict",
      "link": "https://decrypt.co/325190/how-israel-iran-conflict-end-ai-models-predict",
      "summary": "We asked seven leading AI models to analyze the most plausible scenario for how the conflict between Israel and Iran will play out."
    },
    {
      "title": "Solana ETF Applicants Submit Updated SEC Filings With Staking",
      "link": "https://decrypt.co/325234/solana-etf-applicants-updated-sec-filings-staking",
      "summary": "Prospective Solana ETF issuers in the United States submitted updated SEC filings Friday, suggesting approvals may be near."
    },
    {
      "title": "Public Keys: Circle Keeps Surging, GameStop's Bitcoin 'Black Box', Ethereum Treasury Tanks",
      "link": "https://decrypt.co/325150/public-keys-circle-gamestop-bitcoin-ethereum-treasury-tanks",
      "summary": "Circle’s stock soared again while GameStop shares swooned—but SharpLink Gaming’s fall takes the cake on a busy week."
    },
    {
      "title": "Bitcoin Treasury Firm GameStop Boosts Convertible Bond Offering to $2.25 Billion",
      "link": "https://decrypt.co/325182/gamestop-upsizes-convertible-bond-offering-2-5-billion",
      "summary": "Shares fell earlier this week after the Texas-based video game retailer announced plans to offer $1.75 billion in convertible bonds."
    },
    {
      "title": "Elizabeth Warren, Consumer Groups Slam Walmart and Amazon Stablecoin Plans",
      "link": "https://decrypt.co/325178/elizabeth-warren-consumer-groups-slam-walmart-amazon-stablecoin-plans",
      "summary": "Retailers Amazon and Walmart are considering issuing their own stablecoins, according to a Friday report in the Wall Street Journal."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Invesco, Galaxy Digital file to launch Solana ETF in Delaware amid SEC approval buzz",
      "link": "https://cryptobriefing.com/solana-etf-sec-approval/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional interest and investment in the Solana blockchain ecosystem.</p> <p>"
    },
    {
      "title": "Cardano founder Charles Hoskinson proposes converting $100M ADA to Bitcoin and stablecoins",
      "link": "https://cryptobriefing.com/cardano-treasury-conversion-proposal/",
      "summary": "<p>Hoskinson's proposal could enhance Cardano's DeFi competitiveness, potentially increasing its market share and attracting more developers.</p> <p>"
    },
    {
      "title": "Amazon, Walmart, and Expedia consider issuing stablecoins to sidestep costly card fees: WSJ",
      "link": "https://cryptobriefing.com/retailers-embrace-stablecoins/",
      "summary": "<p>Retailers' stablecoin adoption could revolutionize payment systems, enhance cash flow, and challenge traditional financial networks.</p> <p>"
    },
    {
      "title": "Bitcoin slides, gold spikes after Israel strikes Iran, Israeli PM warns campaign will last as many days as needed",
      "link": "https://cryptobriefing.com/crypto-market-volatility-israel-iran/",
      "summary": "<p>Geopolitical tensions may drive investors to traditional safe-haven assets, impacting cryptocurrency markets and regional economic stability.</p> <p>"
    },
    {
      "title": "$USD1 stablecoin begins minting on TRON",
      "link": "https://cryptobriefing.com/usd1-stablecoin-minting-on-tron/",
      "summary": "<p>The minting of USD1 on TRON could enhance institutional trust and adoption, bolstering TRON's position in the global blockchain market.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin ETF inflows explode $970 mln: Will BTC ride this wave to more gains?",
      "link": "https://ambcrypto.com/bitcoin-etf-inflows-explode-970-mln-will-btc-ride-this-wave-to-more-gains/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-13T130432.842-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Institutional inflows spike, but weakening fundamentals raise questions about Bitcoin’s short-term strength."
    },
    {
      "title": "FLOKI bleeds 32% this month: 3 alarming indicators emerge",
      "link": "https://ambcrypto.com/floki-bleeds-32-this-month-3-alarming-indicators-emerge/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250613_095424_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can a metaverse Hail Mary save FLOKI from the brink?"
    },
    {
      "title": "Aptos blockchain development booms, but APT dips 8% – Is THIS why?",
      "link": "https://ambcrypto.com/aptos-blockchain-development-booms-but-apt-dips-8-is-this-why/",
      "summary": "<img alt=\"Aptos blockchain development booms, but APT bleeds - Is THIS why?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-13T123149.069-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite rising developer and DEX activity, APT struggles to gain momentum near key support."
    },
    {
      "title": "Bitcoin drops to $104K: Can $3.3B in inflows spark BTC’s reversal?",
      "link": "https://ambcrypto.com/bitcoin-drops-to-104k-can-3-3b-in-inflows-spark-btcs-reversal/",
      "summary": "<img alt=\"BTC drops to $104K: Is $3.3B in inflows enough to spark a reversal?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-13T143639.869-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite rejection near $112K, long-term holders show conviction as accumulation hits record $3.3B."
    },
    {
      "title": "Bitcoin to $1M? Galaxy’s Novogratz says adoption wave could trigger 10x rally",
      "link": "https://ambcrypto.com/bitcoin-to-1m-galaxys-novogratz-says-adoption-wave-could-trigger-10x-rally/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"885\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Will-BTC-actually-hit-1M.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1574\" />Is Bitcoin’s $1M dream closer than we think or is bearish pressure hiding around the corner?"
    }
  ]
}