{
  "CoinDesk": [
    {
      "title": "AAVE Surges to 3-Week High, Dominating Soaring $56B DeFi Lending Market",
      "link": "https://www.coindesk.com/markets/2025/07/08/aave-surges-to-3-week-high-dominating-soaring-56b-defi-lending-market",
      "summary": ""
    },
    {
      "title": "Bitcoin Bull Mulls Different Kind of Corporate Treasury Strategy as Prices Continue on Hold",
      "link": "https://www.coindesk.com/markets/2025/07/08/bitcoin-bull-mulls-different-kind-of-corporate-treasury-strategy-as-prices-continue-on-hold",
      "summary": ""
    },
    {
      "title": "Polygon’s Token Gains 3% After Seeing ‘Exceptional’ Trading Volume",
      "link": "https://www.coindesk.com/markets/2025/07/08/polygon-s-matic-gains-3-after-seeing-exceptional-trading-volume",
      "summary": ""
    },
    {
      "title": "Ether Treasury Firm BTCS Surges 100% on $100M ETH Buying Plan",
      "link": "https://www.coindesk.com/markets/2025/07/08/ether-treasury-firm-btcs-surges-100-on-100m-eth-buying-plan",
      "summary": ""
    },
    {
      "title": "Tornado Cash Judge Will Not Permit Van Loon Verdict to Be Discussed During Upcoming Trial",
      "link": "https://www.coindesk.com/policy/2025/07/08/tornado-cash-judge-will-not-permit-van-loon-verdict-to-be-discussed-during-upcoming-trial",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "$31B stablecoin surge at Binance revives traders’ altseason hopes",
      "link": "https://cointelegraph.com/news/dollar31b-stablecoin-surge-at-binance-revives-traders-altseason-hopes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VhNDYtY2Q1NC03NjQxLWE1YmQtM2FiODAxMjI4MmYz.jpg\" /></p><p>Soaring stablecoin reserves at Binance, falling Bitcoin dominance and a bullish chart pattern point to a possible altseason starting in the bottom half of 2025.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "BioSig, Streamex target gold tokenization with $1.1B financing",
      "link": "https://cointelegraph.com/news/biosig-streamex-financing-commodities-gold-tokenized?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ViY2UtNzZhZS03NGE0LTg3NTMtNTViNmM4NjZhZmFm.jpg\" /></p><p>With eyes on tokenized gold, the companies plan to merge and launch a gold-backed treasury business.</p>"
    },
    {
      "title": "SOL futures funding rate turns negative: Is $180 the next stop?",
      "link": "https://cointelegraph.com/news/sol-futures-funding-rate-turns-negative-is-180-the-next-stop?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ViYTgtMjlkNi03MTI1LWI5ZGUtYmJiZDk3NWIyODNh.jpg\" /></p><p>Blockchain competitors and recent decisions by institutional investors chip away at Solana’s market share. Will this impact SOL price?</p>"
    },
    {
      "title": "Judge signals Tornado Cash sanctions may be barred from Roman Storm trial",
      "link": "https://cointelegraph.com/news/roman-storm-judge-tornado-cash-sanctions?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzZhZDUtMjgzNS03OTIyLWEzNjQtOWNlNTFmMjhkMjVj.jpg\" /></p><p>The judge reportedly said she would not be inclined to have attorneys bring up the US Treasury’s 2022 sanctions against Tornado Cash after they were withdrawn in March.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Joe Lubin forecasts Ethereum treasury strategies will reshape Wall Street perception",
      "link": "https://cryptoslate.com/joe-lubin-forecasts-ethereum-treasury-strategies-will-reshape-wall-street-perception/",
      "summary": "<p>Ethereum and Consensys co-founder Joe Lubin said companies adopting ETH treasury strategies will play a critical role in communicating the second-largest digital asset&#8217;s value to Wall Street, as major financial institutions ramp up blockchain use and process around 24 million transactions daily. Lubin made the statement during an interview with CNBC on July 8 in [&#8230;]</p> <p>"
    },
    {
      "title": "Stablecoin issuers’ $182 billion US Treasury hoard ranks 17th among countries, beating UAE and South Korea",
      "link": "https://cryptoslate.com/stablecoin-issuers-182-billion-us-treasury-hoard-ranks-17th-among-countries-beating-uae-and-south-korea/",
      "summary": "<p>Four US-dollar stablecoin issuers hold roughly $182 billion in US Treasury bills, an amount that would slot them 17th on the Treasury Department’s country-by-country league table. The amount in overnight Treasury-collateralized repos and Treasury-heavy money market funds would put the group between Norway’s $195.9 billion and Saudi Arabia’s $133.8 billion. Tether&#8217;s USDT tops the cohort. [&#8230;]</p> <p>"
    },
    {
      "title": "Volkswagen ADMT chooses Solana-based Hivemapper to power Robotaxi test fleet",
      "link": "https://cryptoslate.com/volkswagen-admt-chooses-solana-based-hivemapper-to-power-robotaxi-test-fleet/",
      "summary": "<p>Volkswagen ADMT, the automaker’s autonomous-driving subsidiary, will source real-time street-level data from Bee Maps, a spatial intelligence service that runs on Hivemapper’s Solana-based mapping network. According to Hivemapper CEO Ariel Seidman, the partnership “shifts mapping from static to living,” and that robotaxi fleets require data “that evolves as fast as the streets do.” Bee Maps [&#8230;]</p> <p>"
    },
    {
      "title": "SharpLink stock continues surging as treasury tops 200k Ethereum",
      "link": "https://cryptoslate.com/sharplink-stock-continues-surging-as-treasury-tops-200k-ethereum/",
      "summary": "<p>SharpLink Gaming shares surged nearly 26% on July 8 after the Minneapolis-based online gaming company revealed a major expansion of its crypto treasury, bringing its total Ethereum (ETH) holdings to over 200,000 coins. The company announced it had purchased an additional 7,689 ETH for approximately $19.2 million at an average price of $2,501 per coin. [&#8230;]</p> <p>"
    },
    {
      "title": "The capital migration that could reshape finance",
      "link": "https://cryptoslate.com/the-capital-migration-that-could-reshape-finance/",
      "summary": "<p>The following is a guest post and opinion from Patrick Heusser, Head of Lending &#38; TradFi at Sentora. Capital is undergoing a structural reallocation. What once sat securely in fractional-reserve bank accounts is now increasingly flowing into fully funded, blockchain-based financial systems. From stablecoins like USDC and USDT to tokenized T-bills, institutional and retail capital [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum ETF Inflows Hit 8-Week Streak—Institutions Still Buying",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-etf-inflows-8-streak-institutions-buying/",
      "summary": "Data shows the US Ethereum spot ETFs have seen net inflows for eight consecutive weeks now, a sign of continued institutional demand. Ethereum Spot ETF Netflow Remains Positive In a new post on X, the on-chain analytics firm Glassnode has shared an update on how the weekly netflow for the US spot exchange-traded funds (ETFs) of Ethereum has been looking. Spot ETFs refer to investment vehicles that allow investors to gain exposure to an asset without having to directly own it. These ETFs trade on the traditional platforms, so they allow for an easier investment method for those who find cryptocurrency exchanges and wallets overwhelming to navigate. Related Reading: Dogecoin Resistance Walls Ahead: Analyst Flags 3 Key Levels Below is the chart shared by the analytics firm that shows how the American Ethereum spot ETFs have been doing lately: From the graph, it&#8217;s visible that the netflow related to the Ethereum spot ETFs has recently been on a green streak. This means that inflows into wallets attached to the ETFs are continuously happening. Last week saw a net inflow of 61,000 ETH, worth $157.3 million at the current exchange rate. With these inflows, the spot ETFs of the cryptocurrency have seen positive values for eight straight weeks. Since institutional investors generally take this investment route into Ethereum, the continuous inflows could be a sign of sustained demand from them. Despite this interest, the ETH price has remained locked in a phase of sideways movement. Ethereum isn&#8217;t the only asset that&#8217;s observing demand on the ETFs. As the on-chain analytics firm Santiment has pointed out in an X post, Bitcoin has also been enjoying net inflows. As displayed in the above chart, the Bitcoin ETFs have seen a positive netflow on 16 out of the last 17 trading days. The one exception was on July 1st, when outflows occurred. In some other news, Ethereum has observed new on-chain capital inflows during the past week, as Glassnode has revealed in another X post. In the graph, the data for the Realized Cap of coins aged less than 1 week is shown for Ethereum and Solana. The &#8220;Realized Cap&#8221; measures the amount of capital that the investors have put into a given network. The version of the metric of focus here specifically calculates the capital that has come in over the past week. Related Reading: Bitcoin In For Another 460% Run? This Rare Fiat Signal Just Returned From the chart, it&#8217;s visible that the metric has seen an increase for both ETH and SOL during the past week, indicating fresh capital has flowed in. The latter has outperformed the former, however, with the metric standing at $6.2 billion and $8.3 billion, respectively. ETH Price At the time of writing, Ethereum is floating around $2,580, up over 5% in the last week. Featured image from Dall-E, Glassnode.com, Santiment.net, chart from TradingView.com"
    },
    {
      "title": "Last Time This Happened, Bitcoin Jumped $50,000—Is History Repeating?",
      "link": "https://www.newsbtc.com/bitcoin-news/last-time-this-happened-bitcoin-jumped-50000/",
      "summary": "The Bitcoin market appears to be coiling for a major move, according to prominent crypto analyst CrediBull Crypto (@CredibleCrypto), who highlighted today via X that over 80% of all Bitcoin in existence is currently being held by long-term investors—levels of supply constraint previously seen only at major inflection points in Bitcoin’s price history. Why No One’s Selling Bitcoin In his post, CrediBull noted, “The only 2 times in Bitcoin&#8217;s 15 year history that this % was higher was at 43k before a $30,000 impulse to 73k and at 58k before a $50,000 impulse to 105k+.” Drawing on this historical precedent, he concluded that the market is poised for another massive leg up: “When the majority of $BTC total circulating supply is cornered by ‘diamond hands’, price moves up aggressively at the hint of any ‘new’ demand.” With &#8220;excess&#8221; supply now redistributed to long-term holders and institutional entities such as Bitcoin treasury companies increasingly taking the lead, the analyst sees a clear signal: “The next impulse IS IMMINENT. This next one will also likely be even bigger than the last two ($50,000+). Who&#8217;s ready for 150k+ Bitcoin?” Related Reading: 2025’s Biggest Bitcoin Bull Trigger Is Still Hidden, Expert Reveals The optimism is not without a technical underpinning. In a previous post, CrediBull addressed the current market structure and his own Elliott Wave-based scenario planning: “My original count/idea shared a few days ago had us rejecting at range highs above 110k and seeing a pullback down to the BLUE zone at 102k-ish before moving sideways for a few more weeks before the next impulse begins.”However, the analyst acknowledged a significant alternative possibility: “I do still think this scenario is probable, I also recognize that there is a non-zero chance that the next impulse up has already begun (most bullish scenario depicted).” Given the price action and structure, CrediBull argued that the risk-reward profile no longer favors bearish positioning. “In either case, downside is relatively limited on Bitcoin from current levels imo and so focus should be on identifying potential long opps on Bitcoin rather than looking to short clear strength.” Related Reading: Bitcoin’s Liquidity Lifeline Just Got Cut—What You Need To Know He punctuated the point with a rhetorical jab: “Why is it now illegal to short Bitcoin? Because there is a non-zero chance that the next impulse up has already begun.” Adding a layer of technical confirmation, analyst Axel Adler Jr provided a concurrent signal from volatility metrics. Adler pointed to a significant Bollinger Bands squeeze underway, writing: “The range between the upper and lower boundaries has fallen to 7.7%—one of the lowest values throughout the entire bull cycle.” Such compressions in volatility historically precede large directional moves. Adler explained, “The decrease in volatility indicates energy accumulation in the market; the price is ready for a rally, and in an upward trend environment, the chances of an upward breakout are significantly higher.” In the current cycle, Adler has identified six episodes of such squeezes. Four were immediately followed by strong price appreciation, while the remaining two saw brief corrections before continuing upward. The takeaway: “Based on this experience, the current squeeze most likely foreshadows another upward impulse, although a small consolidation before the move is also not ruled out.” With long-term holders now controlling an overwhelming share of supply, bullish technical compression in play, and institutional adoption continuing to absorb circulating coins, the environment CrediBull describes echoes past moments of explosive upside. While nothing is guaranteed, the combination of on-chain metrics and technical indicators suggest Bitcoin’s next chapter may already be beginning—quietly, beneath the surface. At press time, BTC traded at $108,738. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Crash To $92,000 Or New ATHs? Analyst Explains The 2 Options",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-crash-to-92000/",
      "summary": "Bitcoin’s recent price action is holding firm above the $108,000 level despite a string of minor pullbacks in recent trading sessions. Notably, CoinGecko data shows that the Bitcoin price has climbed to an intraday high of $109,116, but it wasn&#8217;t able to hold above and has retreated slightly lower at the time of writing. Volatility has been relatively subdued for Bitcoin above $106,000. However, Doctor Profit, a well-followed crypto analyst, believes Bitcoin is still in a bullish structure, and he outlined two likely paths for the next major move. Bull Flag And Breakout To $130,000 With Retest The first scenario outlined by Doctor Profit involves a breakout to a price level between $113,000 and $114,000, which would take Bitcoin to a new all-time high in the process. However, this all-time high would be very brief. According to this scenario, a sharp correction is expected to follow once Bitcoin reaches this range. Related Reading: Analyst Shares Bitcoin Cheat Sheet Showing When The Bull Run Begins This correction will send the price back down into the $92,000 to $93,000 range to fill a CME gap and tap into a major liquidity pool. Rather than causing panic, the analyst views this move as part of a bullish continuation. This potential retracement zone is clearly marked on Doctor Profit&#8217;s daily candlestick chart with the message “Add more if market allows.” The pullback, if it happens, would serve to reset the market and initiate a bounce before Bitcoin resumes its upward trajectory to $120,000 again. Direct Rally To $120,000 Without Retest The second path skips the correction altogether. In this scenario, Bitcoin breaks through the flag resistance to rally past $113,000. From there, the scenario sees Bitcoin continuing upward without returning to the lower support zones. The move hinges on the ability of Bitcoin to gain momentum rapidly and lead to a strong push toward $120,000. Doctor Profit points out that this option is a more aggressive bullish continuation, and both scenarios are valid for bullish price targets in the long term. Related Reading: Bitcoin Price To See 52% Increase To $166,000, Analyst Reveals Tight Timeline He also debunked fears surrounding the sudden movement of a dormant Satoshi-era whale wallet containing 80,000 BTC. The analyst believes the transfer was likely an over-the-counter deal between a large private entity and an institution or government and not a sign of looming sell pressure. Volatility is going to be very low in the coming days, as there are no macro market events that can cause price volatility. FOMC meeting minutes are due Wednesday, and there are going to be US unemployment claims on Thursday, but both are low-volatility events. Nonetheless, the $113,000 to $114,000 price range is the most important level to watch in both scenarios. What follows from there, a sharp correction or a straight continuation, will define the speed of the next leg to $120,000. At the time of writing, Bitcoin is trading at $108,270. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "PEPE Traders Spot Breakout Echo—Explosive Surge Back On The Table?",
      "link": "https://www.newsbtc.com/altcoin/pepe-traders-spot-breakout-echo-20x-surge-back-on-the-table/",
      "summary": "Based on reports from the trading account Bitcoinensus on X, PEPE has formed a pattern that led to a 10x rally in the past. Now, some chart watchers believe a similar move could push prices even higher—possibly up to 20X the current level. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 Flag And Breakout Signals Drive Hope Traders spot a “flag” shape when price moves sideways after a drop and rise. Bitcoinensus pointed out that PEPE first formed one flag, then shot up from about $0.0000015 to $0.000015—a roughly 10x gain. The chart showed a second flag forming recently, and if PEPE breaks out again, it could mirror that earlier surge. Based on reports, a fresh breakout might send PEPE toward a 20X move from today’s prices. $PEPE Macro Outlook 🔥🚀 PEPE has been repeating the same explosive pattern: 📉 Flag → 📈 Breakout → 📉 Flag → 📈 Breakout So far: Accumulation 1 → 10x Accumulation 2 → Breakout in progress The next big move up will probably lead to the cycle top. History doesn’t… pic.twitter.com/Rqc6KBfWgn — Bitcoinsensus (@Bitcoinsensus) July 7, 2025 Price Targets And Support Levels Tested In a follow‑up post, Solberg Invest on X laid out a bullish short‑term view. Their target sits at $0.000015 if PEPE holds above the key support line at $0.0000102. That level has been tested multiple times in recent weeks, demonstrating some buying interest each time prices approached it. Traders warn that slipping below $0.0000102 could derail hopes for the next big leg up. Triangle Formation Signals Tension A recent chart indicates that PEPE is trading within a triangle pattern. Traders track triangles closely because they can lead to rapid moves following a breakout. Currently, PEPE is wedged at the top of this triangle. When trading volume picks up and the token closes over the old resistance line (indicated in red), it could ignite a new wave of buyers. Community Buzz Keeps Meme Coins Alive Meme tokens survive by social fervor, and PEPE has developed a devoted fan base on sites like X. Meme posts and community-led memes have powered previous rallies, prompting new investors to jump aboard. According to reports, continued buzz might be sufficient to initiate another run at least in the near term. Related Reading: Bitcoin Meets Heartbreak In Drake’s Latest Track—Details Risks And Rewards In Focus Even if history does rhyme, it doesn&#8217;t often repeat itself. Previous runs had PEPE tank just as severely, losing as much as 95% of profits in one session. Gambling on a 20X spike involves taking wild swings and sudden plunges. Anyone considering coming in at $0.0000102 should have in mind exit points and only risk capital that can be safely lost. Featured image from Meta, chart from TradingView"
    },
    {
      "title": "Pundit Explains Why XRP Stands To Gain Big From Ripple’s RLUSD",
      "link": "https://www.newsbtc.com/xrp-news/why-xrp-stands-to-gain-big-from-ripple-rlusd/",
      "summary": "Ripple’s dollar-pegged stablecoin, Ripple USD (RLUSD), has spent the past six months quietly becoming one of the fastest-growing assets in the $160 billion stable-value sector, even though almost all of its issuance still sits on a rival network, not the XRP Ledger. That dichotomy—95 percent of the $455 million supply now lives on Ethereum—was the starting point for a lively weekend exchange on X between XRP pundit “Crypto Eri” and sceptics who questioned whether Ripple’s plans would ever benefit the XRP Ledger (XRPL) itself. XRP’s Hidden Advantage? “Ripple is a long-game player,” Eri wrote. “Its public statements to integrate smart contracts on the mainnet will eventually position RLUSD on XRPL as a more competitive stablecoin, with faster and cheaper settlements than Ethereum.” The remark landed just days after Ripple switched on its EVM-compatible sidechain, bringing full Ethereum-style smart-contract functionality to XRPL on 30 June 2025. More than 1,400 contracts were deployed in the first week, according to developer telemetry, and the bridge is already live to 80 other chains through Axelar. Related Reading: XRP Set To Shock The Crypto Market With 30% Share, Analyst Predicts On-chain data underscore the stakes. RLUSD’s circulating supply rose by 47 percent in June alone to $455 million, the fastest pace among major stablecoins, with roughly $390 million now native to Ethereum after a four-fold expansion since January. Only about $65 million remains on XRPL. That imbalance prompted one user to tell Eri that RLUSD’s utility “impacts ETH more than XRP.” She conceded the point—“correct, for now”—but argued demand would migrate once XRPL’s programmability and liquidity deepen. Ripple’s strategy hinges on more than code. On 2 June the company applied to the US Office of the Comptroller of the Currency for a national trust-bank charter. A parallel filing by its subsidiary, Standard Custody &#38; Trust, seeks a Federal Reserve master account so that RLUSD reserves can eventually sit at the central bank rather than a correspondent institution. The timing aligns with the pending GENIUS Act, bipartisan legislation that for the first time would impose a single federal regime on payment-stablecoin issuers. While the bill’s $10 billion-asset threshold means RLUSD could remain under New York oversight for now, the application positions Ripple to graduate into federal supervision voluntarily—a move CEO Brad Garlinghouse has called a “new (and unique!) benchmark for trust in the stablecoin market.” Eri underscored the charter angle in her post: “The national banking license application, aligned with the GENIUS Act, secures a Federal Reserve master account … enhancing trust, expanding crypto financial and payment services, and removing the patchwork of state licenses, enabling continued scalability at lower cost.” Related Reading: XRP Price Risks Breakdown To Next Support Level, Why $2.28 Is Important If the charter is granted and RLUSD begins to migrate on-demand to XRPL, two flywheels favor the native token, analysts say. First, RLUSD remittances on XRPL would pay transaction fees in XRP, turning every dollar of stablecoin volume into incremental demand for the asset Ripple still holds in large quantities. Second, the EVM sidechain lets decentralized-finance builders tap RLUSD liquidity without leaving XRP’s low-cost consensus layer, potentially reversing the flow of users and liquidity that has so far moved toward Ethereum. “These calculated steps in the $$$$$-dollar stablecoin market give the digital asset XRP enormous potential, but require more time to unfold,” Eri argues. For now, RLUSD’s growth is still driven by Ethereum’s DeFi economy, and sceptics like user “sammie” insist “it’s always going to be like this.” Eri’s final reply was succinct: “Let’s see. I know we’ll be touching base often!” That brevity captures both the promise and the uncertainty ahead. Technical rails are in place; regulatory applications are filed. Whether capital, compliance, and market demand will converge quickly enough to shift billions of RLUSD onto XRPL—and in turn lift XRP’s utility—remains the multi-billion-dollar question. At press time, XRP traded at $2.27. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Showed Up in DC — And Washington Took Notice",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Showed-Up-in-DC-—-And-Washington-Took-Notice-fotor-2025070812361.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice\" rel=\"nofollow\"> </a></p> <p>Reflections on the Bitcoin Policy Summit in Washington DC during May 2025. </p> <p>"
    },
    {
      "title": "Bow Valley Credit Union in Canada turns on Bitcoin purchases for Albertans",
      "link": "https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_an_orange_bull_running_through_an_Alberta_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans\" rel=\"nofollow\"> </a></p> <p>BVCU’s Bitcoin Gateway, with Balance Custody and Bull Bitcoin API, simplifies buying bitcoin. “Facilitates institutional adoption,” says Francis Pouliot. </p> <p>"
    },
    {
      "title": "KULR Secures $20M Bitcoin-Backed Credit Facility from Coinbase Credit",
      "link": "https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Secures-20M-Bitcoin-Backed-Credit-Facility-from-Coinbase-Credit.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit\" rel=\"nofollow\"> </a></p> <p>The deal sets up a multi-draw loan facility worth up to $20 million to expand its Bitcoin holdings.</p> <p>"
    },
    {
      "title": "Sequans Closes $384 Million Investment To Launch Bitcoin Treasury Initiative",
      "link": "https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Sequans-Closes-384-Million-Investment-To-Launch-Bitcoin-Treasury-Initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a fabless semiconductor company focusing on 5G/4G IoT semiconductor technology, has officially closed a $384 million strategic investment to kick off its Bitcoin treasury initiative. The deal combines $195 million in equity financing and $189 million in secured convertible debentures, reflecting growing institutional appetite for Bitcoin. The Offering included the sale of over [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet Enters ‘Bitcoin Gold Rush’ with Plans to Buy 210,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Metaplanet-Enters-Bitcoin-Gold-Rush-with-Plans-to-Buy-210000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027\" rel=\"nofollow\">Metaplanet Enters &#8216;Bitcoin Gold Rush&#8217; with Plans to Buy 210,000 BTC by 2027</a></p> <p>Japan’s top bitcoin treasury firm aims to grow its holdings to 210,000 BTC by 2027 and wants to use its growing reserves to buy cash-generating businesses.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Will Bitcoin Breakout This Week? Price Charts Flash Mixed Signals",
      "link": "https://decrypt.co/329110/bitcoin-price-breakout-myriad-predictions",
      "summary": "With a prediction market deadline fast approaching, traders on Myriad are split as momentum wanes and resistance looms just above the $109K price mark for Bitcoin."
    },
    {
      "title": "'OpenSeason' Crypto Game Goes Offline as Devs Pivot to Gambling on Nudity",
      "link": "https://decrypt.co/328937/openseason-crypto-game-goes-offline-devs-pivot-gambling-nudity",
      "summary": "Fractional Uprising's team has shifted gears after its token plummeted, hoping to draw in degens with AI-generated nudity and crypto gambling."
    },
    {
      "title": "SharpLink Gaming Stock Soars as Ethereum Treasury Firm Boosts Stash to $527 Million",
      "link": "https://decrypt.co/329101/sharplink-gaming-soars-ethereum-treasury-boosts-stash-527-million",
      "summary": "The \"Ethereum treasury firm\" is buying the second biggest digital coin to help shareholders get better value for money."
    },
    {
      "title": "AMERICA INVEST ACT, CORP TREASURY STOCKS & PUMP FUN",
      "link": "https://decrypt.co/videos/interviews/cM75emeO/america-invest-act-corp-treasury-stocks-pump-fun",
      "summary": "Crypto dips on tariff letters, then recovers. ETH outperforms, altcoins weak after PumpFun news. PumpFun plans $600m token sale, $4b valuation. Trump admin to publish crypto report on July 22. US government deposits $218k ETH to Coinbase. Robinhood speaking to US on tokenised shares. Truth Social files for Blue Chip crypto ETF. US drops appeal in Tornado Cash lawsuit. Strategy to raise $4.2b equity to buy BTC. Semler Scientific buys $20m BTC. Bit Digital pivots to ETH treasury, stock pumps. Tokenized assets on ETH hit $5b. Metaplanet to use BTC as collateral for M&amp;A. XRP CEO to testify before senate on legislation. SEC asks firms to amend SOL ETF applications. HK crypto stocks soar on stablecoin momentum. BBVA opens BTC, ETH trading for Spanish retail. El Salvador bought $800k BTC last week"
    },
    {
      "title": "Trump Media Files for 'Crypto Blue Chip' ETF Holding Bitcoin, Ethereum, Solana and XRP",
      "link": "https://decrypt.co/329081/trump-media-files-blue-chip-etf-bitcoin-ethereum-solana-xrp",
      "summary": "Trump Media and Technology Group is looking to launch another Truth Social-branded crypto ETF for Bitcoin, Ethereum, XRP, and more."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Phantom introduces in-wallet perps trading powered by Hyperliquid",
      "link": "https://cryptobriefing.com/in-wallet-perps-trading-phantom/",
      "summary": "<p>Phantom's integration of perpetual futures trading could significantly enhance user engagement and broaden crypto market accessibility.</p> <p>"
    },
    {
      "title": "ProShares’ XRP futures ETF listed on DTCC under ticker UXRP",
      "link": "https://cryptobriefing.com/proshares-xrp-etf-dtcc-listing/",
      "summary": "<p>The listing of ProShares' XRP futures ETF on DTCC suggests growing institutional interest and potential market expansion for crypto ETFs.</p> <p>"
    },
    {
      "title": "Amplifi partners with AIAPE to expand AI agent capabilities",
      "link": "https://cryptobriefing.com/amplifi-aiape-ai-agent-partnership-crypto-trading/",
      "summary": "<p>This partnership could enhance AI-driven trading efficiency, potentially reshaping digital asset markets and influencing future AI integrations.</p> <p>"
    },
    {
      "title": "Cardano Foundation unveils blockchain-based tool to simplify audit compliance and enhance financial reporting",
      "link": "https://cryptobriefing.com/blockchain-esg-compliance-cardano-reeve/",
      "summary": "<p>Cardano's blockchain tool could revolutionize audit compliance, boosting transparency and trust across various sectors and enhancing ESG efforts.</p> <p>"
    },
    {
      "title": "Trump’s Truth Social files S-1 for Crypto Blue Chip ETF holding BTC, ETH, XRP, SOL, and CRO",
      "link": "https://cryptobriefing.com/crypto-blue-chip-etf-launch/",
      "summary": "<p>The launch of a crypto ETF by Truth Social could significantly influence mainstream adoption and regulatory perspectives on digital assets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin crash narrative returns as geopolitical tensions mount",
      "link": "https://ambcrypto.com/bitcoin-crash-narrative-returns-as-geopolitical-tensions-mount/",
      "summary": "<img alt=\"bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-17.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As U.S. allies face new duties, Bitcoin acts less like gold and more like tech."
    },
    {
      "title": "‘Altcoins are back to following Bitcoin’s lead:’ Is an altseason brewing?",
      "link": "https://ambcrypto.com/altcoins-are-back-to-following-bitcoins-lead-is-an-altseason-brewing/",
      "summary": "<img alt=\"&#039;Altcoins are back to following Bitcoin&#039;s lead:&#039; Is an altseason brewing?\" class=\"attachment-full size-full wp-post-image\" height=\"713\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Altcoin-season-incoming.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1267\" />The Altcoin Index says “not yet,” but the charts suggest something bigger is brewing."
    },
    {
      "title": "Bitcoin: Breaking down BTC’s mid-cycle signals before it’s too late",
      "link": "https://ambcrypto.com/bitcoin-breaking-down-btcs-mid-cycle-signals-before-its-too-late/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-08T131652.371-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin metrics suggest mid-cycle strength, but volatility could rise as historical patterns repeat."
    },
    {
      "title": "Solana’s DeFi milestone: TVL soars to $17.5B with new protocol leaders",
      "link": "https://ambcrypto.com/solanas-defi-milestone-tvl-soars-to-17-5b-with-new-protocol-leaders/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-16.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />JTO, KMNO, and Jupiter drive the surge as retail and yield farmers fuel the flywheel."
    },
    {
      "title": "Solana active addresses hit new high – So why is SOL still falling?",
      "link": "https://ambcrypto.com/solana-active-addresses-hit-new-high-so-why-is-sol-still-falling/",
      "summary": "<img alt=\"Solana active addresses hit new high - So why is SOL still falling?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250708_123742_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SOL active addresses surge, but price slips despite on-chain spike."
    }
  ]
}