{
  "CoinDesk": [
    {
      "title": "Ex-Google Chief Eric Schmidt Backs Firms Behind Blockchain Credit Bureau",
      "link": "https://www.coindesk.com/business/2025/06/05/ex-google-chief-eric-schmidt-backs-firms-behind-blockchain-credit-bureau",
      "summary": ""
    },
    {
      "title": "Ethereum Foundation Unveils New Treasury Policy With 15% Opex Cap",
      "link": "https://www.coindesk.com/tech/2025/06/05/ethereum-foundation-unveils-new-treasury-policy-with-15-opex-cap",
      "summary": ""
    },
    {
      "title": "U.S. Seizes Darknet, Internet Domains, Crypto Funds Tied to Illegal Trading in Credit Card Data",
      "link": "https://www.coindesk.com/policy/2025/06/05/us-seizes-darknet-internet-domains-crypto-funds-tied-to-illegal-trading-in-credit-card-data",
      "summary": ""
    },
    {
      "title": "Crypto Lender Maple Finance Expands to Solana With Chainlink",
      "link": "https://www.coindesk.com/business/2025/06/05/crypto-lender-maple-finance-expands-to-solana-with-chainlink",
      "summary": ""
    },
    {
      "title": "U.S. Federal Reserve's New Supervision Chief Will Wield Crypto Authority",
      "link": "https://www.coindesk.com/policy/2025/06/05/u-s-federal-reserve-s-new-supervision-chief-will-wield-crypto-authority",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "How long will Bitcoin’s price consolidation last?",
      "link": "https://cointelegraph.com/news/how-long-will-the-bitcoin-consolidation-last?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTAvMDE5MmQyOWQtNGZhYS03OTE0LThjZGUtMzE0NGNlN2NkYzk5.jpg\" /></p><p>Bitcoin’s consolidation could end when BTC price takes out liquidity on either side and overcomes resistance at $107K.</p>"
    },
    {
      "title": "How $220M was stolen in minutes: Understanding the Cetus DEX exploit on Sui",
      "link": "https://cointelegraph.com/explained/how-220m-was-stolen-in-minutes-understanding-the-cetus-dex-exploit-on-sui?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy85NmI5MjAxODU0ZDk1MzIxNTQwYjY4YjVjNGVhMjllOS5qcGc=.jpg\" /></p><p>The Cetus DEX exploit on Sui drained $220 million in minutes. The hacker took advantage of an undetected bug in the math library of the protocol to siphon off the funds.</p>"
    },
    {
      "title": "Trump’s crypto agenda is rigged for the rich",
      "link": "https://cointelegraph.com/news/trump-crypto-agenda-is-rigged?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzExNTMtM2MxMy03YWMxLWEyYzAtNDEwYWFlNjg3ZTYy.jpg\" /></p><p>Donald Trump’s crypto agenda claims to champion financial freedom, but in reality, it consolidates power among political elites and wealthy investors, sidelining everyday users.</p>"
    },
    {
      "title": "Trump Media files for spot Bitcoin ETF approval from SEC",
      "link": "https://cointelegraph.com/news/trump-media-files-spot-bitcoin-etf-sec?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQwNGUtMzFmOC03NzFhLThkMDMtZDhiNTNmMTA4YjM5.jpg\" /></p><p>Trump Media & Technology Group filed an S-1 registration form with the US regulator to launch the Truth Social Bitcoin ETF.</p>"
    },
    {
      "title": "How to set up stop-loss and take-profit orders",
      "link": "https://cointelegraph.com/news/how-to-set-up-stop-loss-and-take-profit-orders?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NjliZGYtNWYxYi03ZmY1LTk0MWQtMTllZGVlNzc1NWM1.jpg\" /></p><p>Stop-loss and take-profit orders help Bitcoin traders lock in gains and cut losses automatically. They’re essential tools for managing risk in a 24/7, fast-moving market.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "VerifiedX Launches Vault Accounts – Setting a New Standard for Bitcoin Security",
      "link": "https://cryptoslate.com/verifiedx-launches-vault-accounts-setting-a-new-standard-for-bitcoin-security/",
      "summary": "<p>VerifiedX, the pioneering decentralized Layer 1 blockchain protocol, has officially launched Vault Accounts, a groundbreaking on-chain custody solution that redefines crypto security and user control — particularly for Bitcoin holders. Unlike traditional custodial wallets or smart contract-based solutions, Vault Accounts are fully native to the VerifiedX network, offering an unmatched suite of features including time-locked [&#8230;]</p> <p>"
    },
    {
      "title": "Circle makes Wall Street debut as first major stablecoin issuer on NYSE",
      "link": "https://cryptoslate.com/circle-makes-wall-street-debut-as-first-major-stablecoin-issuer-on-nyse/",
      "summary": "<p>Circle, the issuer of the USDC stablecoin, officially began trading on the New York Stock Exchange (NYSE) on June 5 under the ticker symbol CRCL. The listing milestone marks a significant milestone for the firm as it becomes one of the few major crypto-native companies to go public through a traditional listing. Circle CEO Jeremy [&#8230;]</p> <p>"
    },
    {
      "title": "Total crypto trading volume hits $80 trillion over last 12 months",
      "link": "https://cryptoslate.com/insights/total-crypto-trading-volume-hits-80-trillion-over-last-12-months/",
      "summary": "<p>Over the past year, total trading volume across centralized crypto exchanges has surged to $80 trillion, according to CCData’s Exchange Review series. The milestone captures the combined activity from both spot and derivatives markets, highlighting a year marked by sharp cyclical swings, structural dominance of perpetual contracts, and a new, elevated volatility baseline. Volume Regimes: [&#8230;]</p> <p>"
    },
    {
      "title": "Hong Kong readying to legalize Bitcoin and crypto derivatives in push for Web3 leadership",
      "link": "https://cryptoslate.com/hong-kong-readying-to-legalize-bitcoin-and-crypto-derivatives-in-push-for-web3-leadership/",
      "summary": "<p>Hong Kong’s push to legalize crypto derivatives is gaining political momentum, with reports that senior officials see the next wave of virtual asset reforms unlocking Bitcoin futures and options trading for professional investors. The goal is to expand product diversity while preserving sound risk controls. Bitcoin and Ethereum ETFs &#8220;have broadened the product diversity of [&#8230;]</p> <p>"
    },
    {
      "title": "Aave’s USDT liquidity takes a hit after Justin Sun-linked HTX’s $570 million withdrawal",
      "link": "https://cryptoslate.com/aaves-usdt-liquidity-takes-a-hit-after-justin-sun-linked-htxs-570-million-withdrawal/",
      "summary": "<p>Aave, the largest decentralized lending protocol, has experienced a sharp drop in USDT liquidity to under $100 million following a massive withdrawal by a wallet linked to HTX, a crypto exchange connected to Justin Sun. According to on-chain analyst EmberCN, the wallet removed $570 million USDT from Aave&#8217;s lending pool within three hours, slashing the [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Crypto Self Custody Is the Future, and People Say Best Wallet Leads the Way",
      "link": "https://www.newsbtc.com/news/crypto-self-custody-is-the-future-best-wallet-leads-the-way/",
      "summary": "What does crypto want to be when it grows up? Centralized exchanges like Coinbase have long marketed themselves as crypto&#8217;s answer to convenience. User-friendly, regulated, and custodial. Just give them the keys and let them drive. They&#8217;ll handle all the boring details – like on/off ramps, UI, integrated swapping, and little things like taking control of your crypto. And in return, all you need to do is trust. But increasingly, that deal sounds like a bad one. The trade-off between trust and control is no longer worth it. Trust Coinbase and other custodial platforms too much, and what do you get? Hacks and data breaches, among other things. There’s a better path forward – and more and more crypto users are looking for it. A Better Custody Deal So, what should the future of crypto be? Crypto should still be easy. It should still be intuitive. But it should also be private, safe, secure, and truly self-custodial. After all, the old adage of ‘not your keys, not your crypto’ shouldn&#8217;t just be a slogan – it is, and should be, the foundation of decentralized finance. That&#8217;s where wallets like Best Wallet come in. Unlike centralized platforms, self-custody crypto wallets like Best Wallet don&#8217;t hold your private keys. You have complete control of your assets at all times. There are no middlemen, no single points of failure, and no need to put your trust in third parties. But what about the convenience of swapping crypto, sending crypto, and exploring new crypto opportunities all from one app? Bridging the Gap: Self-Custody Meets Convenience The future of crypto points to tools that combine the convenience of centralized exchanges like Coinbase, including KYC and AML requirements, with the security of self-custody, without sacrificing usability. We&#8217;ve already seen this with tools like Railgun, which complies with KYC while enabling private transactions on DeFi platforms, and which Vitalik Buterin just used to transfer $2.6M in crypto. While transactions of that size may well be just another day in the office for the Ethereum founder, it demonstrates how increasingly important privacy, control, and functionality are in the developing crypto economy. This is nothing new; it&#8217;s often the people most deeply involved in tech who understand just how important it is to control your own data (and your own crypto). Remember Zuckerberg’s camera? That was the time he was promoting Meta, and everyone realized he&#8217;d taped across his laptop&#8217;s microphone and camera. Was that paranoia or an understanding of just how vulnerable our data is? That&#8217;s the balance that Best Wallet wants to deliver, beating MetaMask at its own game and dominating the Web3 self-custody wallet market. Best Wallet Token ($BEST) – The Self-Custody Crypto Wallet Presale Token Crypto wallets aren’t just handy places to stash some spare Bitcoin, at least not anymore. The best crypto wallets – like Best Wallet – serve as all-in-one control hubs for crypto investors, whether you&#8217;re operating multiple wallets, swapping tokens, ot investing in crypto presales. And that&#8217;s not all. The Best Wallet ecosystem is supercharged by its own token, $BEST. Best Wallet Token holders get: Lower transaction fees Higher staking rewards Earlier presale access Eligibility for bonus crypto airdrops (such as BTC Bull Token’s Bitcoin airdrop) Best Wallet and the $BEST token are building the crypto future that Buterin and others are looking for: interconnected, seamless, and self-custodial. It&#8217;s everything you could want or ever need from a crypto wallet. You can manage your portfolio, browse upcoming token launches (including the best new meme coins), and spend your crypto in real life with the upcoming Best Card. Buying, selling, and swapping are as easy as tapping a few buttons. And all this is secured with multi-party computation (MPC) and biometric authentication to keep your crypto safe without sacrificing ease of use. The Best Wallet Token presale has raised over $13.1M, with tokens currently priced at $0.025135. That could rise to $0.035215 by the end of the year, according to our $BEST price prediction, delivering gains of 40% to current presale investors. Learn more about how to buy Best Wallet Token with our guide. Best Wallet: Building the Self-Custodial Future of Crypto No longer does crypto have to choose between usability and control. Tools like Best Wallet are showing that self-custody platforms can match – or even beat – the convenience that centralized exchanges offer while staying true to the core values of crypto. As more self-custodial models appear in a post-Coinbase world, Best Wallet wants to lead the charge and dominate this $11B sector. If it succeeds, it will be by delivering a product that is convenient and completely crypto-native. Always do your own research before investing in crypto; this isn’t financial advice. Crypto self-custody is the future. Best Wallet is helping to build that future."
    },
    {
      "title": "Bitcoin Price Crash To $100,00 Loading: Next Targets Revealed As Bears Take Over",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-crash-to-10000-2/",
      "summary": "The Bitcoin price is falling fast, and with bears currently taking control, a crypto analyst has forecasted an impending crash below $100,000. While this potential downturn may sound alarming, the analyst has also revealed that after the pullback, Bitcoin (BTC) is expected to undergo a significant price rally to new all-time highs. Bitcoin Price Faces Immediate Crash Risk Bitcoin appears to be entering a cooling phase after experiencing a significant bullish run that spanned several weeks and led to its current all-time high of almost $112,000. ‘MelikaTrader94’, the TradingView crypto analyst responsible for this new technical analysis, predicts that during this cooling period, bears could take over and send the Bitcoin price crashing down to former lows under $100,000. Related Reading: Bitcoin Price Crash Below $100,000 Still Possible: Analysts Issue Downtrend Warnings On a 4-hour chart presented by the analyst, Bitcoin has consistently respected a descending trendline acting as a strong resistance threshold. This line, which formed after the recent peak, has now rejected price action multiple times, preventing further upward movement and hinting at growing bearish pressure in the short term. At the time of the analysis, Bitcoin was trading at $106,432, attempting to test the descending trendline once again. However, the chart shows that BTC lacks strong momentum, suggesting that another rejection is likely. If this rejection occurs, BTC’s price action is expected to correct downward toward the $99,000 region, marked on the chart as a key horizontal support zone. Bitcoin’s projected pullback is consistent with typical market behavior, especially after an extended bullish phase. Based on the TradingView expert’s analysis, a drop to the $99,000 support level could shake out weak hands and provide fresh buy-dip opportunities for traders. While the structure of the projected downward move is not entirely bearish, it suggests a necessary retest of lower support areas before any sustainable rally can resume. Bullish Continuation Expected After Pullback MelikaTrader94 has suggested that correcting down to the $99,000 support zone is critical for determining Bitcoin’s next rally. If this crash successfully occurs and buyers step in to defend the support, BTC could begin forming a strong bullish continuation structure. Related Reading: Bitcoin Price Crash: Why $107,500 And $103,500 Are The Levels To Watch The TradingView analyst’s chart outlines a possible rebound from the support area, which could trigger a breakout above the descending trendline. A sustained move above this trendline would potentially invalidate the short-term bearish structure and set the stage for a new all-time high, with price targets extending beyond $114,000. Notably, Bitcoin’s consolidation around its current price of $104,500, followed by a possible dip to the well-established support zone, fits the analyst’s narrative that the market is preparing for a big move. The TradingView expert has urged investors and traders to keep an eye out for a strong bounce, as this projected pullback could be a healthy one that comes just before a bullish leg up. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Mirrors Bitcoin 2020 Breakout Setup – Historic Run Incoming?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-mirrors-bitcoin-2020-breakout-setup-historic-run-incoming/",
      "summary": "Ethereum is trading at critical levels after breaking past the $2,500 mark earlier this quarter, now attempting to reclaim momentum and push into higher resistance. Despite global macroeconomic pressures—including rising US Treasury yields and persistent trade tensions between the US and China—ETH continues to show resilience. Market analysts believe that Ethereum could be leading the charge into a long-anticipated altseason, provided it holds key levels and breaks above current supply. Related Reading: Solana Analyst Sets $300 Target – Can Bulls Sustain A Rally? Top analyst Ted Pillows recently pointed to a compelling technical pattern: Ethereum has now posted four consecutive two-week green candles, a formation that mirrors Bitcoin’s price structure in early 2020 following the March crash. That period marked the beginning of Bitcoin’s legendary bull run to $69,000. According to Pillows, the similarities between BTC in 2020 and ETH in 2025 are “just mind blowing,” sparking renewed interest from traders who see Ethereum’s current consolidation as a bullish continuation. With investor sentiment slowly recovering and technicals turning favorable, the market is watching ETH closely. If history is any guide, this consolidation could mark the calm before Ethereum’s next major leg higher. However, macro risks still linger, and timing will be critical. Ethereum Resilience Sparks Hopes Of 2020-Like Rally Ethereum is holding strong above the $2,600 level, showing resilience amid global macro uncertainty and volatile market conditions. This consolidation around key support has many investors and analysts anticipating a breakout that could lead Ethereum into a new rally phase, potentially triggering a broader altseason. Despite growing concerns around systemic risk in the bond market and geopolitical tensions between the US and China, Ethereum continues to attract buyers, signaling confidence in its long-term strength. Analysts are watching this range closely. Many believe that if Ethereum can maintain support and break above near-term resistance, it could gain serious momentum. One of the more compelling arguments for a bullish outlook comes from Ted Pillows, who highlights a striking similarity between Ethereum’s current structure and Bitcoin’s behavior in 2020. According to Pillows, Ethereum has now printed four consecutive two-week green candles since bottoming, just as Bitcoin did after the March 2020 crash. That pattern marked the start of BTC’s legendary run to $69,000. The comparison has sparked optimism that ETH may be preparing for a similar breakout, especially if it clears resistance near $2,700–$2,800. While the macro environment remains tense, this technical structure—paired with rising confidence in ETH’s strength—keeps bulls hopeful that a major move is on the horizon. Related Reading: Ethereum Consolidates Against BTC – Altseason Hopes Hinge On ETH/BTC Breakout ETH Price Analysis: Consolidation Above Support Ethereum (ETH) is holding steady around $2,607, consolidating just above the 34-period EMA on the 4-hour chart, which currently sits near $2,594. After the strong surge in early May that saw ETH rally from under $2,000 to highs near $2,850, the price has moved into a tight consolidation range. This sideways action reflects market indecision as buyers and sellers battle for control. Despite the recent volatility, ETH has continued to post higher lows, indicating ongoing bullish pressure. The 50, 100, and 200-period SMAs are aligned below the current price, all trending upward, signaling that the broader trend remains intact. The price is finding consistent support from the 50-period SMA around the $2,590–$2,600 zone, which is a key level to watch. Related Reading: Ethereum Daily Chart Signals Strength Amid Market Uncertainty – Analyst A decisive break above the short-term resistance near $2,680 would be needed to confirm continuation toward $2,800 and potentially retest previous highs. On the downside, a break below $2,590 could trigger a pullback toward $2,500 or lower, especially if BTC shows weakness. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Dogecoin Needs $0.40 Breakout To Salvage Bull Case, Says Analyst",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-needs-0-40-breakout-salvage-bull-case/",
      "summary": "Dogecoin’s six-month slide may be about to reach its moment of truth, according to independent market commentator VisionPulsed, who told followers on June 4 that the memecoin must vault the long-standing ceiling at roughly $0.40 “either this week or next” if the broader bullish structure is to survive the summer. In a video analysis, the analyst pointed to a second consecutive “blue bar” flashing on Ethereum’s momentum oscillator, a signal he treats as a reliable harbinger of imminent, high-magnitude moves across the digital-asset complex. “The last time we had two blue bars on Ethereum was way back when we were still young and optimistic,” he said, invoking memories of August 2023. “We printed five that time and the market moved sixteen percent. We’re at two now; by Sunday we’ll probably have four, which tells me the move should come next week.” Dogecoin Needs June Rally To Avert Summer Slump Although the blue-bar framework is native to Ethereum, VisionPulsed argued that its read-through for Bitcoin and, by correlation, Dogecoin is more important than ever. He noted that Bitcoin’s own hash-ribbon metric—formed when the network’s 30-day and 60-day hash-rate moving averages compress—has followed a strictly “sell for two weeks, then rally” pattern through the current cycle. “We’ve already been selling off for two weeks,” he said. “Historically in this bull market, that’s when Bitcoin resets and moves higher. If that plays out again, Dogecoin should finally get the lift it’s been denied since February.” Related Reading: June Or Doom: Dogecoin Faces 6 Red Months If It Fails To Surge, Predicts Analyst The crux of his thesis sits on a 70-day timing model derived from Dogecoin’s prior impulse lows. Measuring from the most recent trough, the 70-day mark falls on 14 June. “Every major upswing in Dogecoin during this cycle has come 60 to 80 days after a bottom,” he explained, scrolling through historical candles on screen. “We’re right on that window—if we’re going to break higher, it almost has to be now.” VisionPulsed acknowledged his own track record of slipping deadlines—“one for five hundred,” he joked—but insisted the structure remains statistically sound. “If we don’t rally next week, I’m never putting dates on anything again,” he told viewers, before adding a caveat that has become the headline takeaway. “Dogecoin has to clear $0.40. If we can’t do that, the bear case strengthens dramatically: June down, July probably down, September seasonally weak, and suddenly you’re talking eight red months out of nine.” Pressed by commenters about the depth of a potential downside scenario, the analyst pointed to Ethereum for context. A bullish resolution, he said, could lift ETH to roughly $3,200 before a summer consolidation and possibly $4,200 by early autumn, a path that in his view would drag Dogecoin well north of the $0.40 trigger. Failure, however, “sets up a very large move down, maybe sub-$2,000 on ETH,” a slide that would likely leave Dogecoin retesting multi-month lows. “Whichever way we go,” he concluded, “is going to determine the rest of the summer.” Related Reading: Dogecoin’s Fate Hinges On This Price Level, Analysts Agree The urgency is aggravated by Dogecoin’s mounting sequence of monthly losses: five red candles since January, with only a brief reprieve in April. “Six red months out of seven is staring us in the face,” VisionPulsed said. “June doesn’t have to be a vertical move, but it does have to be green—or at least show a decisive breakout—because otherwise, where is the bull run?” Market structure rather than sentiment, he stressed, underpins the call. Bitcoin already sits near cycle highs while Dogecoin still trades markedly below its own year-to-date peak, a divergence he interprets as latent leverage. “If Bitcoin punches through its local top, it typically drags Doge,” he said, referencing earlier intervals in 2024 when BTC strength eventually translated into delayed but exaggerated moves in the memecoin. Whether that historical choreography can repeat depends, in his framework, on the next few daily closes. “We’re definitely getting more energy built up,” he said, pointing to narrowing Bollinger Bands and declining on-chain activity. “I don’t think the large move is here yet, but by late this week—or early next week at the latest—you should get your answer.” For traders who still believe the four-year cycle remains intact, the analyst’s $0.40 line in the sand arrives almost exactly one calendar year before the next projected Bitcoin top in October 2026. “If Doge can’t start moving now, the entire timing model gets pushed off course,” he warned. “I genuinely think June is a make-or-break month.” At press time, DOGE traded at $0.189. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Scarcity May Spark Explosive Surge, Bank Study Shows",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-scarcity-may-spark-explosive-surge-bank-study-shows/",
      "summary": "Bitcoin’s available coins for trading have dropped sharply. That change could push prices higher if demand holds up. Related Reading: Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge According to Sygnum Bank’s June 2025 Monthly Investment Outlook, the liquid supply of Bitcoin fell by about 30% over the last 18 months. In that time, nearly 1 million BTC left exchanges. That means fewer coins are ready to move at a moment’s notice. Liquid Supply Tightens Based on reports from Sygnum Bank, exchange balances dropped by around 1 million BTC since late 2023. That amount equals roughly 5% of Bitcoin’s total supply. When coins leave exchanges, they often go into cold storage or long-term funds. Some of these funds include new exchange-traded funds and corporate buyers issuing equity or debt to buy Bitcoin. If coins are locked away, traders have to compete for a smaller pool of available coins. That gap between supply and demand can cause bigger price swings on the upside. Institutions And State Moves Three US states have now passed laws to hold Bitcoin as part of their reserves. New Hampshire already signed its bill into law. Texas is expected to follow soon. A third state is also moving forward, though details are still pending. In addition, governments abroad are paying attention. Pakistan’s government has said it will look into Bitcoin reserves. In the UK, the Reform Party—currently leading in election polls—plans to study something similar. When a state or country actually buys Bitcoin for its coffers, it can spark more buying. That act has a double effect: it creates immediate demand and it signals that public institutions see Bitcoin as a store of value. Safe-Haven Status Strengthens Rising uncertainty over the US dollar and US debt worries have driven some investors toward Bitcoin. In May, as US Treasury prices slid on concerns about rising debt levels, digital gold and physical gold saw higher interest. Bitcoin is being viewed more like a hedge against dollar weakness. On days when Treasuries wobble, some cash moves into crypto markets. Larger swings on the upside than on the downside also hint that institutions may be soaking up dips more quickly. Sygnum’s data shows that since June 2022, Bitcoin’s upward moves have been larger than its downward moves. That may be a sign that big players have become more confident in holding through small sell-offs. Related Reading: XRP Could Transform Your Finances Long Before $10K, Angel Investor Says Ethereum’s Comeback Ethereum is also stirring after a period of sluggish performance. The recent Pectra upgrade on Ethereum has spurred more fees and drawing fresh interest. Several big banks and financial firms are now exploring tokenization platforms built on Ethereum and its layer-2 networks. When more institutions issue tokenized assets, the whole crypto space could benefit. Renewed activity on Ethereum often spills back into Bitcoin. That could add to overall demand for top coins. Featured image from Imagen, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Life Insurer, Meanwhile, Becomes First Company to Publish Audited Financials Denominated in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Meanwhile-Insurance.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Meanwhile Insurance Bitcoin (Bermuda) Limited (“Meanwhile”) announced it has become the first company in the world to release externally audited financial statements denominated entirely in Bitcoin. According to the announcement, the company reported 220.4 BTC in assets and 25.29 BTC in net income for 2024, a 300% year over year increase. “We’ve just made history [&#8230;]</p> <p>"
    },
    {
      "title": "President Trump’s Truth Social Files S-1 Form For Bitcoin ETF",
      "link": "https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Eric-Trump-Said-Everybody-Wants-Bitcoin.-Everybody-is-Buying-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf\" rel=\"nofollow\">President Trump&#8217;s Truth Social Files S-1 Form For Bitcoin ETF</a></p> <p>Truth Social filed for an S-1 Form for a Bitcoin ETF.</p> <p>"
    },
    {
      "title": "Botanix Launches Federated Sidechain with 16 Members On Testnet",
      "link": "https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_giant_robot_spider_with_big_matrix_code_ch_2-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members\" rel=\"nofollow\"> </a></p> <p>Botanix launches a decentralized Bitcoin sidechain on testnet with a 16-node federation, using the Spiderchain protocol for EVM-compatible dApps. Mainnet set for Q3 2025.</p> <p>"
    },
    {
      "title": "Matador Technologies Raises C$1.64M To Invest in Their Bitcoin Reserve",
      "link": "https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Matador-Technologies-Raising-C1-Million-to-Invest-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve\" rel=\"nofollow\"> </a></p> <p>Matador Technologies announced it raised C$1,644,300 across the issuance of 2,652,097 units to add more bitcoin to their reserve.</p> <p>"
    },
    {
      "title": "Support The Blockchain Regulatory Certainty Act (BRCA) To Protect Noncustodial Services",
      "link": "https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Blockchain-Regulatory-Certainty-Act-Save-Our-Wallets-Bitcoin-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services\" rel=\"nofollow\"> </a></p> <p>Call your local elected officials and tell them to support the BRCA, which protects developers of noncustodial technology as well as a variety of services that preserve privacy and make it easier to scale Bitcoin.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Circle's USDC Likely to Remain DeFi's Go-To Stablecoin: Compass Point",
      "link": "https://decrypt.co/323843/circles-usdc-likely-remain-defis-go-to-stablecoin-compass-point",
      "summary": "Circle’s USDC stablecoin has a dominant presence across the crypto industry’s growing number of decentralized exchanges, lending protocols, and other DeFi settings, the analysts say."
    },
    {
      "title": "'Bitcoin Is Michael Jordan', Says NBA Star Tristan Thompson—So Who's Ethereum, Solana and XRP?",
      "link": "https://decrypt.co/323727/bitcoin-michael-jordan-nba-star-tristan-thompson",
      "summary": "NBA star Tristan Thompson spoke with at Bitcoin 2025, dishing on assets and athletes alike as he navigates the crypto space."
    },
    {
      "title": "Donald Trump, Elon Musk Clash Over DOGE Sparks $53 Million Solana Meme Coin",
      "link": "https://decrypt.co/323837/donald-trump-elon-musk-doge-solana-meme-coin",
      "summary": "The spat between Elon Musk and President Trump has spawned an unflattering meme and the Kill Big Beautiful Bill, or KBBB, Solana meme coin."
    },
    {
      "title": "Curve Founder Warns of 'For-Hire' Hackers Coordinating Cross-Platform Attacks",
      "link": "https://decrypt.co/323835/curve-founder-for-hire-hackers-attacks",
      "summary": "Crypto hackers siphoned $302M in May alone as DNS attacks and code vulnerabilities expose fatal flaws in DeFi security—and it's getting worse."
    },
    {
      "title": "Hong Kong Opens Door to Crypto Derivatives in Bid to Rival Global Hubs",
      "link": "https://decrypt.co/323833/hong-kong-crypto-derivatives",
      "summary": "Hong Kong may soon be able to trade crypto derivatives thanks to the securities regulator's new plan."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump Media files Form S-1 for Truth Social Bitcoin ETF with SEC",
      "link": "https://cryptobriefing.com/truth-social-bitcoin-etf-sec/",
      "summary": "<p>The filing could influence regulatory perspectives on crypto ETFs and highlight the intersection of politics and cryptocurrency markets.</p> <p>"
    },
    {
      "title": "Gold miner Bluebird to convert gold revenues into Bitcoin reserve, stock jumps 63% intraday",
      "link": "https://cryptobriefing.com/bitcoin-treasury-strategy-gold-miner/",
      "summary": "<p>Bluebird's Bitcoin strategy highlights a shift in asset management, potentially influencing other firms to diversify into digital currencies.</p> <p>"
    },
    {
      "title": "AEON integrates TRON Network to enable seamless in-store payments",
      "link": "https://cryptobriefing.com/tron-network-payments-integration/",
      "summary": "<p>AEON's integration with TRON could significantly boost crypto adoption in retail, enhancing the global reach and utility of digital currencies.</p> <p>"
    },
    {
      "title": "JPMorgan Chase set to accept Bitcoin, crypto ETFs as loan collateral",
      "link": "https://cryptobriefing.com/jpmorgan-crypto-loan-collateral/",
      "summary": "<p>JPMorgan's move to accept crypto ETFs as collateral could accelerate mainstream adoption and integration of digital assets in traditional finance.</p> <p>"
    },
    {
      "title": "BlackRock’s Bitcoin ETF futures go live on Moscow Exchange as fund surpasses $70 billion AUM",
      "link": "https://cryptobriefing.com/bitcoin-futures-moscow-exchange/",
      "summary": "<p>The integration of Bitcoin ETFs into Russia's financial markets may signal a shift towards broader acceptance and regulation of crypto assets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Railgun crypto pumps 30% after Vitalik Buterin’s transaction – What lies ahead?",
      "link": "https://ambcrypto.com/railgun-crypto-pumps-30-after-vitalik-buterins-transaction-what-lies-ahead/",
      "summary": "<img alt=\"Railgun crypto pumps 30% after Vitalik Buterin&#039;s transaction - What lies ahead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/RailgunRAIL.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here's what you need to know about Railgun's native token RAIL."
    },
    {
      "title": "Ethena’s 17mln whale activity amid Coinbase listing: Reversal for ENA?",
      "link": "https://ambcrypto.com/ethenas-17mln-whale-activity-amid-coinbase-listing-reversal-for-ena/",
      "summary": "<img alt=\"Ethena&#039;s 17mln whale activity amid Coinbase listing: Reversal for ENA?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A wallet project-linked wallet moved ENA tokens to exchanges resulting in an 8% drop."
    },
    {
      "title": "XRP faces $2.2B unlock: Will its $2.14 support tumble under pressure?",
      "link": "https://ambcrypto.com/xrp-faces-2-2b-unlock-will-its-2-14-support-tumble-under-pressure/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-85-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP faces critical price pressure after a massive escrow unlock, with $2.14 acting as pivotal support."
    },
    {
      "title": "Toobit Launches Zero-Fee Trading for All USDC Spot Pairs",
      "link": "https://ambcrypto.com/toobit-launches-zero-fee-trading-for-all-usdc-spot-pairs/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"575\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-05-180939.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1025\" />Toobit, an award-winning global digital asset trading exchange, is launching a limited-time Zero-Fee Trading for [&#8230;]"
    },
    {
      "title": "JPMorgan Chase to accept crypto ETF collaterals: BTC push in TradFi?",
      "link": "https://ambcrypto.com/jpmorgan-chase-to-accept-crypto-etf-collaterals-btc-push-in-tradfi/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"929\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/JPMorgan-to-accept-BlackRock-Bitcoin-ETF.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1651\" />With IBIT’s rise and JPMorgan’s new rules, crypto isn’t fringe anymore."
    }
  ]
}