{
  "CoinDesk": [
    {
      "title": "Amber International Raises $25.5M to Expand $100M Crypto Reserve Strategy",
      "link": "https://www.coindesk.com/business/2025/07/03/amber-international-raises-255m-to-expand-100m-crypto-reserve-strategy",
      "summary": ""
    },
    {
      "title": "Ondo, Pantera Capital to Invest $250M in Real-World Asset Projects",
      "link": "https://www.coindesk.com/business/2025/07/03/ondo-pantera-capital-to-invest-250m-in-real-world-asset-projects",
      "summary": ""
    },
    {
      "title": "ETH Holds Firm as Strong U.S. Jobs Data Lifts S&P 500 and Nasdaq Composite to Record Highs",
      "link": "https://www.coindesk.com/markets/2025/07/03/eth-holds-firm-as-strong-u-s-jobs-data-lifts-s-and-p-500-and-nasdaq-composite-to-record-highs",
      "summary": ""
    },
    {
      "title": "SEC's Pause of Grayscale Fund Is Likely Temporary",
      "link": "https://www.coindesk.com/news-analysis/2025/07/03/sec-s-pause-of-grayscale-fund-is-likely-temporary",
      "summary": ""
    },
    {
      "title": "Sui Reclaims $3 After Week-Long Rally Sparked by Lion Group’s Treasury Plans",
      "link": "https://www.coindesk.com/markets/2025/07/03/sui-reclaims-usd3-after-week-long-rally-sparked-by-lion-group-s-treasury-plans",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "WhiteRock founder to be extradited over $30M ZKasino case — ZachXBT",
      "link": "https://cointelegraph.com/news/whiterock-founder-extraditon-netherlands-zkasino?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDNhZjAtMjEyMC03Nzk4LWFjNjktMDdkMWEyZWY2Y2U3.jpg\" /></p><p>WhiteRock Finance founder Ildar Ilham was reportedly detained in the UAE more than a year after Dutch authorities announced an arrest linked to ZKasino.</p>"
    },
    {
      "title": "$250M Ondo Catalyst fund signals ‘arms race’ for RWA tokenization",
      "link": "https://cointelegraph.com/news/ondo-finance-pantera-invest-250m-tokenized-real-world-assets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGNiYjgtNTc5ZS03Nzk5LWJkMzktZDNmOThlMGZkOGY5.jpg\" /></p><p>Ondo Finance and Pantera Capital are launching a $250 million fund to fuel tokenized real-world asset projects.</p>"
    },
    {
      "title": "ETH traders target $3.2K after ‘golden cross’ debut, derivatives data disagrees",
      "link": "https://cointelegraph.com/news/eth-traders-target-3-2k-after-golden-cross-debut-derivatives-data-disagrees?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NGJhZjQtMmJiMy03NTI5LWE4NTMtYmYxY2U4ZjA3NWZm.jpg\" /></p><p>Traders say an ETH rally to $3,200 could result from a “golden cross” pattern, but other Ether price metrics are not so bullish.</p>"
    },
    {
      "title": "Bitcoin price aims for new highs but ‘divergences’ set $110K as resistance",
      "link": "https://cointelegraph.com/news/bitcoin-price-aims-for-new-highs-but-divergences-set-dollar110k-as-resistance?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2QxNmYtMTdlMi03NDI1LWFmOTItNGNhYTQ5ODM2YTVk.jpg\" /></p><p>Bitcoin charts show bearish divergences across multiple timeframes, a hint that price rallies above $110,000 could be a trap.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "DeFi TVL breaks above $116B as lending roars back",
      "link": "https://cryptoslate.com/defi-tvl-breaks-above-116b-as-lending-roars-back/",
      "summary": "<p>The DeFi market has rebounded at the beginning of July, with total value locked (TVL) rising to $116.416 billion, a level last seen in April. The 24-hour increase of 4.95% reflects rising crypto asset prices and renewed deposit flows into lending protocols, restaking services, and yield-bearing primitives. As Ethereum and Solana continue to absorb most [&#8230;]</p> <p>"
    },
    {
      "title": "TRON DAO Joins EthCC as WAGMI Sponsor, Co-Hosts Events with MetaMask and Arkham",
      "link": "https://cryptoslate.com/tron-dao-joins-ethcc-as-wagmi-sponsor-co-hosts-events-with-metamask-and-arkham/",
      "summary": "<p>Geneva, Switzerland, July 3 2025 — TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and decentralized applications (dApps), proudly participated as a WAGMI Sponsor at the Ethereum Community Conference (EthCC), held from June 30 to July 3 in Cannes, France. As Europe’s largest annual Ethereum-focused event, EthCC [&#8230;]</p> <p>"
    },
    {
      "title": "Pantera, Ondo launch $250M fund to drive RWA tokenization",
      "link": "https://cryptoslate.com/pantera-ondo-launch-250m-fund-to-drive-rwa-tokenization/",
      "summary": "<p>Ondo Finance and Pantera Capital have launched a $250 million fund to accelerate investments in tokenized real-world assets (RWAs), Axios reported on July 3. According to the report, the fund, named Ondo Catalyst, will invest in equity stakes and tokens of projects developing tokenized versions of traditional financial assets. Ian De Bode, chief strategy officer [&#8230;]</p> <p>"
    },
    {
      "title": "Post-maintenance mishap on Solana’s Backpack triggers incorrect futures orders, balance reports",
      "link": "https://cryptoslate.com/post-maintenance-mishap-on-solanas-backpack-triggers-incorrect-futures-orders-balance-reports/",
      "summary": "<p>Backpack halted trading for scheduled maintenance at 10 a.m. UTC on July 3 and reopened two hours later, but the restart triggered account errors that forced CEO Armani Ferrante to promise reviews and compensation. Backpack had warned users on X that the platform would go offline at 10 a.m., enter post-only mode at noon, and [&#8230;]</p> <p>"
    },
    {
      "title": "Russian insurance firms unveil investment life policies tied to Bitcoin",
      "link": "https://cryptoslate.com/russian-insurance-firms-unveil-investment-life-policies-tied-to-bitcoin/",
      "summary": "<p>Two major Russian insurance firms, Renaissance Life and BCS Life Insurance, have launched investment life insurance policies (ILIPs) linked to Bitcoin, according to a July 2 local media report. According to the report, the innovative policies allow investors to gain exposure to BlackRock’s iShares Bitcoin Trust (IBIT), the largest Bitcoin ETF by assets under management. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Litecoin Surges Past Descending Resistance – Bulls Target $97.10 Level",
      "link": "https://www.newsbtc.com/news/litecoin/litecoin-surges-past-descending-resistance-bulls-target-97-10-level/",
      "summary": "Litecoin (LTC) is back in the spotlight as bullish momentum sweeps across the crypto market. After months of volatility and sideways action, Litecoin is showing signs of strength, pushing above key technical levels and attracting fresh investor interest. The broader market recovery, fueled by optimism in Bitcoin and Ethereum, has created favorable conditions for altcoins to regain traction, and Litecoin could be one of the biggest beneficiaries. Related Reading: Tron DeFi Activity Expands: SunSwap Hits $3B+ Monthly Swaps In 2025 Top analyst Carl Runefelt recently shared a technical analysis highlighting a major development: Litecoin has broken above a key level on the daily chart. This breakout is a critical technical signal, suggesting a potential trend reversal after weeks of consolidation and indecision. While resistance remains overhead, analysts believe that a confirmed reclaim of this level as support could trigger an expansive phase for LTC, opening the door to strong upside moves. As institutional interest in crypto grows and macroeconomic conditions stabilize, assets like Litecoin—known for speed, low fees, and high liquidity—may attract attention from traders and investors seeking asymmetric returns. With momentum on its side and market sentiment shifting, the coming days will be crucial to determine whether Litecoin can turn this breakout into a full-scale rally. Litecoin Bullish Momentum And ETF Hopes Fuel Rally Litecoin (LTC) is gaining bullish traction as price action strengthens and investor sentiment improves across the crypto market. Currently trading above $90, Litecoin has broken out of its downward trend, signaling renewed buying interest and technical strength. This move is particularly significant, given months of sideways consolidation and the broader market’s gradual recovery. According to Carl Runefelt, Litecoin has decisively broken above its descending resistance on the daily chart—a bullish technical setup that could pave the way for further gains. Runefelt believes the next target is $97.10, a level that, if reached and held, could mark the start of a new upward leg for LTC. The recent breakout has reignited interest in Litecoin’s medium-term prospects, especially as traders look for altcoins with momentum and untapped upside. Adding to the optimism is speculation surrounding a potential Litecoin spot Exchange-Traded Fund (ETF). According to Bloomberg, the probability of approval for a Litecoin spot ETF by October 2 (local time) has risen to an impressive 95%. Such a product would offer institutional investors a new and regulated vehicle to gain exposure to LTC, potentially unlocking significant inflows. With favorable technicals and strong fundamentals aligning, Litecoin appears poised for a breakout. The coming days will be critical as bulls aim to confirm support above $90 and push toward the $97.10 resistance. If ETF approval expectations continue to build alongside broader market momentum, Litecoin could emerge as one of the top-performing altcoins of the current cycle. Related Reading: Bitcoin Bounces Off Key Demand Level – Price Discovery On The Menu? LTC Price Action: Key Levels To Reclaim Litecoin (LTC) is showing strong bullish momentum after breaking above a key descending resistance level on the daily chart. As seen in the chart, LTC surged over 4% in the last session, closing at $91.23. This breakout follows weeks of tight consolidation near the $85 zone and signals growing interest as market sentiment improves across the board. Price has now moved decisively above the 50-day and 100-day moving averages, which have acted as resistance in recent weeks. The next challenge lies at the 200-day moving average, currently near $98.50, which aligns closely with the analyst-projected target of $97.10. Reclaiming that level would confirm a full trend reversal and open the door to testing the $100 psychological level. Related Reading: Tron Shows Adoption Strength As Volume Still Led By Big Transfers – Details Volume has also picked up, supporting the breakout and suggesting that buyers are stepping in. If bulls maintain momentum and consolidate above $90, Litecoin could confirm a shift in market structure and set the stage for a broader rally. On the downside, any rejection at the 200-day MA could trigger a retest of the $87–$89 support area. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Analysts Predict Major Dogecoin Price Rally After Breaking 50-Day Trendline",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-break-50-day-trendline/",
      "summary": "The Dogecoin price may be setting up for a significant rally as a technical analyst identifies a bullish breakout above the 50-day trendline. After months of compressed price action, the meme coin now appears poised to conclude its downtrend, igniting fresh optimism within the crypto community. Dogecoin Price Set For Game-Changing Rally Trader Tardigrade, a crypto market analyst, announced in an X (formerly Twitter) post on July 1 that the Dogecoin price has just broken above a critical 50-day descending trendline on its daily chart. With this new development, the analyst anticipates the potential start of a powerful upward price movement soon. Related Reading: Dogecoin Price Retests 100 SMA Again – Here’s What It Means For Price Notably, the trendline breakout marks a significant shift in momentum for Dogecoin, which had been locked in a consistent downtrend over several weeks. The leading meme coin is currently trading at $0.17, having declined by almost 10% over the past month, according to CoinMarketCap. With the potential end of this market downturn in sight, Trader Tardigrade suggests that DOGE’s microstructure is now beginning to show early signs of a bullish reversal pattern. In his price chart, the analyst notes that Dogecoin established a higher low, followed by a higher high after its breakout above the long-standing trendline. More recently, a second higher low has formed, reinforcing the possibility that a new uptrend is underway. This structure, characterized by successively higher highs and lows, is often seen as the earliest confirmation that buyers could be regaining control of the market. The breakout is also especially significant because it follows an extended period of lower lows and lower highs, with the 50-day trendline acting as a strong resistance barrier throughout. With that resistance now breached and early signs of a bullish market structure developing, Trader Tardigrade is increasingly optimistic about Dogecoin’s near-term prospects. If the current trend persists, it could signal the start of a sustained rally for the meme coin. Analyst Says Dogecoin Below $0.2 Is Free In a separate analysis, market expert Kaleo disclosed that Dogecoin’s current price below $0.20 presents a strong accumulation opportunity, implying that the meme coin is significantly undervalued when compared to its potential upside. Backing his view with a chart, the analyst projected that the Dogecoin price may be on the verge of a major breakout, with possible upside targets indicating a surge toward $1.5 and possibly beyond $ 3.50. Related Reading: Dogecoin Price Rocked By Market Collapse, Analyst Reveals When To Buy Kaleo’s chart analysis highlights strong similarities between Dogecoin’s current market structure, following the April 2024 Bitcoin halving, and the 2020 breakout that preceded the meme coin’s historic bull run. In 2020, Dogecoin traded sideways within a Falling Wedge pattern for months before a breakout triggered a parabolic surge to fresh ATHs. The current price action exhibits a nearly identical setup, with the meme coin now emerging from a similar multi-year Falling Wedge, potentially setting the stage for another historic bull rally. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "Toncoin Walks A Tightrope At $2.80 As Market Tension Builds – What Next?",
      "link": "https://www.newsbtc.com/toncoin-ton/toncoin-walks-a-tightrope/",
      "summary": "In a recent post on X, Michael Steinbach highlighted that Toncoin’s current price is at $2.80, which he considers one of the most exciting levels of the year. With momentum building, Steinbach noted that traders everywhere are now asking the same question: Is a breakout finally underway, or is a sharp sell-off just around the corner? Toncoin Locked In A Narrow Range Between $2.70 And $2.80 Analyzing the daily chart, Michael Steinbach points out that Toncoin has been locked in a tight range between $2.70 as support and $2.80 as resistance for several weeks now. He warns that jumping into the market without a clear plan is a recipe for losses, especially when others are already navigating these well-defined zones with precision. Related Reading: Toncoin Heading Toward 40% Breakout, Pattern Could Suggest He highlights the RSI sitting at 39, a relatively weak position. While it&#8217;s not yet in oversold territory, Steinbach notes that buyers may be holding off for deeper levels. Back in April, a strong rebound occurred from below 30, making the 30–32 zone a critical area to watch for potential bullish reactions. In terms of risk, Steinbach warns that a break below the $2.70 support could hand control over to the bears. If that level fails, the next downside targets to watch are $2.50 and, in a worst-case scenario, $2.00. He reminds traders that repeated tests of a support zone tend to weaken it over time, and when it finally cracks, the fallout can come fast. Whether watching for a breakout or a breakdown, having a plan is essential. Reacting after the crowd moves rarely pays off; it’s the calm, pre-planned decisions that give traders the edge when volatility strikes. Breakout Or Pullback? Define The Setup Before Entering In outlining the bullish scenario, the analyst noted that if Toncoin manages to secure a daily close above the $2.80 resistance, momentum could quickly follow through. This breakout could open the path toward $3.00, with an extended target near $3.40, representing a potential 26% gain from current levels. That’s the kind of upside savvy traders prepare for. Related Reading: Toncoin Rises 13% On Telegram’s $300 Million Deal With Elon Musk’s xAI So, what’s the key takeaway? According to the analyst, successful trading doesn’t rely on gut feeling; it requires well-defined triggers. That means either entering on a confirmed breakout above $2.80 with a stop-loss just below, or stepping back and waiting for a pullback that aligns with RSI signals. The focus should always be on minimizing risk while allowing profits room to grow. As for now, the analyst sees the trend as sideways to slightly bearish. Until the chart sends a crystal-clear signal, the best approach is patience — no FOMO trades, no blind bets, just disciplined setups. Featured image from Medium, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Needs $140K To Match Peak Profits, On-Chain Data Shows",
      "link": "https://www.newsbtc.com/news/140k-bitcoin-isnt-just-a-dream-anymore-on-chain-analytics-shows/",
      "summary": "Long‑term holders of Bitcoin may need to see a fresh high around $140,000 before they enjoy the same kind of profits they saw earlier this cycle. Related Reading: Bitcoin Holds Steady Above $107K As US Senate Clears $4.5T Spending Bill According to CryptoQuant, that price point lines up with past peaks in realized gains for those who have kept their coins untouched for at least six months. &#8216;Market Magnet&#8217; Theory CryptoQuant used the Market Value to Realized Value (MVRV) ratio to track how deep in profit holders are right now. Based on reports, the average realized profit for long‑term holders stands at about 220%. That sounds healthy. But in March and December 2024, holders were sitting on roughly 300% and 350% gains, respectively. The gap between today’s 220% and those earlier highs is what Darkfost, a CryptoQuant contributor, calls a form of “market magnet.” Many are calling for $140,000 BTC so that unrealized profits match the cycle’s top levels. Profit‑Taking Trends Long‑term investors have been selling as Bitcoin flirts with new highs. Recent data shows that these holders have driven much of the selling pressure in the past few weeks. The average cost basis for this group — the realized price — is near $33,800. That means anyone buying before six months ago would need Bitcoin to reach $33,800 just to break even. And to hit the profit levels of March and December 2024, BTC must climb to $140,000. This dynamic pushes some traders to lock in gains early, while others hold on for bigger moves. Super Majority Still In The Green Based on reports, a super majority of Bitcoin investors are sitting on unrealized profits worth a combined $2.5 trillion. That number reflects the overall strength of the market’s recent rally. Even so, many investors remain confident that fresh buying can soak up any waves of profit‑taking. The current phase feels like a pause. Buyers and sellers are sizing each other up. The question now is whether demand will pick up enough to drive that magnet‑level price. Related Reading: Insane Or Insightful? VC Firm Says XRP Could Reach Nearly $9,000 In Just 5 Years Cycle Outlook And Next Steps Analysts said that Bitcoin looks ready for a post‑breakout retest after breaking a multi‑week downtrend that began in mid‑May. They added that the bull run might only have several months left before a final surge and then a change in trend. If this view holds, that final push could be the moment when BTC nears or even hits $140,000. After that, history suggests a sharp peak and then a cool-down. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Ethereum Looks Strong Despite Volatility – $10,000 Price Target Gains Momentum",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-looks-strong-despite-volatility-10000-price-target-gains-momentum/",
      "summary": "Ethereum has regained strong bullish momentum over the past few days, rising more than 23% since June 22 and reclaiming the critical $2,600 level. After weeks of uncertainty and sideways movement, ETH is showing signs of strength, with bulls now eyeing a push toward the $2,700 resistance zone. A successful reclaim of this level could open the doors for a broader rally, potentially reigniting hopes for the long-awaited altseason. Related Reading: Tron DeFi Activity Expands: SunSwap Hits $3B+ Monthly Swaps In 2025 While volatility remains in the broader market, Ethereum’s recovery has been notable, especially as macroeconomic sentiment improves and risk appetite increases across both equities and crypto. The surge in price has brought renewed attention to ETH’s long-term outlook, with top analyst Ted Pillows stating that “ETH is looking good and going above $10,000 this cycle.” This bold projection reflects growing confidence among market participants that Ethereum still holds major upside potential, particularly as network fundamentals strengthen and institutional interest grows. With the $2,700 level acting as the next critical resistance, all eyes are on whether Ethereum can maintain its momentum and set the stage for the next leg higher. The coming days will be essential in confirming whether this rally has staying power or remains short-lived. Ethereum Faces Critical Test As Altcoin Market Watches Closely After a week of volatility, Ethereum surged 9% yesterday, pushing closer to the top of its long-standing range and signaling the potential for a major breakout. Trading between $2,200 and $2,800 since early May, ETH has now returned to the upper end of this consolidation zone. Market participants believe this could be the turning point, not just for Ethereum, but for the entire altcoin market. Ethereum remains the backbone of the altcoin ecosystem, and its price action has historically dictated the momentum of the broader crypto space. A decisive move above $2,800 could trigger a wave of breakouts across major altcoins, many of which remain suppressed under key resistance levels. While short-term volatility remains a concern, analysts argue that Ethereum is showing strong signs of resilience and accumulation. Ted Pillows shared his technical perspective, urging traders to stay focused on the bigger picture: “Don’t let short-term volatility scare you.&#8221; According to him, Ethereum will surpass $10,000 this cycle. His view reflects growing confidence among experienced investors who see Ethereum’s current structure as a launchpad for the next expansion phase. With Ethereum at a critical technical juncture and altcoins waiting for confirmation, the coming days could be pivotal. A breakout above $2,800 would validate growing bullish sentiment and potentially spark the long-anticipated altseason. Related Reading: Bitcoin Bounces Off Key Demand Level – Price Discovery On The Menu? ETH Tests 200-Day MA After Breakout Ethereum is showing renewed strength after reclaiming the $2,600 level and closing above all major moving averages on the daily chart. As seen in the image, ETH surged through the 100-day and 200-day moving averages, which had been acting as dynamic resistance near $2,516. This marks a significant technical milestone, indicating bullish momentum may be returning. The breakout candle is backed by rising volume, a positive sign that the move is supported by real market participation. If ETH can hold above the 200-day MA, the next critical level to watch is $2,700 — the top of the range that has held since early May. A decisive close above $2,700 would open the door for further gains, potentially testing the $2,900–$3,000 resistance zone. Related Reading: Solana Hits New Milestone: Wallets Holding 0.1+ SOL Reach Record High Support remains near the $2,500 level, where the 50-day and 100-day MAs converge, offering a strong confluence zone should any pullback occur. If bulls can maintain momentum and hold above the moving average cluster, the odds of a larger trend reversal increase. Ethereum’s current setup appears constructive, and market participants are closely watching for continuation, especially as macro sentiment improves and altcoin strength begins to return. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Senator Lummis’ New Bill Enables Tax-Exempt Bitcoin Spending — But Thresholds Are Too Low",
      "link": "https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Senator-Lummis-at-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start\" rel=\"nofollow\"> </a></p> <p>Long-time Bitcoin advocate Senator Cynthia Lummis (R-WY) has drafted a bill that allows Bitcoin enthusiasts to spend small amounts of bitcoin without incurring capital gains taxes (which is very cool), but many — including myself — feel that the spending limits in the bill are too low.</p> <p>"
    },
    {
      "title": "Senator Lummis Introduces Digital Asset Tax Legislation",
      "link": "https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/US-Senator-Cynthia-Lummis-Discusses-Bitcoin-Reserve-Stablecoin-Legislation-and-Market-Structure-Bill-at-Bitcoin-2025-Conference.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation\" rel=\"nofollow\"> </a></p> <p>The bill proposes a $300 exemption for small Bitcoin and crypto transactions, defers taxes on mining and staking until assets are sold.</p> <p>"
    },
    {
      "title": "Bitcoin Miner Riot Produces 450 Bitcoin In June",
      "link": "https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Miner-Riot-Produces-450-Bitcoin-In-June.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june\" rel=\"nofollow\"> </a></p> <p>The company saw a 76% year-over-year increase in production, earned $5.6 million in power credits, and ended the month holding 19,273 Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin at UATX: A New Era of Intellectual Sovereignty",
      "link": "https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_A_majestic_depiction_of_the_Texas_State_Ca_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty\" rel=\"nofollow\"> </a></p> <p>UATX’s Bitcoin Endowment and hands-on curriculum defy academia’s past. Students mine with Antminer S9s — could this shape Bitcoin’s academic future? </p> <p>"
    },
    {
      "title": "Blue Star Capital Secures £1.25M For Bitcoin and Crypto Treasury Expansion",
      "link": "https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Blue-Star-Capital-Secures-1.25M-For-Bitcoin-and-Crypto-Treasury-Expansion.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion\" rel=\"nofollow\"> </a></p> <p>The funding will be used to expand SatoshiPay’s Bitcoin and crypto treasury and enhance its crypto operations. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "House GOP Declares ‘Crypto Week’ to Advance Landmark Digital Asset Bills",
      "link": "https://decrypt.co/328567/house-gop-crypto-week-advance-landmark-digital-asset-bills",
      "summary": "House Republicans are coordinating a legislative blitz to reshape U.S. crypto regulation and block future state-issued digital currencies."
    },
    {
      "title": "Telegram's Crypto Ecosystem Notches Billion-Dollar Unicorn in The Open Platform",
      "link": "https://decrypt.co/328548/telegram-crypto-ecosystem-billion-dollar-unicorn-open-platform",
      "summary": "A key player in the Telegram-linked The Open Network (TON) crypto ecosystem just hit a $1 billion valuation with its latest funding round."
    },
    {
      "title": "Bitcoin Bullish Again? Potential All-Time High in Sight: Analysis",
      "link": "https://decrypt.co/328551/bitcoin-bullish-again-potential-all-time-high-sight",
      "summary": "Traders are gearing up for potential 4th of July fireworks as Bitcoin pops past $110,000 ahead of the holiday—though bearish vibes linger."
    },
    {
      "title": "Grayscale Calls SEC Trading Pause on ETF Holding Solana, XRP 'Unexpected'",
      "link": "https://decrypt.co/328547/grayscale-calls-sec-trading-pause-etf-holding-solana-xrp-unexpected",
      "summary": "The crypto asset manager attributed the decision to a fast-changing regulatory landscape."
    },
    {
      "title": "Will GPT-5 Be the Surprise Hit of the Summer? Here's What to Expect",
      "link": "https://decrypt.co/328500/openai-gpt-5-surprise-hit-summer-what-expect",
      "summary": "OpenAI’s new flagship model GPT-5 is nearly here. Industry insiders say it could be a game-changer—or just another overhyped upgrade."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump’s ‘Big Beautiful Bill’ clears Congress after narrow House vote, what could this mean for Bitcoin?",
      "link": "https://cryptobriefing.com/trump-tax-bill-congress-vote/",
      "summary": "<p>The bill's passage may lead to a liquidity squeeze, impacting Bitcoin's price volatility and potentially increasing national debt concerns.</p> <p>"
    },
    {
      "title": "Senator Lummis proposes to exempt small crypto transactions from taxes, ending double taxation for miners and stakers",
      "link": "https://cryptobriefing.com/crypto-tax-reform-innovation-users/",
      "summary": "<p>The proposed tax reform could boost crypto adoption, enhance U.S. competitiveness in digital finance, and simplify tax compliance for users.</p> <p>"
    },
    {
      "title": "TON builder The Open Platform raises $28.5 million, reaches $1 billion valuation in extended Series A",
      "link": "https://cryptobriefing.com/ton-blockchain-funding-unicorn-status/",
      "summary": "<p>The funding and valuation boost for The Open Platform could accelerate global blockchain adoption, leveraging Telegram's extensive user base.</p> <p>"
    },
    {
      "title": "IMF denies Pakistan’s proposal to offer cheap power to Bitcoin, crypto miners",
      "link": "https://cryptobriefing.com/crypto-mining-electricity-pakistan-imf/",
      "summary": "<p>The IMF's rejection highlights challenges in balancing economic growth with sustainable energy policies in developing nations.</p> <p>"
    },
    {
      "title": "Bitcoin could retest $90K as Trump’s Big Beautiful Bill sets stage for liquidity crunch: Arthur Hayes",
      "link": "https://cryptobriefing.com/bitcoin-liquidity-risk-tga-refill/",
      "summary": "<p>A potential liquidity drain from US fiscal policies could temporarily pressure Bitcoin, but long-term bullish trends remain intact.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum-backed stocks are booming – Here’s what’s fueling the surge",
      "link": "https://ambcrypto.com/ethereum-backed-stocks-are-booming-heres-whats-fueling-the-surge/",
      "summary": "<img alt=\"Ethereum-backed stocks are booming - Here’s what’s fueling the surge\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ethereum-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The Ethereum spot ETF inflows have begun to climb higher since June, reflecting increased investor confidence."
    },
    {
      "title": "Ripple CEO confirms, ‘Linqto owns 4.7M shares’ – But denies any direct sale",
      "link": "https://ambcrypto.com/ripple-ceo-confirms-linqto-owns-4-7m-shares-but-denies-any-direct-sale/",
      "summary": "<img alt=\"Ripple CEO confirms, &#039;Linqto owns 4.7M shares&#039; - But denies any direct sale\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ripple-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Linqto's collapse has affected Ripple shareholders drastically."
    },
    {
      "title": "BlackRock’s Bitcoin ETF just outperformed its core S&P 500 fund in revenue",
      "link": "https://ambcrypto.com/blackrocks-bitcoin-etf-just-outperformed-its-core-sp-500-fund-in-revenue/",
      "summary": "<img alt=\"BlackRock’s Bitcoin ETF Outpaces\" class=\"attachment-full size-full wp-post-image\" height=\"961\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/BlackRocks-Bitcoin-ETF-Outpaces.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1708\" />Is Bitcoin replacing traditional assets in elite portfolios?"
    },
    {
      "title": "HYPE reclaims $40 with $8.6M whale buy – Can it break ATH soon?",
      "link": "https://ambcrypto.com/hype-reclaims-40-with-8-6m-whale-buy-can-it-break-ath-soon/",
      "summary": "<img alt=\"HYPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/FE6E8BBD-0F6E-4324-B0A1-8200DD67C73C.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE’s recent appeal to investors may open the door to a broader rally."
    },
    {
      "title": "Ethereum hits $2.6k – With 6M ETH staked, what’s next for price action?",
      "link": "https://ambcrypto.com/ethereum-hits-2-6k-with-6m-eth-staked-whats-next-for-eths-price/",
      "summary": "<img alt=\"ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-03T143457.524-min-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum breaks above $2,590 after record accumulation and short liquidations fuel bullish momentum."
    }
  ]
}