{
  "CoinDesk": [
    {
      "title": "Cathie Wood's ARK Invest: Bitcoin Gains Coming Alongside Clear Stress in Housing, Autos",
      "link": "https://www.coindesk.com/markets/2025/06/10/cathie-woods-ark-invest-bitcoin-gains-coming-alongside-clear-stress-in-housing-autos",
      "summary": ""
    },
    {
      "title": "House Ag Committee Advances Market Structure Bill, Other Crypto Actions Pending",
      "link": "https://www.coindesk.com/policy/2025/06/10/house-ag-committee-advances-market-structure-bill-other-crypto-actions-pending",
      "summary": ""
    },
    {
      "title": "Negative Rates Return to Switzerland as U.S. Faces Higher Yields. What Does it Mean for Bitcoin?",
      "link": "https://www.coindesk.com/markets/2025/06/11/negative-rates-are-back-in-switzerland-as-u-s-faces-higher-bond-yields-what-does-it-mean-for-bitcoin",
      "summary": ""
    },
    {
      "title": "U.K. Regulator Names Sarah Pritchard as Deputy CEO to Help Oversee Crypto, Stablecoins",
      "link": "https://www.coindesk.com/policy/2025/06/10/uk-regulator-names-sarah-pritchard-as-deputy-ceo-to-help-oversee-crypto-stablecoins",
      "summary": ""
    },
    {
      "title": "Ether More Favored by Traders as Volatility Against Bitcoin Hits Highest Since FTX Crash",
      "link": "https://www.coindesk.com/markets/2025/06/10/ether-more-favored-by-traders-as-volatility-against-bitcoin-hits-highest-since-ftx-crash",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "House Agriculture Committee advances crypto market structure bill",
      "link": "https://cointelegraph.com/news/house-committee-crypto-market-structure-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5NDA5Y2MtOTM5YS03NjQ1LWI4NTYtOGU4MWE2ODIwYjk4.jpg\" /></p><p>The US House Agriculture Committee voted to advance the CLARITY Act for digital assets as lawmakers in the House Financial Services Committee debated an amendment for developers.</p>"
    },
    {
      "title": "Bitcoin’s &#039;fair value&#039; could be as high as $230K: Bitwise analysts",
      "link": "https://cointelegraph.com/news/bitcoin-fair-value-could-be-as-high-as-230k-bitwise-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVhNDMtMzBmYS03ODY1LWFlYTctOTQxNzJkNGZhNjFl.jpg\" /></p><p>Trump’s tax cuts and soaring US debt fuel Bitcoin’s rise as a hedge against sovereign default risks, potentially pushing BTC price toward $200,000 or more by 2025.</p>"
    },
    {
      "title": "How to use Grok for real-time crypto trading signals",
      "link": "https://cointelegraph.com/news/how-to-use-grok-for-crypto-trading?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVhZGMtNWZlYy03YzZjLWJkMmYtNGFkMzZiNTUwMzE1.jpg\" /></p><p>Grok scans posts and sentiment shifts on X to help crypto traders identify early signals, memes and macro-driven momentum plays.</p>"
    },
    {
      "title": "Ethereum network growth, spot ETH ETF inflows and price gains lure new investors",
      "link": "https://cointelegraph.com/news/ethereum-network-growth-spot-eth-etf-inflows-and-price-gains-lure-new-investors?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5NDE1ZGItNzY5Yy03ZmFhLWFlYzgtODc1ZWVlNDJiNmM2.jpg\" /></p><p>Ethereum’s dominance in staking, the spot crypto ETFs, and improving investor sentiment all point toward a sustained ETH price rally.</p>"
    },
    {
      "title": "Meta’s AI shortfall prompts Zuckerberg’s $15B investment in Scale AI — Report",
      "link": "https://cointelegraph.com/news/meta-acquires-49-percent-scale-ai-big-tech-ai-race?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVhYTEtYjlmZi03NDAyLThkZTgtNjZlZDFlMzZkMDFi.jpg\" /></p><p>Mark Zuckerberg is reportedly assembling a superintelligence group that will include Scale AI founder Alexandr Wang.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Blockchain Group wins approval for $11B raise to execute aggressive Bitcoin acquisitions",
      "link": "https://cryptoslate.com/blockchain-group-wins-approval-for-11b-raise-to-execute-aggressive-bitcoin-acquisitions/",
      "summary": "<p>The Blockchain Group on June 10 won shareholder approval to raise more than €10 billion ($11 billion) for additional Bitcoin (BTC) purchases effective immediately, formalizing a proposal first aired one day earlier. During an ordinary and extraordinary general meeting, investors holding 39% of voting rights backed every resolution with support exceeding 95%, according to a [&#8230;]</p> <p>"
    },
    {
      "title": "Guggenheim chooses Ripple’s XRPL for latest tokenized commercial paper issuance",
      "link": "https://cryptoslate.com/guggenheim-chooses-ripples-xrpl-for-latest-tokenized-commercial-paper-issuance/",
      "summary": "<p>Guggenheim Partners is bringing its Treasury-backed fixed-income product to the XRP Ledger (XRPL) through a new partnership with Ripple, Bloomberg News reported on June 10. Guggenheim Treasury Services, a subsidiary of the investment giant, will offer tokenized US commercial paper with customized maturity terms of up to 397 days on XRPL. The product is fully [&#8230;]</p> <p>"
    },
    {
      "title": "Alby faces backlash over ‘inactivity fees’ leading to unexpected Bitcoin withdrawals",
      "link": "https://cryptoslate.com/alby-faces-backlash-over-inactivity-fees-leading-to-unexpected-bitcoin-withdrawals/",
      "summary": "<p>Alby, a Bitcoin Lightning Network wallet, is facing mounting criticism after several users reported unexpected withdrawals from their accounts. The deductions, described as inactivity fees, have raised concerns about transparency and custodial risks. Community complaints against Alby The controversy gained traction on June 10 after Yu Xian, co-founder of blockchain security firm SlowMist, disclosed that [&#8230;]</p> <p>"
    },
    {
      "title": "80% of CME crypto futures expire by August",
      "link": "https://cryptoslate.com/80-of-cme-crypto-futures-expire-by-august/",
      "summary": "<p>CME’s Bitcoin futures and options structure has become increasingly condensed and cautious, with the vast majority of notional exposure now expiring within the next four weeks. At the same time, the annualized basis curve has flattened to its narrowest level since April, offering minimal incentive for arbitrage-driven carry trades and limited insight into longer-term market [&#8230;]</p> <p>"
    },
    {
      "title": "Cardano launches Cardinal to fuse Bitcoin liquidity with DeFi ecosystem",
      "link": "https://cryptoslate.com/cardano-launches-cardinal-to-fuse-bitcoin-liquidity-with-defi-ecosystem/",
      "summary": "<p>Cardano has taken a new step in bridging the gap between Bitcoin and decentralized finance by launching Cardinal. This protocol allows the top blockchain network to interact with Cardano&#8217;s DeFi ecosystem. Cardano founder Charles Hoskinson highlighted the release on June 9, sharing a post from Roman Pellerin, Chief Technology Officer at Input Output Global (IOG), [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Chainlink Cross-Border Play Expands To Hong Kong–Australia Money Movement",
      "link": "https://www.newsbtc.com/altcoin/chainlink-cross-border-play-expands-to-hong-kong-australia-money-movement/",
      "summary": "Chainlink is set to play a major role as Hong Kong’s central bank takes a big step in its digital currency tests. Phase two of the e-HKD pilot will try moving tokenized Hong Kong dollars across borders. The plan is to swap e-HKD for A$DC, an Australian dollar stablecoin. This could cut settlement times from days to seconds. It may also show how central banks can work together with blockchain technology. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Hong Kong And Australia Test Digital Cash According to reports, the project will use Chainlink’s Cross-Chain Interoperability Protocol, or CCIP, to handle transfers. The goal is simple. Move money in real time and make sure both sides get what they expect. Phase two kicks off with Hong Kong authorities and their counterparts in Australia. They will swap e-HKD for A$DC and aim for instant settlement. Based on reports, this setup could serve as a model for other central banks. We’re excited to share that Chainlink is facilitating the secure exchange of a Hong Kong CBDC and an Australian dollar stablecoin as part of an ongoing use case in Phase 2 of the e-HKD+ Pilot Program. Congratulations to participants @Visa, ANZ, China AMC, and Fidelity… pic.twitter.com/ts2C6Vt4Ul — Chainlink (@chainlink) June 9, 2025 Chainlink Tools In Use Chainlink is not just a name in the mix. It brings two big pieces of tech to the table. CCIP handles the cross-chain messages, acting like a bridge between different blockchains. The Digital Transfer Agent, or DTA, deals with compliance. It keeps track of who owns what token and makes sure rules in different countries are met. In May, World Liberty Financial tapped Chainlink for cross-chain stablecoin transfers covering USD1. That earlier deal hinted at what’s possible this time around. Big Names Join The Pilot Visa and ANZ are helping with payment processing for e-HKD and A$DC. Asset managers Fidelity International and ChinaAMC will also take part. Their job is to manage the tokenized funds on both sides. This mix of banks, asset managers and tech firms shows the project is more than a small test. It has real money and real risks involved. Reports disclosed that those risks are managed by a Payment-versus-Payment model. This means funds are only released when both sides confirm they have received the other asset. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Market Moves And Reactions LINK, the token for Chainlink, jumped by 6% after news of the pilot broke. It now trades at $14.70. That rise follows a wider market rally driven by hopes that Bitcoin may hit $110,000 before the week’s end. According to market data, crypto traders often chase big targets. Short-term gains can be tempting. But they can also lead to quick sell-offs if the main story fades. Despite the rally, Bitcoin still tracks the equity swings rather closely. There is a mix of bulls and bears in futures data that suggests some people are not yet convinced this run will last. High volatility can shake out weaker hands at the first sign of trouble. A sudden change in risk sentiment or a fresh macro shock can quickly reverse gains. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Dogecoin Primed For Liftoff If It Can Break This Barrier: Key Price Targets",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-liftoff-break-this-barrier-key-price-targets/",
      "summary": "Dogecoin skidded to a low near $0.168 last week before snapping higher to trade around $0.19 on Tuesday morning, up roughly six percent over 24 hours. The rebound unfolded in lock-step with bitcoin’s own recovery from the technically charged $106,800 level to just above $109,000, re-invigorating short-term dip-buyers across the memecoin complex. Dogecoin Needs To Conquer This Price Level Technical analyst Kevin (@Kev_Capital_TA) argues that the Fib defence has restored bullish structure—but only up to a point. “After coming down to the .382 Fib Dogecoin finally found the support it needed along with BTC finding support at 100K,” he wrote. “As it goes for the immediate future of **DOGE it has a lot of work to do. Big resistance at .19-.21 cent range will need to be broken in order to head back up to that .26-.28 level. Indicators on the daily time frame look bullish.” Bitcoin’s behaviour therefore remains pivotal. Spot BTC is hovering near $109,000 this morning and has so far defended the $106,800 pivot flagged by several high-profile analysts, including Michael van de Poppe, as the “linchpin for a potential rally”. Should Bitcoin extend toward the $120,000-$130,000 band, Kevin argues that Dogecoin will decouple from its dependence on the benchmark “when dominance tops and the market sniffs out easing monetary policy.” Crypto pundit Chandler (“@ChandlerCharts”) is less sanguine. Overlaying DOGE’s four-day price against DOGE/BTC, market cap and a relative-strength oscillator, his graphic highlights three prior compression phases—shaded grey—where the memecoin failed to sustain outperformance against Bitcoin. Related Reading: Bloodbath Incoming? Dogecoin Must Hold This Level To Survive “Even if DOGE breaks above its November highs, it won’t feel great if DOGE/BTC ends up way lower than it was at the November highs,” he cautioned. Chandler calculates that with BTC at $107,600, Dogecoin would have to print roughly $0.52 simply to reach a higher high against Bitcoin. “If BTC runs to $120-130k, DOGE needs to be around $0.60+ for holding DOGE to make sense over BTC.” Related Reading: Dogecoin Is Going To $1 With The ‘Next Impulse’, Analyst Predicts That threshold underscores the importance of the $0.19-$0.21 supply zone visible on both analysts’ charts. On Kevin’s canvas it coincides with the 0.618-0.703 Fib cluster; on Chandler’s, it overlaps the upper edge of an eighteen-month value area that has repeatedly rejected upside probes. A decisive close above $0.211 would place the May 11 summit at $0.2597 back in play and, more importantly for bulls. For now, traders are watching two numbers: $106,800 on Bitcoin and $0.21 on Dogecoin. A clean break of the latter would validate Kevin’s bullish roadmap toward $0.26-$0.28 and, by extension, keep alive the possibility of Chandler’s higher-high scenario on the DOGE/BTC cross. Until then, the memecoin’s fate indeed “remains in the hands of BTC’s capability in heading higher.” At press time, DOGE traded at $0.19. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Price Eyes 38% Jump To $3,500 As 50EMA Swims Into View",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-price-eyes-38-jump/",
      "summary": "Crypto analyst Crypto Bullet has raised the possibility of the Ethereum price surging by 38% soon. He alluded to the 50EMA as the only thing holding ETH from witnessing this price surge, but suggested that it could change soon with a breakout on the horizon. Ethereum Price Eyes 38% Jump To $3,500 In an X post, Crypto Bullet predicted that the Ethereum price could record a 38% surge to $3,500. This came following as he highlighted the ongoing battle between ETH and the 50EMA, noting that this indicator was the only thing holding the altcoin back from a parabolic surge. The analyst added that on average, a breakout results in a 38% pump, which puts Ethereum exactly at $3,500. Related Reading: Pundit Says Do Not Ignore Ethereum Amid New All-Time Highs In Major Metric As reported, Crypto Bullet also recently predicted that the Ethereum price could rally to $3,300 as a Morningstar Candle pattern formed. Back then, he noted that ETH was facing tough resistance at $2,500 but affirmed that the resistance would be broken in due time. He indicated that a breakout from that resistance will usher in the rally to $3,300. The Ethereum price has now broken above the $2,500 resistance, which provides a bullish outlook for the largest altcoin by market cap. Based on Crypto Bullet’s prediction, a rally to $3,300 may already be underway, which could then lead ETH to the $3,500 target. In a more recent X post, the crypto analyst commented on the recent break above $2,500. He stated that the Ethereum price is now trying to break the 200-day MA, which is between $3,000 and $3,300, for the fifth time. He indicated that a breakout above the range is likely to happen on this fifth attempt. His accompanying showed that ETH could rally to the $4,000 level if a successful breakout occurs. ETH About To Begin A New Bull Run Crypto analyst Trader Tardigrade predicted that another bull run is about to start for the Ethereum price. He noted that ETH’s daily candle closed above the resistance level at $2,650 yesterday and also opened above this resistance level today. The analyst added that ETH is now moving above it, which signals the start of a new bull run. Related Reading: FTX Repayments About To Dump $5B On The Market, How Will Bitcoin And Ethereum React? His accompanying chart showed that the Ethereum price is breaking out of an ascending triangle, which could send the altcoin above the psychological $3,000 level. Crypto analyst Mikybull Crypto also declared that Ethereum’s breakout will be huge, with ETH still maintaining its current range between $2,400 and $2,600. At the time of writing, the Ethereum price is trading at around $2,670, up over 7% in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin’s $110K Sprint Coincides With Record-Low Exchange Reserves",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoins-110k-sprint-coincides-with-record-low-exchange-reserves/",
      "summary": "Bitcoin’s price shook off last week’s dip and climbed sharply on Tuesday morning in Asia, topping $110,000 briefly before settling around $109,450. Traders rushed back in after the asset dipped close to $100,000, feeding a sharp rebound that leaves Bitcoin just 2.8% shy of its record high. A blend of forced liquidations, surging derivatives volume, easing US–China trade tensions and steady on-chain withdrawals is driving the move. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Heavy Liquidations Shift The Balance According to Coinglass, nearly $203 million in Bitcoin positions were wiped out over the past 24 hours. Of that, $195 million were against shorts. When so many short bets unwind at once, it forces buyers to cover positions, which can send prices spiking. Yet history shows these “short squeezes” can reverse quickly when traders take profits. Based on reports, Bitcoin’s derivatives volume more than doubled, climbing over 110% to $110 billion. Open interest then followed suit, expanding 7.3% to almost $77 billion. These kinds of inflows indicate that new money is accumulating. Both open interest and volume rising tends to indicate enthusiasm—and a willingness to carry through positions with swings. Trade Diplomacy Lifts Risk Assets Talks resumed in London on June 9 between the US and China over tariffs and export rules. Even a hint of progress tends to boost appetite for riskier assets, and Bitcoin isn’t immune. Headlines of smoother trade ties lifted equities earlier this week—and crypto traders moved in tandem. If negotiations hit a snag, though, Bitcoin could slide with global markets. On-Chain Data Shows Steady Accumulation CryptoQuant’s numbers reveal that centralized exchanges have shed 550,000 BTC since July 2024, falling from 1.55 million to about 1.01 million today. As coins leave exchanges, float tightens. At the same time, the Coinbase Premium indicator rose, with US buyers paying more than overseas investors. Santiment also reports renewed accumulation among wallets holding 10–100 BTC. This pattern hints at long-term holding rather than quick trades. Related Reading: Ignore The Trump–Musk Noise: Bitcoin’s Backbone Stays Solid Correlation And Caution Remain When you consider the rally, Bitcoin still dances on the tunes of equity price swings. Futures have mixed bets between bulls and bears, showing portrait-wise signs that certainly not everybody is convinced this run is going to hold. High volatility would tend to wash out weak hands at the slightest hint of trouble, any reversal of risk sentiment, or a sudden macro shock would cost the rally dearly. Optimism is building as analysts talk of fresh all-time highs. Some even eye $150,000 by the end of the year if US debt levels climb further. But sustaining a rally of that magnitude will require more than forced liquidations. Traders will watch derivatives flows, on-chain reserves and trade headlines for signs of real, lasting demand before pushing prices much higher. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "XRP Eyes $2.50 Decision Zone As Macro Wave Structure Takes Shape",
      "link": "https://www.newsbtc.com/xrp-news/xrp-eyes-2-50-decision-zone-macro-wave-structure/",
      "summary": "XRP changed hands at roughly $2.30 in early European trading on Tuesday, extending a two-day bounce that has pulled the token back toward the upper half of the seven-month range that has confined it between about $2.00 and $2.80 since December. Analyst Quantum Ascend argues that this compression phase is now approaching a technical fulcrum that will determine whether the next move is an impulsive wave-three surge or one final wave-two washout. XRP Tightens Into Decision Zone In a video posted on 9 June, the trader noted that “we’ve been in this range… since early December… between like $2.80 and $2.00 just bouncing the whole time,” before zooming out to show what he calls the only Elliott-wave count that “makes sense”: a completed five-wave advance from last year’s lows followed by a five-wave corrective pull-back. “Right now we’re looking at a one-two-three-four-five on the way down… that’s the macro two… and now we’re waiting on three-four-five,” he said, adding that XRP still represents about 12.5% of his portfolio despite his tactical rotation into “alts with more gas left.” Quantum Ascend’s Fibonacci mapping reveals that the token has already retraced slightly more than 50% of its preceding leg higher—a textbook depth for a second-wave correction—and that the sell-off bottomed in the price region that coincided with the fourth wave of the prior move. “Makes sense, perfect spot for us to bounce,” he told viewers after plotting the swing low against the 0.5 Fib level. Related Reading: XRP Bull Trap Incoming? Analyst Sees $2.40 Fakeout Before Painful Crash Whether that bounce blossoms into a sustained breakout, he stressed, ultimately hinges on the market leader: “I think Bitcoin’s gonna make the decision for us,” he said, pointing out that XRP’s fate remains tightly coupled to any directional conviction in BTC. Bitcoin’s own advance toward key retracement resistance could, in his view, drag major altcoins—including XRP—into their respective inflection zones. The analyst now fixes on the 0.618–0.786 Fib band, which corresponds to $2.42–$2.52, as the “decision zone.” “There’s gonna be an area that we gotta be careful of… statistically it’s the area we’re most probable to roll over… between $2.42 and $2.52,” he warned, outlining the risk that XRP forms an A-B-C zig-zag and revisits lower supports before the larger impulsive leg begins. A rejection there would map onto the classical script of a complex second wave that fakes out early longs one final time before relinquishing control to bulls. Related Reading: XRP Price Remains Bullish Above $2, This Falling Channel Says $3.8 Is Coming Macro currents may soon add fuel. XRP’s next potential volatility catalyst is the US Securities and Exchange Commission’s 17 June deadline on Franklin Templeton’s spot-XRP exchange-traded fund proposal—a ruling some desks see as the token’s analogue to January’s Bitcoin ETF moment. While ETF speculation has helped price reclaim higher ground this month, XRP remains almost a dollar below its January all-time high of $3.40, leaving the $2.42–$2.52 pocket as the most technically significant hurdle in the short term. For now, traders will watch whether the current advance can print a daily close inside—or better, above—that corridor. A clean break would validate Quantum Ascend’s wave-three thesis and open the charts to measured moves targeting the mid-$3s. Failure, by contrast, risks a final capitulation toward the lower-$2 region before the larger bull structure can re-assert itself. Whatever the outcome, the analyst remains sanguine: “Whether it rolls over here one more time and we have to be patient or it just goes—that’s okay, because either way the end result is going to be the same.” At press time, XRP traded at $2.28. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "The Trump’s American Bitcoin Merges with Gryphon, Reports 215 BTC on Balance Sheet Since Launch",
      "link": "https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ABTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch\" rel=\"nofollow\"> </a></p> <p>American Bitcoin Corp (ABTC), a newly formed private Bitcoin mining company backed by Eric Trump and Donald Trump Jr., announced in a June 10 SEC filing that it has acquired 215 Bitcoin (BTC) since launching operations on April 1, 2025. The reserve is currently valued at approximately $23 million, showing their drive and commitment to [&#8230;]</p> <p>"
    },
    {
      "title": "Canaan Announces Record Bitcoin Mining Month with Over 109 BTC Mined",
      "link": "https://bitcoinmagazine.com/news/canaan-announces-record-bitcoin-mining-month-with-over-109-btc-mined",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Canaan-Announces-Record-Bitcoin-Mining-Month-with-Over-109-BTC-Mined.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/canaan-announces-record-bitcoin-mining-month-with-over-109-btc-mined\" rel=\"nofollow\"> </a></p> <p>Canaan Inc. reported mining 109 bitcoins in the month of May. Now holding 1,466 BTC.</p> <p>"
    },
    {
      "title": "Quantum BioPharma Boosts Digital Asset Holdings to $5 Million with New Bitcoin Purchase",
      "link": "https://bitcoinmagazine.com/news/quantum-biopharma-boosts-digital-asset-holdings-to-5-million-with-new-bitcoin-purchase",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Quantum-Biopharma-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/quantum-biopharma-boosts-digital-asset-holdings-to-5-million-with-new-bitcoin-purchase\" rel=\"nofollow\"> </a></p> <p>In an expansion of its digital asset portfolio, Quantum BioPharma Ltd. has announced the purchase of an additional $500,000 in Bitcoin and other cryptocurrencies, bringing its total holdings to USD $5,000,000. The Canadian biopharmaceutical company made the move after securing approval from its Board of Directors. “Quantum BioPharma Ltd. is pleased to announce that after [&#8230;]</p> <p>"
    },
    {
      "title": "Robert Mitchnick Discusses BlackRock’s Bitcoin ETF IBIT Success On Bloomberg",
      "link": "https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Robert-Mitchnick-Discusses-BlackRocks-Bitcoin-ETF-IBIT-Success-On-Bloomberg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg\" rel=\"nofollow\"> </a></p> <p>BlackRock’s Head of Digital Assets, Robert Mitchnick, explains the key factors driving the surge in Bitcoin ETFs.</p> <p>"
    },
    {
      "title": "KULR Technology Group Announces $300 Million ATM Offering To Invest in Their Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>KULR entered a $300 million ATM offering to fund its Bitcoin treasury reserve, with Cantor Fitzgerald &#038; Co. and Craig-Hallum Capital Group LLC.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Ethereum Governance Tokens Spike as SEC Backs ‘Innovation Exemption’ for DeFi Projects",
      "link": "https://decrypt.co/324427/ethereum-governance-tokens-spike-as-sec-backs-innovation-exemption-for-defi-projects",
      "summary": "Uniswap, Aave, and Sky all started out as platforms on Ethereum."
    },
    {
      "title": "Next-Gen Xbox Preview: Everything You Need to Know About the Console and Crypto Plans",
      "link": "https://decrypt.co/198822/next-gen-xbox-everything-need-know-microsoft-leaks-rumors-news",
      "summary": "UPDATE: While the next-gen Xbox is likely still years away, Microsoft has unveiled the first Xbox handheld. Here's what we know so far."
    },
    {
      "title": "Bitcoin Core Devs Commit to Changing OP_RETURN Data Storage Limit By October",
      "link": "https://decrypt.co/324424/bitcoin-core-devs-commit-to-changing-op_return-data-storage-limit-by-october",
      "summary": "The controversial change expands data storage on Bitcoin to 4MB, a move that has stirred debate for months among its community."
    },
    {
      "title": "ETH leads majors, DeFi coins soar, HYPE hits ATH",
      "link": "https://decrypt.co/videos/interviews/O6XJMUeH/eth-leads-majors-defi-coins-soar-hype-hits-ath",
      "summary": "FOMO HOUR EP375 ETH leads majors as BTC briefly hits $110k. Staking not a securities transaction: Atkins. Atkins set to remove regulatory barriers for DeFi. AAVE & UNI lead DeFi coins higher. HYPE hits ATH, assistance fund now owns $1bn. Staked Ethereum hits ATH. Circle hits 4x IPO price. South Korea unveils plan to allow stablecoins. BTC Coinbase premium at 4-month high. Crypto fund assets hit record high in May. BlackRock BTC ETF fastest ever to hit $70bn AUM . Siebert to raise $100m to buy crypto. Japan’s ANAP adopts BTC reserve. Societe Generale launches USD stablecoin. ADA founder launches BTC DeFi protocol. Tether’s MOS to be open sourced in Q4 2025. Uphold explores IPO, or sale to payments firm. DoJ indicts Gugnin for laundering $530m crypto. FOMO HOUR brings you the biggest daily news, updates and events from inside and outside of the crypto and macro spheres! Join hosts Farokh, Mando and Tyler as they cover some of the biggest topics at present with some of the biggest names in the ecosystem. Streaming live 5 days per week, Monday to Friday 10:00 AM EST to 11:00 AM EST on YouTube and X. JOIN YEET = https://yeet.com/register?aff=fomohour PLAYLIST = https://www.youtube.com/playlist?list=PLGSgoImPFTiVpkHhLXF78cE_Z3uG7VNGL PODCAST = https://x.com/i/spaces/1kvKpydgqMQGE LIVE SPACE = https://x.com/i/spaces/1yNGaLOwmlrKj Links: https://linktr.ee/fomohour https://twitter.com/fomohour https://www.rug.fm/ https://x.com/rugradio Hosts: https://twitter.com/farokh https://twitter.com/rektmando https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets #bitcoin #crypto #podcast"
    },
    {
      "title": "While LA Burns Waymos, London Teases Driverless Car Pilot",
      "link": "https://decrypt.co/324410/la-burns-waymos-london-teases-driverless-cars",
      "summary": "UK to trial self-driving taxis in London by 2027 as Waymo cars get torched in LA protests—will autonomous vehicles survive the streets?"
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Wall Street’s Guggenheim Treasury brings its flagship tokenized debt instrument to XRP Ledger",
      "link": "https://cryptobriefing.com/guggenheim-treasury-launches-tokenized-commercial-paper-xrp-ledger/",
      "summary": "<p>The integration of tokenized debt on the XRP Ledger could accelerate blockchain adoption in traditional finance, enhancing liquidity and efficiency.</p> <p>"
    },
    {
      "title": "Eric Trump-backed American Bitcoin discloses 215 BTC holdings",
      "link": "https://cryptobriefing.com/american-bitcoin-btc-disclosure/",
      "summary": "<p>The strategic focus on Bitcoin accumulation by American Bitcoin could influence market dynamics and drive broader adoption and infrastructure development.</p> <p>"
    },
    {
      "title": "French banking giant Société Générale confirms launch of new stablecoin on Ethereum and Solana",
      "link": "https://cryptobriefing.com/usd-coinvertible-launch-sg-forge/",
      "summary": "<p>Socit Gnrale's stablecoin launch signifies a pivotal shift in traditional banking towards embracing blockchain technology and digital finance.</p> <p>"
    },
    {
      "title": "How UK crypto taxes work and what you need to know",
      "link": "https://cryptobriefing.com/how-uk-crypto-taxes-work/",
      "summary": "<p>The increasing scrutiny on crypto tax compliance in the UK highlights the need for investors to maintain accurate records and understand tax obligations.</p> <p>"
    },
    {
      "title": "Did Paraguay just make Bitcoin legal tender? Suspected hack of president’s X account sparks confusion",
      "link": "https://cryptobriefing.com/paraguay-bitcoin-legal-tender-hack/",
      "summary": "<p>The incident highlights the vulnerability of digital platforms in disseminating misinformation, potentially impacting national and global markets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "BNB transactions jump 275%: Can price break the $675 resistance?",
      "link": "https://ambcrypto.com/bnb-transactions-jump-275-can-price-break-the-675-resistance/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-10T131816.287-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB shows explosive on-chain growth, but resistance and liquidation zones could delay a breakout."
    },
    {
      "title": "SEC’s Paul Atkins pledges DeFi, self-custody support – How this affects Ethereum",
      "link": "https://ambcrypto.com/secs-paul-atkins-pledges-defi-self-custody-support-how-this-affects-ethereum/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/SECPaulAtkins.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Atkins said the agency will consider a conditional “innovation exemption” to drive on-chain products."
    },
    {
      "title": "HYPE rockets 11% as Bitcoin climbs – But what happens if $40 fails again?",
      "link": "https://ambcrypto.com/hype-rockets-11-as-bitcoin-climbs-but-what-happens-if-40-fails-again/",
      "summary": "<img alt=\"HYPE rockets 11% as Bitcoin climbs - But what happens if $40 fails again?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-1-5.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE’s rising fast - but is a shakeout next?"
    },
    {
      "title": "Breaking down the CLARITY Act: What it means for crypto’s future",
      "link": "https://ambcrypto.com/breaking-down-the-clarity-act-what-it-means-for-cryptos-future/",
      "summary": "<img alt=\"Breaking down the CLARITY Act: What it means for crypto&#039;s future\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-8-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The act aims to define U.S. crypto regulation, splitting oversight between SEC and CFTC."
    },
    {
      "title": "FARTCOIN surges 20% in 24 hours – $1.46 or $1.08, what’s next?",
      "link": "https://ambcrypto.com/fartcoin-surges-20-in-24-hours-1-46-or-1-08-whats-next/",
      "summary": "<img alt=\"Fartcoin surges 20% in 24 hours - $1.46 or $1.08, what&#039;s next?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-12.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />FARTCOIN surged 20.29% over the past day amid surging demand for memecoins."
    }
  ]
}