{
  "CoinDesk": [
    {
      "title": "BlackRock iShares Bitcoin ETF Surges Past 700K BTC in Record-Breaking Run",
      "link": "https://www.coindesk.com/markets/2025/07/08/blackrock-ishares-bitcoin-etf-surges-past-700k-btc-in-record-breaking-run",
      "summary": ""
    },
    {
      "title": "Australian Crypto Asset Manager DigitalX Secures Over $13M to Expand Bitcoin Holdings",
      "link": "https://www.coindesk.com/business/2025/07/08/australian-crypto-asset-manager-digitalx-secures-over-13m-to-expand-bitcoin-holdings",
      "summary": ""
    },
    {
      "title": "XRP Futures Open Interest Zooms to 5-Month High as Traders Seek Bullish Bets",
      "link": "https://www.coindesk.com/markets/2025/07/08/xrp-futures-open-interest-zooms-to-5-month-high-as-traders-seek-bullish-bets",
      "summary": ""
    },
    {
      "title": "Bonk.fun Grabs 55% of Solana Token Issuance Share, Pushes BONK Demand",
      "link": "https://www.coindesk.com/markets/2025/07/08/bonkfun-grabs-55-of-solana-token-issuance-share-pushes-bonk-demand",
      "summary": ""
    },
    {
      "title": "Coinbase Recovers to Listing Day Valuation. What Next for COIN?",
      "link": "https://www.coindesk.com/markets/2025/07/08/coinbase-recovers-to-listing-day-valuation-what-next-for-coin",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Crypto fundraising surges to $10B in Q2, highest since early 2022",
      "link": "https://cointelegraph.com/news/crypto-vc-funding-q2-2025-surge?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWI1MTgtZGRhMS03MGFmLWFiOGQtYjZhNDk1NjkyNmU1.jpg\" /></p><p>Crypto venture funding hit $10.03 billion in Q2 2025, its strongest quarter since early 2022, with June alone pulling in $5.14 billion.</p>"
    },
    {
      "title": "Bitcoin Mayer Multiple shows $108K BTC price undervalued: Analysis",
      "link": "https://cointelegraph.com/news/bitcoin-mayer-multiple-108k-btc-price-is-undervalued?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2U5MTgtYWViNC03ZmMyLWI0OWEtMWRiOTZhMDU5Zjlk.jpg\" /></p><p>Bitcoin is less overheated than during previous local bull market tops, but consensus is forming around an October blow-off top for BTC price action.</p>"
    },
    {
      "title": "Metaplanet eyes digital bank acquisition in phase 2 of Bitcoin strategy",
      "link": "https://cointelegraph.com/news/metaplanet-bitcoin-digital-bank-acquisition-strategy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5Njg1NzctMjY4NS03ZjA2LWI5NmItNDBkYTQ4ZTFkNmUz.jpg\" /></p><p>Metaplanet aims to leverage its growing Bitcoin treasury to acquire cash-generating businesses, with a digital bank in Japan among its possible targets.</p>"
    },
    {
      "title": "How Vietnam is using crypto to fix its FATF reputation",
      "link": "https://cointelegraph.com/news/how-vietnam-is-using-crypto-to-fix-its-fatf-reputation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2UzZTQtMjdlZC03NWYwLTg1MmQtM2VhNzk3NzRmZGJk.jpg\" /></p><p>Vietnam is leveraging crypto regulation to meet FATF standards, combat digital asset fraud and rebuild its international financial reputation.</p>"
    },
    {
      "title": "Bitcoin miner BitFuFu mines 445 BTC for its biggest production month",
      "link": "https://cointelegraph.com/news/bitfufu-record-bitcoin-mining-june-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGYzMzYtMWNlZi03ZDI2LTllNTItNzY3YjhjNTA0ODJi.jpg\" /></p><p>Bitcoin miners had a mixed bag in June, with Australian-based miner IREN reporting a record-breaking month for revenues, but lower Bitcoin production.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Polymarket faces backlash over disputed $200M Zelensky ‘suit’ market",
      "link": "https://cryptoslate.com/polymarket-faces-backlash-over-disputed-200m-zelensky-suit-market/",
      "summary": "<p>Polymarket, a crypto-based betting platform, has recently been involved in two controversies surrounding its resolution system, raising questions about the reliability of decentralized dispute mechanisms. One controversy centers on a $200 million bet on whether Ukrainian President Volodymyr Zelensky would wear a suit before the end of June. The wager&#8217;s outcome has sparked debate about [&#8230;]</p> <p>"
    },
    {
      "title": "Solana’s tokenized stock market more than triples in two weeks to hit $48M",
      "link": "https://cryptoslate.com/solanas-tokenized-stock-market-more-than-triples-in-two-weeks-to-hit-48m/",
      "summary": "<p>Solana’s tokenized stock market hit $48.53 million on July 4, up more than threefold from $15.28 million on June 20, according to on-chain data tracked by rwa.xyz. Solana’s tokenized stocks capitalization expanded more than threefold in two weeks, outpacing every other tracked network during the period. Furthermore, the tokenized stock market on Solana represented 11.4% [&#8230;]</p> <p>"
    },
    {
      "title": "EU regulators probing Robinhood’s tokenized equity plans after OpenAI raises concerns",
      "link": "https://cryptoslate.com/eu-regulators-probing-robinhoods-tokenized-equity-plans-after-openai-raises-concerns/",
      "summary": "<p>Robinhood’s private equity tokens, offering exposure to tech stocks like SpaceX and OpenAI, have triggered regulatory scrutiny in Europe after OpenAI raised concerns and said that the digital assets do not represent equity ownership in the company, CNBC reported on July 7. The Bank of Lithuania, which serves as Robinhood’s primary regulator in the European [&#8230;]</p> <p>"
    },
    {
      "title": "Cloudflare’s bot paywall could ignite a tokenized content gold rush",
      "link": "https://cryptoslate.com/cloudflares-bot-paywall-could-ignite-a-tokenized-content-gold-rush/",
      "summary": "<p>The following is a guest post and opinion from Ahmad Shadid, CEO at O.XYZ. For years, a broken value exchange has defined the web. AI companies, racing to build powerful models, deployed bots to scrape a vast internet of content without permission or compensation. This practice of harvesting news, art, and data undermined the creators [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin remains stuck in $100k-$110k band as retail and whales enter potential standoff",
      "link": "https://cryptoslate.com/bitcoin-remains-stuck-in-100k-110k-band-as-retail-and-whales-enter-potential-standoff/",
      "summary": "<p>Bitcoin (BTC) continued to trade between $100,000 and $110,500 for a second consecutive week as smaller investors replaced whales on the buy side, Bitfinex Alpha reported on July 7. The report noted that BTC spent most of July so far within a 10% channel, capped by the January high of $109,590 and floored near the [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "50% Bitcoin Price Crash On The Horizon? Analyst Reveals $60,000 Target",
      "link": "https://www.newsbtc.com/news/bitcoin/50-bitcoin-price-crash-60000/",
      "summary": "Despite the Bitcoin price holding up quite nicely above $100,000 and remaining very close to its all-time high levels, there continues to be expectations of a massive crash that would rock the market. Pseudonymous crypto analyst FriendlyRox points to a number of indicators for this, going from volume to momentum, all pointing to a possible price crash. What is the expected result of this? Losing the $100,000 psychological level and then falling to previous peaks. Bitcoin Price At Risk With Dwindling Volume And Momentum In the analysis, FriendlyRox highlighted the decline in major metrics such as momentum and volume as the major driver of the forecasted price crash. This comes amid bullish news dominating the headlines, such as institutions increasing their Bitcoin holdings and supply on exchanges falling toward new lows, meaning investors are choosing to hold for higher prices. Related Reading: Ethereum Ready For Explosive Breakout: $5,791 The Minimum Target–Analyst The decline in the volume has been apparent after the Bitcoin price had fallen below $100,000 before bouncing back up in June. So far, in the month of July, the Bitcoin trading volumes have trended lower, with data from Coinglass showing consistent daily volumes below $100 billion. At the same time, there has also been a decline in momentum, with the analyst pointing out a negative divergence in this metric. Furthermore, the Bitcoin price has also flashed a historical trend that has usually predated market tops. This is price reaching the 50 EMA (Exponential Moving Average) and then retracing. FriendlyRox revealed that in the past, whenever the price touched the 50 EMA and then extended back, it usually signalled a crash, and the Bitcoin price has done this now, extending even further. Other metrics that have also flashed bearishness include the RSI and the MACD, both of which are now showing a loss of momentum as they moved into the negative. All of these factors happening together at the same time have painted a pretty bleak picture for the leading cryptocurrency by market cap. BTC Bottom Targets With the lineup of bearish developments, the crypto analyst has predicted an approximately 50% from here. As volume continues to decrease and momentum slides into the negative, they expect that the Bitcoin price will be looking to retrace back to the 50 EMA. Related Reading: Bitcoin Must Hold $106,000 And $98,000 To Avoid Breakdown The interesting fact here is that the 50 EMA falls below the previous Bitcoin price peak, putting it at $60,000. A crash of this magnitude would only be rivaled by the COVID crash in 2020 and the FTX-induced market crash back in 2022. But nevertheless, it would mean a wipeout for altcoins across the board. As for the timeframe for when this could happen, there is no definite timeline. Going by the analyst’s chart, it could take a couple of years for this to completely play out, with the analyst closing with: “Let us see how it unfolds.” Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "No New Bitcoin Buys: Strategy Takes A Breather After 3 Consecutive Months",
      "link": "https://www.newsbtc.com/bitcoin-news/no-new-bitcoin-buys-strategy-takes-a-breather-after-3-consecutive-months/",
      "summary": "Strategy (previously MicroStrategy), the Bitcoin proxy firm co-founded by Bitcoin bull Michael Saylor, has made headlines once again on Monday, but not for its usual Bitcoin acquisitions, but for its notable absence of purchases during the week of June 30 to July 6. This marks the first time since late March that the largest corporate holder of BTC has not added to its impressive treasury, which currently stands at 597,325 Bitcoin, valued at approximately $64.71 billion. Strategy Bitcoin Investment Hits A Pause The lack of activity in Bitcoin acquisitions is surprising, especially given Strategy&#8217;s aggressive purchases over the past few months. These purchases have brought the company close to holding nearly 3% of the cryptocurrency’s total supply. From April 7 through June 29, the company invested $6.77 billion in acquiring 69,140 BTC, averaging about $97,906 per coin. At current market prices, these investments have appreciated by 10.4%, now worth around $7.49 billion. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 In terms of trading, Strategy&#8217;s stock (trading on the Nasdaq under the ticker symbol MSTR) saw a slight decline of 0.7% during morning trading hours, which is in line with the 0.8% drop in Bitcoin prices. As of this writing, MSTR closed the day at $395. This highlights the close relationship between the company’s performance and the volatility of the cryptocurrency market. However, the company&#8217;s stock has enjoyed a rise of 38.5% in 2025, outpacing BTC’s 16.1% increase and the S&#38;P 500&#8217;s modest gain of 6.1%. Up To $4.2 Billion For Future BTC Investments In addition to this pause in BTC purchases, Strategy did not issue any new common or preferred shares during the specified week. However, the company announced a sales agreement to potentially issue and sell up to $4.2 billion in 10% preferred stock. According to Monday’s press release on the matter by the Bitcoin proxy firm, the proceeds from this sales agreement are earmarked for general corporate purposes, which include future BTC acquisitions and working capital needs. Related Reading: Bitcoin To Repeat Parabolic Phase From 2017 And 2021? Here’s The Target The new preferred stock, known as Series A Perpetual Stride Preferred Stock, will be sold in a “disciplined manner,” taking market conditions into account, highlighting the firm’s ongoing commitment to leveraging its financial strategies to enhance its BTC holdings, even as it temporarily steps back from direct purchases. At the time of writing, BTC is trading at $107,855, marking a 1.5% decline within the last 24 hours, increasing the gap between the current price and its record by 3.5%. This follows a failed attempt last week to overcome the cryptocurrency&#8217;s most significant resistance level of $110,000 and establish a new all-time high above its current record of $111,800. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Back In ‘Retesting Phase’ After Key Level Reclaim – The Calm Before The Storm?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-back-in-retesting-phase-after-key-level-reclaim-the-calm-before-the-storm/",
      "summary": "After achieving its highest weekly close to date, Bitcoin (BTC) is now attempting to confirm two crucial levels as support before continuing its rally to new highs. Some analysts have suggested that the cryptocurrency may be experiencing a “calm before the storm” phase. Related Reading: Brazil’s Central Bank Hacked—$40M In Crypto Washed In Aftermath Bitcoin Set For Key Support Confirmations Bitcoin managed to close above two crucial levels over the past few days, recording its highest weekly close in history. Last week, the flagship crypto positioned itself for a reclaim of its final major weekly resistance around $109,000 after nearing this area for four days. On Sunday, BTC surged above the key barrier and closed the week around the $109,200 mark, also successfully confirming its diagonal daily trendline as support. Now, the cryptocurrency is retesting the final resistance to confirm the breakout. Rekt Capital affirmed that the goal is to turn this resistance into support, as it could push BTC to new all-time highs (ATH). He explained that “given how price barely Weekly Closed above the final Weekly resistance, it offers very little chance for price to cleanly retest this level into support; that is, this retest is likely going to be a volatile one.” Nonetheless, the analyst noted that the cryptocurrency has significant High Timeframe (HTF) support beneath it that “should act as a demand area to springboard price into Price Discovery Uptrend 2 over time.” Notably, Bitcoin reclaimed and held the high zone of its re-accumulation range, around the $104,400 mark, as support over the past two weeks. Meanwhile, June Monthly Closed above the $102,464 level and retested it post-breakout “to enable this current July upside candle,” setting it as a monthly support. Additionally, the $107,244 level also emerged as a crucial area after last month’s close, driving BTC “back to its retesting phase.” BTC To Breakout After The Summer? Rekt Capital considers BTC’s current phase as “the calm before the storm,” adding that “for as long as"
    },
    {
      "title": "Dogecoin Resistance Walls Ahead: Analyst Flags 3 Key Levels",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-resistance-walls-analyst-flags-3-key/",
      "summary": "An analyst has pointed out three key resistance levels for Dogecoin that could be to keep an eye on, based on on-chain data. Dogecoin URPD Shows These Price Levels Stand Out In a new post on X, analyst Ali Martinez has shared DOGE levels that could be important resistance boundaries. The levels in question correspond to major supply walls on the Dogecoin UTXO Realized Price Distribution (URPD). The URPD is an on-chain indicator from the analytics firm Glassnode that tells us about the total amount of the memecoin&#8217;s supply that was last purchased at the different price levels that it has visited over history. Related Reading: Bitcoin In For Another 460% Run? This Rare Fiat Signal Just Returned Now, here is the chart posted by Martinez that shows how the URPD looks for Dogecoin right now: As displayed in the above graph, the level closest to the latest Dogecoin spot price that stands out in terms of the URPD is $0.18. The investors last purchased around 8.94% of the asset&#8217;s supply around this mark. Naturally, as the level is above the spot price, all of these holders would be in the red at the moment. Generally, investors in loss look forward to retests of their break-even mark so that they can get their money &#8216;back.&#8217; Often, these holders push for the exit as soon as this happens, fearing that the price would go back down again in the near future. As such, whenever the price retests the cost basis of a notable part of the supply from below, a significant selling reaction can sometimes appear in the market. This can provide resistance to the cryptocurrency. Considering that the $0.18 level is particularly large, it can act as a point of notable resistance. Similarly, the analyst has also flagged two other levels: $0.21 (7.24% of supply) and $0.36 (3.82% of supply). Interestingly, between these two, there aren&#8217;t any significant supply walls, meaning that if Dogecoin can get into this zone, it may, at least in theory, have an easier time climbing up. In the scenario that DOGE gets rejected at the resistance, however, it may have to find support at the in-profit supply zones. Holders belonging to these levels can react to declines to their cost basis by buying more, as they may believe the drawdown to be just a dip-buying opportunity. Related Reading: Shiba Inu Supply Most Centralized Among Top Coins—62% Held By Just 10 Whales The only level below the current Dogecoin spot price that stands out in terms of supply is all the way down at $0.07. It hosts the acquisition mark of 20.03% of the memecoin&#8217;s supply, which means that it&#8217;s massive in size, and so, could be a strong support center. DOGE Price At the time of writing, Dogecoin is floating around $0.168, up 1.6% in the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "BNB Price Gears Up for Upside Break — Will Bulls Deliver?",
      "link": "https://www.newsbtc.com/analysis/bnb/bnb-price-gears-up-665/",
      "summary": "BNB price is gaining pace above the $650 support zone. The price is now showing positive signs and might aim for more gains in the near term. BNB price is attempting to recover from the $620 support zone. The price is now trading above $655 and the 100-hourly simple moving average. There is a key contracting triangle forming with resistance at $662 on the hourly chart of the BNB/USD pair (data source from Binance). The pair must stay above the $655 level to start another increase in the near term. BNB Price Eyes More Gains After forming a base above the $620 level, BNB price started a fresh increase. There was a move above the $645 and $650 resistance levels, like Ethereum and Bitcoin. The price even surged above the $660 level. A high was formed at $666 before there was a downside correction. The price dipped below the 50% Fib retracement level of the upward move from the $650 swing low to the $666 swing high. The price is now trading above $655 and the 100-hourly simple moving average. On the upside, the price could face resistance near the $662 level. There is also a key contracting triangle forming with resistance at $662 on the hourly chart of the BNB/USD pair. The next resistance sits near the $665 level. A clear move above the $665 zone could send the price higher. In the stated case, BNB price could test $672. A close above the $672 resistance might set the pace for a larger move toward the $680 resistance. Any more gains might call for a test of the $700 level in the near term. Another Decline? If BNB fails to clear the $662 resistance, it could start another decline. Initial support on the downside is near the $655 level and the 61.8% Fib retracement level of the upward move from the $650 swing low to the $666 swing high. The next major support is near the $650 level. The main support sits at $644. If there is a downside break below the $644 support, the price could drop toward the $632 support. Any more losses could initiate a larger decline toward the $620 level. Technical Indicators Hourly MACD – The MACD for BNB/USD is gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BNB/USD is currently above the 50 level. Major Support Levels – $655 and $650. Major Resistance Levels – $662 and $665."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "U.S. Court Brings Coin Center’s Tornado Cash Appeal To A Close",
      "link": "https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Tornado-Cash-Trial.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close\" rel=\"nofollow\"> </a></p> <p>Coin Center’s appeal to the U.S. Treasury Department’s Office of Foreign Asset Control (OFAC) regarding Tornado Cash is now over.</p> <p>"
    },
    {
      "title": "CleanSpark Announces Mining 685 Bitcoin Worth Over $74 Million In June",
      "link": "https://bitcoinmagazine.com/news/cleanspark-announces-mining-685-bitcoin-worth-over-74-million-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/CleanSpark-Announces-Bitcoin-Mining-Results-From-June-2025.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/cleanspark-announces-mining-685-bitcoin-worth-over-74-million-in-june\" rel=\"nofollow\"> </a></p> <p>CleanSpark mined 685 bitcoin in June, sold 578 BTC for over $61 million, and became the first miner to reach 50 EH/s using fully self-operated infrastructure.</p> <p>"
    },
    {
      "title": "Nakiki SE to Become First German Public Company With ‘Pure’ Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/nakiki-se-to-become-first-german-public-company-with-pure-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Nakiki-SE-to-Become-First-German-Public-Company-With-‘Pure-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/nakiki-se-to-become-first-german-public-company-with-pure-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>German listed company plans to become the nation’s first public firm with a pure Bitcoin treasury.</p> <p>"
    },
    {
      "title": "Trustodial: An Ontological Dilemma",
      "link": "https://bitcoinmagazine.com/technical/trustodial-an-ontological-dilemma",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Trustodial.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/trustodial-an-ontological-dilemma\" rel=\"nofollow\"> </a></p> <p>\"Trustodial\" systems like statechains introduce a dilemma in terms of what constitutes self custodial.</p> <p>"
    },
    {
      "title": "Semler Scientific Acquires 187 More Bitcoin, Surpassing 4,600 BTC in Holdings",
      "link": "https://bitcoinmagazine.com/news/semler-scientific-acquires-187-more-bitcoin-surpassing-4600-btc-in-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Semler-Scientific.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/semler-scientific-acquires-187-more-bitcoin-surpassing-4600-btc-in-holdings\" rel=\"nofollow\"> </a></p> <p>Semler Scientific has purchased an additional 187 Bitcoin for approximately $20 million, according to a new SEC filing. The acquisition brings the firm’s total Bitcoin holdings to 4,636 BTC, worth about $502 million at current market prices. The company disclosed the purchases were made between June 4 and July 2 at an average price of [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "What Are Coin Mixers and How Do They Work?",
      "link": "https://decrypt.co/resources/what-are-coin-mixers-tornado-cash-how-do-they-work",
      "summary": "Coin mixers like Tornado Cash have faced sanctions for aiding money laundering, but advocates argue they have legitimate use cases."
    },
    {
      "title": "DigitalX Taps Animoca’s Yat Siu, Raises $13.5M to Buy Bitcoin",
      "link": "https://decrypt.co/329044/digitalx-animoca-yat-siu-buy-bitcoin",
      "summary": "Roughly $12.8 million will go toward Bitcoin purchases, with the remainder slated for operating expenses and working capital."
    },
    {
      "title": "Apple’s Top AI Exec Leaves For Meta Amid Aggressive Hiring Trend",
      "link": "https://decrypt.co/329041/apple-top-ai-exec-leaves-metas-superintelligence-lab",
      "summary": "The executive's departure signals intensifying competition for elite talent and deepens concerns over Apple's generative AI strategy."
    },
    {
      "title": "Shenzhen Warns of Stablecoin Scams as Neighboring Hong Kong Pushes Ahead",
      "link": "https://decrypt.co/329038/shenzhen-warns-stablecoin-scams-neighboring-hong-kong",
      "summary": "Mainland officials have urged public caution amid a rise in crypto fraud as Hong Kong prepares to roll out rules for stablecoin issuers."
    },
    {
      "title": "US Politician’s Tweet Revives Cultural Debate Over UAPs",
      "link": "https://decrypt.co/329029/us-politicians-tweet-revives-cultural-debate-uaps",
      "summary": "A viral post has reignited debate over whether some UFO sightings may reflect ancient religious imagery rather than extraterrestrial life."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Ripple CEO Brad Garlinghouse to testify before US Senate Banking Committee on crypto legislation",
      "link": "https://cryptobriefing.com/crypto-market-legislation-senate-hearing/",
      "summary": "<p>Garlinghouse's testimony could accelerate US crypto regulation, potentially fostering innovation and consumer protection in digital markets.</p> <p>"
    },
    {
      "title": "SEC pushes Solana ETF issuers to refile by end of July, signals fast-track approval path",
      "link": "https://cryptobriefing.com/solana-etf-approval-sec-fast-track/",
      "summary": "<p>The SEC's expedited process for Solana ETFs could accelerate mainstream crypto adoption and diversify investment options in the US market.</p> <p>"
    },
    {
      "title": "US govt moves $200K in Ethereum to Coinbase after test transaction",
      "link": "https://cryptobriefing.com/us-government-ethereum-wallet-test-deposit-coinbase-prime/",
      "summary": "<p>The US government's Ethereum transaction hints at potential future asset management strategies, impacting market perceptions and crypto policies.</p> <p>"
    },
    {
      "title": "US government abandons Tornado Cash appeal after policy reversal",
      "link": "https://cryptobriefing.com/tornado-cash-sanctions-reversal/",
      "summary": "<p>The US government's policy reversal on Tornado Cash may influence future regulatory approaches to crypto technologies and international software.</p> <p>"
    },
    {
      "title": "Plume Network brings real-world yield to TRON’s global payment ecosystem via SkyLink integration",
      "link": "https://cryptobriefing.com/real-world-yield-tron-plume/",
      "summary": "<p>Plume Network integrates SkyLink with TRON, enabling users global access to real-world yield from asset-backed financial products.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "VIC crypto soars 60% in 24 hours – Is the rally just beginning?",
      "link": "https://ambcrypto.com/vic-crypto-soars-60-in-24-hours-is-the-rally-just-beginning/",
      "summary": "<img alt=\"VIC crypto soars 60% in 24 hours - Is the rally just beginning?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250708_094041_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />VIC could extend its gains in the coming days."
    },
    {
      "title": "Binance stablecoin reserves hit ATH – Is altseason just ONE move away?",
      "link": "https://ambcrypto.com/binance-stablecoin-reserves-hit-ath-is-altseason-just-one-move-away/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-15.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin exits exchanges, altcoins hit depression lows, and whales quietly reload for what’s next."
    },
    {
      "title": "Shiba Inu’s burn rate explodes 65,141% – Is a SHIB breakout finally coming?",
      "link": "https://ambcrypto.com/shiba-inus-burn-rate-explodes-65141-is-a-shib-breakout-finally-coming/",
      "summary": "<img alt=\"Shiba Inu Burn Rate Explodes 65,141% - Is a SHIB Breakout Finally Coming?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Shiba-Inu-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The 65,141% hike meant 1.007 billion Shiba Inu tokens were burnt in just 24 hours."
    },
    {
      "title": "Cup & Handle Breakout? Bitcoin targets $230K, Solana could skyrocket to $4,390!",
      "link": "https://ambcrypto.com/cup-handle-breakout-bitcoin-targets-230k-solana-could-skyrocket-to-4390/",
      "summary": "<img alt=\"Cup &amp; Handle Breakout? Bitcoin targets $230K, Solana could skyrocket to $4,390!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Solana-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Dwindling weekly trading volume since May highlighted the bearish bias of Solana in recent months."
    },
    {
      "title": "Hong Kong to launch stablecoin licensing in August 2025 – Details",
      "link": "https://ambcrypto.com/hong-kong-to-launch-stablecoin-licensing-in-august-2025-details/",
      "summary": "<img alt=\"Hong Kong stablecoins\" class=\"attachment-full size-full wp-post-image\" height=\"561\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Hong-Kong-stablecoins.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"998\" />With the U.S. racing ahead, can Hong Kong’s cautious stablecoin rollout really compete on a global stage?"
    }
  ]
}