{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Bitcoin Bulls Laser Focused on $120K Despite Trump-Musk Turmoil",
      "link": "https://www.coindesk.com/markets/2025/06/05/asia-morning-briefing-bitcoin-bulls-laser-focused-on-120k-despite-trump-musk-turmoil",
      "summary": ""
    },
    {
      "title": "Senate Stablecoin Bill Likely to Win Massive Bipartisan Support, Dem Lawmaker Says",
      "link": "https://www.coindesk.com/policy/2025/06/05/senate-stablecoin-bill-likely-to-win-massive-bipartisan-support-dem-lawmaker-says",
      "summary": ""
    },
    {
      "title": "Bitcoin Threatens $100K, Crypto Losses Grow as Musk/Trump Feud Goes Nuclear",
      "link": "https://www.coindesk.com/markets/2025/06/05/bitcoin-threatens-100k-crypto-losses-grow-as-musktrump-feud-goes-nuclear",
      "summary": ""
    },
    {
      "title": "OFAC Sanctions Philippines-Based Tech Company For Facilitating Pig Butchering Schemes",
      "link": "https://www.coindesk.com/policy/2025/06/05/ofac-sanctions-philippines-based-tech-company-for-facilitating-pig-butchering-schemes",
      "summary": ""
    },
    {
      "title": "Circle Soars 167% After IPO, Closing at $83 in First Day of Trading",
      "link": "https://www.coindesk.com/markets/2025/06/05/circle-soars-167-after-ipo-closing-at-83-in-first-day-of-trading",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "US wants $7.7M in crypto laundered in North Korea IT worker plot",
      "link": "https://cointelegraph.com/news/us-wants-crypto-laundered-north-korea-it-worker-plot?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQyNTktMzU4YS03YmI2LTgxYmItNmQyNTdjOGM0Yzc2.jpg\" /></p><p>The Justice Department has filed a civil forfeiture complaint to seize crypto and NFTs allegedly tied to laundering efforts by North Korea.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Maple Finance expands to Solana, deploys yield-bearing stablecoin",
      "link": "https://cointelegraph.com/news/maple-finance-expands-solana-yield-bearing-stablecoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGNiNmQtYzBjYy03NGQwLThmMDAtZWY1NzU5Y2Y2NjQ4.jpg\" /></p><p>Maple’s expansion to Solana is powered by Chainlink’s CCIP, which allows data transfer between EVM and SVM ecosystems.</p>"
    },
    {
      "title": "Institutional Bitcoin ETF holdings see first quarterly decline — Report",
      "link": "https://cointelegraph.com/news/institutional-bitcoin-etf-holdings-see-first-quarterly-decline-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzJkYzEtZjQyZC03NTg2LWE5MGUtMTVlYTFhYjI3ZDEw.jpg\" /></p><p>According to CoinShares, price depreciation, not selling pressure, was the main factor behind the drop in institutional BTC ETF exposure.</p>"
    },
    {
      "title": "Circle stock jumps 167% on NYSE debut",
      "link": "https://cointelegraph.com/news/circle-stock-price-jumps-167-in-first-day-of-trading-after-ipo?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmVhNDItYjllZS03ODcwLThhNWYtNmMzNzM0OGMwMmYw.jpg\" /></p><p>Circle had boosted its IPO to a range of $1.05 billion on June 4 as investor demand grew significantly.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Profit-taking, not capitulation: institutions cut Bitcoin ETF exposure by 23% in Q1",
      "link": "https://cryptoslate.com/profit-taking-not-capitulation-institutions-cut-bitcoin-etf-exposure-by-23-in-q1/",
      "summary": "<p>Institutional investors cut Bitcoin (BTC) allocations in US-based spot exchange-traded funds (ETFs) during the first quarter after hedging profits waned and futures premiums compressed, a June 5 CoinShares report showed. The report assessed 13-F filings from asset managers with at least $100 million in assets under management. These investors reported $21.2 billion in Bitcoin ETF [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin bulls must guard key $95.6k support as veteran holders cash in on gains",
      "link": "https://cryptoslate.com/bitcoin-bulls-must-guard-key-95-6k-support-as-veteran-holders-cash-in-on-gains/",
      "summary": "<p>Bitcoin (BTC) is suffering pressure from veteran holders securing gains and must hold the key $95,600 support level to remain bullish if it breaks below six-figures, according to a June 5 report by Glassnode. The report highlighted that after breaking below $103,700, the next major level of support is the psychological price level of $100,000 [&#8230;]</p> <p>"
    },
    {
      "title": "WLFI issues cease and desist notice to creators of ‘Official Trump Wallet’",
      "link": "https://cryptoslate.com/wlfi-issues-cease-and-desist-notice-to-creators-of-official-trump-wallet/",
      "summary": "<p>World Liberty Financial (WLFI), the crypto venture associated with President Donald Trump and members of his family, has issued a cease-and-desist letter to the creators of a newly announced Trump-branded crypto wallet, Bloomberg News reported on June 5, citing a person familiar with the matter. The letter, reportedly sent to Fight Fight Fight LLC, the [&#8230;]</p> <p>"
    },
    {
      "title": "Uber eyes stablecoins for faster settlements, lower FX costs for global operations",
      "link": "https://cryptoslate.com/uber-eyes-stablecoins-for-faster-settlements-lower-fx-costs-for-global-operations/",
      "summary": "<p>Uber is exploring dollar-pegged stablecoins as a tool for transferring funds across its global network, CEO Dara Khosrowshahi said on June 5 at the Bloomberg Tech conference in San Francisco. Khosrowshahi explained that blockchain-based tokens could settle payments faster than traditional correspondent bank channels and eliminate layers of foreign exchange fees. He said that stablecoins [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin dives below $102k amid fading momentum and macro uncertainty",
      "link": "https://cryptoslate.com/bitcoin-dives-below-102k-amid-fading-momentum-and-macro-uncertainty/",
      "summary": "<p>Bitcoin (BTC) plunged to a low of $101,500 on June 5, marking its sharpest decline in over a month as a wave of selling swept through crypto markets. The drop extended a multi-day slide triggered by shifting investor sentiment and declining demand from institutions. The world’s largest cryptocurrency touched a low of $101,500 before stabilizing [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Price Dips Sharply Below $102K as Profit-Taking Accelerates",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-dips-100500/",
      "summary": "Bitcoin price started a fresh decline and tested the $100,500 zone. BTC is now consolidating and might extend losses below the $100,000 level. Bitcoin started a fresh decline below the $104,000 zone. The price is trading below $104,000 and the 100 hourly Simple moving average. There was a break below a key bullish trend line with support at $104,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh decline if it breaks the $100,500 support zone. Bitcoin Price Dips Further Bitcoin price started a fresh decline and traded below the $104,500 support zone. BTC even settled below the $104,200 level to enter a short-term bearish zone. Besides, there was a break below a key bullish trend line with support at $104,600 on the hourly chart of the BTC/USD pair. Finally, the pair tested the $100,500 support zone. A low was formed at $100,400 and the price is now consolidating losses. There was a move above the $101,500 level. BTC tested the 23.6% Fib retracement level of the recent decline from the $106,820 swing high to the $100,400 low. Bitcoin is now trading below $103,000 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $102,000 level. The first key resistance is near the $103,200 level. The next key resistance could be $103,600. It is close to the 50% Fib retracement level of the recent decline from the $106,820 swing high to the $100,400 low. A close above the $103,600 resistance might send the price further higher. In the stated case, the price could rise and test the $104,200 resistance level. Any more gains might send the price toward the $105,000 level. More Losses In BTC? If Bitcoin fails to rise above the $103,200 resistance zone, it could start another decline. Immediate support is near the $101,200 level and the trend line. The first major support is near the $100,500 level. The next support is now near the $100,000 zone. Any more losses might send the price toward the $98,500 support in the near term. The main support sits at $97,200, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $101,200, followed by $100,500. Major Resistance Levels – $102,000 and $103,600."
    },
    {
      "title": "From Wall Street To Red Square: Moscow Exchange Lists BlackRock Bitcoin Futures",
      "link": "https://www.newsbtc.com/news/bitcoin/from-wall-street-to-red-square-moscow-exchange-lists-blackrock-bitcoin-futures/",
      "summary": "Russia’s main exchange. the Moscow Exchange, has started offering Bitcoin futures contracts. This is one of the biggest moves yet in the country’s slow but steady opening to cryptocurrencies. According to market insiders, these new contracts track the price of the BlackRock Bitcoin ETF, which has gathered over $72 billion in assets. Related Reading: $500M Bet On Solana: Education Platform Aims To Supercharge Its Treasury Trades will be priced in US dollars per lot, while settlements will happen in Russian rubles. This setup lets local traders tap into Bitcoin’s price swings without touching foreign crypto platforms. Quarterly Contracts Linked To IBIT These Bitcoin futures will come out every three months, with the first batch due to expire in September 2025. Based on reports, only qualified investors will be allowed to trade on the MOEX. That means big banks, funds, and other approved financial groups can take part. Ordinary investors won’t get in on these deals. The Bank of Russia gave the green light in May 2025 for such products, but it still warns most firms to steer clear of direct crypto deals. The idea seems to be to let big players handle the risk in a controlled way. Local Settlements Keep Risk In Rubles Moscow Exchange decided to price the contracts in US dollars. However, when it’s time to settle, everything happens in rubles. This approach protects Russia from sudden swings in foreign markets. A trader can lock in a deal based on Bitcoin’s value in dollars, yet get paid in their home currency. It’s a setup that keeps money inside Russia even as it ties to a global crypto product. Some analysts see this as a smart middle ground. It lets Russia join the international cryptocurrency scene but without depending on overseas platforms. 🚀 Moscow Stock Exchange Launches #Bitcoin Futures Contracts will only be available to qualified investors, with the futures tied to the value of the iShares Bitcoin Trust ETF, quoted in US dollars, and settled in Russian rubles. (TASS) The launch follows Sberbank&#8217;s approval… pic.twitter.com/wMTRlK2Y0y — RT_India (@RT_India_news) June 4, 2025 Bank Of Russia’s Cautious Stance Behind the scenes, the central bank is still cautious. It approved crypto-linked derivatives for qualified investors, but it hasn’t opened the door for everyone. Most banks and investment firms are told not to put their clients into direct Bitcoin trades. Instead, they can offer tools like these futures if they qualify. This reflects a watchful stance on digital assets. Authorities acknowledge the lure of big profits, but they also want to avoid big losses. By keeping access limited, they hope to keep any trouble contained. Related Reading: Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge Sberbank’s New Bitcoin-Linked Bonds Meanwhile, Sberbank, the country’s biggest bank, is working on its own crypto-based product. Soon, select clients will be able to buy structured bonds tied to Bitcoin’s price. These bonds will also trade in rubles and won’t require a crypto wallet. That way, people can bet on Bitcoin without opening accounts on foreign sites. Featured image from Lonely Planet, chart from TradingView"
    },
    {
      "title": "What Happens To The XRP Price If The 2017 Fractal Plays Out Again?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-2017-fractal-reappearing/",
      "summary": "XRP&#8217;s price action is currently exhibiting a back-and-forth pattern around $2.20, but an interesting technical analysis suggests it may soon leave this price level. A chart analysis posted by a crypto analyst on the social media platform X has given an interesting projection about XRP’s next move. By overlaying XRP’s current weekly chart with its explosive 2017 fractal, the analyst hints that the altcoin might be on the verge of a repeat performance that sends it far beyond its current price range. 2017 XRP Fractal Overlaid Technical analysis of XRP price action on the weekly timeframe reveals an interesting pattern that has been unfolding over multiple weeks. This interesting pattern began with the intense XRP price rally in Q4 2024, which eventually ended in a consolidation around $2, as seen in the current price action. This, in turn, has led to the formation of a flag pattern that is still playing out. Related Reading: Analyst Shows 3-Cycle Ride For XRP Price To Reach $46 The core of the analyst&#8217;s technical analysis lies in the uncanny resemblance between XRP’s present market structure and the bullish pattern that preceded the historic 2017 rally. As such, the analyst overlaid the 2017 fractal onto the current price action, revealing a formation that mirrors a giant bull flag, which is often interpreted as a technical continuation pattern. The analysis also places into focus XRP’s ongoing interaction with the 50-week exponential moving average (EMA) on the weekly candlestick timeframe. Back in 2017, this level acted as a support base for XRP’s vertical breakout. Now, the current pattern shows the cryptocurrency is once again consolidating directly above this moving average, which the analyst describes as the foundation of a giga bull flag. The resemblance doesn’t stop at price structure. The analyst also draws attention to the RSI behavior. Back in 2017, the RSI entered a flat compressed zone between two spikes on the weekly timeframe, a pattern that appears to be repeating today. The first RSI peak has already formed, and the current flattening phase suggests a possible second spike may soon follow, which could correlate with a breakout in price if the fractal stays valid. What To Expect If 2017 Fractal Plays Out Again? The implications are exciting if XRP follows the same trajectory as it did in 2017. The overlay suggests a price rally beyond $20, which would represent the biggest rally so far in XRP&#8217;s price history. The projected move would take XRP far beyond its 2018 all-time high of $3.40 and establish a new price floor above double digits for the cryptocurrency. This projection aligns with other projections in similar technical analyses from other cryptocurrency analysts. Related Reading: XRP Price Is Now Targeting $4 After Reversal From ‘Buy Zone’ At the time of writing, XRP is trading at $2.2, down by 2,3% in the past 24 hours. Whether or not XRP follows the 2017 pattern exactly remains to be seen, but the similarities in price behavior, RSI compression, and EMA support are difficult to dismiss. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Crypto Analyst Warns: This Bitcoin Bull Cycle Looks Nothing Like 2017 or 2021",
      "link": "https://www.newsbtc.com/bitcoin-news/crypto-analyst-warns-this-bitcoin-bull-cycle-looks-nothing-like-2017-or-2021/",
      "summary": "Bitcoin’s price continues to show signs of consolidation following its all-time high of over $111,000 recorded in May. At the time of writing, the asset is trading at $104,851, down 0.3% in the past 24 hours and roughly 6.3% below its recent peak. This period of relative price stability comes amid cautious sentiment across the broader crypto market, as analysts examine whether the current bull cycle is beginning to shift gears or simply experiencing a temporary pause. CryptoQuant contributor Crypto Dan has released a comparative analysis of current and past market cycles, noting several distinct behaviors in Bitcoin’s recent price action. Drawing parallels to the bull runs of 2017 and 2021, Dan suggests that while similarities exist, the current cycle has developed unique characteristics. These changes could signal a different structure in how the market plays out, particularly in terms of timing and investor participation. Related Reading: Bitcoin Scarcity May Spark Explosive Surge, Bank Study Shows Comparing Bitcoin Cycles: 2024–2025 Diverges from Historical Patterns According to Dan, previous cycles saw more predictable corrections and rallies. In 2017, Bitcoin experienced relatively short corrections before entering a prolonged rally that concluded in late December of that year. The 2021 cycle, affected early on by the COVID-19 pandemic, featured a longer initial correction before a strong upward surge. In both cases, once Bitcoin gained momentum, corrections became less frequent and shorter in duration. The current cycle, spanning 2024–2025, has so far been marked by alternating strong rallies and sudden declines, often occurring over short timeframes. These patterns have dampened broader market sentiment, particularly during periods when altcoins significantly underperformed Bitcoin. Dan posits that these repeated pullbacks may not be purely organic. Instead, they could indicate intentional suppression by large players aiming to extend the cycle’s duration and prevent overheating. If this interpretation holds, the bull cycle could end not with a gradual fade, but a sharp spike driven by euphoric buying behavior. Retail Activity Declines as Institutions Drive Market Structure A separate analysis by CryptoQuant’s Burak Kesmeci focuses on the behavior of retail investors since Bitcoin hit its $111,000 high in late May. Data shows that retail transfer volumes, transactions valued between $0 and $10,000, have decreased from $423 million to $408 million. Additionally, the 30-day change in retail demand has slipped into negative territory, shifting from +5 points to -0.11 points. This reduction in retail activity suggests that smaller investors remain sensitive to short-term volatility, stepping back in response to recent price corrections. Related Reading: The Last Bitcoin Cycle? Swan Says History’s Turning Kesmeci argues that for the bull cycle to sustain momentum, consistent participation from retail segments is crucial. At present, institutional interest appears to be the primary source of demand. The divergence between these two investor classes may shape how the next leg of Bitcoin’s market cycle develops. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin Hash Ribbons Indicating Prime Buying Opportunity, Analyst Says",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-hash-ribbons-indicating-prime-buying-opportunity-analyst-says/",
      "summary": "Bitcoin (BTC) remains range-bound in the mid-$100,000s, showing no clear directional bias. However, the Hash Ribbons indicator is now flashing a fresh buy signal, suggesting that the top cryptocurrency may be gearing up for its next upward move. Bitcoin Hash Ribbons Flash Buy Signal According to a recent CryptoQuant Quicktake post by contributor Darkfost, Bitcoin’s Hash Ribbons are signalling a potential prime buying opportunity for the leading digital asset. This signal coincides with Bitcoin’s hashrate reaching new all-time highs (ATH). Related Reading: Bitcoin Mining Giant Abandons Full-Hold Strategy, Unloads $40M In Crypto For the uninitiated, Bitcoin Hash Ribbons is an on-chain indicator that analyzes miner stress by comparing the 30-day and 60-day moving averages of Bitcoin’s hashrate. When the short-term average crosses above the long-term average after a period of decline, it signals that miner capitulation is ending &#8211; often marking a strong long-term buying opportunity. Such signals can emerge when mining becomes unprofitable for certain miners, forcing them to sell their BTC holdings to stay afloat. These sell-offs may temporarily pressure the price, but historically they have created attractive long-term buying opportunities. In their analysis, Darkfost notes that while the current signal is bullish from a long-term perspective, it could lead to a short-term pullback in BTC price. However, he emphasizes that any dip should be viewed as a chance to accumulate. Darkfost also pointed out that the Hash Ribbons indicator has historically been reliable, with the exception of 2021 during the China mining ban. They shared the following chart illustrating how the indicator is currently showing a strong buy signal. Is BTC Headed For A Crash? While the Hash Ribbons suggest a favorable long-term setup, some analysts warn that the short-term correction could be deeper than expected. For instance, crypto analyst Xanrox used the Fibonacci levels to forecast that BTC may tumble as low as $98,000. Related Reading: Bitcoin Warning Signs? Long-Term Holders Exit While Retail Buyers Rush In Similarly, analyst Jelle noted that Bitcoin may face “one last speed bump” before launching a major rally to $140,000. Meanwhile, more pessimistic voices continue to warn of a dramatic crash, with some speculating that BTC could fall below $10,000 &#8211; a view seen as increasingly unlikely by most market participants. Despite the varying predictions, fresh on-chain data points to a healthy BTC market in the near to medium term. For instance, CryptoQuant contributor Amr Taha recently highlighted that the derivatives market has undergone a reset, with funding rates stabilizing around neutral levels. Similarly, Fundstrat’s Head of Research, Tom Lee foresees BTC surging to as high as $250,000 by the end of the year. At press time, BTC trades at $105,367, up 0.5% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin vs Stablecoins: Bitcoin is an Unreplicable Lifeline in Authoritarian Regimes",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Authoritarian-leader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes\" rel=\"nofollow\"> </a></p> <p>Bitcoin operates beyond any government’s grasp. Its value isn’t in replacing stablecoins — it’s in doing what they fundamentally cannot do.</p> <p>"
    },
    {
      "title": "Bitcoin Life Insurer, Meanwhile, Becomes First Company to Publish Audited Financials Denominated in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Meanwhile-Insurance.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Meanwhile Insurance Bitcoin (Bermuda) Limited (“Meanwhile”) announced it has become the first company in the world to release externally audited financial statements denominated entirely in Bitcoin. According to the announcement, the company reported 220.4 BTC in assets and 25.29 BTC in net income for 2024, a 300% year over year increase. “We’ve just made history [&#8230;]</p> <p>"
    },
    {
      "title": "President Trump’s Truth Social Files S-1 Form For Bitcoin ETF",
      "link": "https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Eric-Trump-Said-Everybody-Wants-Bitcoin.-Everybody-is-Buying-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf\" rel=\"nofollow\">President Trump&#8217;s Truth Social Files S-1 Form For Bitcoin ETF</a></p> <p>Truth Social filed for an S-1 Form for a Bitcoin ETF.</p> <p>"
    },
    {
      "title": "Botanix Launches Federated Sidechain with 16 Members On Testnet",
      "link": "https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_giant_robot_spider_with_big_matrix_code_ch_2-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members\" rel=\"nofollow\"> </a></p> <p>Botanix launches a decentralized Bitcoin sidechain on testnet with a 16-node federation, using the Spiderchain protocol for EVM-compatible dApps. Mainnet set for Q3 2025.</p> <p>"
    },
    {
      "title": "Matador Technologies Raises C$1.64M To Invest in Their Bitcoin Reserve",
      "link": "https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Matador-Technologies-Raising-C1-Million-to-Invest-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve\" rel=\"nofollow\"> </a></p> <p>Matador Technologies announced it raised C$1,644,300 across the issuance of 2,652,097 units to add more bitcoin to their reserve.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "How Circle’s IPO Stacks Up Against Other Crypto Market Debuts",
      "link": "https://decrypt.co/323939/how-circles-ipo-stacks-up-against-other-crypto-market-debuts",
      "summary": "Circle closed with an $18.4 billion valuation, well below Coinbase’s IPO but ahead of newer entrants like Fold and eToro."
    },
    {
      "title": "'A Different Era': Bored Ape Creator Yuga Labs Wants to Kill the ApeCoin DAO",
      "link": "https://decrypt.co/323902/bored-ape-creator-yuga-labs-wants-kill-apecoin-dao",
      "summary": "Bored Ape Yacht Club creator Yuga Labs has proposed axing the ApeCoin DAO, with plans to create a new entity to oversee the Ethereum token."
    },
    {
      "title": "VPN Usage Spikes in France as Pornhub Blocks Users Over Age Restrictions",
      "link": "https://decrypt.co/323881/vpn-usage-spikes-france-pornhub-age-restrictions",
      "summary": "Pornhub’s France block over age checks sparked a 1,000% ProtonVPN signup surge, highlighting pushback against ID laws."
    },
    {
      "title": "Myriad Moves: Will Musk Kick Trump Off X? Plus Ethereum and French Open Predictions",
      "link": "https://decrypt.co/323894/myriad-moves-musk-trump-x-ethereum-french-open",
      "summary": "Myriad Markets users are putting their money where their mouths are on the Musk/Trump schism, Ethereum's price, the French Open, and beyond."
    },
    {
      "title": "'So Sad': The Trump and Musk Break-Up, Tweet by Tweet",
      "link": "https://decrypt.co/323892/so-sad-trump-musk-break-up-tweets",
      "summary": "What happens when two of the most powerful people in the world have a messy split—and it all happens in public? Sweet, sweet calamity."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump–Musk feud escalates as Musk accuses Trump of appearing in Epstein files",
      "link": "https://cryptobriefing.com/trump-musk-contracts-epstein-allegation/",
      "summary": "<p>Trump threatens to cut Musks government contracts after backlash over $1.6T bill. Musk fires back with Epstein claim as Tesla sinks 20%.</p> <p>"
    },
    {
      "title": "Truth Social Bitcoin and Ethereum ETF registered in Nevada",
      "link": "https://cryptobriefing.com/truth-social-cryptocurrency-investment-trusts/",
      "summary": "<p>This move could enhance crypto market accessibility and legitimacy, potentially influencing broader adoption and regulatory perspectives.</p> <p>"
    },
    {
      "title": "Trump’s sons send cease-and-desist to his meme coin team over Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/trump-branded-crypto-wallet-dispute/",
      "summary": "<p>The cease-and-desist highlights potential legal and reputational risks in unauthorized use of high-profile names in crypto ventures.</p> <p>"
    },
    {
      "title": "Tesla shares tumble as Trump-Musk bromance collapses days after farewell",
      "link": "https://cryptobriefing.com/tesla-stock-tumble-trump-musk/",
      "summary": "<p>The fallout may impact Tesla's market stability and influence future corporate-political alliances, highlighting risks of volatile partnerships.</p> <p>"
    },
    {
      "title": "Trump Media files Form S-1 for Truth Social Bitcoin ETF with SEC",
      "link": "https://cryptobriefing.com/truth-social-bitcoin-etf-sec/",
      "summary": "<p>The filing could influence regulatory perspectives on crypto ETFs and highlight the intersection of politics and cryptocurrency markets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin’s HODL level hits 2-year high: Are LTHs the key to BTC’s next surge?",
      "link": "https://ambcrypto.com/bitcoins-hodl-level-hits-2-year-high-are-lths-the-key-to-btcs-next-surge/",
      "summary": "<img alt=\"Bitcoin’s HODL level hits 2-year high: Are LTHs the key to BTC&#039;s next surge?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-4.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin's HODL level hits a 2-year high as accumulation scores for mid and small buyers hit 1.0."
    },
    {
      "title": "BlackRock buys $357 mln in BTC, ETH amid shifting whale sentiment",
      "link": "https://ambcrypto.com/blackrock-buys-357-mln-in-btc-eth-amid-shifting-whale-sentiment/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_34_-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BlackRock purchases $357M in crypto as Ethereum whales accumulate and Bitcoin whales shift to profit-taking."
    },
    {
      "title": "DOJ shuts down 145 BidenCash sites: ‘Not anonymous anymore’",
      "link": "https://ambcrypto.com/doj-shuts-down-145-bidencash-sites-not-anonymous-anymore/",
      "summary": "<img alt=\"DOJ shuts down 145 BidenCash sites: &#039;Not anonymous anymore&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_35_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />U.S. shuts down BidenCash and seizes domains and crypto in coordinated dark web crime crackdown."
    },
    {
      "title": "Maker: 60% holders in profit, whales stake big – So why did MKR dip 5%?",
      "link": "https://ambcrypto.com/maker-60-holders-in-profit-whales-stake-big-so-why-did-mkr-dip-5/",
      "summary": "<img alt=\"Maker: 60% holders in profit, whales stake big - So why did MKR dip 5%?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-1-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whales continued to stake SKY, with Maker breaking above a key trendline resistance on the weekly price chart."
    },
    {
      "title": "VIRTUAL: Smart money dumps $1.2mln, then buys back – What’s the plan?",
      "link": "https://ambcrypto.com/virtual-smart-money-dumps-1-2mln-then-buys-back-whats-the-plan/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250605_120157_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Top-of-mind interest in VIRTUAL has benefited the asset."
    }
  ]
}