{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Asia's Banks Look to Stablecoins to Prevent Deposit Flight",
      "link": "https://www.coindesk.com/markets/2025/06/26/asia-morning-briefing-asias-banks-look-to-stablecoins-to-prevent-deposit-flight",
      "summary": ""
    },
    {
      "title": "Coinbase Comes Full Circle, Soars to Highest Price Since 2021 Nasdaq Debut",
      "link": "https://www.coindesk.com/markets/2025/06/26/coinbase-comes-full-circle-soars-to-highest-price-since-2021-nasdaq-debut",
      "summary": ""
    },
    {
      "title": "Bitcoin Holds Above $107K Ahead of Friday’s Big Options Expiry With $102K Max Pain Price",
      "link": "https://www.coindesk.com/markets/2025/06/26/btc-holds-above-107k-ahead-of-fridays-big-options-expiry-with-102k-max-pain-price",
      "summary": ""
    },
    {
      "title": "Lingerie Fighting Championships to Add $2M in Bitcoin to Treasury Ahead of Expansion to UK",
      "link": "https://www.coindesk.com/markets/2025/06/26/lingerie-fighting-championships-to-add-2m-in-bitcoin-to-treasury-ahead-of-expansion-to-uk",
      "summary": ""
    },
    {
      "title": "Core Scientific Soars 25% as WSJ Reports Buyout Talks With CoreWeave",
      "link": "https://www.coindesk.com/markets/2025/06/26/coreweave-back-in-talks-to-acquire-bitcoin-miner-core-scientific-wsj",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bakkt Holdings files $1B shelf offering that could fuel Bitcoin buys",
      "link": "https://cointelegraph.com/news/bakkt-holdings-files-1b-shelf-offering-to-buy-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FmMWQtZmM0Zi03ODdlLTljMzgtZThhOTdhODA4OGYz.jpg\" /></p><p>Bakkt has filed for a $1 billion shelf registration after the firm updated its investment policy earlier this month to allow it to buy Bitcoin and other cryptocurrencies.</p>"
    },
    {
      "title": "AI crypto app users nearly double this year as funding beats 2024 total",
      "link": "https://cointelegraph.com/news/ai-crypto-activity-near-double-2025-funding-beats-2024?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDNkMDktMzQzNi03ZDhiLWIzYzUtN2QyOTQ5OGNjMzgx.jpg\" /></p><p>DappRadar found AI agent projects raised $1.39 billion this year, a 9.4% increase on the total funding in 2024, while a onchain activity has surged 86%.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "3 reasons why Bitcoin price could fall below $100,000",
      "link": "https://cointelegraph.com/news/3-reasons-why-bitcoin-price-could-fall-below-100-000?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzJjZWEtZDJmZS03MTE2LWE5NzEtMGM3YTRiYTRiY2M2.jpg\" /></p><p>Mounting macroeconomic risks, declining Bitcoin miner revenues, and cautious sentiment among investors could trigger a sharp BTC price correction.</p>"
    },
    {
      "title": "Banking Committee chair sets September goal for market structure bill",
      "link": "https://cointelegraph.com/news/senate-banking-committee-tim-scott-market-structure?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MmZkOTUtMzY5Zi03MmUwLTg0OGMtYjFhMTFhNDcxM2Iy.jpg\" /></p><p>After passing the GENIUS stablecoin bill, Republican leadership on the Senate Banking Committee has turned its sights to digital asset market structure.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "USDT on TRON Surpasses $80 Billion, Strengthening TRON’s Position as the Leading Stablecoin Network",
      "link": "https://cryptoslate.com/usdt-on-tron-surpasses-80-billion-strengthening-trons-position-as-the-leading-stablecoin-network/",
      "summary": "<p>June 26, 2025 &#8211; Geneva, Switzerland &#8211; TRON DAO announced today that the total circulating supply of USDT on the TRON blockchain has exceeded $80 billion, further cementing TRON’s position as the top blockchain for USDT activity. With USDT holding more than 63 percent of the global stablecoin market and surpassing 155 billion dollars in [&#8230;]</p> <p>"
    },
    {
      "title": "Dinari wins broker-dealer license to roll out tokenized stocks across US platforms",
      "link": "https://cryptoslate.com/dinari-wins-broker-dealer-license-to-roll-out-tokenized-stocks-across-us-platforms/",
      "summary": "<p>Dinari secured a US broker-dealer registration for its subsidiary, becoming the first platform cleared to offer blockchain-based shares of publicly traded companies to domestic investors, Reuters reported on June 26. The San Francisco firm stated that it will activate the licensed entity during the next quarter, following completion of onboarding with the Securities and Exchange [&#8230;]</p> <p>"
    },
    {
      "title": "Former Tether, Hut 8, Blackstone execs to launch $1B crypto treasury firm",
      "link": "https://cryptoslate.com/former-tether-hut-8-blackstone-execs-to-launch-1b-crypto-treasury-firm/",
      "summary": "<p>A group of high-profile financial executives, including former Blackstone dealmaker Chinh Chu and Tether co-founder Reeve Collins, are seeking to raise $1 billion to launch what could become the first publicly traded crypto treasury firm with a diversified portfolio, Bloomberg News reported on June 25, citing people familiar with the matter. The effort is being [&#8230;]</p> <p>"
    },
    {
      "title": "CoreWeave revives bid for Core Scientific causing shares to surge 33%",
      "link": "https://cryptoslate.com/coreweave-revives-bid-for-core-scientific-causing-shares-to-surge-33/",
      "summary": "<p>CoreWeave is negotiating to acquire Bitcoin (BTC) miner-turned-compute host Core Scientific, the Wall Street Journal reported on June 26, citing people familiar with the matter. The cloud infrastructure company attempted to acquire the miner for $5.75 per share in June 2024 but withdrew after Core Scientific’s board deemed the price inadequate. Core Scientific and CoreWeave [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin stays confined to $100k–$110k band as realized profit and network activity recede",
      "link": "https://cryptoslate.com/bitcoin-stays-confined-to-100k-110k-band-as-realized-profit-and-network-activity-recede/",
      "summary": "<p>Bitcoin (BTC) has traded between $100,000 and $110,000 for a seventh consecutive week due to slower profit realization, cooling transfer volume, and a cautious derivatives backdrop, according to a June 26 Glassnode report. The report cited the market&#8217;s struggles to extend May&#8217;s all-time high rally, with the 30-day realized profit gauge peaking in early May, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Under Pressure — Can It Maintain The Bullish Structure?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-under-pressure-2-020/",
      "summary": "XRP price started a downside correction from the $2.220 zone. The price is consolidating and might decline further toward the $2.020 support. XRP price started a downside correction below the $2.20 zone. The price is now trading below $2.150 and the 100-hourly Simple Moving Average. There was a break below a bullish trend line with support at $2.150 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could find bids near the $2.020 zone and start a fresh increase. XRP Price Dips Below Support XRP price attempted more gains above the $2.150 zone, like Bitcoin and Ethereum. The price spiked above the $2.20 and $2.220 levels, but the bulls failed to extend gains. A high was formed at $2.2294 and the price is now correcting gains. There was a move below the $2.20 and $2.15 levels. The price dipped below the 23.6% Fib retracement level of the upward move from the $1.910 swing low to the $2.2294 high. Besides, there was a break below a bullish trend line with support at $2.150 on the hourly chart of the XRP/USD pair. The price is now trading below $2.180 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.150 level. The first major resistance is near the $2.20 level. The next resistance is $2.220. A clear move above the $2.220 resistance might send the price toward the $2.320 resistance. Any more gains might send the price toward the $2.40 resistance or even $2.450 in the near term. The next major hurdle for the bulls might be $2.50. More Losses? If XRP fails to clear the $2.20 resistance zone, it could start another decline. Initial support on the downside is near the $2.070 level or the 50% Fib retracement level of the upward move from the $1.910 swing low to the $2.2294 high. The next major support is near the $2.020 level. If there is a downside break and a close below the $2.020 level, the price might continue to decline toward the $2.00 support. The next major support sits near the $1.920 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.070 and $2.020. Major Resistance Levels – $2.20 and $2.220."
    },
    {
      "title": "Ethereum Price Action Turns Bearish — Risk of Near-Term Correction",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-action-bearish-2520/",
      "summary": "Ethereum price started a fresh increase above the $2,450 zone. ETH is now correcting gains from $2,520 and might slip to test the $2,320 zone. Ethereum started a fresh upward move above the $2,350 level. The price is trading above $2,400 and the 100-hourly Simple Moving Average. There was a break below a connecting bullish trend line with support at $2,450 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it remains stable above the $2,320 zone in the near term. Ethereum Price Dips Below Support Ethereum price started a fresh increase above the $2,320 support level, like Bitcoin. ETH price was able to clear the $2,350 and $2,450 resistance levels to move into a positive zone. The bulls even pushed the price above the 76.4% Fib retracement level of the downward move from the $2,569 swing high to the $2,115 low. However, the bulls were active above the $2,500 level. A high was formed at $2,520 and the price is now correcting some gains. There was a move below the 23.6% Fib retracement level of the upward move from the $2,114 swing low to the $2,520 high. Besides, there was a break below a connecting bullish trend line with support at $2,450 on the hourly chart of ETH/USD. Ethereum price is now trading above $2,400 and the 100-hourly Simple Moving Average. On the upside, the price could face resistance near the $2,500 level. The next key resistance is near the $2,520 level. The first major resistance is near the $2,550 level. A clear move above the $2,550 resistance might send the price toward the $2,600 resistance. An upside break above the $2,600 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,720 resistance zone or even $2,800 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,520 resistance, it could start a fresh decline. Initial support on the downside is near the $2,400 level. The first major support sits near the $2,320 zone. A clear move below the $2,320 support might push the price toward the $2,250 support. Any more losses might send the price toward the $2,200 support level in the near term. The next key support sits at $2,150. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,320 Major Resistance Level – $2,520"
    },
    {
      "title": "Bitcoin Retests $108,000, But Holders Disagree On Direction",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-retests-108000-disagree-on-direction/",
      "summary": "As Bitcoin pushes back toward the $108,000 level, on-chain data reveals the investor cohorts are still divided in their accumulation behavior. Bitcoin Accumulation Trend Score Shows Mixed Behavior From Holders In a new post on X, the on-chain analytics firm Glassnode has talked about how the BTC investor cohorts aren&#8217;t showing a unified behavior on the Accumulation Trend Score. The Accumulation Trend Score refers to an indicator that basically tells us whether Bitcoin holders are accumulating or not. The metric bases its value on two factors: the balance changes happening in the wallets of the investors and the size of those wallets. Related Reading: Tron’s 374% Profit-Taking Spree Uncovered—Here’s Who Was Behind It When the value of the indicator is greater than 0.5, it means the large holders (or a large number of small hands) are leaning toward net accumulation. The closer the score is to 1.0, the stronger the buying. On the other hand, the metric being under the threshold suggests the investors are in a phase of distribution (or simply, that they aren&#8217;t accumulating). This behavior is the strongest at the zero mark. Now, here is the chart for the Accumulation Trend Score shared by Glassnode, showing the trend in the metric separately for the various holder groups: As displayed in the above graph, the Accumulation Trend Score has recently varied in value across these cohorts. Investors who hold between 1 to 10 BTC appear to be distributing, while those with 10 to 100 BTC are accumulating. Among the large holders, the trend leans more neutral, but the indicator still doesn&#8217;t show any clear uniformity. Members of the 1,000 to 10,000 coins group, popularly referred to as the whales, are currently tending toward accumulation, but those part of the 10,000+ cohort, the &#8216;mega whales,&#8217; are showing slight distribution. According to the analytics firm, the Accumulation Trend Score of the network as a whole stands at 0.57. As such, it seems there is no majority behavior being followed by the traders at the moment. Related Reading: Chainlink Holders Set Record As 1-Yr MVRV Signals ‘Opportunity’ That said, while a unifying buying push hasn&#8217;t appeared alongside the latest price rally toward $108,000, there has still been an improvement that has occurred in the score. According to the analytics firm, the indicator dropped to a low of 0.25 earlier. It only remains to be seen, however, whether the Bitcoin investors would continue to move in this direction, or if indecision is here to stay for a while. BTC Price Bitcoin attempted to find a break above the $108,000 level earlier, but the asset has so far not been able to maintain a sustainable move, and its price has even seen rejection toward $107,100. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Sideways Action Builds — Will Bulls Step In After a Minor Dip?",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-sideways-108k/",
      "summary": "Bitcoin price started a fresh increase above the $106,500 zone. BTC is now consolidating and might aim for a move above the $108,000 resistance. Bitcoin started a fresh increase above the $106,500 zone. The price is trading above $106,500 and the 100 hourly Simple moving average. There was a break below a bullish trend line with support at $107,300 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $105,500 zone. Bitcoin Price Faces Resistance Bitcoin price started a fresh increase above the $104,200 zone. BTC gained pace and was able to climb above the $105,000 and $105,500 levels to enter a positive zone. The bulls pushed the price above the $106,500 resistance and the price tested the $108,150 zone. A high was formed at $108,165 and the price is now consolidating gains. There was a break below a bullish trend line with support at $107,300 on the hourly chart of the BTC/USD pair. However, the price stayed above the 23.6% Fib retracement level of the upward move from the $98,272 swing low to the $108,165 high. Bitcoin is now trading above $106,000 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $107,800 level. The first key resistance is near the $108,150 level or the 1.236 Fib extension level of the downward move from the $106,470 swing high to the $98,276 low. A close above the $108,150 resistance might send the price further higher. In the stated case, the price could rise and test the $110,000 resistance level. Any more gains might send the price toward the $112,000 level. Bearish Reaction In BTC? If Bitcoin fails to rise above the $108,150 resistance zone, it could start another decline. Immediate support is near the $105,800 level. The first major support is near the $105,000 level. The next support is now near the $103,200 zone and the 50% Fib retracement level of the upward move from the $98,272 swing low to the $108,165 high. Any more losses might send the price toward the $102,500 support in the near term. The main support sits at $101,200, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $105,800, followed by $105,500. Major Resistance Levels – $107,800 and $108,150."
    },
    {
      "title": "Bitcoin Weak Hands Exit While Smart Money Loads Up –  Is A Breakout Near?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-weak-hands-exit-while-smart-money-loads-up-is-a-breakout-near/",
      "summary": "As Bitcoin (BTC) continues its steady climb toward its all-time high (ATH) of $111,814 recorded in May 2025, the cryptocurrency is witnessing a notable shift in its holder composition. New on-chain data suggests that BTC “weak hands” are selling their holdings to larger investors. Bitcoin Moving Upstream From Weak Hands To Big Money According to a recent Cryptoquant Quicktake post by contributor IT Tech, Bitcoin’s supply is moving upstream from retail investors to larger holders. This movement denotes a fundamental shift in the investor sentiment toward the largest digital asset. Related Reading: Bitcoin Following ABCD Pattern? Analyst Sees Path To $137,000 Retail investors &#8211; those holding less than one BTC &#8211; have seen a significant reduction in their holdings, with total balances dropping by 54,500 BTC year-over-year (YoY), to 1.69 million BTC. On average, this cohort has experienced outflows of approximately 220 BTC per day. In contrast, large holders &#8211; wallets with 1,000 BTC or more &#8211; have expanded their total BTC exposure by 507,700 BTC over the same period, bringing their combined holdings to 16.57 million BTC. This group is now seeing average inflows of around 1,460 BTC per day. Institutional interest in Bitcoin also continues to rise at a historic pace. Notably, institutions are currently absorbing about seven times more BTC than retail investors are selling. At the same time,"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Tahini’s Bitcoin Treasury: How a Family Chain Outsmarted Inflation",
      "link": "https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/tahini-bitcoin-2020-treasury-playbook.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation\" rel=\"nofollow\"> </a></p> <p>Tahini’s, a Canadian fast-casual chain, embraced Bitcoin in 2020, leveraging it to compete with giants like McDonald’s. Here’s their treasury playbook.</p> <p>"
    },
    {
      "title": "Coinbase to Launch US Nano Bitcoin Perpetual-Style Futures In July",
      "link": "https://bitcoinmagazine.com/news/coinbase-to-launch-us-nano-bitcoin-perpetual-style-futures-in-july",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-to-Launch-US-Nano-Bitcoin-Perpetual-Style-Futures-In-July.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-to-launch-us-nano-bitcoin-perpetual-style-futures-in-july\" rel=\"nofollow\"> </a></p> <p>Coinbase Derivatives to introduce long-dated, regulated futures contracts with 24/7 trading and spot price tracking.</p> <p>"
    },
    {
      "title": "Japan’s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC",
      "link": "https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Japans-Metaplanet-Acquires-1234-More-Bitcoin-Total-Holdings-Reach-12345-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc\" rel=\"nofollow\">Japan&#8217;s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC</a></p> <p>The Japanese company continues accelerating its Bitcoin treasury strategy with a ¥19.27 billion purchase.</p> <p>"
    },
    {
      "title": "Kraken Launches Krak, a No-Fee App to Use and Store Bitcoin and Crypto",
      "link": "https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Launches-Krak-a-No-Fee-App-to-Use-and-Store-Bitcoin-and-Crypto.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto\" rel=\"nofollow\"> </a></p> <p>Bitcoin and crypto platform Kraken has officially launched Krak, a no-fee, all-in-one global money app that lets users spend, send, and save across over 300 fiat and digital assets—including Bitcoin. Designed to merge the best of banking, payments, and crypto into a single user experience, the Krak app is set to redefine how people move [&#8230;]</p> <p>"
    },
    {
      "title": "Castle Raises $1M to Bring Automated Bitcoin Treasury to Small & Medium-Sized Businesses",
      "link": "https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Castle-Raises-1M-to-Bring-Automated-Bitcoin-Treasury-to-Small-Medium-Sized-Businesses-2.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses\" rel=\"nofollow\">Castle Raises $1M to Bring Automated Bitcoin Treasury to Small &amp; Medium-Sized Businesses</a></p> <p>Backed by Boost VC and Winklevoss Capital, Castle aims to help SMBs protect their balance sheets by automating bitcoin allocations.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitwise Dogecoin, Aptos ETF Filing Updates Suggest Path to Approvals: Analyst",
      "link": "https://decrypt.co/327189/bitwise-dogecoin-aptos-etf-filing-approvals-analyst",
      "summary": "Amended Bitwise prospectuses for Dogecoin and Aptos ETFs are a good sign for their eventual approvals, a Bloomberg analyst told ."
    },
    {
      "title": "Metaplanet Boosts Bitcoin Stash Above $1.3 Billion With 1,234 BTC Buy",
      "link": "https://decrypt.co/327272/metaplanet-boosts-bitcoin-stash-above-1-3-billion",
      "summary": "Japan's biggest publicly traded Bitcoin treasury company now holds 12,345 BTC, following its latest purchase of 1,234 BTC."
    },
    {
      "title": "Avalanche Crypto Game 'Raini: The Lords of Light' Is Shutting Down",
      "link": "https://decrypt.co/327281/avalanche-crypto-game-raini-lords-light-shutting-down",
      "summary": "Blockchain games are closing left and right, with Avalanche-based NFT card game Raini: The Lords of Light the latest to join the list."
    },
    {
      "title": "Myriad Moves: Will Trump Drop Another F-Bomb? Plus Predictions on Ethereum and Wimbledon",
      "link": "https://decrypt.co/327269/myriad-moves-trump-drop-f-bomb-predictions-ethereum-wimbledon",
      "summary": "Myriad Markets users are placing predictions on President Trump's language, whether Ethereum will rise or fall, and Wimbledon's winner."
    },
    {
      "title": "Bitcoin Headed for One of the Largest Options Expiries of the Year",
      "link": "https://decrypt.co/327260/bitcoin-one-of-largest-options-expiries",
      "summary": "Bitcoin faces one of its largest options expiries with $15 billion in contracts set to expire Friday as volatility hits multi-year lows."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Crypto exchange Bakkt files to raise up to $1 billion to support Bitcoin strategy",
      "link": "https://cryptobriefing.com/bakkt-bitcoin-strategy-funding/",
      "summary": "<p>Bakkt's fundraising could accelerate its shift towards crypto infrastructure, potentially influencing market dynamics and digital asset adoption.</p> <p>"
    },
    {
      "title": "US Treasury may release federal Bitcoin holdings report, says Bo Hines",
      "link": "https://cryptobriefing.com/us-bitcoin-holdings-treasury-report/",
      "summary": "<p>The potential release of the US Bitcoin holdings report could enhance transparency, influencing global crypto market dynamics and policy debates.</p> <p>"
    },
    {
      "title": "USDT on TRON surpasses $80 billion, strengthening TRON’s position as the leading stablecoin network",
      "link": "https://cryptobriefing.com/usdt-on-tron-stablecoin-leader/",
      "summary": "<p>USDT on TRON exceeds $80 billion in circulation, accounting for over half of global supply and leading active stablecoin network metrics.</p> <p>"
    },
    {
      "title": "Court rejects Ripple and SEC bid to slash $125M penalty and lift injunction on XRP sales to institutions",
      "link": "https://cryptobriefing.com/ripple-sec-penalty-court-decision/",
      "summary": "<p>The court's decision underscores the ongoing regulatory challenges and legal scrutiny facing the cryptocurrency industry.</p> <p>"
    },
    {
      "title": "Galaxy Digital secures $175 million for first venture fund to back early-stage crypto startups",
      "link": "https://cryptobriefing.com/early-stage-crypto-startups-fund/",
      "summary": "<p>Galaxy Digital's venture fund expansion could accelerate innovation in crypto, bridging traditional finance and blockchain, impacting global markets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum stablecoin adoption hits record 750K weekly users – What’s fueling the surge?",
      "link": "https://ambcrypto.com/ethereum-stablecoin-adoption-hits-record-750k-weekly-users-whats-fueling-the-surge/",
      "summary": "<img alt=\"Ethereum stablecoin adoption hits record 750K weekly users - What’s fueling the surge?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-14-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />USDT and USDC still dominate, but rising competition and use cases are reshaping the stablecoin race."
    },
    {
      "title": "Curve DAO [CRV]: $0.42 could be next – Here’s what you should know",
      "link": "https://ambcrypto.com/curve-dao-crv-0-42-could-be-next-heres-what-you-should-know/",
      "summary": "<img alt=\"Curve DAO in Danger of Breaking Below $0.42: Here’s What Investors Need to Know\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Curve-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Curve DAO faces bearish pressure, trading below $0.70; $0.42–$0.50 zone could determine its recovery."
    },
    {
      "title": "Ethereum stuck below $2.5K – Why ETH price hangs on THESE triggers!",
      "link": "https://ambcrypto.com/ethereum-stuck-below-2-5k-why-eth-price-hangs-on-these-triggers/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-1-8.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />For Ethereum to sustain its earlier bullishness, price need to confirm meeting two key conditions."
    },
    {
      "title": "Bitcoin could hit a new ATH in Q3, but mid-term caution persists",
      "link": "https://ambcrypto.com/bitcoin-could-hit-a-new-ath-in-q3-but-mid-term-caution-persists/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoinsummer.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can BTC explode to a new ATH and shun historical weak summer returns?"
    },
    {
      "title": "Jupiter breaks trading volume record on Solana – Impact on SOL?",
      "link": "https://ambcrypto.com/jupiter-breaks-trading-volume-record-on-solana-impact-on-sol/",
      "summary": "<img alt=\"SOL\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_55_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Jupiter Exchange outpaces rivals, Solana could be next as its network activity skyrockets."
    }
  ]
}