{
  "CoinDesk": [
    {
      "title": "Spot Crypto ETF Filings for XRP, SOL, DOGE Among Those With Overwhelming SEC Approval Odds: Bloomberg",
      "link": "https://www.coindesk.com/markets/2025/06/20/spot-crypto-etf-filings-for-xrp-sol-doge-among-those-with-overwhelming-sec-approval-odds-bloomberg",
      "summary": ""
    },
    {
      "title": "Bitcoin Quickly Plunges Below $103K, With Volatility Burst Spurring $450M in Crypto Liquidations",
      "link": "https://www.coindesk.com/markets/2025/06/20/bitcoin-quickly-plunges-below-103k-with-volatility-burst-spurring-450m-in-crypto-liquidations",
      "summary": ""
    },
    {
      "title": "Trumps May Have Sold Platform Stake as U.S. Stablecoins See Wave of Good News",
      "link": "https://www.coindesk.com/policy/2025/06/20/as-u-s-stablecoins-see-wave-of-good-news-trumps-may-have-sold-platform-stake",
      "summary": ""
    },
    {
      "title": "Peter Schiff Says He 'Gets Bitcoin' But Not USD-Pegged Stablecoins, Floats Gold-Backed Token Plan",
      "link": "https://www.coindesk.com/markets/2025/06/20/peter-schiff-says-he-gets-bitcoin-but-not-usd-pegged-stablecoins-floats-gold-backed-token-plan",
      "summary": ""
    },
    {
      "title": "Semler Scientific Investors Cheered by New Hire, Lofty Bitcoin Acquisition Goals",
      "link": "https://www.coindesk.com/markets/2025/06/20/semler-scientific-investors-cheered-by-new-hire-lofty-bitcoin-acquisition-goals",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Crypto cycle is playing out ‘spookily similar’ to 2017: Raoul Pal",
      "link": "https://cointelegraph.com/news/crypto-cycle-resembles-2017-macro-data-raoul-pal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkxMWQtNjNmZi03MmMyLTg1MWMtZTJiMTdlY2VkMWYz.jpg\" /></p><p>Real Vision CEO Raoul Pal says macroeconomic data suggests the current crypto cycle could extend into Q2 2026.</p>"
    },
    {
      "title": "CoinMarketCap has &#039;identified and removed&#039; malicious wallet scam",
      "link": "https://cointelegraph.com/news/coinmarketcap-malicious-verify-wallet-popup-removed-website?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkwMzctOThhNi03MWNhLWEzNTAtZjM3ODAzNzhmYzA5.jpg\" /></p><p>According to a post on CoinMarketCap's X account, the malicious code has been removed, though the team insists the investigation into the incident is still ongoing.</p>"
    },
    {
      "title": "Bitcoin in a post-Trump world worries hedge fund execs: Eric Semler",
      "link": "https://cointelegraph.com/news/bitcoin-donald-trump-administration-hedge-fund-concerns-eric-semler?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5MzhjNjktMzcyYi03YjgwLWI4OTctOTFhMTliMTNiMTIy.jpg\" /></p><p>Eric Semler says he enjoys being the “lone voice crying in the wilderness” with Bitcoin as most hedge fund executives think Bitcoin is a “fly-by-night concept.”</p>"
    },
    {
      "title": "Bitcoin futures premium falls to 3-month low despite strong BTC ETF inflows",
      "link": "https://cointelegraph.com/news/bitcoin-futures-premium-falls-to-3-month-low-despite-strong-btc-etf-inflows?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDVkZTAtMTRkMC03NzQ2LTkxYWUtZWM2N2RiMmUwMDM3.jpg\" /></p><p>Bitcoin derivatives traders turned cautious, despite steady inflows to the spot BTC ETFs.</p>"
    },
    {
      "title": "Reddit weighs World’s scanning orbs for user verification — Report",
      "link": "https://cointelegraph.com/news/reddit-world-scanning-orbs-user-id?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhmMWMtMTY5MS03MTljLTg1ZjUtMTQ2ZDI1MmI1MjE0.jpg\" /></p><p>Many users said they would delete accounts or consider moving to another platform if Reddit were to adopt World’s verification system.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Pumpfun reportedly delays token auction to July amid legal troubles",
      "link": "https://cryptoslate.com/pumpfun-reportedly-delays-token-auction-to-july-amid-legal-troubles/",
      "summary": "<p>Pump.fun has delayed its public token sale once again, extending months of uncertainty for users and investors as the popular Solana-based launchpad wrestles with a flurry of lawsuits, Colin Wu reported on June 20. Pump.fun had aimed to raise $1 billion at a $4 billion valuation through its token auction originally set for June 25. The [&#8230;]</p> <p>"
    },
    {
      "title": "Alex Mashinsky forfeits rights to Celsius assets amid ongoing bankruptcy process",
      "link": "https://cryptoslate.com/alex-mashinsky-forfeits-rights-to-celsius-assets-amid-ongoing-bankruptcy-process/",
      "summary": "<p>Alex Mashinsky, the former CEO of Celsius, has agreed to surrender all rights to assets tied to the collapsed crypto lender. According to newly filed court documents, Mashinsky and entities associated with him, including AM Ventures Holdings Inc., Koala1 LLC, and Koala3 LLC, will be excluded from any future distributions under the Celsius bankruptcy plan. The [&#8230;]</p> <p>"
    },
    {
      "title": "Bloomberg analysts revise ETF approval odds to ‘90% or higher’ as SEC requests amended filings",
      "link": "https://cryptoslate.com/bloomberg-analysts-revise-etf-approval-odds-to-90-or-higher-as-sec-requests-amended-filings/",
      "summary": "<p>Bloomberg analysts have sharply increased the likelihood of U.S. regulators approving a new wave of cryptocurrency exchange-traded funds, pointing to a friendlier stance from the Securities and Exchange Commission (SEC). Bloomberg senior ETF analysts Eric Balchunas and James Seyffart said on June 20 that they now see a &#8220;90% or higher&#8221; chance that a broad [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase secures MiCA approval, shifts headquarters to Luxembourg",
      "link": "https://cryptoslate.com/coinbase-secures-mica-approval-shifts-headquarters-to-luxembourg/",
      "summary": "<p>Coinbase, the largest US-based exchange, has taken a major step in its global expansion by securing approval under the European Union’s Markets in Crypto-Assets (MiCA) regulation, according to a June 20 statement. The exchange confirmed that Luxembourg’s financial watchdog, the Commission de Surveillance du Secteur Financier (CSSF), granted it the necessary license to operate across the [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin falls to monthly lows triggering $464 million in liquidations amid global market jitters",
      "link": "https://cryptoslate.com/bitcoins-falls-to-monthly-lows-triggering-464-million-in-liquidations-amid-global-market-jitters/",
      "summary": "<p>Bitcoin (BTC) fell to its lowest price this month on June 20, triggering $464 million in liquidations across cryptocurrency markets as geopolitical jitters and heavy selling pressure rattled traders. Bitcoin dropped to a low of $102,225, reversing the gains recorded earlier in the day after failing to break through resistance above $106,000. Data from Coinglass [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Sees Modest Gains, But Demand Weakness Limits Breakout Potential",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-sees-modest-gains-but-demand-weakness-limits-breakout-potential/",
      "summary": "Bitcoin has resumed a slow climb upward after a recent period of consolidation, briefly breaking back above the $106,000 mark earlier today. At the time of writing, the cryptocurrency is trading at $105,383, reflecting a 0.8% increase over the past 24 hours. While this upward move has not sparked a major breakout, analysts are paying close attention to on-chain and market structure indicators that suggest a cautiously balanced environment. Related Reading: Analyst Warns Of Bitcoin Breakdown—’If This Continues, It Snaps’ On-Chain Data Points to Equilibrium, But Demand Wanes According to CryptoQuant analyst Darkfost, the market currently lacks extreme signals of profit-taking or panic. In a recent analysis, Darkfost explained that realized profits over a seven-day moving average remain below $1 billion. This is in line with figures observed during the market correction in late 2024 and significantly below peaks seen in early 2025. The analyst suggests that the current realized profit levels point to a market that is not under pressure from large-scale investor exits, supporting the ongoing consolidation. In the same report, Darkfost also discussed how a decline in demand may be limiting further upward momentum. By analyzing the ratio of new supply to the supply held inactive for over a year, the study observed that while demand remains positive, it has been weakening since Bitcoin’s local high in May. This suggests that although the market is absorbing existing selling pressure, fresh buying interest is not strong enough to trigger a new rally. As a result, the market appears to be in a state of temporary equilibrium, a phase where both sellers and buyers are relatively inactive. Bitcoin Traders Brace for Volatility in a Crowded Range Another CryptoQuant analyst, BorisVest, echoed the sentiment of a tightly contested market by analyzing Binance order flow and position data. He noted that Bitcoin has traded within a range of $100,000 to $110,000 for nearly a month. Within this band, both long and short positions have been building, and traders are watching the extremes of this zone closely. According to BorisVest, any breakout beyond $110,000 or drop below $100,000 could set the tone for the next significant price movement. The $100K–$110K price range has become a battleground for both bulls and bears. BorisVest observed that short positions are currently increasing, indicating that a significant portion of market participants expect a downward correction. Related Reading: Is Bitcoin Gearing Up for a Breakout? On-Chain Signals Say ‘Watch This Level’ However, he also pointed out that when shorts dominate, the risk of a sudden reversal, known as a short squeeze, becomes more likely. This behavior is consistent with recent funding rate trends, which show a fairly balanced distribution of long and short bets. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin May Surprise Bears: $100K–$110K Range Shows Rising Short Interest",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-may-surprise-bears-100k-110k-range-shows-rising-short-interest/",
      "summary": "While Bitcoin (BTC) has remained range-bound &#8211; trading between $100,000 and $110,000 for about a month &#8211; both short and long positions have been building within this range, with short positions rising at a faster pace. Bitcoin Long Positions Slightly Ahead But Shorts Catching Up After reaching a new all-time high (ATH) of $111,814 last month, BTC has consolidated within the $100,000–$110,000 range for nearly a month, offering little clarity on its next directional move. Related Reading: Bitcoin Holds Strong Despite Israel-Iran Tensions – Weekly Resistance Begins To Crack According to a new CryptoQuant Quicktake post by contributor BorisVest, fresh data from Binance crypto exchange suggests that long positions currently hold a slight edge in this range. Historical data reveals a pattern &#8211; when short positions rise, short squeezes tend to follow. Similarly, a buildup in long positions has often led to long squeezes. A decisive breakout from either end of the current range will likely determine Bitcoin’s next major move. That said, Binance data indicates that while long positions are marginally ahead, the ratio of longs to shorts remains relatively balanced. The funding rate hovering near neutral levels supports this view, reflecting a closely contested standoff between bulls and bears. However, such balance usually signals uncertainty in the market. While long interest has stabilized, short positions continue to climb &#8211; likely driven by expectations of further downside amid escalating geopolitical tensions in the Middle East. BorisVest noted: This shows that most market participants believe the rally may not continue. When Bitcoin&#8217;s price starts to fall, and funding rates turn negative, it means shorts are piling in quickly. All of this points to this range being a highly sensitive zone. He further noted that with most traders leaning toward short positions, the setup could be ripe for a surprise move in the opposite direction &#8211; possibly fuelled by quiet accumulation from larger market participants. Is BTC Preparing For A Big Move? Despite BTC trading within the $100,000 &#8211; $110,000 range for the better part of the previous month, several analysts posit that the flagship cryptocurrency is preparing for a major move in the coming weeks. Related Reading: Bitcoin Consolidates as Realized Profits Stay Low – No Signs Of Major Sell-Off Yet Most analysts are leaning toward a move to the upside. For instance, crypto trader Josh Olszewics remarked that if liquidity holds, then BTC may eye a move toward the $150,000 level. From a technical standpoint, the outlook is encouraging. Crypto analyst Mister Crypto recently pointed out that BTC is forming a bullish inverse head &#38; shoulders pattern on the 3-day chart. However, latest on-chain data shows that Bitcoin Network Value to Transactions (NVT) Golden Cross recently moved into an overpriced zone, warranting caution. At press time, BTC trades at $105,940, up 1.1% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Dogecoin Breaks Free—Could Soar 60%, Analyst Says",
      "link": "https://www.newsbtc.com/altcoin/dogecoin-breaks-free-could-soar-60-analyst-says/",
      "summary": "Dogecoin edged up slightly to $0.17 on Friday, gaining 1.0% in the last 24 hours. Trading has thinned out this week, and Dogecoin has slipped almost 3% over the past seven days. Based on reports, investors are moving carefully as volume dropped 30% to about $678 million. Related Reading: Iran’s Top Crypto Hub Loses $82 Million To Hackers With Israeli Links—Details Trading Volume Drop Signals Caution According to on‑chain data, the slump in daily volume shows fewer traders are stepping in. That 34% slide in activity suggests a loss of momentum. Some market watchers say low volume often leads to whipsaws. When fewer coins change hands, even modest buys or sells can push prices sharply in either direction. #Dogecoin $DOGE looks prime for a 60% price move! All you need to do is wait for a daily close outside of the $0.16 to $0.22 range to determine the direction of the trend. So go to @coinexcom, sign up using my referral link https://t.co/73n8mWavUX, and join me in this trade! pic.twitter.com/Im27DBuBka — Ali (@ali_charts) June 19, 2025 Triangle Pattern Points To Imminent Breakout On charts stretching from early 2024 into mid‑2025, Dogecoin fits a symmetrical triangle. Prices have carved lower highs and higher lows as trendlines converge. Data from crypto analyst Ali shows, this narrowing range often precedes a major move. He notes the tip of the triangle is due by June 2025, which puts a deadline on when volatility should pick up. DOGE Bulls Eye Breakout According to Ali’s analysis, a daily close above $0.22 likely signals a bullish breakout. If that happens, he sees Dogecoin reaching roughly $0.35 or $0.36—about 60% higher than current levels. On the flip side, a drop below $0.16 could spark a sell‑off toward $0.10. Investors are watching those exact levels to decide whether to join buyers or cut losses. DOGE Price Forecast Digital Coin Price is on the optimistic end. They predict Dogecoin could go past $0.37 before year‑end and even test its old high of $0.74 again. Market Catalysts Could Tip The Scales Dogecoin’s swings often mirror the wider crypto space or follow social media buzz. A surge in Bitcoin or Ethereum prices could carry DOGE higher, while a broader sell‑off would magnify losses. Some traders also keep an eye on endorsements from well‑known figures and major exchange listings. Related Reading: Bitcoin Nears Climax, But A Twist Awaits—Analyst Reveals Key Insight For now, patience may pay off. Traders will look for volume to confirm any move past $0.22 or under $0.16. Until then, expect choppy range‑bound action. The next few weeks will be critical as the symmetrical triangle tightens. If volume steps back in, Dogecoin could pick a clear direction—either a strong rally or a deeper correction. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Analyst Warns Of XRP Trap — „You’re Being Played”",
      "link": "https://www.newsbtc.com/xrp-news/analyst-warns-of-xrp-trap-youre-being-played/",
      "summary": "CryptoInsightUK’s latest market briefing arrives with the sound of literal hammer blows next door, an accidental soundtrack to the pounding he expects traders to take before the next rally. In a thirteen–minute walkthrough of XRP, Bitcoin and Ethereum liquidity maps, the British analyst argues that the market is staging what he calls “a deliberate trap” designed to flush out weak hands, harvest stop-loss orders and maximise upside leverage for larger players—leaving retail participants “screaming, ‘Yay, we’re going to the upside,’ … only to find out they’ve been played.” The Trap Is Set, Warns XRP Trader He begins with XRP’s five-month down-channel that started at the New-Year peak, noting that price continues to hug the underside of a descending trend line. “We’re stuck below that trend line basically looking to see if this liquidity is going to get taken below us. My obvious opinion is that it is,” he says, underscoring the conviction that a sweep of resting bids below remains the path of least resistance. The flush, he contends, would “make our journey to the upside much better and much easier to navigate,” because it would reset funding, scare out late longs and reload the order book for what he still calls the next “parabolic expansion probably up towards the $8 to $12 region.” Related Reading: ‘Out of Time’: XRP Consolidation Hits Final Moment, Analyst Alerts The trap, however, may not be a straightforward vertical collapse. Charts, he reminds viewers, “love doing something like” an initial breakout that rallies 15-20%, convinces traders the bear-phase is finished, and then abruptly reverses into the deep liquidity pocket below. “That’s exactly how higher-highs-and-higher-lows type situations are supposed to get you frustrated,” he says, openly conceding that the pattern looks engineered. The phrase he never uses—manipulation—hovers unspoken over the analysis, but his rhetoric leaves little doubt: “This is how they test everybody.” Bitcoin, in his narrative, may serve as the decoy that sets the trap. The benchmark asset has already slipped out of its own wedge-like consolidation and, he observes, “does like to do this sort of thing” by staging premature upside breaks. He sketches a possible march toward $115,000 that would “delay the inevitable” and then give way to a liquidity hunt of its own. Even so, his mid-cycle price band for Bitcoin remains $150,000 to $220,000. That upside, he argues, justifies dollar-cost-averaging into altcoins even while keeping “a tiny bit of dry powder” in reserve for the washout he expects. Related Reading: XRP 5-Wave Count Shows When The Price Will Hit All-Time Highs Above $5 A more elaborate scenario involves a temporary dominance surge in Bitcoin to the 66 to 74% range. As Bitcoin siphons capital, alts such as XRP would “bleed out,” take the downside liquidity target, and only then reverse as cash rotates back into their order books. He illustrates the dance on twin TradingView panels—Bitcoin on the left, XRP on the right—before concluding that the rotational setup is “not highly likely” because it requires several macro-scale dominoes to fall in sequence. Still, he refuses to dismiss it, pointing to the strategic reserve bill in Washington as the sort of narrative catalyst that could spark a temporary Bitcoin-only rally and demoralise alt-holders. Macro-risk flickers through the commentary—wars that could “shove us down” in the near term—but he treats geopolitical stress as a catalyst for final capitulation rather than a thesis-killer. “The upside is so large it almost can’t be ignored,” he insists, framing the present chop as a high-volatility pause before a structural up-leg. Whether that leg begins only after a full flush or emerges from yet another fake-out remains uncertain, but the analyst’s message is unmistakable: traders who chase breakouts without accounting for hidden hands risk being liquidated first, spectators to the parabola they hoped to ride. For now he is content to wait “for the market to do its worst trick,” believing that the final shakeout will announce itself through a sudden, depth-piercing wick. “You’re being played,” he warns. The admonition is stark: if the playbook unfolds as expected, the pain will be quick. “If we get these levels, that’s where I’m putting the last bit of my dry powder in[&#8230;]. It’s $1.80-ish, $1.90 maybe.” At press time, XRP traded at $2.16. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin’s Dominance Could Kill Altseason Dreams, Analyst Warns",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoins-dominance-could-kill-altseason-dreams-analyst-warns/",
      "summary": "According to an analyst on X, Bitcoin’s grip on the market looks too strong for altcoins to break free any time soon. Bitcoin’s price ticked up to around $104,000 after climbing 0.4%. It had dipped briefly to $103,000 but buyers stepped in fast. Related Reading: Crypto Gets A Green Light From Spanish Banking Giant That push drove it back toward the $105K mark. At the same time, the US Federal Reserve held interest rates steady, keeping traders on alert for any ripple effects. Bull Market Support Band Explained Based on reports, the Bull Market Support Band sits between two key moving averages. One is a 20‑week simple moving average. The other is a 21‑week exponential moving average. Together they form a zone that Bitcoin Dominance has used as a springboard all year. When dominance tests that area, it usually bounces higher instead of dropping further. $BTC.D &#8211; As long as the Bitcoin Dominance continues to hold its Bull Market Support Band, there will be no altseason. pic.twitter.com/XCYDyuDxP2 — Luca (@CrypticTrades_) June 19, 2025 Historical Support Tests Bitcoin Dominance fell from about 56% in June 2024 to 54% in July of that year but found support. It also slipped from 58% down to 56% between late December 2024 and January 2025. Each time, the support band held firm. More recently, dominance dipped to 61% on May 14 after peaking at 65% on May 7, only to recover to 64% in a matter of days. $BTC.D &#8211; As long as the Bitcoin Dominance continues to hold its Bull Market Support Band, there are no risks of this being a distribution range for $BTC. ✅ pic.twitter.com/GS8r9jNIpB — Luca (@CrypticTrades_) June 19, 2025 Analyst Warnings And Scenarios Other experts see a different picture. Bitcoinsensus warns dominance could “fall off a cliff” before any altcoin season kicks off. That view suggests a sudden drop, maybe giving altcoins their moment. An analyst points to a possible double‑top pattern in dominance. If Bitcoin can’t clear resistance, money might flow into altcoins. But if dominance breaks higher, some believe Bitcoin could aim for a fresh record. Limitations Of Dominance Metric Dominance only measures Bitcoin’s share of total crypto market cap. It can slip if stablecoins flood in or if new tokens launch, even when altcoins aren’t rallying. And a rise in dominance can mean altcoins are selling off. Related Reading: Iran’s Top Crypto Hub Loses $82 Million To Hackers With Israeli Links—Details Traders should know that moving‑average support lines can fail in choppy markets. A pattern that works for months can break when the climate changes. In the end, the Bull Market Support Band offers a clear trend line. It shows that Bitcoin is still the favorite for many investors. Yet relying on one technical tool can miss bigger moves driven by real‑world news or fresh blockchain data. For now, though, Bitcoin’s dominance looks safe—unless something big shifts in the weeks ahead. Featured image from Imagen, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [],
  "Decrypt": [
    {
      "title": "Solana, XRP and Dogecoin ETF Approvals in 2025 Are a Near Lock, Analysts Say",
      "link": "https://decrypt.co/326353/solana-xrp-dogecoin-etf-approvals-2025-near-lock",
      "summary": "Wall Street analysts say that SEC approvals for ETFs based on altcoins including Dogecoin, XRP, and Solana are nearly a sure thing this year."
    },
    {
      "title": "Nakamoto Holdings Rakes in $51.5 Million for Publicly Traded Bitcoin Treasury",
      "link": "https://decrypt.co/326316/nakamoto-holdings-51-5-million-publicly-traded-bitcoin-treasury",
      "summary": "The Bitcoin holdings company's merger partner KindlyMD closed the $51.5 million fundraise with private investors on Friday."
    },
    {
      "title": "Public Keys: Circle and Coinbase Get GENIUS Bump, Bitcoin Treasuries on Shaky Ground?",
      "link": "https://decrypt.co/326330/public-keys-circle-coinbase-genius-bump-bitcoin-treasuries-shaky-ground",
      "summary": "Circle skyrockets on stablecoin optimism while Bitcoin treasury firms face valuation challenges in this week's public markets roundup."
    },
    {
      "title": "Bitcoin, Dogecoin Targeted as Norway Eyes Ban on New Crypto Mining Operations",
      "link": "https://decrypt.co/326280/bitcoin-dogecoin-targeted-norway-eyes-ban-new-crypto-mining-operations",
      "summary": "The government said it will \"explore the possibility of temporarily prohibiting the establishment of new data centers in Norway that extract cryptocurrency.\""
    },
    {
      "title": "Texas Sheriffs Crack Bitcoin ATM With Power Tools to Retrieve $32,000",
      "link": "https://decrypt.co/326308/texas-sheriffs-crack-bitcoin-atm-with-power-tools-to-retrieve-32000",
      "summary": "Jasper County Sheriff Chuck Havard told that authorities have likely accessed the machines before."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "CoinMarketCap’s front-end compromised, investigation underway",
      "link": "https://cryptobriefing.com/coinmarketcap-security-breach-investigation/",
      "summary": "<p>This incident highlights the urgent need for enhanced cybersecurity measures in the crypto industry to protect user assets and data integrity.</p> <p>"
    },
    {
      "title": "Texas governor signs bill to protect state Bitcoin reserve as a permanent fund if established",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-protection-bill/",
      "summary": "<p>Texas' move to protect a potential Bitcoin reserve could set a precedent for state-level crypto asset management, influencing future fiscal policies.</p> <p>"
    },
    {
      "title": "XRP joins Solana and Litecoin in top ETF approval tier",
      "link": "https://cryptobriefing.com/spot-crypto-etf-approval-tier/",
      "summary": "<p>The increased likelihood of crypto ETF approvals could significantly boost market legitimacy and attract institutional investment.</p> <p>"
    },
    {
      "title": "Why your business should start accepting Bitcoin today",
      "link": "https://cryptobriefing.com/accepting-bitcoin-payments-business/",
      "summary": "<p>Accepting Bitcoin can lower fees, reduce fraud risks, and simplify global payments as more consumers look to pay with crypto in 2024.</p> <p>"
    },
    {
      "title": "Reddit considers using World ID to verify redditors: Semafor",
      "link": "https://cryptobriefing.com/reddit-world-id-verification-anonymity/",
      "summary": "<p>Reddit's potential use of World ID could enhance user trust and compliance with regulations while balancing privacy and authenticity concerns.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Pi Network’s 100-day sprint: Ecosystem booms, price reacts – What’s next?",
      "link": "https://ambcrypto.com/pi-networks-100-day-sprint-ecosystem-booms-price-reacts-whats-next/",
      "summary": "<img alt=\"Pi Network’s 100-day sprint: Ecosystem booms, price reacts - What’s next?\" class=\"attachment-full size-full wp-post-image\" height=\"691\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Pi-Networks-100-Day-Sprint.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1228\" />Pi Network grows fast, but PI token struggles—Is real-world adoption enough to silence skeptics?"
    },
    {
      "title": "Pump.fun bets $4B on PUMP: Golden opportunity or a high-risk setup?",
      "link": "https://ambcrypto.com/pump-fun-bets-4b-on-pump-golden-opportunity-or-a-high-risk-setup/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika2-5.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PUMP offers big upside, but full unlocks and high FDV make it a risky bet for retail."
    },
    {
      "title": "BNB profits from recent upgrades, but can its price follow through now?",
      "link": "https://ambcrypto.com/bnb-profits-from-recent-upgrades-but-can-its-price-follow-through-now/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-20T153124.817-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB's network is strong, but traders remain split."
    },
    {
      "title": "Is Bitcoin’s position at risk? Look out for THESE key signals!",
      "link": "https://ambcrypto.com/is-bitcoins-position-at-risk-look-out-for-these-key-signals/",
      "summary": "<img alt=\"Is Bitcoin&#039;s position at risk? Look out for THESE key signals!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-20T115712.924-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Why hasn’t BTC broken out despite being so close to it ATH once again?"
    },
    {
      "title": "Ethereum – How changes in adoption stats and scarcity can fuel a new breakout",
      "link": "https://ambcrypto.com/ethereum-how-changes-in-adoption-stats-and-scarcity-can-fuel-a-new-breakout/",
      "summary": "<img alt=\"Ethereum - How changes in adoption stats and scarcity can fuel a new breakout\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-20T124131.875-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Strong fundamentals could be key to the altcoin's performance in the short-term."
    }
  ]
}