{
  "CoinDesk": [
    {
      "title": "ETH Surges 9% as Crypto Market Celebrates Trump's Ceasefire Announcement",
      "link": "https://www.coindesk.com/markets/2025/06/24/eth-surges-9-as-crypto-market-celebrates-trump-s-peace-deal-announcement",
      "summary": ""
    },
    {
      "title": "Bitcoin Busts Past $106K on Reported Iran/Israel Ceasefire",
      "link": "https://www.coindesk.com/markets/2025/06/23/bitcoin-busts-past-106k-on-reported-iranisrael-ceasefire",
      "summary": ""
    },
    {
      "title": "Circle Hits New Record With Market Cap Nearing That of Coinbase",
      "link": "https://www.coindesk.com/markets/2025/06/23/circle-hits-new-record-with-market-cap-nearing-that-of-coinbase",
      "summary": ""
    },
    {
      "title": "Stablecoins Are a Monetary Revolution in the Making",
      "link": "https://www.coindesk.com/opinion/2025/06/23/stablecoins-are-a-monetary-revolution-in-the-making",
      "summary": ""
    },
    {
      "title": "Cipher Mining Begins Bitcoin Production at 300 MW Black Pearl Data Center",
      "link": "https://www.coindesk.com/markets/2025/06/23/cipher-mining-begins-bitcoin-production-at-300-mw-black-pearl-data-center",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Pompliano’s crypto firm raises $750M to go public via SPAC",
      "link": "https://cointelegraph.com/news/pompliano-crypto-firm-procap-raises-750m-to-go-public-via-spac?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzlmMTUtZWMwMS03YmU2LWJmNmMtOGJiNWU3NjhhM2M5.jpg\" /></p><p>Crypto entrepreneur and podcaster Anthony Pompliano has raised $750 million to take his crypto company ProCap public by merging it with a blank-check firm.</p>"
    },
    {
      "title": "Huione marketplace death sprouts 30 more in its place: Elliptic",
      "link": "https://cointelegraph.com/news/darknet-marketplaces-thriving-after-huione-shutdown?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzllZjEtNWY1Yy03ZTdhLTg4NmItZWJlNTAxYTAzOWYy.jpg\" /></p><p>Huione Guarantee’s shutdown sent “shockwaves” through the ecosystem but also left a vacuum for other crypto darknet marketplaces to fill.</p>"
    },
    {
      "title": "Bitcoin rebounds to $106K amid Middle East ceasefire and rate cut bets",
      "link": "https://cointelegraph.com/news/bitcoin-rebounds-to-106k-amid-middle-east-ceasefire-and-rate-cut-bets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzllZjctODM5ZS03NzcyLWI0ZWMtMmE2NDliOWEwZThl.jpg\" /></p><p>Bitcoin bounced to $106,000 as traders bet on higher chances of Fed interest rate cuts due to tensions in the Middle East.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Anchorage adds DeFi capability for institutions with Uniswap wallet integration",
      "link": "https://cointelegraph.com/news/anchorage-adds-defi-capability-institutions-uniswap-wallet-integration?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzllODktZjllZC03YzQ5LWE5M2EtYmQxZDQ4ZGY2OGI2.jpg\" /></p><p>Anchorage Digital is expanding its Porto wallet with Uniswap integration, giving institutions direct access to DeFi swaps and liquidity.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Dark market activity on Telegram persists despite $27B Huione ban – Elliptic",
      "link": "https://cryptoslate.com/dark-market-activity-on-telegram-persists-despite-27b-huione-ban-elliptic/",
      "summary": "<p>Telegram-based dark markets rapidly filled the gap left by Huione Guarantee after the $27 billion marketplace disappeared on May 13, according to a June 23 Elliptic report. Elliptic noted that Telegram banned thousands of Huione Guarantee channels and usernames once researchers traced billions of USDT-denominated sales to pig-butchering scams. However, data shows that merchants immediately [&#8230;]</p> <p>"
    },
    {
      "title": "FTX fights back against 3AC’s ‘unreasonable and unsupportable’ $1.53B claim",
      "link": "https://cryptoslate.com/ftx-fights-back-against-3acs-unreasonable-and-unsupportable-1-53b-claim/",
      "summary": "<p>FTX’s bankruptcy lawyers have pushed back forcefully against a $1.53 billion claim filed by failed crypto hedge fund Three Arrows Capital (3AC), calling the demand “illogical” and warning that it would unfairly drain funds from FTX’s legitimate creditors. In new court documents submitted on June 20, FTX’s legal team asked a Delaware bankruptcy judge to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin whipsaws back to $104k after losing six-figures as Iran’s failed attack signals end of tensions",
      "link": "https://cryptoslate.com/bitcoin-whipsaws-back-to-104k-after-losing-six-figures-as-irans-failed-attack-signals-end-of-tensions/",
      "summary": "<p>Bitcoin (BTC) whipsawed below $100,000 at about 4 p.m. UTC on June 23 and reclaimed nearly $104,000 three hours later as traders processed news of an Iranian missile strike on a US air base in Qatar that caused no casualties. As of press time, Bitcoin was trading at $103,801.74, up 4.5% over the past 24 [&#8230;]</p> <p>"
    },
    {
      "title": "Survey: 82% of US wealthy investors favor advisers who can deliver informed crypto strategies",
      "link": "https://cryptoslate.com/survey-82-of-us-wealthy-investors-favor-advisers-who-can-deliver-informed-crypto-strategies/",
      "summary": "<p>Wealthy US investors say they are more likely to hire financial advisers who provide crypto guidance, according to a June 2025 CoinShares survey of 500 individuals with at least $500,000 in investable assets. A vast majority (88%) of investors already work with an adviser, and 58% rank advisers as their most trusted source for digital [&#8230;]</p> <p>"
    },
    {
      "title": "Fed joins regulators dropping reputational risk factor, clearing banks to serve crypto firms",
      "link": "https://cryptoslate.com/fed-joins-regulators-dropping-reputational-risk-factor-clearing-banks-to-serve-crypto-firms/",
      "summary": "<p>The Federal Reserve Board on June 23 removed reputational risk from its bank supervision program, ordering staff to strike the term from examination manuals and to concentrate on measurable financial exposures. The Fed move positions the central bank alongside the Federal Deposit Insurance Corporation (FDIC) and the Office of the Comptroller of the Currency, which [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Paces $15 Billion YTD Influx Amid 10-Week Fund Flow Streak",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-paces-15-billion-ytd-influx-amid-10-week-fund-flow-streak/",
      "summary": "Bitcoin and other crypto funds have kept the cash register flowing for 10 straight weeks, pulling in $1.24 billion in the latest period. That brings the year-to-date haul to $15 billion. Even holiday trading lulls and global jitters haven’t stalled the momentum. Investors seem to be treating this pullback as a chance to buy, not a reason to sell. Related Reading: Stablecoin Wars Ignite: Peter Schiff Champions Gold-Backed Digital Assets Bitcoin And Ethereum Lead The Pack According to CoinShares data, Bitcoin pulled in $1.114 billion this week alone. It has now logged $2.37 billion month-to-date and $12.7 billion YTD, across nearly $152 billion in assets under management. Ethereum chipped in with its ninth straight week of gains, adding $124 million in weekly inflows. That pushed its month-to-date total past $1 billion and its YTD figure to $2.43 billion, across $14.29 billion of assets. Investors aren’t scooping up bearish bets, either: short Bitcoin products saw just $1.4 million in outflows this week and $8.7 million since January. Altcoins See Mixed Results Solana attracted $2.80 million this week and nearly $3 million month-to-date, lifting its YTD flows to almost $86 million. XRP pulled in $2.70 million weekly and $10.55 million month-to-date, taking its year-long total to $268 million across $1.205 billion in managed assets. But funds that package multiple tokens bled $5.76 million this week and almost $17 million for the month—though they’re still up $58 million in 2025. Other altcoin vehicles are in rough shape, with $509 million of outflows since January. Regional Trends Highlight The US The United States led global flows with $1.25 billion in weekly inflows. That’s $3.37 billion month-to-date and $14.30 billion YTD, out of $135 billion under management. Canada added nearly $21 million this week and $42.8 million for June. Germany chipped in almost $11 million while Australia booked $16.6 million. Brazil bucked the trend with $9 million of outflows this week and $26.4 million in June, but it’s still about $34.8 million ahead for the year. Smaller Tokens Struggle For Attention Some newer names drew mixed reactions. Sui saw $8.5 million drain this week despite $3.3 million of gains so far in June. Litecoin eked out $0.21 million in weekly inflows and clos to $6 million YTD. Related Reading: Dogecoin Breaks Free—Could Soar 60%, Analyst Says Cardano and Chainlink grabbed $0.34 million and $0.6 million this week, respectively. But smaller “other” products pulled in only $2.75 million against heavy selling since January. Institutions are still finding reasons to back crypto even as global events and holiday thins slow trading. Total weekly flows hit $1.23 billion, taking June’s total to $3.38 billion and the year’s to $15 billion, across $176 billion in overall assets. Based on these trends, big spenders aren’t ready to abandon digital tokens. They’re treating pullbacks like offers they can’t pass up. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Turns Higher — Relief Rally Follows Reduction In Global Risk",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-turns-higher-105k/",
      "summary": "Bitcoin price started a fresh increase from the $98,250 zone. BTC is now consolidating and might aim for a move above the $106,500 resistance. Bitcoin started a fresh increase above the $102,000 zone. The price is trading above $102,500 and the 100 hourly Simple moving average. There was a break above a key bearish trend line with resistance at $101,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $102,500 zone. Bitcoin Price Recovers Ground Bitcoin price started a fresh increase from the $98,500 zone. BTC gained pace after Trump announced a ceasefire. The price was able to climb above the $102,000 and $103,200 levels. Besides, there was a break above a key bearish trend line with resistance at $101,500 on the hourly chart of the BTC/USD pair. The pair cleared the 61.8% Fib retracement level of the downward move from the $106,470 swing high to the $98,277 low. Finally, the price traded close to the $106,000 level. Bitcoin is now trading above $104,000 and the 100 hourly Simple moving average. It is also above the 76.4% Fib retracement level of the downward move from the $106,470 swing high to the $98,277 low. On the upside, immediate resistance is near the $106,000 level. The first key resistance is near the $106,200 level. The next key resistance could be $106,500. A close above the $106,500 resistance might send the price further higher. In the stated case, the price could rise and test the $108,000 resistance level. Any more gains might send the price toward the $110,000 level. Another Drop In BTC? If Bitcoin fails to rise above the $106,000 resistance zone, it could start another decline. Immediate support is near the $104,000 level. The first major support is near the $103,500 level. The next support is now near the $102,500 zone. Any more losses might send the price toward the $101,200 support in the near term. The main support sits at $100,000, below which BTC might struggle to find bids. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $104,000, followed by $103,500. Major Resistance Levels – $106,000 and $106,500."
    },
    {
      "title": "Bitcoin Binary CDD Hints At Healthy Consolidation, Not A Top",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-binary-cdd-hints-at-healthy-consolidation-not-a-top/",
      "summary": "After a brief drop to $98,000 over the weekend, Bitcoin (BTC) has recovered and is now trading above $101,000 at the time of writing. While concerns about a potential double top persist, on-chain data has yet to show any major warning signs. Bitcoin Undergoing Healthy Consolidation According to a recent CryptoQuant Quicktake post by contributor Avocado_onchain, despite broader market sentiment turning bearish, BTC has not yet displayed any significant red flags. In fact, the cryptocurrency still appears to be in a consolidation phase. Related Reading: Bitcoin Whales Pull 4,500 BTC From Binance, Hinting At Incoming Rally Notably, the 30-day moving average (MA) of Binary Coin Days Destroyed (CDD) indicates that long-term holders are continuing to hold onto their BTC rather than selling. This suggests that investors remain optimistic about Bitcoin’s potential for further upside in the near term. For the uninitiated, the 30-day MA Binary CDD smooths out daily fluctuations to show how frequently long-term Bitcoin holders are moving their coins over a month. A lower value suggests strong holding behavior and accumulation, while a higher value may indicate distribution or selling pressure from experienced holders. The analyst noted in a previous analysis that when Bitcoin’s Binary CDD exceeded 0.8, it was typically followed by a steep correction. However, this time, the indicator has peaked around 0.6 and is now on the decline &#8211; suggesting the market is far from overheating. They added: Although the data may not align perfectly from cycle to cycle, this moderation below 0.8 still implies the market may be entering a consolidation period, and further price or time correction could follow. The analyst emphasized that this indicator does not signal the end of the bull run. Rather &#8211; similar to the previous two market phases &#8211; Bitcoin could be following a &#8220;staircase-like movement,&#8221; where periods of consolidation are followed by a strong upward leg. They concluded that BTC historically tends to rally when market attention fades and sentiment remains quiet. Therefore, the current period of low volatility could be a precursor to Bitcoin’s next major move to the upside. Are BTC Bears In Trouble? While the current bearish sentiment may have raised hopes for further price pullback for the largest cryptocurrency by reported market cap, both technical and on-chain indicators suggest otherwise. Related Reading: Bitcoin Yearly Trend Suggests Cycle Top Near $205,000 By Year-End, Analyst Says For example, short positions have been rising sharply within the $100,000–$110,000 range, increasing the likelihood of a short squeeze &#8211; which could drive BTC to a new all-time high (ATH). That said, some caution is warranted, as short-term holders have been selling during recent dips, showing a lack of confidence in Bitcoin’s ability to sustain its upward trajectory. At press time, BTC trades at $101,954, up 1.1% in the past 24 hours. Featured image with Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Bitcoin STHs Capitulate: 14,700 BTC Moved To Exchanges At Loss",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-sths-capitulate-14700-btc-exchanges-loss/",
      "summary": "As volatility engulfs the cryptocurrency market amid war tensions, on-chain data shows that the Bitcoin short-term holders are selling at a loss. Bitcoin Short-Term Holders Just Made Large Exchange Inflows At A Loss In a new post on X, CryptoQuant author Axel Adler Jr has talked about how the Bitcoin short-term holders have reacted to the price volatility that has come alongside rising tensions in the Middle East following US strikes on three nuclear facilities in Iran. Related Reading: Consolidation Takes Its Toll: Bitcoin Investors No Longer Greedy The short-term holders (STHs) refer to the BTC investors who purchased their coins within the past 155 days. The other side of the network, the holders with a holding time greater than 155 days, are termed as the long-term holders (LTHs). The former group contains the new entrants and low conviction holders, who generally panic easily whenever some change occurs in the market. On the other hand, the latter cohort includes the veterans of the market, who tend to sit tight through crashes and rallies alike. As such, given the recent sharp price action that has occurred in the sector, the STHs are likely to have made some moves. And indeed, on-chain data would confirm so. The above chart, shared by the analyst, shows the data for the profit and loss exchange deposit transactions that the STHs as a whole are making. Investors usually transfer to these centralized platforms when they want to sell, so inflows going to them can provide hints about whether selling is elevated or not. From the graph, it&#8217;s visible that the loss transactions going to the exchanges from this cohort have amounted to 14,700 BTC, which, although lower than the two major capitulation events from the past couple of months, is significant. Thus, it would appear that some of the STHs have reacted to the news by exiting the market, even if it means taking a loss. Related Reading: Dogecoin Gears Up For 60% Move—Will It Be Up Or Down? It&#8217;s also apparent from the chart that the profitable transfers have remained relatively low at 3,100 BTC. This is likely down to the fact that the STHs are left with little profit following the price decline, as the on-chain analytics firm Glassnode has pointed out in an X post. In the chart, the trend of the STH Realized Price is displayed. This indicator keeps track of the Bitcoin cost basis or acquisition level of the average STH. During the crash, the price almost retested the line, and even after the rebound, it remains close to it, meaning the profit margin for the cohort is still tight. BTC Price At the time of writing, Bitcoin is trading around $101,300, down over 5% in the last week. Featured image from Dall-E, Glassnode.com, CryptoQuant.com, chart from TradingView.com"
    },
    {
      "title": "The BNB Paradox: Bearish Breakdown Meets Bullish Flag, Which Will Prevail?",
      "link": "https://www.newsbtc.com/analysis/bnb/bnb-bearish-breakdown/",
      "summary": "BNB finds itself at a pivotal crossroads where conflicting signals collide — a bearish breakdown challenging key support levels, yet a bullish flag pattern hints at a potential upward surge. This paradox leaves traders and investors weighing which force will ultimately dominate the market’s next move. As pressure mounts from both sides, understanding the technical nuances behind this tug-of-war becomes crucial to anticipating BNB’s trajectory in the near term. BNB Faces Pressure From Key Technical Levels Analyzing the BNBUSD setup on the M30 timeframe, Thomas Anderson in an X post highlighted that the price is currently testing the yellow support line at $626.95, following a decisive drop below the cyan price line at $633.99. This breakdown has shifted short-term sentiment, suggesting that sellers are beginning to exert stronger control over the price action. Related Reading: BNB Price Breakout Could Trigger ATH Rally Repeat – Is $730 The Next Stop? According to Anderson, the 200 MA (red line), positioned between $642 and $645, is now acting as a dynamic resistance zone overhead. With price trading below this moving average, any attempts at recovery may face immediate rejection. He also pointed out that the H1 chart confirms the ongoing bearish momentum, with the price continuing to trade below both the cyan level and the 200 MA. This alignment between the M30 and H1 timeframes strengthens the case for further downside movement, especially if the current support at $626.95 fails to hold. Until buyers manage to reclaim key resistance levels, the overall outlook remains weak, and traders should keep an eye on how the price behaves around the current support to gauge the next likely move. BNB’s Price Outlook Strengthened By Bullish Continuation Signal Despite the bearish outlook presented by Thomas Anderson, eL Zippo expressed a more optimistic stance in his latest X tweet regarding BNB. He believes that BNB still has the potential to rise in value, challenging the prevailing negative sentiment around its recent price action. Related Reading: BNB Price Eyes Comeback: Can It Regain Momentum and Rally Higher? EL Zippo’s view is supported by the formation of a bullish flag pattern on the chart. This pattern is widely recognized as a continuation signal, indicating that the asset may resume its prior upward trend after a period of consolidation. For eL Zippo, the presence of this structure suggests that BNB could be setting up for another leg higher if market conditions align. At the time of writing, BNB was trading around the $623 mark, reflecting steady price action. The asset’s market capitalization stood at approximately $87.7 billion, signaling strong investor interest. Additionally, BNB recorded a 24-hour trading volume of roughly $1.8 billion, with price and volume showing percentage gains of 2.11% and 13.22%, respectively—an indication of renewed activity and positive sentiment in the market. Featured image from Adobe Stock, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Sequans Launches $384M Bitcoin Treasury Initiative with Swan Bitcoin Partnership",
      "link": "https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Sequans-Launches-384M-Bitcoin-Treasury-Initiative-with-Swan-Bitcoin-Partnership.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a France-based developer of 5G and IoT semiconductor technology, has announced a move into Bitcoin with a new treasury initiative backed by a $384 million private placement.&#160;&#160; The funding includes $195 million in equity securities and $189 million in convertible secured notes. Sequans plans to allocate this capital toward building a Bitcoin position [&#8230;]</p> <p>"
    },
    {
      "title": "The Blockchain Group Acquires 75 BTC After €7.2M Raise",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/10.4B-Bitcoin-Firm-Unchained-Announces-First-Regulated-Bitcoin-Native-Trust-Company-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise\" rel=\"nofollow\"> </a></p> <p>Total holdings reach 1,728 BTC as YTD yield climbs to 1,231.7%, reinforcing its Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Fintech Company DigiAsia Corp to Launch Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Southeast-Asian-fintech-company-aims-to-raise-100-million-for-long-term-Bitcoin-holdings-as-part-of-their-corporate-treasury-initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DigiAsia Corp, a leading Southeast Asian Fintech-as-a-Service platform, has signed an indicative term sheet for up to $3 million in non-recourse debt financing to kickstart its Bitcoin treasury acquisition strategy. The funding comes from High West Capital Partners and is expected to close within 45 days.&#160; The $3 million facility represents the first phase of [&#8230;]</p> <p>"
    },
    {
      "title": "ECD Automotive Design Secures $500M Facility to Acquire Bitcoin",
      "link": "https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ECD-Automotive-Design-Secures-500M-Facility-to-Acquire-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin\" rel=\"nofollow\"> </a></p> <p>Luxury auto builder will grow its Bitcoin treasury, expand operations, and offer $21,000 in upgrades to early customers who pay with Bitcoin and other crypto.</p> <p>"
    },
    {
      "title": "Anthony Pompliano Announces $1 Billion Merger in Record Bitcoin Treasury Company Fundraise",
      "link": "https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ProCap-Financial-has-raised-over-750-million-in-the-largest-initial-funding-round-for-a-public-Bitcoin-treasury-company.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise\" rel=\"nofollow\"> </a></p> <p>Anthony Pompliano announced a $1 billion merger creating ProCap Financial through a Special Purpose Acquisition Company (SPAC) transaction with Columbus Circle Capital Corp. (CCCM). The deal represents the largest initial fundraise in history for a public Bitcoin treasury company, raising $516.5 million in equity and $235 million in convertible notes.&#160;&#160; ProCap Financial will operate with [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Tech That Could Prove Whether Iran’s Uranium Was Destroyed",
      "link": "https://decrypt.co/326588/tech-irans-uranium-destroyed",
      "summary": "Satellite images reveal damage, but experts suggest that new technology may be able to verify what actually happened underground."
    },
    {
      "title": "How AI Is Has Turned Propaganda Into a Potent Weapon",
      "link": "https://decrypt.co/326589/ai-propaganda-potent-weapon",
      "summary": "AI-generated videos and fake personas are flooding social media from Tel Aviv to Tehran, turning it into a digital battlefield of deception."
    },
    {
      "title": "Senator Introduces Bill to Halt Trump’s Crypto Activity—But Voted to Allow It Last Week",
      "link": "https://decrypt.co/326576/senator-introduces-bill-halt-trump-crypto-activity-voted-allow",
      "summary": "Adam Schiff (D-CA) is the latest Democrat to propose a bill banning President Trump from engaging in crypto activity. Like the others, it's unlikely to pass anytime soon."
    },
    {
      "title": "Bitcoin, Ethereum and XRP Spike as Trump Says Iran, Israel Agree to Ceasefire",
      "link": "https://decrypt.co/326577/bitcoin-ethereum-xrp-spike-trump-says-iran-israel-ceasefire",
      "summary": "Crypto prices are surging again—with Bitcoin back above $105K—after President Trump said that Iran and Israel have agreed to a ceasefire."
    },
    {
      "title": "Donald Trump and Bitcoin: From 'Not a Fan' to Crypto President—With His Own Meme Coin",
      "link": "https://decrypt.co/240580/donald-trump-bitcoin-evolution-timeline-president",
      "summary": "President Donald Trump used to slam Bitcoin as \"a scam.\" Now he's back in the White House and making pro-crypto moves."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin drops below $100K, then rebounds after Iran reportedly fires missiles toward US military targets in Qatar and Iraq",
      "link": "https://cryptobriefing.com/bitcoin-price-drop-mideast-tensions/",
      "summary": "<p>Geopolitical tensions can significantly impact cryptocurrency markets, highlighting their volatility and sensitivity to global events.</p> <p>"
    },
    {
      "title": "Crypto fund veterans to raise $100M to build BNB strategic reserve",
      "link": "https://cryptobriefing.com/bnb-treasury-strategy-listed-company/",
      "summary": "<p>The initiative could diversify crypto investment strategies, potentially increasing BNB's market influence and public company crypto adoption.</p> <p>"
    },
    {
      "title": "Fintech giant Fiserv to launch FIUSD stablecoin and digital asset platform with Circle, Paxos, and Solana",
      "link": "https://cryptobriefing.com/fiusd-stablecoin-platform-launch/",
      "summary": "<p>Fiserv's FIUSD launch could revolutionize digital payments, enhancing real-time transactions and expanding blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Michael Saylor’s Strategy makes smallest Bitcoin purchase since mid-March",
      "link": "https://cryptobriefing.com/strategy-bitcoin-acquisition-record/",
      "summary": "<p>Saylor's ongoing Bitcoin acquisitions highlight a strategic commitment to digital assets, potentially influencing market dynamics and investor sentiment.</p> <p>"
    },
    {
      "title": "Hackers exploit Trezor’s website to send phishing emails",
      "link": "https://cryptobriefing.com/trezor-security-alert-phishing-warning/",
      "summary": "<p>This incident highlights the growing sophistication of phishing attacks, underscoring the need for enhanced cybersecurity measures in crypto platforms.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Story [IP] price prediction – Traders, look out for this key divergence!",
      "link": "https://ambcrypto.com/story-ip-price-prediction-traders-look-out-for-this-key-divergence/",
      "summary": "<img alt=\"Story [IP] price prediction - Traders, look out for this key divergence!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Story-IP-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />IP saw some demand over the past few days that resulted in a price bounce."
    },
    {
      "title": "Avalanche: Retail sells $821K of AVAX, smart money holds on – What next?",
      "link": "https://ambcrypto.com/avalanche-retail-sells-821k-of-avax-smart-money-holds-on-what-next/",
      "summary": "<img alt=\"AVAX\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250623_125539_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Avalanche gains 2.62% after a month-long decline, as smart money profits while retail sells"
    },
    {
      "title": "Metaplanet buys $118M in Bitcoin during dip – Now holds over $1B in BTC",
      "link": "https://ambcrypto.com/metaplanet-buys-118m-in-bitcoin-during-dip-now-holds-over-1b-in-btc/",
      "summary": "<img alt=\"Metaplanet buys $118M in Bitcoin during dip - Now holds over $1B in BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/MetaplanetBTCFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Metaplanet's latest purchase is just the latest in a series of them."
    },
    {
      "title": "PEPE: $3.45M whale buy could trigger a 112% rally, ONLY IF…",
      "link": "https://ambcrypto.com/pepe-3-45m-whale-buy-could-trigger-a-112-rally-only-if/",
      "summary": "<img alt=\"PEPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-1-7.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The massive accumulation of PEPE by Cumberland could be a precursor for A 112% move."
    },
    {
      "title": "Mantra: Assessing impact of $2.17M whale dump on OM’s price",
      "link": "https://ambcrypto.com/mantra-assessing-impact-of-2-17m-whale-dump-on-oms-price/",
      "summary": "<img alt=\"OM\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-23T125852.459-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />OM’s outlook weakens as bearish metrics overpower oversold signals and address growth."
    }
  ]
}