{
  "CoinDesk": [
    {
      "title": "OFAC’s Dropped Sanctions Against Tornado Cash Can’t Come Up at Trial, Judge Says",
      "link": "https://www.coindesk.com/policy/2025/07/08/ofacs-dropped-sanctions-against-tornado-cash-cant-come-up-at-trial-judge-says",
      "summary": ""
    },
    {
      "title": "AAVE Surges to 3-Week High, Dominating Soaring $56B DeFi Lending Market",
      "link": "https://www.coindesk.com/markets/2025/07/08/aave-surges-to-3-week-high-dominating-soaring-56b-defi-lending-market",
      "summary": ""
    },
    {
      "title": "Bitcoin Bull Mulls Different Kind of Corporate Treasury Strategy as Prices Continue on Hold",
      "link": "https://www.coindesk.com/markets/2025/07/08/bitcoin-bull-mulls-different-kind-of-corporate-treasury-strategy-as-prices-continue-on-hold",
      "summary": ""
    },
    {
      "title": "Polygon’s Token Gains 3% After Seeing ‘Exceptional’ Trading Volume",
      "link": "https://www.coindesk.com/markets/2025/07/08/polygon-s-matic-gains-3-after-seeing-exceptional-trading-volume",
      "summary": ""
    },
    {
      "title": "Ether Treasury Firm BTCS Surges 100% on $100M ETH Buying Plan",
      "link": "https://www.coindesk.com/markets/2025/07/08/ether-treasury-firm-btcs-surges-100-on-100m-eth-buying-plan",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin metric says $100K BTC was the bottom: When will a rally to new highs start?",
      "link": "https://cointelegraph.com/news/bitcoin-metric-says-100k-btc-was-the-bottom?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ViNzQtNGRlOS03MGMzLTlkOWUtNTM5NmM5NGVkMmUy.jpg\" /></p><p>Bitcoin’s inflow/outflow ratio fell to 2022 lows, and the cumulative volume delta shows short-selling pressure failing to push prices lower. Time for a rally?</p>"
    },
    {
      "title": "$31B stablecoin surge at Binance revives traders’ altseason hopes",
      "link": "https://cointelegraph.com/news/dollar31b-stablecoin-surge-at-binance-revives-traders-altseason-hopes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VhNDYtY2Q1NC03NjQxLWE1YmQtM2FiODAxMjI4MmYz.jpg\" /></p><p>Soaring stablecoin reserves at Binance, falling Bitcoin dominance and a bullish chart pattern point to a possible altseason starting in the bottom half of 2025.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "BioSig, Streamex target gold tokenization with $1.1B financing",
      "link": "https://cointelegraph.com/news/biosig-streamex-financing-commodities-gold-tokenized?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ViY2UtNzZhZS03NGE0LTg3NTMtNTViNmM4NjZhZmFm.jpg\" /></p><p>With eyes on tokenized gold, the companies plan to merge and launch a gold-backed treasury business.</p>"
    },
    {
      "title": "SOL futures funding rate turns negative: Is $180 the next stop?",
      "link": "https://cointelegraph.com/news/sol-futures-funding-rate-turns-negative-is-180-the-next-stop?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ViYTgtMjlkNi03MTI1LWI5ZGUtYmJiZDk3NWIyODNh.jpg\" /></p><p>Blockchain competitors and recent decisions by institutional investors chip away at Solana’s market share. Will this impact SOL price?</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Survey finds gaps in mainstream Bitcoin coverage, leaving institutional investors exposed",
      "link": "https://cryptoslate.com/survey-finds-gaps-in-mainstream-bitcoin-coverage-leaving-institutional-investors-exposed/",
      "summary": "<p>A second-quarter survey of 18 mainstream news outlets logged 1,116 Bitcoin (BTC) stories and measured sentiment at 31% positive, 41% neutral, and 28% negative, according to Bitcoin analysis firm Perception. The data reveal a significant gap between finance-focused media that cover the market extensively and legacy publications that rarely address it. Sparse coverage Perception counted [&#8230;]</p> <p>"
    },
    {
      "title": "Joe Lubin forecasts Ethereum treasury strategies will reshape Wall Street perception",
      "link": "https://cryptoslate.com/joe-lubin-forecasts-ethereum-treasury-strategies-will-reshape-wall-street-perception/",
      "summary": "<p>Ethereum and Consensys co-founder Joe Lubin said companies adopting ETH treasury strategies will play a critical role in communicating the second-largest digital asset&#8217;s value to Wall Street, as major financial institutions ramp up blockchain use and process around 24 million transactions daily. Lubin made the statement during an interview with CNBC on July 8 in [&#8230;]</p> <p>"
    },
    {
      "title": "Stablecoin issuers’ $182 billion US Treasury hoard ranks 17th among countries, beating UAE and South Korea",
      "link": "https://cryptoslate.com/stablecoin-issuers-182-billion-us-treasury-hoard-ranks-17th-among-countries-beating-uae-and-south-korea/",
      "summary": "<p>Four US-dollar stablecoin issuers hold roughly $182 billion in US Treasury bills, an amount that would slot them 17th on the Treasury Department’s country-by-country league table. The amount in overnight Treasury-collateralized repos and Treasury-heavy money market funds would put the group between Norway’s $195.9 billion and Saudi Arabia’s $133.8 billion. Tether&#8217;s USDT tops the cohort. [&#8230;]</p> <p>"
    },
    {
      "title": "Volkswagen ADMT chooses Solana-based Hivemapper to power Robotaxi test fleet",
      "link": "https://cryptoslate.com/volkswagen-admt-chooses-solana-based-hivemapper-to-power-robotaxi-test-fleet/",
      "summary": "<p>Volkswagen ADMT, the automaker’s autonomous-driving subsidiary, will source real-time street-level data from Bee Maps, a spatial intelligence service that runs on Hivemapper’s Solana-based mapping network. According to Hivemapper CEO Ariel Seidman, the partnership “shifts mapping from static to living,” and that robotaxi fleets require data “that evolves as fast as the streets do.” Bee Maps [&#8230;]</p> <p>"
    },
    {
      "title": "SharpLink stock continues surging as treasury tops 200k Ethereum",
      "link": "https://cryptoslate.com/sharplink-stock-continues-surging-as-treasury-tops-200k-ethereum/",
      "summary": "<p>SharpLink Gaming shares surged nearly 26% on July 8 after the Minneapolis-based online gaming company revealed a major expansion of its crypto treasury, bringing its total Ethereum (ETH) holdings to over 200,000 coins. The company announced it had purchased an additional 7,689 ETH for approximately $19.2 million at an average price of $2,501 per coin. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "ERC-20 Stablecoin Supply Hits All-Time High At $121B – Liquidity On The Rise",
      "link": "https://www.newsbtc.com/stablecoin/erc-20-stablecoin-supply-hits-all-time-high-at-121b-liquidity-on-the-rise/",
      "summary": "While Bitcoin struggles to break above its all-time high and altcoins face difficulty finding solid support, one corner of the crypto market continues to expand: stablecoins. Since the beginning of the bull run, the stablecoin market has shown consistent growth, cementing its reputation as one of crypto’s most reliable and scalable use cases. Unlike volatile assets, stablecoins offer stability, liquidity, and utility across DeFi, trading, and settlement. Related Reading: Ethereum Range Tightens – Liquidity Looms At $2,800 And $2,350 Top analyst Darkfost recently shared fresh data and highlighted a key development many have overlooked — the total supply of ERC-20 stablecoins is rising again. As of today, it has reached a new all-time high of $121 billion. This milestone signals renewed demand and liquidity entering the crypto ecosystem, at a time when other sectors appear stagnant. The rise in stablecoin supply underscores the sector’s resilience and importance. While speculative tokens face resistance, stablecoins thrive on utility and adoption. Whether for hedging, yield strategies, or capital movement, their role in crypto remains foundational. As the broader market waits for its next move, the silent growth in stablecoin supply could be an early signal of renewed momentum across the board. The stablecoin narrative is far from over — in fact, it may just be starting. Stablecoin Growth Accelerates: On-Chain Data Points To Renewed Liquidity Stablecoins have emerged as one of the most impactful innovations in crypto, creating a vital bridge between traditional finance (TradFi) and decentralized finance (DeFi). This narrative gained massive traction in June when Circle (NASDAQ: CRCL), the company behind USDC, went public on the New York Stock Exchange. Initially priced at $31 per share, Circle’s IPO exceeded all expectations — closing the day at $82.84, marking a 167% gain. Today, CRCL trades nearly six times above its IPO price, giving the company a $42 billion market cap and reinforcing confidence in the stablecoin business model. On-chain insights shared by Darkfost add another layer to the story. According to the data, the total supply of ERC-20 stablecoins has started rising again and just hit a new all-time high of $121 billion. ERC-20 stablecoins are cryptocurrencies built on the Ethereum blockchain that follow the ERC-20 token standard. They are designed to maintain a stable value, usually pegged to fiat currencies like the US dollar (e.g., USDC, USDT, DAI). This surge in supply is critical because stablecoins are minted on demand — their issuance directly reflects user demand and fresh liquidity entering the system. This expanding supply meets the needs of protocols and exchanges that face rising user activity and capital inflows. While market sentiment remains cautious, if the stablecoin supply continues to grow, it would signal renewed risk appetite and capital deployment. In that case, stablecoins may once again serve as the early catalyst for the next major phase in the crypto bull cycle. Related Reading: Altcoins Set A Higher Low – Bulls Target 2024 High To Trigger Altseason Dominance Hovers Below 8%: A Neutral Yet Strategic Positioning The weekly chart shows stablecoin dominance currently sitting at 7.90%, a level that reflects cautious but sustained interest in liquidity reserves across the crypto market. After a sharp climb between 2020 and mid-2022—when stablecoin dominance peaked above 16% during risk-off periods—dominance has gradually declined, aligning with risk-on rotations into Bitcoin and altcoins during bull runs. However, since early 2024, dominance has consolidated between 7% and 10%, signaling a more balanced environment. The current level remains just above the 50-week and 100-week moving averages (7.76% and 8.02%, respectively), suggesting strong horizontal support. Meanwhile, the 200-week moving average at 9.30% acts as a long-term ceiling. Related Reading: Ethereum Risks Downside If Resistance Holds: $2,700 Level Is Critical This neutral position implies that market participants are neither fully risk-on nor risk-off. If dominance rises from here, it could either reflect increased fear (capital flowing out of volatile assets) or fresh liquidity entering the market, especially if paired with a rise in stablecoin supply, which we’re already witnessing with ERC-20 tokens. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Altcoins Reclaim Trendline That Led To 2021 Explosion, Will History Repeat Itself?",
      "link": "https://www.newsbtc.com/altcoin/altcoins-reclaim-key-trendline/",
      "summary": "The altcoin market is flashing a familiar signal that preceded its most explosive rallies in the past. After months of uncertainty and price consolidation, a new analysis suggests that altcoins have just reclaimed a critical trendline—the same one that marked the beginning of the 2017 and 2021 bull runs. With market patterns aligning and fractals emerging, analysts are now questioning whether the conditions are once again ripe for a massive altcoin breakout. Altcoins Eye Vertical Move As Bear Trap Ends The altcoin market may be on the brink of a historic breakout, according to a recent chart analysis by crypto expert Merlijn The Trader. The analyst draws parallels between the current cycle and those of 2017 and 2021. The analyst’s chart, published on X social media, shows that the total altcoin market capitalization has reclaimed a long-term ascending trendline that had preceded previous vertical expansions during major bull runs. Related Reading: Altcoin Season Not Remotely Close, Bitcoin Dominance Still Too High: Market Expert Says In earlier cycles, altcoins briefly broke this trendline in what was identified as a “bear trap” before swiftly reversing and launching into explosive growth phases. Merlijin The Trader reveals that this pattern appears to be repeating in this cycle, as the current market structure mirrors previous setups that triggered rapid valuation increases across the altcoin sector. The ascending trendline recovery is framed within a red box in the chart, consistent with the zones that marked the end of prior downtrends. In each instance, the reclaim was followed by aggressive upward movement, highlighted by green boxes that represented parabolic gains in the total market cap. Merlijn The Trader suggests that the recent rebound indicates the completion of another bear trap, signaling renewed bullish momentum. Green arrows placed below the price curve, matching the timing of previous breakouts within the analyst’s chart, imply that the altcoin market could be preparing for another phase of expansion. If the historical fractal holds, the analyst forecasts a sharp vertical rally for altcoins, with valuations possibly reaching the $10-$16 trillion range. Altcoin Market Mirror 2016-2018 Breakout Setup In another fresh analysis, Merlijn The Trader noted that the altcoin market cap is showing signs of repeating a historical pattern that previously led to a major bull rally. A comparison between the 2016-2018 market cycle and the current one reveals an almost identical structure playing out, albeit on a much larger scale. Related Reading: Bitcoin Dominance Holds Altcoin Season At Bay, Analyst Says No Upside Until This Happens The market appears to have formed a Double Bottom, followed by a mid-cycle correction and consolidation within a descending broadening wedge pattern. This same fractal unfolded before the explosive altcoin rally in 2017. The analyst’s chart also illustrates that in the previous cycle, altcoins broke out of this same wedge pattern, resulting in a massive surge in market capitalization, which he referred to as “Pump 2.0”. With the same breakout now confirmed for this cycle’s market structure, Merlijn The Trader predicts that the altcoin sector may be entering its next parabolic expansion phase. This development could mark the end of the altcoin market&#8217;s current bear phase and the beginning of a second macro pump similar to what occurred between 2017 and early 2018. Featured image from Unsplash, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Turns Key Resistance Into Support – Momentum Builds For Range Breakout",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-turns-key-resistance-into-support-momentum-builds-for-range-breakout/",
      "summary": "Ethereum is consolidating above the $2,500 mark, showing resilience amid broader market uncertainty. While bulls have successfully flipped $2,500 from resistance into support, the price still faces significant pressure below the $2,700 zone. This range-bound behavior has persisted since early May, and the coming days are likely to define the next major move, not only for ETH but also for the broader altcoin market. Related Reading: Ethereum Range Tightens – Liquidity Looms At $2,800 And $2,350 Top analyst Ted Pillows shared technical insights, highlighting Ethereum’s current structure, particularly after the $2,500 level was reclaimed. However, the next challenge lies in reclaiming the range high. A breakout above this key resistance could trigger a strong bullish continuation and potentially ignite an altseason, as capital often rotates into altcoins once ETH gains momentum. On the flip side, failure to sustain current support may open the door for a pullback toward lower demand levels. For now, bulls appear to be in control, but the market remains on edge, awaiting a decisive move. Whether ETH can build enough strength to break through resistance or slips into another leg of consolidation will likely shape sentiment and positioning for the weeks ahead. Ethereum Builds Strength As It Eyes Range High Ethereum continues to trade within a well-defined consolidation zone, oscillating between $2,400 and $2,700 since early May. After reclaiming the $2,500 level and flipping it into support, ETH now looks poised for a potential breakout. Ted Pillows highlighted this shift in momentum, stating that Ethereum is “looking good” and could soon revisit the upper boundary of the range. However, despite Ethereum’s strength, broader market conditions remain mixed. Bitcoin’s failure to break above its all-time high adds pressure to the crypto market, and altcoins continue to struggle to find solid footing. While macroeconomic uncertainty has eased following encouraging job reports and legislative developments in the US, headwinds persist. Rising US Treasury yields and the Federal Reserve’s ongoing delay in cutting interest rates contribute to a cautious environment. Still, Ethereum’s ability to hold above $2,500 suggests bullish intent. If price pushes toward and ultimately breaks above $2,700, it could trigger a broader move across altcoins, reawakening market momentum. But without a breakout in the short term, another leg of consolidation—or even a pullback—remains possible. This week may prove pivotal in setting the tone for Ethereum and the altcoin market’s next phase. Related Reading: Ethereum Risks Downside If Resistance Holds: $2,700 Level Is Critical ETH Tests Resistance As Consolidation Tightens Ethereum is trading at $2,550, holding above its key moving averages and continuing to consolidate in a tight range. The daily chart shows that ETH is attempting to break above the 200-day moving average (red), currently sitting near $2,488, while managing to stay above both the 50-day (blue) and 100-day (green) moving averages. This convergence of key technical levels highlights the current equilibrium between bulls and bears. Despite multiple attempts since early May, Ethereum has not been able to sustain a breakout above the $2,700 mark. Each push higher has faced selling pressure, suggesting that this zone remains a major area of resistance. However, recent price action shows higher lows and strong defense of the $2,500 level, signaling building momentum. Related Reading: Altcoins Set A Higher Low – Bulls Target 2024 High To Trigger Altseason Trading volume remains relatively flat, which aligns with the ongoing consolidation, but could also foreshadow a volatility spike once direction is confirmed. A successful daily close above the $2,600–$2,700 zone could trigger an impulsive move toward $3,000 and beyond. Conversely, a breakdown below the $2,480 level would invalidate the bullish structure and shift sentiment. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Ethereum ETF Inflows Hit 8-Week Streak—Institutions Still Buying",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-etf-inflows-8-streak-institutions-buying/",
      "summary": "Data shows the US Ethereum spot ETFs have seen net inflows for eight consecutive weeks now, a sign of continued institutional demand. Ethereum Spot ETF Netflow Remains Positive In a new post on X, the on-chain analytics firm Glassnode has shared an update on how the weekly netflow for the US spot exchange-traded funds (ETFs) of Ethereum has been looking. Spot ETFs refer to investment vehicles that allow investors to gain exposure to an asset without having to directly own it. These ETFs trade on the traditional platforms, so they allow for an easier investment method for those who find cryptocurrency exchanges and wallets overwhelming to navigate. Related Reading: Dogecoin Resistance Walls Ahead: Analyst Flags 3 Key Levels Below is the chart shared by the analytics firm that shows how the American Ethereum spot ETFs have been doing lately: From the graph, it&#8217;s visible that the netflow related to the Ethereum spot ETFs has recently been on a green streak. This means that inflows into wallets attached to the ETFs are continuously happening. Last week saw a net inflow of 61,000 ETH, worth $157.3 million at the current exchange rate. With these inflows, the spot ETFs of the cryptocurrency have seen positive values for eight straight weeks. Since institutional investors generally take this investment route into Ethereum, the continuous inflows could be a sign of sustained demand from them. Despite this interest, the ETH price has remained locked in a phase of sideways movement. Ethereum isn&#8217;t the only asset that&#8217;s observing demand on the ETFs. As the on-chain analytics firm Santiment has pointed out in an X post, Bitcoin has also been enjoying net inflows. As displayed in the above chart, the Bitcoin ETFs have seen a positive netflow on 16 out of the last 17 trading days. The one exception was on July 1st, when outflows occurred. In some other news, Ethereum has observed new on-chain capital inflows during the past week, as Glassnode has revealed in another X post. In the graph, the data for the Realized Cap of coins aged less than 1 week is shown for Ethereum and Solana. The &#8220;Realized Cap&#8221; measures the amount of capital that the investors have put into a given network. The version of the metric of focus here specifically calculates the capital that has come in over the past week. Related Reading: Bitcoin In For Another 460% Run? This Rare Fiat Signal Just Returned From the chart, it&#8217;s visible that the metric has seen an increase for both ETH and SOL during the past week, indicating fresh capital has flowed in. The latter has outperformed the former, however, with the metric standing at $6.2 billion and $8.3 billion, respectively. ETH Price At the time of writing, Ethereum is floating around $2,580, up over 5% in the last week. Featured image from Dall-E, Glassnode.com, Santiment.net, chart from TradingView.com"
    },
    {
      "title": "Last Time This Happened, Bitcoin Jumped $50,000—Is History Repeating?",
      "link": "https://www.newsbtc.com/bitcoin-news/last-time-this-happened-bitcoin-jumped-50000/",
      "summary": "The Bitcoin market appears to be coiling for a major move, according to prominent crypto analyst CrediBull Crypto (@CredibleCrypto), who highlighted today via X that over 80% of all Bitcoin in existence is currently being held by long-term investors—levels of supply constraint previously seen only at major inflection points in Bitcoin’s price history. Why No One’s Selling Bitcoin In his post, CrediBull noted, “The only 2 times in Bitcoin&#8217;s 15 year history that this % was higher was at 43k before a $30,000 impulse to 73k and at 58k before a $50,000 impulse to 105k+.” Drawing on this historical precedent, he concluded that the market is poised for another massive leg up: “When the majority of $BTC total circulating supply is cornered by ‘diamond hands’, price moves up aggressively at the hint of any ‘new’ demand.” With &#8220;excess&#8221; supply now redistributed to long-term holders and institutional entities such as Bitcoin treasury companies increasingly taking the lead, the analyst sees a clear signal: “The next impulse IS IMMINENT. This next one will also likely be even bigger than the last two ($50,000+). Who&#8217;s ready for 150k+ Bitcoin?” Related Reading: 2025’s Biggest Bitcoin Bull Trigger Is Still Hidden, Expert Reveals The optimism is not without a technical underpinning. In a previous post, CrediBull addressed the current market structure and his own Elliott Wave-based scenario planning: “My original count/idea shared a few days ago had us rejecting at range highs above 110k and seeing a pullback down to the BLUE zone at 102k-ish before moving sideways for a few more weeks before the next impulse begins.”However, the analyst acknowledged a significant alternative possibility: “I do still think this scenario is probable, I also recognize that there is a non-zero chance that the next impulse up has already begun (most bullish scenario depicted).” Given the price action and structure, CrediBull argued that the risk-reward profile no longer favors bearish positioning. “In either case, downside is relatively limited on Bitcoin from current levels imo and so focus should be on identifying potential long opps on Bitcoin rather than looking to short clear strength.” Related Reading: Bitcoin’s Liquidity Lifeline Just Got Cut—What You Need To Know He punctuated the point with a rhetorical jab: “Why is it now illegal to short Bitcoin? Because there is a non-zero chance that the next impulse up has already begun.” Adding a layer of technical confirmation, analyst Axel Adler Jr provided a concurrent signal from volatility metrics. Adler pointed to a significant Bollinger Bands squeeze underway, writing: “The range between the upper and lower boundaries has fallen to 7.7%—one of the lowest values throughout the entire bull cycle.” Such compressions in volatility historically precede large directional moves. Adler explained, “The decrease in volatility indicates energy accumulation in the market; the price is ready for a rally, and in an upward trend environment, the chances of an upward breakout are significantly higher.” In the current cycle, Adler has identified six episodes of such squeezes. Four were immediately followed by strong price appreciation, while the remaining two saw brief corrections before continuing upward. The takeaway: “Based on this experience, the current squeeze most likely foreshadows another upward impulse, although a small consolidation before the move is also not ruled out.” With long-term holders now controlling an overwhelming share of supply, bullish technical compression in play, and institutional adoption continuing to absorb circulating coins, the environment CrediBull describes echoes past moments of explosive upside. While nothing is guaranteed, the combination of on-chain metrics and technical indicators suggest Bitcoin’s next chapter may already be beginning—quietly, beneath the surface. At press time, BTC traded at $108,738. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Showed Up in DC — And Washington Took Notice",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Showed-Up-in-DC-—-And-Washington-Took-Notice-fotor-2025070812361.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice\" rel=\"nofollow\"> </a></p> <p>Reflections on the Bitcoin Policy Summit in Washington DC during May 2025. </p> <p>"
    },
    {
      "title": "Bow Valley Credit Union in Canada turns on Bitcoin purchases for Albertans",
      "link": "https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_an_orange_bull_running_through_an_Alberta_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans\" rel=\"nofollow\"> </a></p> <p>BVCU’s Bitcoin Gateway, with Balance Custody and Bull Bitcoin API, simplifies buying bitcoin. “Facilitates institutional adoption,” says Francis Pouliot. </p> <p>"
    },
    {
      "title": "KULR Secures $20M Bitcoin-Backed Credit Facility from Coinbase Credit",
      "link": "https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Secures-20M-Bitcoin-Backed-Credit-Facility-from-Coinbase-Credit.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit\" rel=\"nofollow\"> </a></p> <p>The deal sets up a multi-draw loan facility worth up to $20 million to expand its Bitcoin holdings.</p> <p>"
    },
    {
      "title": "Sequans Closes $384 Million Investment To Launch Bitcoin Treasury Initiative",
      "link": "https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Sequans-Closes-384-Million-Investment-To-Launch-Bitcoin-Treasury-Initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a fabless semiconductor company focusing on 5G/4G IoT semiconductor technology, has officially closed a $384 million strategic investment to kick off its Bitcoin treasury initiative. The deal combines $195 million in equity financing and $189 million in secured convertible debentures, reflecting growing institutional appetite for Bitcoin. The Offering included the sale of over [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet Enters ‘Bitcoin Gold Rush’ with Plans to Buy 210,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Metaplanet-Enters-Bitcoin-Gold-Rush-with-Plans-to-Buy-210000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027\" rel=\"nofollow\">Metaplanet Enters &#8216;Bitcoin Gold Rush&#8217; with Plans to Buy 210,000 BTC by 2027</a></p> <p>Japan’s top bitcoin treasury firm aims to grow its holdings to 210,000 BTC by 2027 and wants to use its growing reserves to buy cash-generating businesses.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Polymarket Rules 'No' on $237M Controversial Bet Over Zelenskyy's Suit",
      "link": "https://decrypt.co/329210/polymarket-rules-no-237m-bet-zelenskyys",
      "summary": "Discontent over the market’s resolution has reignited scrutiny of UMA’s dispute system and the influence of large Polymarket stakeholders."
    },
    {
      "title": "Meet 'MechaHitler:' Grok’s New Disturbing Persona",
      "link": "https://decrypt.co/329182/mechahitler-grok-disturbing-persona",
      "summary": "Grok maker xAI quietly updated its chatbot to assume all media is biased, relying on X, a platform known for misinformation."
    },
    {
      "title": "Grok 4 Drops Tomorrow—Here's How Musk's AI Might Steal GPT-5's Thunder",
      "link": "https://decrypt.co/329170/grok-4-musks-ai-steal-gpt-5s-thunder",
      "summary": "The latest xAI model promises specialized coding capabilities, benchmark-beating reasoning, and something GPT-5 doesn't have: availability."
    },
    {
      "title": "Why Ethereum Layer-2 Arbitrum Is Built to Power AAA Games: Offchain Labs CEO",
      "link": "https://decrypt.co/329153/why-ethereum-layer2-arbitrum-built-power-aaa-games-offchain-labs-ceo",
      "summary": "The flexibility of Arbitrum’s tech stack should make the layer-2 network a go-to for game developers, Offchain Labs CEO Steven Goldfeder said."
    },
    {
      "title": "Hackers Target Bitcoin Wallet Holding Billions Swiped From Mt. Gox",
      "link": "https://decrypt.co/329146/hackers-target-bitcoin-wallet-holding-billions-swiped-mt-gox",
      "summary": "Scammers appear to be targeting a Bitcoin address holding $8.7 billion in BTC—stolen from the Mt. Gox exchange—with a phishing attempt."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trillion-dollar bank clears Bitwise crypto ETF for advisor-managed accounts",
      "link": "https://cryptobriefing.com/crypto-etf-approval-bitwise-bank/",
      "summary": "<p>Institutional adoption of crypto ETFs signals a shift towards mainstream acceptance, potentially increasing crypto's role in diversified portfolios.</p> <p>"
    },
    {
      "title": "Phantom introduces in-wallet perps trading powered by Hyperliquid",
      "link": "https://cryptobriefing.com/in-wallet-perps-trading-phantom/",
      "summary": "<p>Phantom's integration of perpetual futures trading could significantly enhance user engagement and broaden crypto market accessibility.</p> <p>"
    },
    {
      "title": "ProShares’ XRP futures ETF listed on DTCC under ticker UXRP",
      "link": "https://cryptobriefing.com/proshares-xrp-etf-dtcc-listing/",
      "summary": "<p>The listing of ProShares' XRP futures ETF on DTCC suggests growing institutional interest and potential market expansion for crypto ETFs.</p> <p>"
    },
    {
      "title": "Amplifi partners with AIAPE to expand AI agent capabilities",
      "link": "https://cryptobriefing.com/amplifi-aiape-ai-agent-partnership-crypto-trading/",
      "summary": "<p>This partnership could enhance AI-driven trading efficiency, potentially reshaping digital asset markets and influencing future AI integrations.</p> <p>"
    },
    {
      "title": "Cardano Foundation unveils blockchain-based tool to simplify audit compliance and enhance financial reporting",
      "link": "https://cryptobriefing.com/blockchain-esg-compliance-cardano-reeve/",
      "summary": "<p>Cardano's blockchain tool could revolutionize audit compliance, boosting transparency and trust across various sectors and enhancing ESG efforts.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Will Chainlink drop 17% amid tariff tensions? Mapping the road ahead",
      "link": "https://ambcrypto.com/chainlink-may-drop-17-amid-tariff-tensions-mapping-the-road-ahead/",
      "summary": "<img alt=\"Chainlink may drop 17% amid tariff tensions: Mapping the road ahead\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-08T172643.819_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The recent tariff tension coincided with Chainlink's price struggles, further weakening investor sentiment."
    },
    {
      "title": "XRP breaks out! – But will $2.33 hold, if so, what next?",
      "link": "https://ambcrypto.com/xrp-breaks-out-but-will-2-33-hold-if-so-what-next/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-08T142007.587-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP broke out, but its pullback and sentiment metrics raise questions about sustainability."
    },
    {
      "title": "Bitcoin crash narrative returns as geopolitical tensions mount",
      "link": "https://ambcrypto.com/bitcoin-crash-narrative-returns-as-geopolitical-tensions-mount/",
      "summary": "<img alt=\"bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-17.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As U.S. allies face new duties, Bitcoin acts less like gold and more like tech."
    },
    {
      "title": "‘Altcoins are back to following Bitcoin’s lead:’ Is an altseason brewing?",
      "link": "https://ambcrypto.com/altcoins-are-back-to-following-bitcoins-lead-is-an-altseason-brewing/",
      "summary": "<img alt=\"&#039;Altcoins are back to following Bitcoin&#039;s lead:&#039; Is an altseason brewing?\" class=\"attachment-full size-full wp-post-image\" height=\"713\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Altcoin-season-incoming.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1267\" />The Altcoin Index says “not yet,” but the charts suggest something bigger is brewing."
    },
    {
      "title": "Bitcoin: Breaking down BTC’s mid-cycle signals before it’s too late",
      "link": "https://ambcrypto.com/bitcoin-breaking-down-btcs-mid-cycle-signals-before-its-too-late/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-08T131652.371-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin metrics suggest mid-cycle strength, but volatility could rise as historical patterns repeat."
    }
  ]
}