{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: BTC Reclaims 100K as Markets Shrug off Iran Strike",
      "link": "https://www.coindesk.com/markets/2025/06/22/asia-morning-briefing-btc-reclaims-100k-as-markets-shrug-off-iran-strike",
      "summary": ""
    },
    {
      "title": "Solana's SOL Falls 8% as Traders Brace for Fallout From a Spike in Oil Price",
      "link": "https://www.coindesk.com/markets/2025/06/22/solana-s-sol-falls-over-8-as-traders-brace-for-fallout-from-a-spike-in-oil-price",
      "summary": ""
    },
    {
      "title": "Bitcoin Price Slips Below $100K, Hinting Oil-Led Risk-Off on Wall Street",
      "link": "https://www.coindesk.com/markets/2025/06/22/bitcoin-slips-below-usd100k-hinting-oil-led-risk-off-on-wall-street",
      "summary": ""
    },
    {
      "title": "Iran Mulls Closure of Strait of Hormuz; Digital Oil Memecoin Soars 400%",
      "link": "https://www.coindesk.com/markets/2025/06/22/iran-s-parliament-has-reportedly-approved-closure-of-strait-of-hormuz-digital-oil-memecoin-soars-400",
      "summary": ""
    },
    {
      "title": "ADA Takes a Hard Fall as Traders Feel the Heat of War in the Middle East",
      "link": "https://www.coindesk.com/markets/2025/06/22/ada-takes-a-hard-fall-as-traders-feel-the-heat-of-war-in-the-middle-east",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Saylor hints next Bitcoin buy as investor sues over Strategy’s Q1 loss",
      "link": "https://cointelegraph.com/news/saylor-next-bitcoin-buy-investor-sues-over-strategy-6b-loss?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2YxMTItZjRkYS03NmYzLWFiMzctZjcxNmMwZDM3MjEz.jpg\" /></p><p>Strategy chair Michael Saylor cryptically hinted at another Bitcoin buy as the company faces a lawsuit over its $5.9 billion loss on Bitcoin in Q1.</p>"
    },
    {
      "title": "Bitcoin ‘weakness shall pass’ after dip below $100K: Arthur Hayes",
      "link": "https://cointelegraph.com/news/bitcoin-weakness-shall-pass-after-falling-below-100k-hayes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTI0ZjktM2U5Mi03NmE2LWFiODEtMmQ2M2Y3ZjE1MzA0.jpg\" /></p><p>Bitcoin has lost more than 8% over the past week as geopolitical tensions and military action between Israel and Iran ramped up.</p>"
    },
    {
      "title": "Hacken token plunges 99% after hacker mints and dumps $250K",
      "link": "https://cointelegraph.com/news/hacken-exploited-through-private-key-leak?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzlhMmMtNDQ4My03MGQzLWFmZGUtMTNkMTgwNzQ0NDBm.jpg\" /></p><p>Cybersecurity firm Hacken CEO Dyma Budorin said the biggest damage has been to its reputation, though the incident had nothing to do with the main business.</p>"
    },
    {
      "title": "Traders watch XRP, ETH, SOL and HYPE now that Bitcoin trades below $100K",
      "link": "https://cointelegraph.com/news/traders-watch-xrp-eth-sol-and-hype-now-that-bitcoin-trades-below-100k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk4YTgtNjgyYi03MmM5LTkyZGEtNTcyNTkxMjQ0ZjM5.jpg\" /></p><p>Bitcoin’s drop below the $100,000 support pulled ETH, XRP, SOL, and HYPE lower, but a relief rally may be around the corner.</p>"
    },
    {
      "title": "Ethereum whale stacks $39M despite ETH falling harder than Bitcoin",
      "link": "https://cointelegraph.com/news/ethereum-whale-stacks-39m-eth-despite-ether-falling-harder-than-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk3MmMtMDI0NS03OWM3LTg2NzAtNzk3YThlYzYxZjJi.jpg\" /></p><p>Technical patterns point to a potential 25% rebound in Ether’s price, with whales scooping $263.5 million worth of ETH during the price dip.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Gracy Chen, the rare but glorious woman behind Bitget’s epic growth",
      "link": "https://cryptoslate.com/gracy-chen-the-rare-but-glorious-woman-behind-bitgets-epic-growth/",
      "summary": "<p>Welcome to Slate Sundays, ’s weekly feature showcasing in-depth interviews, expert analysis, and thought-provoking op-eds that go beyond the headlines to explore the ideas and voices shaping the future of crypto. Gracy Chen leaves quite an impression. As the only female CEO among the top 10 crypto exchanges, she’s well aware of the challenges facing women [&#8230;]</p> <p>"
    },
    {
      "title": "Solana network extensions will redefine blockchain scaling",
      "link": "https://cryptoslate.com/solana-network-extensions-will-redefine-blockchain-scaling/",
      "summary": "<p>The following is a guest post and opinion from Aryan Sheikhalian, Head of Research at CMT Digital. Ethereum is betting big on a future filled with rollups. But in typical Solana fashion, the network is taking a different route—one that doesn’t just scale more blockspace, but bespoke execution environments with first-class developer control. Enter Network [&#8230;]</p> <p>"
    },
    {
      "title": "Oil markets tense amid U.S. airstrikes on Iran, while Bitcoin price holds steady",
      "link": "https://cryptoslate.com/oil-markets-tense-amid-u-s-airstrikes-on-iran-while-bitcoin-price-holds-steady/",
      "summary": "<p>Global oil markets are on high alert following U.S. airstrikes on three of Iran’s nuclear facilities, Fordow, Isfahan, and Natanz, with fears mounting over a potential closure of the critical Strait of Hormuz. The military action, announced by President Donald Trump last night, has intensified geopolitical tensions in the Middle East and raised concerns about [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto has grown up: Why the Rolex rally is on pause in 2025",
      "link": "https://cryptoslate.com/crypto-has-grown-up-why-the-rolex-rally-is-on-pause-in-2025/",
      "summary": "<p>The following is a guest post and opinion from Gracy Chen, CEO of Bitget. There was a time not too long ago when the pulse of the crypto market could be measured not only by candlestick charts but by the waitlists at luxury watch boutiques. During the 2020–2022 bull cycle, the correlation between Bitcoin and [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase CEO highlights 3 key reasons why the world needs crypto",
      "link": "https://cryptoslate.com/coinbase-ceo-highlights-3-key-reasons-why-the-world-needs-crypto/",
      "summary": "<p>As the world faces increasing economic woes from soaring debt and stubborn inflation to dwindling trust in financial institutions, Coinbase CEO says, “The world needs crypto, now more than ever.” He adds: “Debt is growing exponentially, inflation is crippling entire nations, economic freedom is declining.” Armstrong points to the astronomical level of U.S. federal debt, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Finds Some Relief, But Faces Headwinds on The Path Up",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-finds-some-relief-2-020/",
      "summary": "XRP price started a fresh decline below the $2.00 zone. The price is now correcting losses and faces resistance near the $2.050 level. XRP price started a fresh decline below the $2.050 zone. The price is now trading below $2.020 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $2.020 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start a fresh increase if there is a close above the $2.050 resistance zone. XRP Price Faces Resistance XRP price reacted to the downside below the $2.120 support zone, like Bitcoin and Ethereum. The price declined below the $2.050 and $2.020 support levels. The pair tested the $1.920 support A low was formed at $1.910 and the price started to recover losses. There was a minor recovery wave above the 23.6% Fib retracement level of the downward move from the $2.178 swing high to the $1.910 low. The price is now trading below $2.020 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.020 level. There is also a key bearish trend line forming with resistance at $2.020 on the hourly chart of the XRP/USD pair. The first major resistance is near the $2.050 level or the 50% Fib retracement level of the downward move from the $2.178 swing high to the $1.910 low. The next resistance is $2.080. A clear move above the $2.080 resistance might send the price toward the $2.120 resistance. Any more gains might send the price toward the $2.150 resistance or even $2.20 in the near term. The next major hurdle for the bulls might be $2.250. Another Drop? If XRP fails to clear the $2.050 resistance zone, it could start another decline. Initial support on the downside is near the $1.950 level. The next major support is near the $1.920 level. If there is a downside break and a close below the $1.920 level, the price might continue to decline toward the $1.880 support. The next major support sits near the $1.840 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.950 and $1.920. Major Resistance Levels – $2.020 and $2.050."
    },
    {
      "title": "Bitcoin Crashed Below $100,000 Amid US Airstrikes On Iran And Market Sell-Off",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-crashed-below-100000-amid-us-airstrikes-on-iran-and-market-sell-off/",
      "summary": "The market’s leading crypto, Bitcoin (BTC), dipped below the $100,000 mark for the first time in over a month on Sunday, following US airstrikes on Iran as conflicts in the middle east continue to escalate. This decline, which saw the Bitcoin price drop approximately 4% to around $99,300, coincided with a broader market sell-off, with Ethereum (ETH) experiencing an even sharper decline of nearly 10%. Overall, the total cryptocurrency market took a significant hit, falling about 7% in just 24 hours. Geopolitical Unrest And Tariff Troubles The timing of this downturn was particularly notable, occurring just hours after the US targeted three key nuclear sites in Iran. Tensions had escalated following a United Nations report that indicated Iran was not adhering to international prohibitions against developing a military nuclear program. In response to these revelations, Israel conducted strikes against Iran, leading to further retaliation from the Islamic Republic. On Saturday, President Donald Trump declared on social media: This is an HISTORIC MOMENT FOR THE UNITED STATES OF AMERICA, ISRAEL, AND THE WORLD. IRAN MUST NOW AGREE TO END THIS WAR. THANK YOU! Related Reading: Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106 This recent plummet below the psychologically significant $100,000 threshold follows a year of substantial gains for Bitcoin. After Trump took office in January, Bitcoin reached all-time highs above $100,000 in February, buoyed by executive orders aimed at supporting the cryptocurrency sector. However, the cryptocurrency&#8217;s price soon mirrored the broader declines in financial markets, particularly after Trump announced severe tariffs in April, which saw Bitcoin fall to nearly $75,000, its lowest point in 2025. Despite this volatility, Bitcoin had seen a resurgence, particularly in May when it reached new highs as Wall Street investors returned to the cryptocurrency through US exchange-traded funds (ETFs). However, by late Sunday, there were signs of recovery, with Bitcoin trading approximately at $101,300, down only 1% over the previous day, while ETH managed to pare its losses to around $2,200. Forced Liquidations Exacerbate Bitcoin Sell-Off According to CNBC, Iran has also threatened to block the Strait of Hormuz, a crucial shipping route responsible for approximately 20% of the global oil supply, further adding to the broader financial uncertainty. JPMorgan warned that such a blockade could drive oil prices up to $130 per barrel, which would have significant implications for US inflation, potentially pushing it back toward 5%—a level not seen since March 2023. While Bitcoin has often been promoted as an inflation hedge, its recent behavior aligns more closely with that of high-beta tech stocks. Data from crypto provider Kaiko indicates that Bitcoin’s correlation with the tech-heavy Nasdaq has increased sharply in recent weeks, particularly following the surge in inflows into Bitcoin ETFs. Related Reading: $312M ETH Transfer Triggers Sell-Off Fears As Ethereum Price Crashes Below Support Institutional investment patterns have also shifted. More than $1.04 billion flowed into spot Bitcoin ETFs from Monday to Wednesday last week, but this momentum dissipated as the weekend approached, with minimal net movement on Thursday and only $6.4 million on Friday. The technical aspects of the market further exacerbated the sell-off. Research from CoinGlass revealed that Bitcoin’s drop below $99,000 triggered forced liquidations across offshore derivatives platforms, including Binance and Bybit. During this period, over $1 billion in crypto positions were liquidated within 24 hours, with more than 95% of these coming from long positions, highlighting the market&#8217;s overexposure. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Price Slides 10% — Market Sentiment Turns Cautious",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-slides-2150/",
      "summary": "Ethereum price started a fresh decline below the $2,500 zone. ETH is now consolidating losses and might attempt to recover above the $2,250 resistance. Ethereum started a fresh decline below the $2,350 level. The price is trading below $2,350 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $2,280 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it settles above the $2,320 resistance zone in the near term. Ethereum Price Eyes Recovery Ethereum price started a fresh decline below the $2,500 support level, like Bitcoin. ETH price declined below the $2,350 and $2,250 levels. The bears even pushed the price below the $2,200 level. The pair tested the $2,120 zone and started a consolidation phase. There was a minor move above the $2,200 level. The price climbed above the 23.6% Fib retracement level of the downward move from the $2,568 swing high to the $2,114 low. Ethereum price is now trading below $2,300 and the 100-hourly Simple Moving Average. On the upside, the price could face resistance near the $2,250 level. There is also a key bearish trend line forming with resistance at $2,280 on the hourly chart of ETH/USD. The next key resistance is near the $2,340 level. It is close to the 50% Fib retracement level of the downward move from the $2,568 swing high to the $2,114 low. The first major resistance is near the $2,400 level. A clear move above the $2,400 resistance might send the price toward the $2,500 resistance. An upside break above the $2,500 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,550 resistance zone or even $2,620 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,340 resistance, it could start a fresh decline. Initial support on the downside is near the $2,200 level. The first major support sits near the $2,150 zone. A clear move below the $2,150 support might push the price toward the $2,120 support. Any more losses might send the price toward the $2,050 support level in the near term. The next key support sits at $2,000. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,150 Major Resistance Level – $2,340"
    },
    {
      "title": "Bitcoin Price Dives as War Escalation Sparks Market Sell-Off",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-dives-100k/",
      "summary": "Bitcoin price started a fresh decline below the $103,000 zone. BTC is now consolidating and might struggle to recover above the $103,500 resistance. Bitcoin started a fresh decline below the $103,000 zone. The price is trading below $102,500 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance at $101,250 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $100,000 zone. Bitcoin Price Dips Further Bitcoin price started a fresh decline below the $105,500 zone. BTC gained pace and dipped below the $104,200 and $103,000 levels. There was a clear move below the $102,000 support level. Finally, the price tested the $98,250 zone. A low was formed at $98,277 and the price started a consolidation phase. There was a minor recovery above the 23.6% Fib retracement level of the downward move from the $106,470 swing high to the $98,277 low. However, the bears were active below the $101,200 zone. Bitcoin is now trading below $102,000 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance at $101,250 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $101,250 level. The first key resistance is near the $102,500 level or the 50% Fib retracement level of the downward move from the $106,470 swing high to the $98,277 low. The next key resistance could be $103,500. A close above the $103,500 resistance might send the price further higher. In the stated case, the price could rise and test the $105,000 resistance level. Any more gains might send the price toward the $106,200 level. Another Drop In BTC? If Bitcoin fails to rise above the $102,000 resistance zone, it could start another decline. Immediate support is near the $100,150 level. The first major support is near the $98,500 level. The next support is now near the $96,500 zone. Any more losses might send the price toward the $95,500 support in the near term. The main support sits at $95,000, below which BTC might struggle to find bids. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $100,150, followed by $100,000. Major Resistance Levels – $101,250 and $103,500."
    },
    {
      "title": "$96k Or $144k? Bitcoin Mayer Multiple Chart Price Target Options",
      "link": "https://www.newsbtc.com/news/bitcoin/96k-or-144k-bitcoin-mayer-multiple-chart-price-target-options/",
      "summary": "Bitcoin (BTC) has registered a slight uptick in the last few hours after US President Donald Trump announced a successful airstrike on Iranian nuclear facilities, a move aimed at de-escalating rising tensions in the Middle East after several days of conflict between Iran and Israel. Despite the short-term price reaction, BTC remains in a corrective phase, having struggled to break through the $110,000 resistance level over the past month with market sentiment being largely shaped by both global uncertainty and technical stagnation. Amid this backdrop, a crypto analyst with X pseudonym On-Chain College has highlighted two prospective price targets based on on-chain data. Related Reading: Bitcoin Price Breakdown Spurs Sell-Offs, Analyst Reveals What Will Happen If BTC Hits 92,800 Market Odds Favor Further Upside For Bitcoin &#8211; Analyst In a recent X post on June 21, On-Chain College shares a positive long-term Bitcoin price outlook using the Mayer Multiple, an on-chain metric that measures relationship between Bitcoin’s price and its 200-day moving average (200DMA). By tracking key valuation bands, the Mayer Multiple helps determine whether Bitcoin is overvalued, undervalued, or fairly valued, based on historical price behavior. Since the bull market commenced in Q4 2024, Bitcoin has consistently moved between 1.0x band i.e. the 200DMA (blue line) and the 1.5x band (orange line) representing the mid price range zone. Notably, the Bitcoin price struggles in the past have generated speculations of potential market top at the current market high. However, the Mayer Multiple chart shows that BTC has only ever attained a cycle price peak after hitting the 2.5x band (red line). Therefore, there is still room for price growth in the current bull market. However, the immediate price targets for premier cryptocurrency lies at $96,000 (1.0x) or $144,000 (1.5x). Notably, there is significant potential to rediscover its bullish form and surge towards $144,000 in line with its defined-range bound movement. However, there are also equal chances of a return to $96,000 which On-Chain College states would aid in flushing out weak hands before a full-scale bullish price reversal. Related Reading: XRP Daily New Addresses Plunge 80% In 2025 — Bearish On-Chain Metrics Raise Alarm Bitcoin Price Outlook At the time of writing, Bitcoin is valued at $102,700 following a 1.50% decline in the last 24 hours. Meanwhile, the maiden cryptocurrency also reports losses of 2.94% and 8.08% on the weekly and monthly chart, respectively. According to CoinCodex, the general market sentiment remains neutral. However, CoinCodex analysts foresee an impending price breakout with an audacious projection of $136,472 within the next five days. Interestingly, it’s worth noting that this level may represent or come close to the cycle market top, as long-term forecasts include $138,379 in three months and $116,115 in six months. Featured image from Pexels, chart from Tradingview"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Norway Plans to Temporarily Ban New Bitcoin & Crypto Mining Centers to Conserve Energy",
      "link": "https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/NBX-Acquires-Bitcoin-Becomes-First-Public-Bitcoin-Treasury-Company-in-Norway.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy\" rel=\"nofollow\">Norway Plans to Temporarily Ban New Bitcoin &amp; Crypto Mining Centers to Conserve Energy</a></p> <p>Norway’s government will temporarily block the development of new Bitcoin and cryptocurrency mining facilities starting this year, prioritizing energy for other industries.</p> <p>"
    },
    {
      "title": "A Seed Phrase Isn’t Self Custody, It’s A Liability.",
      "link": "https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/seedlessheader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability\" rel=\"nofollow\"> </a></p> <p>Seed phrases were an improvement a decade ago. They’re long overdue for an upgrade.</p> <p>"
    },
    {
      "title": "Is the 4-Year Bitcoin Cycle Over? Rational Root Explains Why This Time Might Not Be Different",
      "link": "https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Is-the-4-Year-Bitcoin-Cycle-Over-Rational-Root-Explains.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root\" rel=\"nofollow\"> </a></p> <p>Rational Root joins Pro to debate whether the 4-year Bitcoin cycle is breaking down in the age of ETFs, passive flows, and institutions.</p> <p>"
    },
    {
      "title": "What Happens to Bitcoin When Quantum Computers Arrive?",
      "link": "https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ChaincodeReportHeader-fotor-20250620123039.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive\" rel=\"nofollow\"> </a></p> <p>A high level overview of the recent report by Chaincode Labs on the threat quantum computing poses to Bitcoin. </p> <p>"
    },
    {
      "title": "Coinbase Secures MiCA License to Serve 450 Million Europeans",
      "link": "https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans\" rel=\"nofollow\"> </a></p> <p>Coinbase has obtained its Markets in Crypto Assets (MiCA) license from Luxembourg&#8217;s Commission de Surveillance du Secteur Financier (CSSF), marking a significant regulatory milestone that enables them to offer its complete range of services across all 27 European Union member states. The license allows Coinbase to serve approximately 450 million Europeans under a unified regulatory [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Cointelegraph Website Hacked in Fake Airdrop Phishing Attack",
      "link": "https://decrypt.co/326435/cointelegraph-website-hacked-fake-airdrop-phishing-attack",
      "summary": "Cointelegraph is the latest in a wave of phishing attacks targeting crypto platforms via exploits that lure users with fake token rewards."
    },
    {
      "title": "Texas Joins Growing List of US States With Bitcoin Reserves",
      "link": "https://decrypt.co/326427/texas-us-states-bitcoin-reserves",
      "summary": "Texas has become the third U.S. state to approve a public Bitcoin reserve, with new legislation allowing direct crypto purchases."
    },
    {
      "title": "Bitcoin Rebounds as Markets Price in 'Short-Lived' Iran Conflict",
      "link": "https://decrypt.co/326424/bitcoin-rebounds-markets-price-short-lived-iran-conflict",
      "summary": "Bitcoin rose back above $100,000 as markets shrugged off U.S. strikes on Iran, with oil and equities remaining largely unchanged."
    },
    {
      "title": "This Week in Crypto Games: B3's Self-Destruct PC, Avalanche Battle Pass",
      "link": "https://decrypt.co/325851/this-week-crypto-games-self-destruct-pc-avalanche-battle-pass",
      "summary": "Ethereum gaming protocol B3 is launching a PC with self-destruct storage, Avalanche dropped a battle pass with rewards for players, and more."
    },
    {
      "title": "7 Classic Video Games That Defined Their Consoles",
      "link": "https://decrypt.co/326159/7-classic-video-games-defined-consoles",
      "summary": "From analog sticks to motion controls, these are the games that didn’t just launch on a console; they defined what it could do."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin crashes as Iranian Parliament approval of Hormuz Strait closure threatens oil disruption, stokes global inflation",
      "link": "https://cryptobriefing.com/bitcoin-oil-disruption-inflation/",
      "summary": "<p>The potential closure of the Strait of Hormuz could trigger global economic instability, with rising oil prices exacerbating inflationary pressures.</p> <p>"
    },
    {
      "title": "Trump announces US airstrikes on Iran’s nuclear sites, Bitcoin dumps, then pumps",
      "link": "https://cryptobriefing.com/us-iran-airstrikes-nuclear-sites/",
      "summary": "<p>The airstrikes heighten geopolitical tensions, potentially destabilizing the region and impacting global markets and cryptocurrency volatility.</p> <p>"
    },
    {
      "title": "Texas governor signs Bitcoin reserve bill into law",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-law/",
      "summary": "<p>Texas' Bitcoin reserve law could bolster financial resilience and set a precedent for other states to integrate crypto into fiscal strategies.</p> <p>"
    },
    {
      "title": "CoinMarketCap’s front-end compromised, investigation underway",
      "link": "https://cryptobriefing.com/coinmarketcap-security-breach-investigation/",
      "summary": "<p>This incident highlights the urgent need for enhanced cybersecurity measures in the crypto industry to protect user assets and data integrity.</p> <p>"
    },
    {
      "title": "Texas governor signs bill to protect state Bitcoin reserve as a permanent fund if established",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-protection-bill/",
      "summary": "<p>Texas' move to protect a potential Bitcoin reserve could set a precedent for state-level crypto asset management, influencing future fiscal policies.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin alert! –  Should BTC traders brace for $82K in a market reset?",
      "link": "https://ambcrypto.com/bitcoin-alert-should-btc-traders-prepare-for-82k-in-a-market-reset/",
      "summary": "<img alt=\"Bitcoin woes set to worsen? Here&#039;s what the fall below $102.5k could lead to\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-8.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The drawdown from the recent ATH was a meager 8.75%- Bitcoin has seen deeper corrections during recent bull runs, which investors should prepare for."
    },
    {
      "title": "Injective slumps 12% – Assessing if you should buy INJ now",
      "link": "https://ambcrypto.com/injective-slumps-12-traders-should-you-buy-now-assessing/",
      "summary": "<img alt=\"INJ\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250622_130948_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />INJ long-term holders return, shaking up the market."
    },
    {
      "title": "Bitcoin spot volume soars 10X, yet traders should be cautious – Why?",
      "link": "https://ambcrypto.com/bitcoin-spot-volume-soars-10x-yet-traders-should-be-cautious-why/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-22T130900.596-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Binance’s dominance surges, but cooling network metrics and rising inflows could threaten Bitcoin’s upside."
    },
    {
      "title": "Crypto market’s weekly winners and losers – KAIA, BCH, SPX, FARTCOIN",
      "link": "https://ambcrypto.com/crypto-market-weekly-review-22-june/",
      "summary": "<img alt=\"Crypto weekly winner and loser\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika2-6.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here’s how some of your favorites wrapped up the week."
    },
    {
      "title": "Celestia: THESE signs reveal why TIA inflows surged despite BTC’s fall",
      "link": "https://ambcrypto.com/celestia-these-signs-reveal-why-tia-inflows-surged-despite-btcs-fall/",
      "summary": "<img alt=\"Celestia: Downturn? No, THESE signs reveal why TIA inflows surged despite Bitcoin’s fall\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250622_095816_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TIA drops 11%, but whales may be loading up, know why!"
    }
  ]
}