{
  "CoinDesk": [
    {
      "title": "Bitcoin Falls Below $104K as Retail Investor Sentiment Returns to Liberation Day Levels",
      "link": "https://www.coindesk.com/markets/2025/06/21/bitcoin-falls-below-usd104k-as-retail-investor-sentiment-returns-to-liberation-day-levels",
      "summary": ""
    },
    {
      "title": "Spot Crypto ETF Filings for XRP, SOL, DOGE Among Those With Overwhelming SEC Approval Odds: Bloomberg",
      "link": "https://www.coindesk.com/markets/2025/06/20/spot-crypto-etf-filings-for-xrp-sol-doge-among-those-with-overwhelming-sec-approval-odds-bloomberg",
      "summary": ""
    },
    {
      "title": "Bitcoin Quickly Plunges Below $103K, With Volatility Burst Spurring $450M in Crypto Liquidations",
      "link": "https://www.coindesk.com/markets/2025/06/20/bitcoin-quickly-plunges-below-103k-with-volatility-burst-spurring-450m-in-crypto-liquidations",
      "summary": ""
    },
    {
      "title": "Trumps May Have Sold Platform Stake as U.S. Stablecoins See Wave of Good News",
      "link": "https://www.coindesk.com/policy/2025/06/20/as-u-s-stablecoins-see-wave-of-good-news-trumps-may-have-sold-platform-stake",
      "summary": ""
    },
    {
      "title": "Peter Schiff Says He 'Gets Bitcoin' But Not USD-Pegged Stablecoins, Floats Gold-Backed Token Plan",
      "link": "https://www.coindesk.com/markets/2025/06/20/peter-schiff-says-he-gets-bitcoin-but-not-usd-pegged-stablecoins-floats-gold-backed-token-plan",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "ZachXBT slams Bitcoin bridge Garden Finance for laundering hacked funds",
      "link": "https://cointelegraph.com/news/zachxbt-garden-finance-lazarus-laundering-allegations?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkxZTMtYmNhMi03ZjIyLThlZTAtZDVlNTliODk1ZTdk.jpg\" /></p><p>ZachXBT claims over 80% of Garden Finance’s fees are tied to crypto laundering, challenging the project’s decentralization narrative.</p>"
    },
    {
      "title": "Nakamoto Holdings secures $51.5M to expand Bitcoin treasury strategy",
      "link": "https://cointelegraph.com/news/nakamoto-holdings-raises-51m-to-expand-bitcoin-treasury?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkxNTQtZjc5My03NDA2LWJiNGQtZDk1M2FkZGVhMGU3.jpg\" /></p><p>Nakamoto Holdings, led by Trump’s crypto adviser David Bailey, raises $51.5M in fresh capital to accelerate its Bitcoin acquisition strategy.</p>"
    },
    {
      "title": "Crypto cycle is playing out ‘spookily similar’ to 2017: Raoul Pal",
      "link": "https://cointelegraph.com/news/crypto-cycle-resembles-2017-macro-data-raoul-pal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkxMWQtNjNmZi03MmMyLTg1MWMtZTJiMTdlY2VkMWYz.jpg\" /></p><p>Real Vision CEO Raoul Pal says macroeconomic data suggests the current crypto cycle could extend into Q2 2026.</p>"
    },
    {
      "title": "CoinMarketCap has &#039;identified and removed&#039; malicious wallet scam",
      "link": "https://cointelegraph.com/news/coinmarketcap-malicious-verify-wallet-popup-removed-website?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkwMzctOThhNi03MWNhLWEzNTAtZjM3ODAzNzhmYzA5.jpg\" /></p><p>According to a post on CoinMarketCap's X account, the malicious code has been removed, though the team insists the investigation into the incident is still ongoing.</p>"
    },
    {
      "title": "Bitcoin in a post-Trump world worries hedge fund execs: Eric Semler",
      "link": "https://cointelegraph.com/news/bitcoin-donald-trump-administration-hedge-fund-concerns-eric-semler?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5MzhjNjktMzcyYi03YjgwLWI4OTctOTFhMTliMTNiMTIy.jpg\" /></p><p>Eric Semler says he enjoys being the “lone voice crying in the wilderness” with Bitcoin as most hedge fund executives think Bitcoin is a “fly-by-night concept.”</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Pumpfun reportedly delays token auction to July amid legal troubles",
      "link": "https://cryptoslate.com/pumpfun-reportedly-delays-token-auction-to-july-amid-legal-troubles/",
      "summary": "<p>Pump.fun has delayed its public token sale once again, extending months of uncertainty for users and investors as the popular Solana-based launchpad wrestles with a flurry of lawsuits, Colin Wu reported on June 20. Pump.fun had aimed to raise $1 billion at a $4 billion valuation through its token auction originally set for June 25. The [&#8230;]</p> <p>"
    },
    {
      "title": "Alex Mashinsky forfeits rights to Celsius assets amid ongoing bankruptcy process",
      "link": "https://cryptoslate.com/alex-mashinsky-forfeits-rights-to-celsius-assets-amid-ongoing-bankruptcy-process/",
      "summary": "<p>Alex Mashinsky, the former CEO of Celsius, has agreed to surrender all rights to assets tied to the collapsed crypto lender. According to newly filed court documents, Mashinsky and entities associated with him, including AM Ventures Holdings Inc., Koala1 LLC, and Koala3 LLC, will be excluded from any future distributions under the Celsius bankruptcy plan. The [&#8230;]</p> <p>"
    },
    {
      "title": "Bloomberg analysts revise ETF approval odds to ‘90% or higher’ as SEC requests amended filings",
      "link": "https://cryptoslate.com/bloomberg-analysts-revise-etf-approval-odds-to-90-or-higher-as-sec-requests-amended-filings/",
      "summary": "<p>Bloomberg analysts have sharply increased the likelihood of U.S. regulators approving a new wave of cryptocurrency exchange-traded funds, pointing to a friendlier stance from the Securities and Exchange Commission (SEC). Bloomberg senior ETF analysts Eric Balchunas and James Seyffart said on June 20 that they now see a &#8220;90% or higher&#8221; chance that a broad [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase secures MiCA approval, shifts headquarters to Luxembourg",
      "link": "https://cryptoslate.com/coinbase-secures-mica-approval-shifts-headquarters-to-luxembourg/",
      "summary": "<p>Coinbase, the largest US-based exchange, has taken a major step in its global expansion by securing approval under the European Union’s Markets in Crypto-Assets (MiCA) regulation, according to a June 20 statement. The exchange confirmed that Luxembourg’s financial watchdog, the Commission de Surveillance du Secteur Financier (CSSF), granted it the necessary license to operate across the [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin falls to monthly lows triggering $464 million in liquidations amid global market jitters",
      "link": "https://cryptoslate.com/bitcoins-falls-to-monthly-lows-triggering-464-million-in-liquidations-amid-global-market-jitters/",
      "summary": "<p>Bitcoin (BTC) fell to its lowest price this month on June 20, triggering $464 million in liquidations across cryptocurrency markets as geopolitical jitters and heavy selling pressure rattled traders. Bitcoin dropped to a low of $102,225, reversing the gains recorded earlier in the day after failing to break through resistance above $106,000. Data from Coinglass [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Tron Energy Usage Surges 108% – Smart Contract Activity Accelerates",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-energy-usage-surges-108-smart-contract-activity-accelerates/",
      "summary": "Tron (TRX) has captured investor attention once again with major developments surrounding its future. On Monday, Nasdaq-listed SRM Entertainment (SRM.O) confirmed a strategic agreement with Tron founder Justin Sun. The deal will see SRM acquire Tron tokens, rebrand itself as &#8220;Tron Inc.,&#8221; and onboard Sun as an adviser, effectively bringing Tron closer to becoming a publicly traded entity. This marks a historic shift for the blockchain industry and positions Tron in a unique space among crypto projects. Related Reading: Solana Analyst Sees $123 And $116 As Mid-Zone Support Levels – Here’s Why However, the market backdrop is anything but calm. Rising geopolitical tensions in the Middle East have sparked sharp volatility across risk assets, including Tron. While the token’s price has fluctuated significantly, long-term metrics suggest underlying strength in the network. According to new CryptoQuant data, TRON’s total daily energy consumption—an important measure of smart contract execution and user activity—has surged 108% year-over-year. It now sits at 200 billion energy units per day, compared to just 77 billion a year ago. Notably, 80% of this demand originates from staked TRX, indicating robust participation in the protocol and a significant increase in smart contract interactions. Together, these factors underscore Tron&#8217;s growing relevance as both a technical platform and a public-facing blockchain enterprise. Tron Trades Near Key Demand Amid Broader Market Pullback Tron is currently testing key demand levels after a 9% correction from its recent high near $0.295. The price had briefly surged on Monday after the announcement of Tron’s plans to go public through a deal with Nasdaq-listed SRM Entertainment. However, the excitement was short-lived. As macroeconomic uncertainty deepens and Middle East conflicts escalate, the entire crypto market has entered a retracement phase, dragging TRX below the levels it traded at prior to the news. Despite the challenging conditions, on-chain fundamentals paint a much more resilient picture. CryptoQuant data shows that Tron’s network activity remains robust, with energy consumption—used to execute smart contracts—up 108% year-over-year. Total daily energy usage now exceeds 200 billion units, compared to just 77 billion at the same time last year. This surge in energy use signals growing demand for on-chain operations and smart contract execution. Importantly, about 80% of this energy demand comes from staked TRX, pointing to strong user commitment to the network and increased participation in decentralized applications. The divergence between TRX’s on-chain strength and its current price performance suggests that the recent pullback may be more about broader market stress than any deterioration in Tron’s fundamentals. If volatility stabilizes, these robust activity metrics could help position Tron for a strong recovery. Related Reading: Ethereum Prepares For A Decisive Move: ETH/BTC Setup Could Trigger Altseason TRX Price Holds Trendline Support Despite Volatile Reversal Tron is currently trading at $0.2730, showing a modest 9% pullback from the $0.295 high reached earlier this week following the announcement of a deal involving SRM Entertainment. Price action in the chart reflects this volatile reaction—after spiking, TRX retraced sharply and is now consolidating just above the 50-day moving average (blue line), which has acted as dynamic support over the past two months. Despite this pullback, the structure remains bullish. TRX continues to respect the long-term ascending trendline formed since early March, with higher lows being maintained. Volume surged during the initial rally on the announcement but has since returned to pre-news levels, indicating fading short-term hype and a return to fundamentals. Looking at the broader setup, the 100-day and 200-day moving averages (green and red lines) remain sloped upward, reflecting sustained long-term momentum. The $0.269–$0.253 support band, defined by these MAs, will be key if further downside pressure materializes. Related Reading: Ethereum Analyst Eyes High Timeframe Close – Range Break Above $2,800 Could Be Violent A break above $0.295 would invalidate this short-term pullback and potentially ignite a move toward $0.32. Conversely, failure to hold the trendline could trigger a deeper retracement. For now, TRX holds structure—yet caution remains warranted given broader market uncertainty. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "XRP Price Crash Tests Critical Support At $2.1, Will It Break?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-crash-tests-2-1/",
      "summary": "After the market crash that sent the Bitcoin price falling toward $100,000, the XRP price also saw a notable decline, and this crash has brought it toward an important level. While the digital asset continues to hold above the $2.1 level, it remains critical support and a break below this could be negative for the price. This is outlined by crypto analyst The Alchemist Trader, who has shown what direction the XRP price could be headed in depending on what happens here. XRP Price Threatens Major Support Level After the almost 4.5% decline that ravaged the XRP price over the last week, it has been pushed down toward the next major support level, lying just above $2.09. So far, the bulls have defended this level, but the multiple tests suggest that a breakdown at this level could be in view. Related Reading: Analyst Predicts 20% Ethereum Price Crash Below $2,000, Here’s Why The analyst explains that the reason this level is so important is that it actually includes the value area low recorded in previous declines. Additionally, it is the 200-day moving average (MA) for the cryptocurrency, and also now serves as a key daily support/resistance flip. This means either camp of the bulls and bears can pull it in their direction, making it incredibly important for what happens to the XRP price in the short term. Given the importance of this level, whether it holds or breaks will carry serious implications for the XRP price. In the bearish scenario, the crypto analyst explains that a break below this support would trigger a liquidity sweep as the price dumps lower. The possibility of a break is even higher now, given that this level has already been tested multiple times. The Alchemist explains that each test weakens the level, putting it at risk of a breakdown. However, with long consolidation so far above this level, there is a bullish scenario that is rising. As bulls continue to maintain this support, further strength here could erode the possibility of a decline. If properly defended with a notable uptick in volume, in addition to a move upward into the recent local highs at $2.4, then it is likely that the XRP price continues to move up. Related Reading: Ethereum Bullish Wave Towards ATH Coming? Here Are The Targets “For bulls, a clean defense of this level with volume and a move back above recent local highs would indicate a potential rotation toward the next resistance,” the analysis read. “For bears, a breakdown without a reclaim increases the likelihood of continuation to the downside.” As for how to play the current trend, the analyst advises investors to exercise caution and wait for confirmation before taking positions. The confirmation here would either be a break below the support or a strong upward rally away from it, signaling a clear direction. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "BNB Price Breakout Could Trigger ATH Rally Repeat – Is $730 The Next Stop?",
      "link": "https://www.newsbtc.com/news/bnb-price-breakout-could-trigger-ath-rally-repeat-is-730-the-next-stop/",
      "summary": "Amid the market performance, BNB is attempting to reclaim the $650 level. Some analysts believe that a breakout toward the $700 barrier might occur next, which could lead to a bigger move to new highs. Related Reading: Solana Correction About To End? Analyst Forecasts $130 Retest Before Next Wave Up BNB Breakout To Retest $700 On Friday, BNB dropped to the $640 support after failing to hold the mid-zone of its local price range. The cryptocurrency has been trading within the $630-$690 price range following its reclaim of the $600 barrier last month. During the May breakout, BNB neared the crucial $700 resistance level, hitting a four-month high of $697. This key level propelled the altcoin’s price toward its $788 all-time high (ATH) after being broken in late 2024 and was lost during the early 2025 pullbacks. Now, the cryptocurrency is eyeing a reclaim of this area as support to continue its price recovery. Analyst Carl Runefelt from The Moon Show noted that BNB displays a one-month descending triangle pattern on the daily timeframe, with price compressing between the support and resistance levels. According to the chart, the formation’s support sits around the $635 level, while the descending resistance sits around the $650 area. To Runefelt, a bullish breakout from this pattern could propel the token 10% toward the $700 resistance. Notably, reclaiming and confirming this key area as support could also send BNB’s price toward another crucial horizontal level. Analyst Crypto Batman recently highlighted that BNB is forming a multi-month ascending triangle, “holding strong” near the ascending trendline after continuing to bounce from the $635-$640 support zone. To the market watcher, “Even with market uncertainty, BNB structure is clean after respecting the trendline and bouncing off major support, now eyeing a breakout above $700,” which could be part of a bigger move toward the $800 level. Is A Move To $800 Coming? Crypto Batman also noted that the cryptocurrency could be following the same price action as last year. He asserted that the altcoin’s price “loves testing key zones before liftoff,” adding that it is displaying the same base form as it did in Q3 2024. Last year, the token formed a three-month base around the $460-$470 area, which led to an “explosive” run over the next few months. This year, BNB formed a similar base near the $550 level, and it’s “showing strength again.” To the analyst, “If the pattern repeats, then patience will give us profits.” Additionally, he pointed out that despite the early April retraces, BNB held its macro range, trading above the range lows and multi-time-tested support. Related Reading: SUI Preparing For New Highs As Falling Wedge Breakout Targets $5 The cryptocurrency is now consolidating near the mid-zone, which could propel the price to a retest of the macro range highs around the $729 mark. He explained that “If we see a breakout above the $729 resistance, it could open the path toward a 50% move to the upside.” The analyst affirmed that BNB’s structure remains bullish as long as the cryptocurrency holds the $490-$500 levels, adding that the $600 mark is also a strong support. As of this writing, BNB is trading at $641, a 2.9% decline in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Consolidation Takes Its Toll: Bitcoin Investors No Longer Greedy",
      "link": "https://www.newsbtc.com/bitcoin-news/consolidation-bitcoin-investors-no-longer-greedy/",
      "summary": "Data shows the Bitcoin Fear &#38; Greed Index has returned back to the neutral territory, a sign that investors are losing optimism. Bitcoin Fear &#38; Greed Index Has Reset Back To Neutral The &#8220;Fear &#38; Greed Index&#8221; refers to an indicator created by Alternative that tells us about the average sentiment present among the traders in the Bitcoin and wider cryptocurrency markets. Related Reading: Dogecoin Gears Up For 60% Move—Will It Be Up Or Down? The index makes use of the data of these five factors in order to determine the trader mentality: trading volume, market cap dominance, volatility, social media sentiment, and Google Trends. The indicator represents the calculated sentiment as a score lying between zero and hundred. Values above the 54 mark correspond to the dominance of greed in the market, while those below 46 to presence of fear among the investors. All values lying between these cutoffs correlate to a net neutral sentiment. Now, here is how the mood in the Bitcoin market is like right now according to the Fear &#38; Greed Index: As is visible above, the Bitcoin Fear &#38; Greed Index has a value of 54 at the moment, which suggests the investors hold a neutral sentiment, although one that&#8217;s right on the edge of turning into greed. The recent neutral mentality in the sector has come following a phase of greed among the traders, as the below chart shows. As displayed in the graph, the Bitcoin Fear &#38; Greed Index spiked to a high of 72 earlier in the month as the asset&#8217;s price gave investors hope that its consolidation phase might be coming to an end. As the recovery rally has fizzled out and the coin has returned to its range, however, optimism among the investors has predictably faded. If history is to go by, though, this development may not actually be so bad for the cryptocurrency. Generally, digital asset markets tend to move in a way that goes contrary to the expectations of the majority. The probability of such an opposite move taking place goes up the more extreme the crowd opinion becomes. Besides the three core sentiments, there are two special regions known as the extreme fear (under 25) and extreme greed (above 75). These zones are where the likelihood of a contrary move has been the strongest in the past, with tops and bottoms often taking form. Although the market sentiment has recently only seen a reset to the neutral territory, the fact that the investors are no longer greedy could still be a positive for Bitcoin and other cryptocurrencies. There have been many instances in the past where a dip into the neutral zone was enough for the bull run to regain momentum. Related Reading: Solana Plunges 13%: Can Key On-Chain Support Stop The Fall? It only remains to be seen, though, how the prices of BTC and others would develop in the coming days. BTC Price At the time of writing, Bitcoin is floating around the $102,800 mark, down more than 2% in the last seven days. Featured image from Dall-E, Alternative.me, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Sees Modest Gains, But Demand Weakness Limits Breakout Potential",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-sees-modest-gains-but-demand-weakness-limits-breakout-potential/",
      "summary": "Bitcoin has resumed a slow climb upward after a recent period of consolidation, briefly breaking back above the $106,000 mark earlier today. At the time of writing, the cryptocurrency is trading at $105,383, reflecting a 0.8% increase over the past 24 hours. While this upward move has not sparked a major breakout, analysts are paying close attention to on-chain and market structure indicators that suggest a cautiously balanced environment. Related Reading: Analyst Warns Of Bitcoin Breakdown—’If This Continues, It Snaps’ On-Chain Data Points to Equilibrium, But Demand Wanes According to CryptoQuant analyst Darkfost, the market currently lacks extreme signals of profit-taking or panic. In a recent analysis, Darkfost explained that realized profits over a seven-day moving average remain below $1 billion. This is in line with figures observed during the market correction in late 2024 and significantly below peaks seen in early 2025. The analyst suggests that the current realized profit levels point to a market that is not under pressure from large-scale investor exits, supporting the ongoing consolidation. In the same report, Darkfost also discussed how a decline in demand may be limiting further upward momentum. By analyzing the ratio of new supply to the supply held inactive for over a year, the study observed that while demand remains positive, it has been weakening since Bitcoin’s local high in May. This suggests that although the market is absorbing existing selling pressure, fresh buying interest is not strong enough to trigger a new rally. As a result, the market appears to be in a state of temporary equilibrium, a phase where both sellers and buyers are relatively inactive. Bitcoin Traders Brace for Volatility in a Crowded Range Another CryptoQuant analyst, BorisVest, echoed the sentiment of a tightly contested market by analyzing Binance order flow and position data. He noted that Bitcoin has traded within a range of $100,000 to $110,000 for nearly a month. Within this band, both long and short positions have been building, and traders are watching the extremes of this zone closely. According to BorisVest, any breakout beyond $110,000 or drop below $100,000 could set the tone for the next significant price movement. The $100K–$110K price range has become a battleground for both bulls and bears. BorisVest observed that short positions are currently increasing, indicating that a significant portion of market participants expect a downward correction. Related Reading: Is Bitcoin Gearing Up for a Breakout? On-Chain Signals Say ‘Watch This Level’ However, he also pointed out that when shorts dominate, the risk of a sudden reversal, known as a short squeeze, becomes more likely. This behavior is consistent with recent funding rate trends, which show a fairly balanced distribution of long and short bets. Featured image created with DALL-E, Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Norway Plans to Temporarily Ban New Bitcoin & Crypto Mining Centers to Conserve Energy",
      "link": "https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/NBX-Acquires-Bitcoin-Becomes-First-Public-Bitcoin-Treasury-Company-in-Norway.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy\" rel=\"nofollow\">Norway Plans to Temporarily Ban New Bitcoin &amp; Crypto Mining Centers to Conserve Energy</a></p> <p>Norway’s government will temporarily block the development of new Bitcoin and cryptocurrency mining facilities starting this year, prioritizing energy for other industries.</p> <p>"
    },
    {
      "title": "A Seed Phrase Isn’t Self Custody, It’s A Liability.",
      "link": "https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/seedlessheader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability\" rel=\"nofollow\"> </a></p> <p>Seed phrases were an improvement a decade ago. They’re long overdue for an upgrade.</p> <p>"
    },
    {
      "title": "Is the 4-Year Bitcoin Cycle Over? Rational Root Explains Why This Time Might Not Be Different",
      "link": "https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Is-the-4-Year-Bitcoin-Cycle-Over-Rational-Root-Explains.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root\" rel=\"nofollow\"> </a></p> <p>Rational Root joins Pro to debate whether the 4-year Bitcoin cycle is breaking down in the age of ETFs, passive flows, and institutions.</p> <p>"
    },
    {
      "title": "What Happens to Bitcoin When Quantum Computers Arrive?",
      "link": "https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ChaincodeReportHeader-fotor-20250620123039.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive\" rel=\"nofollow\"> </a></p> <p>A high level overview of the recent report by Chaincode Labs on the threat quantum computing poses to Bitcoin. </p> <p>"
    },
    {
      "title": "Coinbase Secures MiCA License to Serve 450 Million Europeans",
      "link": "https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans\" rel=\"nofollow\"> </a></p> <p>Coinbase has obtained its Markets in Crypto Assets (MiCA) license from Luxembourg&#8217;s Commission de Surveillance du Secteur Financier (CSSF), marking a significant regulatory milestone that enables them to offer its complete range of services across all 27 European Union member states. The license allows Coinbase to serve approximately 450 million Europeans under a unified regulatory [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Solana, XRP and Dogecoin ETF Approvals in 2025 Are a Near Lock, Analysts Say",
      "link": "https://decrypt.co/326353/solana-xrp-dogecoin-etf-approvals-2025-near-lock",
      "summary": "Wall Street analysts say that SEC approvals for ETFs based on altcoins including Dogecoin, XRP, and Solana are nearly a sure thing this year."
    },
    {
      "title": "Nakamoto Holdings Rakes in $51.5 Million for Publicly Traded Bitcoin Treasury",
      "link": "https://decrypt.co/326316/nakamoto-holdings-51-5-million-publicly-traded-bitcoin-treasury",
      "summary": "The Bitcoin holdings company's merger partner KindlyMD closed the $51.5 million fundraise with private investors on Friday."
    },
    {
      "title": "Public Keys: Circle and Coinbase Get GENIUS Bump, Bitcoin Treasuries on Shaky Ground?",
      "link": "https://decrypt.co/326330/public-keys-circle-coinbase-genius-bump-bitcoin-treasuries-shaky-ground",
      "summary": "Circle skyrockets on stablecoin optimism while Bitcoin treasury firms face valuation challenges in this week's public markets roundup."
    },
    {
      "title": "Bitcoin, Dogecoin Targeted as Norway Eyes Ban on New Crypto Mining Operations",
      "link": "https://decrypt.co/326280/bitcoin-dogecoin-targeted-norway-eyes-ban-new-crypto-mining-operations",
      "summary": "The government said it will \"explore the possibility of temporarily prohibiting the establishment of new data centers in Norway that extract cryptocurrency.\""
    },
    {
      "title": "Texas Sheriffs Crack Bitcoin ATM With Power Tools to Retrieve $32,000",
      "link": "https://decrypt.co/326308/texas-sheriffs-crack-bitcoin-atm-with-power-tools-to-retrieve-32000",
      "summary": "Jasper County Sheriff Chuck Havard told that authorities have likely accessed the machines before."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "CoinMarketCap’s front-end compromised, investigation underway",
      "link": "https://cryptobriefing.com/coinmarketcap-security-breach-investigation/",
      "summary": "<p>This incident highlights the urgent need for enhanced cybersecurity measures in the crypto industry to protect user assets and data integrity.</p> <p>"
    },
    {
      "title": "Texas governor signs bill to protect state Bitcoin reserve as a permanent fund if established",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-protection-bill/",
      "summary": "<p>Texas' move to protect a potential Bitcoin reserve could set a precedent for state-level crypto asset management, influencing future fiscal policies.</p> <p>"
    },
    {
      "title": "XRP joins Solana and Litecoin in top ETF approval tier",
      "link": "https://cryptobriefing.com/spot-crypto-etf-approval-tier/",
      "summary": "<p>The increased likelihood of crypto ETF approvals could significantly boost market legitimacy and attract institutional investment.</p> <p>"
    },
    {
      "title": "Why your business should start accepting Bitcoin today",
      "link": "https://cryptobriefing.com/accepting-bitcoin-payments-business/",
      "summary": "<p>Accepting Bitcoin can lower fees, reduce fraud risks, and simplify global payments as more consumers look to pay with crypto in 2024.</p> <p>"
    },
    {
      "title": "Reddit considers using World ID to verify redditors: Semafor",
      "link": "https://cryptobriefing.com/reddit-world-id-verification-anonymity/",
      "summary": "<p>Reddit's potential use of World ID could enhance user trust and compliance with regulations while balancing privacy and authenticity concerns.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum whales sell $321 mln in 60 seconds! Still, a tough battle remains",
      "link": "https://ambcrypto.com/ethereum-whales-sell-321-mln-in-60-seconds-still-a-tough-battle-remains/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-3-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Are bulls regaining control or will bearish momentum push ETH lower?"
    },
    {
      "title": "Bitcoin’s Options expiry to test BTC’s $100K floor – Will bears take control?",
      "link": "https://ambcrypto.com/bitcoins-options-expiry-to-test-btcs-100k-floor-will-bears-take-control/",
      "summary": "<img alt=\"Bitcoin&#039;s Options expiry to test BTC&#039;s $100K floor - Will bears take control?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-13.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin faces a high-volatility week. Here’s what’s at play!"
    },
    {
      "title": "Can holding Bitcoin make you a target? France’s scary new reality",
      "link": "https://ambcrypto.com/can-holding-bitcoin-make-you-a-target-frances-scary-new-reality/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"691\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Wrench-attack-in-France.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1228\" />Here's what happens when Bitcoin becomes too valuable to protect with just a password."
    },
    {
      "title": "Semler Scientific’s Bitcoin vision: 42K BTC buy in 2026, 105K in 2027",
      "link": "https://ambcrypto.com/semler-scientifics-bitcoin-vision-42k-btc-buy-in-2026-105k-in-2027/",
      "summary": "<img alt=\"Semler Scientific&#039;s Bitcoin vision: 42K BTC buy in 2026, 105K in 2027\" class=\"attachment-full size-full wp-post-image\" height=\"713\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Semler-Scientifics-Bitcoin-strategy.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1267\" />What’s behind the sudden crypto pivot by a medical tech company, and who’s pulling the strings?"
    },
    {
      "title": "KAIA surges 70% monthly, but THIS points to a pullback ahead",
      "link": "https://ambcrypto.com/kaia-surges-70-monthly-but-this-points-to-a-pullback-ahead/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250620_161753_0000.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />KAIA sees a major break, but this isn’t the bullish flag."
    }
  ]
}