{
  "CoinDesk": [
    {
      "title": "Weekly Recap: Bitcoin Hits ATH as Dozens of Treasuries Bloom",
      "link": "https://www.coindesk.com/news-analysis/2025/07/11/weekly-recap-bitcoin-hits-ath-as-dozens-of-treasuries-bloom",
      "summary": ""
    },
    {
      "title": "SOL: Nasdaq-Listed Firm Secures $200M in Financing, with Over $150M Tied to Solana Treasury Strategy",
      "link": "https://www.coindesk.com/markets/2025/07/11/sol-nasdaq-listed-firm-secures-usd200m-in-financing-with-over-usd150m-tied-to-solana-treasury-strategy",
      "summary": ""
    },
    {
      "title": "Tether/Circle Stablecoin Supply Growth Signals Strong Liquidity Backing Crypto Rally",
      "link": "https://www.coindesk.com/markets/2025/07/11/tethercircle-stablecoin-supply-growth-signals-strong-liquidity-backing-crypto-rally",
      "summary": ""
    },
    {
      "title": "Robinhood Probed by Florida AG’s Office Over Allegedly ‘Deceptive’ Crypto Pricing Claims",
      "link": "https://www.coindesk.com/policy/2025/07/11/robinhood-probed-by-florida-ag-s-office-over-allegedly-deceptive-crypto-pricing-claims",
      "summary": ""
    },
    {
      "title": "Grayscale Challenges SEC’s Delay of GDLC ETF Launch, Calls Stay Order Unlawful",
      "link": "https://www.coindesk.com/policy/2025/07/11/grayscale-challenges-sec-s-delay-of-gdlc-etf-launch-calls-stay-order-unlawful",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "S&amp;P 500 Index soars to record but drops in Bitcoin terms",
      "link": "https://cointelegraph.com/news/sp500-record-high-bitcoin-etf-inflows-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ZhNGMtNzgxZS03MjE5LThhMjItZjcyMTAxNWU5YmJi.jpg\" /></p><p>The S&amp;P 500 Index has staged a remarkable turnaround since April, but its performance still lags considerably behind BTC.</p>"
    },
    {
      "title": "LetsBonk stuns Solana memecoin launchpad rankings: Finance Redefined",
      "link": "https://cointelegraph.com/news/solana-letsbonk-pumpfun-defi-tradfi-crypto-roundup?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzliYWItMTJlMS03Y2Q1LWE1MGQtOTYyNGI3Y2M0OTNj.jpg\" /></p><p>Solana’s memecoin race gets a shakeup as LetsBonk overtakes Pump.fun in daily revenue, while TradFi and DeFi move closer to convergence.</p>"
    },
    {
      "title": "Bitcoin $120K expectations add fuel to ETH, HYPE, UNI and SEI",
      "link": "https://cointelegraph.com/news/bitcoin-dollar120k-expectations-add-fuel-to-eth-hype-uni-and-sei?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ZhODEtNDk1Mi03NjMwLTg3YzAtNmIwOTVmMjJkMmFk.jpg\" /></p><p>ETH, HYPE, UNI and SEI rallied toward new highs as Bitcoin pushed above $118,000.</p>"
    },
    {
      "title": "Grayscale calls out SEC delay of Digital Large Cap Fund ETF listing",
      "link": "https://cointelegraph.com/news/grayscale-sec-delay-digital-large-cap-fund-etf-listing?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NjkxNDUtZDU1OC03Mzc4LWJkZmUtNGM0MTIyNzRjZjA5.jpg\" /></p><p>Attorneys for Grayscale argued that the US regulator's delay of the approval or disapproval decision clashes with existing statutes.</p>"
    },
    {
      "title": "How to use ChatGPT for crypto strategy, signals, and sentiment",
      "link": "https://cointelegraph.com/news/how-to-use-chatgpt-to-analyze-crypto-market-movements?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM2MTAtY2VhMC03ZjRlLWI5NjAtNGQ4ZDQ2YTU1ODJj.jpg\" /></p><p>Use ChatGPT to summarize market news, interpret on-chain data, compare token metrics, and spot sentiment shifts using structured prompts.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Grayscale pushes back on SEC’s decision to stay ETF conversion",
      "link": "https://cryptoslate.com/grayscale-pushes-back-on-secs-decision-to-stay-etf-conversion/",
      "summary": "<p>Grayscale Asset Management has questioned the US Securities and Exchange Commission (SEC) decision to issue a stay on the application to convert the Digital Large Cap Fund (DLCF) into an exchange-traded fund (ETF). In a July 8 letter, Grayscale&#8217;s legal team argued that the SEC exceeded its authority, as the application had already been approved [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum advances toward censorship-resistant scaling with zkEVM layer-1 shift",
      "link": "https://cryptoslate.com/ethereum-advances-toward-censorship-resistant-scaling-with-zkevm-layer-1-shift/",
      "summary": "<p>Ethereum is advancing its long-term scalability strategy with a substantial technical shift to integrate the zero-knowledge Ethereum Virtual Machine (zkEVM) into the layer-1 blockchain. On July 10, Sophia Gold, an Ethereum Foundation developer, stated that the foundation aims to ship the L1 zkEVM within a year, marking a critical evolution in Ethereum’s pursuit of efficient, [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum futures volume surpasses Bitcoin for first time amid 5 month high",
      "link": "https://cryptoslate.com/ethereum-futures-volume-surpasses-bitcoin-for-first-time-amid-5-month-high/",
      "summary": "<p>Ethereum’s daily futures trading volume exceeded Bitcoin’s for the first time on July 10, a landmark development that coincided with the asset’s price testing the $3,000 level. The technical flip in the derivatives market indicates a potential shift in trader sentiment and capital allocation, lending credence to narratives of a changing market structure. Data from [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation denies selling assets amid ETH’s climb past $3,000",
      "link": "https://cryptoslate.com/ethereum-foundation-denies-selling-assets-amid-eths-climb-past-3000/",
      "summary": "<p>Ethereum has surged past the $3,000 mark for the first time since February, riding on the renewed momentum sweeping across the broader crypto market. According to data, ETH&#8217;s price peaked at $3,033 during the last 24 hours amid a 9% increase. However, its value has slightly retraced to $2,991 as of press time. This [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin ETFs see record $1.2B inflow as market hits all-time high in dollars",
      "link": "https://cryptoslate.com/bitcoin-etfs-see-record-1-2b-inflows-as-market-hits-all-time-high-in-dollars/",
      "summary": "<p>US-based spot Bitcoin ETFs saw a dramatic uptick in investor activity as the top crypto price reached a new all-time high of over $118,000, at least in dollars. According to SoSoValue data, the 12 funds saw cumulative inflows of $1.2 billion, the second strongest daily performance since launch in 2024, and the best this year. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Analyst Sounds The Alarm: Shiba Inu Primed For Over 1,500% Breakout",
      "link": "https://www.newsbtc.com/altcoin/analyst-sounds-the-alarm-shiba-inu-primed-for-over-1500-breakout/",
      "summary": "Shiba Inu (SHIB) might be on the verge of a powerful rally, according to crypto analyst MasterAnanda, who believes the popular meme coin could climb more than 1,500% in this cycle. The analyst predicts SHIB may cancel another zero and reach a new all-time high if a few key levels are cleared. Related Reading: Bitcoin 30-Day Average Funding Rate Drops – Bullish Setup Takes Shape Signs Of A Possible Reversal SHIB has been stuck in a downtrend since March 2024. It peaked at $0.000045 before sliding back to close that month at $0.000030. Since then, the coin has moved within a descending triangle pattern, bouncing around the base while facing strong bearish pressure. However, something may be changing. SHIB has just printed a fully green weekly candle and gained 15% over the past seven days. According to analysts, this is one of the most bullish weekly moves since early May, when the token jumped 25%. Despite the optimism, SHIB remains below its 200-day moving average, which sits at $0.000016. That&#8217;s around 19% higher than its current price of $0.000013. Analysts see this as a critical level the token must beat to confirm a long-term bullish trend. Bullish Price Targets Appear On The Chart MasterAnanda believes SHIB will break above the triangle and make a run toward $0.000032, aligning with the 0.50 Fibonacci retracement level. If that plays out, the analyst sees a further move to $0.000067, then to $0.00010, which would represent a new all-time high. From there, two more possible targets have emerged using Fibonacci extensions: $0.00017 and $0.00022. Those would mark gains of 1,180% and 1,529%, respectively. While ambitious, other analysts have also supported a similar price path based on the same descending triangle breakout. Shiba Inu Sentiment Mixed As Greed Index Climbs Although bullish targets are grabbing headlines, market sentiment is still uncertain. Based on recent data, SHIB recorded green days on just 13 out of the last 30, and showed 4.25% price volatility. The current reading for sentiment is &#8220;Neutral&#8221; and the Fear &#38; Greed Index stands at 69, which is in the &#8220;Greed&#8221; category. Price prediction tools indicate that SHIB could increase 27% to August 10, 2025, at about $0.000017. That will bring it nearer to its MA-200, but still far from the lofty targets being predicted by some analysts. Related Reading: Ethereum Back At Range Highs: Breakout Above $2,800 Could Ignite Altseason SHIB holders are now waiting to see what&#8217;s next. Will the triangle breakout occur in a hurry, or will resistance levels hold the token below major technicals? The coming weeks may provide the answers. Featured image from Meta, chart from TradingView"
    },
    {
      "title": "SUI Explodes Higher, Climbing Above 20-Day MA — But Can The Rally Hold?",
      "link": "https://www.newsbtc.com/sui/sui-explodes-higher-climbing-above-20-day-ma/",
      "summary": "SUI is positioned for further upside, and backed by technical momentum and solid volume support. However, maintaining the price above the key moving averages will be crucial for the continuation of this bullish run. Volume Spikes Confirm Breakout Strength According to Gemxbt&#8217;s post on X, the SUI 1-hour chart is showing a strong uptrend, with the price trading above the 5, 10, and 20-day moving averages, which is a sign of short-term momentum and sustained buyer strength. Related Reading: SUI Prints Classic Reversal Setup With Triple Top Formation The Relative Strength Index (RSI) is approaching overbought territory, which warns of a potential short-term pullback and suggests that traders should be cautious of a temporary pause as the market digests recent gains. Meanwhile, the Moving Average Convergence Divergence (MACD) is bullish with a widening gap between the MACD line and the signal line. This expansion often precedes continuation in trending markets and confirms that momentum is accelerating. Trading volume has increased notably alongside price movement. The rising volume during an uptrend suggests that the move is a genuine market participation. Analyst LORD ATU also stated that SUI is trading at $2.90 on the daily chart, with a solid 9.69% weekly gain, and showing clear signs of bullish momentum. The price action falling wedge pattern is typically a bullish continuation signal with a potential target at $3.20, and if confirmed with volume, a breakout will follow through. However, a bearish head and shoulders formation is also beginning to emerge, which is signaling a potential drop toward the $2.30 support zone, which is a level of prior structure and support. LORD ATU noted that the key levels to watch out for are the support at $2.88, which is a crucial short-term floor that must hold to maintain the uptrend, and resistance at $3.15, where a clear break could trigger momentum higher. The SUI ecosystem growth looks strong, with increasing development activity and solid fundamentals. However, an upcoming token unlock could introduce fresh supply pressure and volatility. Momentum Accelerates After Consolidation Phase Another Analyst, Profit Demon, also mentioned on X that SUI has completed a bullish flag pattern breakout on the 3-day chart, which is signaling a shift in market sentiment after a period of consolidation. This continuation pattern often marks the end of sideways movement and the resumption of an existing uptrend. Related Reading: SUI Prepares For Bullish Flag Breakout Amid $3 Reclaim – Analyst Doubles The Target The upward momentum is building after the consolidation phase, which supports the increased buying interest and favorable market conditions. SUI trading at $3.51 on the daily chart &#124; Source: SUIUSDT on Tradingview.com Featured image from iStock images, chart from tradingview.com"
    },
    {
      "title": "99Bitcoins Q2 Report Unveils What’s Powering the 2025 Crypto Boom",
      "link": "https://www.newsbtc.com/news/99bitcoins-q2-report-unveils-whats-powering-2025-crypto-boom/",
      "summary": "The crypto market has been on a tear in 2025, and the latest 99Bitcoins Q2 State of Crypto Market Report, authored by Manisha Mishra and sponsored by KCEX, lays it all out. The quarter saw institutional demand surge, Bitcoin ($BTC) hit a then-ATH of $111,980, and crypto hiring spike 753%. Despite the rally, the total market cap was still 12% below its $3.7 trillion peak, hinting at room to run. With stablecoin adoption booming and long-term holders stacking, Q2 may have been the real start of this cycle’s breakout. Read the full report here: State of Crypto Q2 2025 – 99Bitcoins A Record-Breaking Quarter for Bitcoin Bitcoin lit up Q2 with a 25.66% gain, smashing past resistance to hit a then-record $111,980 on May 22. That put it well ahead of gold’s 7.21% rise and most equity indices, marking a sharp reversal from Q1’s pullback. According to 99Bitcoins’ Q2 report, the rally was driven by institutional inflows, ETF demand, and growing sovereign interest, with governments now holding 2.5% of Bitcoin’s total supply. Meanwhile, spot ETF flows consistently outpaced miner issuance, tightening supply just as demand surged. Chris Wright of 21Shares summed it up: “We believe that Bitcoin ETFs will attract 50% more inflows this year compared to last year. This would result in net inflows of approximately $55 billion in 2025, representing an increase of around $20 billion year-over-year.” A golden cross in late May confirmed the uptrend, following a clean breakout from months of consolidation. It’s a textbook bullish structure. With price action and fundamentals in sync, Q2 marked the clearest shift yet: Bitcoin is back, but powered by institutions, not retail. Institutions Took the Wheel, Retail Turned to Altcoins According to the 99Bitcoins report, this bull run has a different driver behind the wheel. And it’s not Reddit. 9 out of 10 experts interviewed in the Q2 report said retail traders have shifted their focus to the best altcoins, chasing faster gains while institutions quietly accumulated Bitcoin. The on-chain data backs it up. Glassnode shows that 30% of $BTC’s supply is now held by centralized entities, with large players dominating inflows. Meanwhile, Google Trends reveals that retail interest in “Bitcoin” searches stayed surprisingly low throughout Q2, even as $BTC hit new highs. Confidence among long-term holders also climbed. UTXO activity dropped, and the amount of BTC in long-term storage kept rising. A sign that serious capital isn’t looking to sell anytime soon. Stablecoins and DeFi Picked Up Steam If Q2 proved anything, it’s that stablecoins aren’t just stable, they’re also scaling. The Circle IPO popped 168% on day one, marking the first stablecoin issuer to go public and signaling TradFi’s growing appetite for crypto exposure without the volatility. According to 99Bitcoins, 81% of crypto-aware SMBs now want to use stablecoins for daily ops, and the number of Fortune 500s planning to integrate them has tripled since last year. On the DeFi side, Ethereum ($ETH) held L1 dominance, Chainlink ($LINK) led dev activity, and $HYPE – the native token of Hyperliquid – saw serious traction, fueled by the DEX’s rise to 70%+ of all perp DEX volume. While others chased memes, HYPE rallied on actual utility. In short: DeFi’s still cooking, and stablecoins are fueling the fire. Memecoin Mayhem After tanking in Q1, the memecoin market bounced back slightly in Q2, though volatility stayed extreme and price action remained erratic. Q2 saw the meme coins hit new heights, with over 5.9 million new tokens launched and most of them churned out via pump.fun. It was chaotic, noisy, and pure degen energy. While most faded instantly, tokens like $FARTCOIN and $SPX kept riding the wave. That said, the surge in token activity came with a dark side: phishing and wallet-targeted hacks climbed, especially among memecoin holders. Regulatory Wins and Macro Shifts Driving Confidence If Q2 had a theme, it was relief on both the policy and economic fronts. The U.S. pulled back on crypto enforcement, scrapped IRS reporting rules for DeFi, and signaled a more constructive stance overall. Meanwhile, the Fed held rates steady for the fourth straight time, hinting at a possible cut in July. With unemployment flat and growth slowing, capital started flowing into safe-haven assets, and this time, Bitcoin was firmly on that list. The result? Confidence surged. Bitcoin ETF inflows accelerated, volatility dropped, and $BTC’s macro narrative strengthened. It’s no longer just a risk asset; it’s becoming part of the defensive playbook. Elsewhere, $XRP finally closed its long-running legal battle with the SEC, potentially clearing the runway for a new ATH later this year. What’s Next for Q3? Back in Q2, 99Bitcoins forecasted that if BTC could flip $111K–$112K resistance, the path to $120K would open, with $135K as a stretch target. Fast forward to now, and that prediction is aging well: Bitcoin is already trading at above $118K, edging toward that psychological milestone. The report also noted $BTC was holding firm above $103K support, forming a bullish structure backed by rising miner wallet balances, shrinking exchange reserves, and growing illiquid supply – all signs of confidence from long-term holders. Still, Q3 isn’t without risk. ETF inflows could slow, and macro headwinds, from global conflict to sudden rate hikes, remain on the radar. But if institutional flows stay hot and the Fed delivers a rate cut, $135K no longer feels like a moonshot. It’s just part of the next leg up. Final Thoughts: A Bull Market With Depth The 99Bitcoins Q2 report by Manisha Mishra paints a clear picture: this bull market isn’t built on retail hype. Institutions, regulatory tailwinds, and real product traction are powering it. From ETF inflows to stablecoin adoption and supply-side tightening, the signals all point toward a more mature, resilient crypto cycle. And with Bitcoin already pushing towards $120K, many of the Q2 projections are already playing out. If momentum holds, and macro conditions don’t throw a curveball, Q4 could be the real breakout. Read the full report here: State of Crypto Q2 2025 – 99Bitcoins This article is for informational purposes only and does not constitute financial advice. Please always do your own research (DYOR) before investing in crypto."
    },
    {
      "title": "Bitcoin Dominance Falls: 9 Factors To Watch For That Says The Altcoin Season Has Begun",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-dominance-falls/",
      "summary": "Bitcoin’s price is holding firm despite growing chatter about the end of its market dominance. However, analysts are turning their attention not to Bitcoin’s price but to its waning market share as signs that altcoins may finally be ready to take center stage in what could become a full-blown altcoin season. A post on X has highlighted a specific breakdown structure in BTC dominance, which is linked to nine factors indicating that the altcoin season has begun. Technical Factors Showing Fall Of Bitcoin Dominance According to the analyst, Bitcoin dominance reached a peak of exactly 66% on June 27, 2025, a date he calls significant for its esoteric code 434 and its occurrence on a new moon. From a technical perspective, the 66% mark coincided precisely with the 0.786 Fibonacci retracement level, a region many traders consider a reversal zone. More importantly, several warning signals are flashing for Bitcoin traders. Related Reading: Altcoin Season Not Remotely Close, Bitcoin Dominance Still Too High: Market Expert Says The analyst&#8217;s post on the social media platform X features a few price charts to emphasize how the Bitcoin dominance might be fading, alongside nine factors. From a purely technical lens, the dominance chart looks increasingly exhausted. The first factor is the most recent highest monthly RSI in the history of the Bitcoin dominance chart. This event has created an overbought condition, and the next outlook is a possible crash of the RSI. The MACD, in fact, has already crossed into bearish territory. Furthermore, the histogram has turned negative, and the faster line has moved below the slower one, which is a classic signal of an impending downtrend. Another interesting factor is that Bitcoin dominance has now broken a key diagonal support line that held firm through much of 2024 and 2025, which is another possible structural breakdown. Fundamental Factors Show Strong Rotation Into Altcoin Pairs While the technical picture is deteriorating, the fundamentals are also stacking in favor of altcoins very quickly. The first fundamental factor is the importance of upcoming altcoin spot ETFs, which have the possibility to redirect institutional flows from Bitcoin into Ethereum, XRP, and others. Related Reading: Time To Forget Altcoin Season? Bitcoin Dominance At This Level Is This Only Hope ETFs such as the Spot XRP, Dogecoin, and Solana ETFs could rapidly increase inflows into the rest of the crypto market, similar to how Spot Bitcoin ETFs caused massive inflows into Bitcoin. The analyst also highlighted the likelihood of upcoming U.S. Federal Reserve rate cuts, which would tilt market conditions in favor of altcoins over Bitcoin. Momentum has also begun to shift in some trading pairs, particularly XRP/BTC and ETH/BTC, both of which are showing reversal signs from critical levels. The XRP/BTC chart displays repeated failed attempts to break above 0.0000215 BTC, a horizontal resistance that has now been tested five times on the daily candlestick timeframe chart. At the time of writing, the XRP/BTC pair has returned to this level yet again, and based on this pattern, any clean breakout here could confirm a decisive rotation into XRP. Likewise, Ethereum has begun to recover from long-term oversold conditions when measured against Bitcoin. The rounded bottom pattern forming on the ETH/BTC weekly chart shows a reversal from undervaluation, which in past cycles has caused substantial gains for Ethereum relative to BTC. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "The Last Time This Happened Cardano Rose 55%, ADA Analyst Makes Bold Prediction",
      "link": "https://www.newsbtc.com/news/cardano/the-last-time-this-happened-cardano-rose-55-ada-analyst-makes-bold-prediction/",
      "summary": "Cardano has been one of the best performing assets on low timeframes. The top cryptocurrency is hinting at further profits, as the Bitcoin price crosses a new all time high and the much awaited altcoin season approaches. Related Reading: Bitcoin Moving With Stocks, But Ethereum’s Correlation Is Fading At the time of writing, Cardano trades at $0.74 with a 18% profit over the past 24 hours. On higher timeframes, the cryptocurrency records a 28% profit followed by XRP’s 20% gains over the same period. ADA's price trends to the upside on the daily chart. Source: ADAUSD on Tradingview Analyst Says Cardano Will Replicate a Historical Bull Run Unlike Ethereum and XRP, the Cardano price has been more consistent with its past performance. In that sense, analyst Ali Martinez pointed to the formation of a bullish pattern for ADA that could propel the digital asset above the critical level around $1. The analyst claims that the $0.55 support for Cardano has been a key support on high timeframes. The last time the cryptocurrency dropped to this level in April this year, as seen on the chart below, ADA was able to rise to over 55% and touched the $0.85 mark. ‘It’s happening again’ said Martinez while pointing at the bullish momentum driving Cardano since it touched the bottom of this parallel channel. If the cryptocurrency can sustain this drive, it is likely to touch its May highs before meeting critical resistance. ADA price trends to the upside after touching a critical support level, aiming for $0.82. Source: Ali Martinez via X ADA Could Trend Even Higher, Bullish Price Targets A separate analyst also took note of the Cardano price action and the way it seems to be mirroring past patterns. The analyst claims that Cardano is entering a critical breakout zone. However, unlike Martinez, the analyst is more bullish and believes the ADA price might rally as much as 212% over the coming weeks. The analyst placed a bullish price target for the Cardano price at around $1.7. Related Reading: Bitcoin 30-Day Average Funding Rate Drops – Bullish Setup Takes Shape The analyst stated the following while sharing the chart below: $ADA is now testing the 50-week EMA. The last 2 times it crossed this line, it went up 212% and 128%. If history repeats, we will be looking at $1.77 $ADA. Are you ready for the pump? Cardano price to enter the $1 area over the next few weeks. Source: MinswapIntern via X In the long term, the analyst expects to see ADA hit $5 driven by its recent announcements, including a partnership with Tx Pipe to accelerate developer growth in Argentina that is set to benefit the Cardano ecosystem. On this partnership, Charles Hoskinson, CEO of IO, said: Their team represents the best of what Argentina’s developer community has to offer, and together we are building a foundation for long-term ecosystem growth. Our collaboration also fulfills the broader vision of making IO Buenos Aires a crypto hub. Cover image from ChatGPT, ADAUSD chart from Tradingview"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "How CoinJoin Anonymity Can Be Undermined Using Clustering",
      "link": "https://bitcoinmagazine.com/bigread/how-coinjoins-achieve-anonymity",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/BM-Big-Read-07-12-25.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bigread/how-coinjoins-achieve-anonymity\" rel=\"nofollow\"> </a></p> <p>BM Big Read: CoinJoins, Bitcoin's most established anonymity feature, leaks more information than people think.</p> <p>"
    },
    {
      "title": "Bitcoin Hits New All Time High as IBIT Breaks ETF Records",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-as-ibit-breaks-etf-records",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-as-IBIT-Breaks-ETF-Records.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-as-ibit-breaks-etf-records\" rel=\"nofollow\"> </a></p> <p>IBIT sits at $83 billion and holds over 706,000 BTC, making it the 21st largest ETF in the US market.</p> <p>"
    },
    {
      "title": "Bitcoin Hits New All Time High of $113,900 as Adoption Accelerates",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-of-113000-as-Adoption-Accelerates.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates\" rel=\"nofollow\"> </a></p> <p>Bitcoin’s surge to $113,900 signals rising adoption, and Fed rate cut expectations.</p> <p>"
    },
    {
      "title": "Rumble Partners with MoonPay to Launch Bitcoin Wallet for Creators",
      "link": "https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Rumble-Partners-with-MoonPay-to-Launch-Bitcoin-Wallet-for-Creators-Today.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators\" rel=\"nofollow\"> </a></p> <p>Today, Rumble announced an exclusive partnership with MoonPay to launch a Bitcoin and crypto wallet that will let creators handle their earnings outside traditional banking systems.&#160; The new Rumble Wallet, set to arrive in Q3 2025, will use MoonPay&#8217;s infrastructure to power all digital currency transactions on the platform. Users will be able to buy, [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Technology Increases Bitcoin Holdings to $101 Million",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million\" rel=\"nofollow\"> </a></p> <p>KULR now holds 1,021 BTC, reporting a 291% BTC yield year to date.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "GMX Hacker Goes White-Hat, Returns $40 Million—Sends Rest to Tornado Cash",
      "link": "https://decrypt.co/329821/gmx-hacker-white-hat-returns-40-million-sends-rest-tornado-cash",
      "summary": "After returning funds to GMX, it appeared a would-be hacker sent $5 million in Ethereum to the coin mixer."
    },
    {
      "title": "SEC's Halt of ETF Holding XRP and Solana Has Investors 'Suffering Harm', Grayscale Says",
      "link": "https://decrypt.co/329819/secs-halt-etf-xrp-solana-investors-suffering-harm-grayscale",
      "summary": "Grayscale said in a letter on Tuesday that it may take legal action if the SEC continues to hold up the debut of its multi-token fund on NYSE Arca."
    },
    {
      "title": "XRP Price Spike Outpaces Bitcoin as Open Interest Nears 6-Month High",
      "link": "https://decrypt.co/329814/xrp-price-spike-outpaces-bitcoin-open-interest-6-month-high",
      "summary": "Bitcoin keeps pushing to new highs, but the Ripple-linked XRP has actually surged more over the past day while open interest soars."
    },
    {
      "title": "SharpLink Shares Rise After Firm Buys $30 Million in ETH From Ethereum Foundation",
      "link": "https://decrypt.co/329744/sharplink-rises-treasury-buys-30-million-eth-ethereum-foundation",
      "summary": "The Ethereum treasury company is only second to the Ethereum Foundation in the size of its holdings."
    },
    {
      "title": "Dogecoin Barks Up Huge Gains as Meme Coin Traders Await Pump.fun Token Sale",
      "link": "https://decrypt.co/329754/dogecoin-barks-meme-coin-traders-await-pump-fun-sale",
      "summary": "Meme coins, led by Dogecoin, are jumping higher Friday as Bitcoin hits new highs—and the Pump.fun Solana token sale is only hours away."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Tether to end USDT support for Omni, Bitcoin Cash SLP, Kusama, EOS, and Algorand in September",
      "link": "https://cryptobriefing.com/tether-blockchain-support-changes/",
      "summary": "<p>Tether's shift to focus on scalable, high-utility networks may drive innovation and efficiency, impacting blockchain adoption and ecosystem growth.</p> <p>"
    },
    {
      "title": "PENGU token pumps after Coinbase updates X profile with Pudgy Penguins’ NFT",
      "link": "https://cryptobriefing.com/coinbase-profile-pengu-nft/",
      "summary": "<p>Coinbase's strategic social media engagement could enhance crypto market dynamics, influencing token valuations and investor sentiment.</p> <p>"
    },
    {
      "title": "Grayscale challenges SEC stay on approval of BTC, ETH, XRP, ADA large-cap fund",
      "link": "https://cryptobriefing.com/sec-grayscale-approval-large-cap-fund/",
      "summary": "<p>Grayscale's challenge to the SEC's stay highlights ongoing regulatory tensions, potentially impacting future crypto fund approvals and market dynamics.</p> <p>"
    },
    {
      "title": "Bitcoin creator Satoshi Nakamoto may now be richer than Dell CEO Michael Dell",
      "link": "https://cryptobriefing.com/satoshi-nakamoto-wealth-bitcoin/",
      "summary": "<p>Satoshi Nakamoto's rising wealth underscores Bitcoin's potential to disrupt traditional wealth hierarchies and influence global financial systems.</p> <p>"
    },
    {
      "title": "REX Shares files for 2X leveraged TRON ETF",
      "link": "https://cryptobriefing.com/2x-tron-etf-launch/",
      "summary": "<p>The filing highlights the increasing diversification in crypto investment products, potentially broadening market participation and innovation.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Arbitrum [ARB] defies stablecoin outflow, price surges 16% – Is $0.50 next?",
      "link": "https://ambcrypto.com/arbitrum-arb-defies-stablecoin-outflow-price-surges-16-is-0-50-next/",
      "summary": "<img alt=\"INJ\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250711_123344_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is ARB on the verge of a major rally? What do the charts suggest."
    },
    {
      "title": "PEPE jumps 30% in 48 hours – Traders, more gains ahead IF…",
      "link": "https://ambcrypto.com/pepe-jumps-30-in-48-hours-traders-more-gains-ahead-if/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-11T152107.790.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A crypto whale bought 228 billion PEPE worth $2.68 million."
    },
    {
      "title": "Bitcoin – How $1.18B in ETF inflows could push BTC’s price higher",
      "link": "https://ambcrypto.com/bitcoin-how-1-18b-in-etf-inflows-could-push-btcs-price-higher/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Benjamin-2025-07-11T135431.102.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Selling pressure from miners increased slightly as BTC hit a new ATH."
    },
    {
      "title": "Hyperliquid breaks ATH at $46.32 – Can HYPE sustain its run?",
      "link": "https://ambcrypto.com/hyperliquid-breaks-ath-at-46-32-can-hype-sustain-its-run/",
      "summary": "<img alt=\"HYPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-3.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Hyperliquid whales and Assistance Fund continue accumulation despite price trading at the peak."
    },
    {
      "title": "Top 12 Telegram games of July 2025",
      "link": "https://ambcrypto.com/top-12-telegram-games-of-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/andrey-metelev-DEuansgqjns-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Telegram has become much more than just a messaging platform, and its importance in the [&#8230;]"
    }
  ]
}