{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: BTC Slips Below $110K as 'Signs of Fatigue' Emerging",
      "link": "https://www.coindesk.com/markets/2025/06/09/asia-morning-briefing-btc-slips-below-110k-as-signs-of-fatigue-emerging",
      "summary": ""
    },
    {
      "title": "Bitcoin Climbs Above $110K, 'At Crossroads' for Next Major Move",
      "link": "https://www.coindesk.com/markets/2025/06/09/bitcoin-climbs-above-110k-at-crossroads-for-next-major-move",
      "summary": ""
    },
    {
      "title": "Aptos' APT Gains 4% on Significant Volume, Has More Potential Upside",
      "link": "https://www.coindesk.com/markets/2025/06/09/aptos-apt-gains-4-on-significant-volume-has-more-potential-upside",
      "summary": ""
    },
    {
      "title": "Trump Media and Semler Scientific Could Be Cheapest Bitcoin Treasury Companies by This Metric",
      "link": "https://www.coindesk.com/markets/2025/06/09/trump-media-and-semler-scientific-could-be-cheapest-bitcoin-treasury-companies-by-this-metric",
      "summary": ""
    },
    {
      "title": "U.S. SEC Chair Says Working on 'Innovation Exemption' for DeFi Platforms",
      "link": "https://www.coindesk.com/policy/2025/06/09/u-s-sec-chair-says-working-on-innovation-exemption-for-defi-platforms",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin, US crypto stocks rise as more firms plan BTC buys",
      "link": "https://cointelegraph.com/news/crypto-stocks-bitcoin-gain-companies-buy-btc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU2ZjYtNGU5ZS03ZDA0LWI5NmEtYTM2NjE0ZjlmODc3.jpg\" /></p><p>Crypto-tied US companies gained alongside Bitcoin on Monday, as public firms continued to scoop up the cryptocurrency.</p>"
    },
    {
      "title": "BlackRock’s Bitcoin fund blows past $70B in record pace for ETFs",
      "link": "https://cointelegraph.com/news/blackrock-bitcoin-etf-fastest-70-billion-assets-under-management?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU2ZjEtOGZmOC03NTc3LWI1NWItZjExNGQzMmY1M2Ji.jpg\" /></p><p>BlackRock’s Bitcoin ETF milestone came shortly after the fund wrapped up a massive 31-day inflow streak.</p>"
    },
    {
      "title": "Staked Ethereum hits all-time high as ETH tops $2.7K",
      "link": "https://cointelegraph.com/news/staked-ethereum-hits-record-eth-tops-2700?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU3N2EtNDc3MS03YTcyLWEyYTQtMGFjYTllNTdjY2Nj.jpg\" /></p><p>The amount of Ethereum now staked is almost 30% of the current circulating supply, reaching a new record this week.</p>"
    },
    {
      "title": "SEC eyes exemption framework to boost crypto innovation",
      "link": "https://cointelegraph.com/news/sec-mulls-crypto-exemption-onchain-innovation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGQ3ZDYtYjJhZi03YjA0LWJjODMtMjc3ODg1Y2MzYzk3.jpg\" /></p><p>Securities and Exchange Commission chair Paul Atkins also bashed the previous administration under former SEC Chair Gary Gensler and its approach to crypto.</p>"
    },
    {
      "title": "UK appoints specialist to recover crypto from bankruptcy cases",
      "link": "https://cointelegraph.com/news/uk-appoints-crypto-specialist-recover-funds-bankruptcies?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzYzNDctNTY0MC03MTJjLThlZDItNzkwNGU0NzhlZmJk.jpg\" /></p><p>The UK Insolvency Service has hired a former police investigator to help creditors recover cryptocurrency from failed companies and criminal cases.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "RLUSD surpasses $300M supply as Ripple secures UAE backing",
      "link": "https://cryptoslate.com/rlusd-surpasses-300m-supply-as-ripple-secures-uae-backing/",
      "summary": "<p>Ripple’s stablecoin RLUSD expanded its circulating supply by 29% in the week ended June 8, adding $72.5 million and closing at $320.6 million. The movement marks the first time the token’s float crossed the $300 million threshold. Additionally, it represents a sixfold increase since the launch of RLUSD on Dec. 17, 2024. Data from Artemis [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin climbs back to $110k amid sustained corporate, institutional interest",
      "link": "https://cryptoslate.com/bitcoin-climbs-back-to-110k-amid-sustained-corporate-institutional-interest/",
      "summary": "<p>Bitcoin (BTC) rebounded above $110,000 on June 9, regaining ground lost in last week’s selloff as investors rotated back into digital assets on the back of strong ETF inflows, easing macroeconomic tensions, and renewed optimism across risk markets. The world’s largest crypto reached an intraday high of $110,653 from a daily low of $105,426 earlier [&#8230;]</p> <p>"
    },
    {
      "title": "ProShares, Bitwise race to launch CRCL ETFs, targeting August debut amid stock price surge",
      "link": "https://cryptoslate.com/proshares-bitwise-race-to-launch-crcl-etfs-targeting-august-debut-amid-stock-price-surge/",
      "summary": "<p>ProShares Trust and Bitwise each filed preliminary prospectuses with the Securities and Exchange Commission (SEC) on June 6 for exchange-traded funds (ETF) designed to track Circle’s CRCL shares. The ProShares Ultra CRCL ETF is a 2x leveraged product that seeks to deliver twice the daily move in CRCL by utilizing swaps and other derivatives, as [&#8230;]</p> <p>"
    },
    {
      "title": "BiT Global drops Coinbase lawsuit over wrapped Bitcoin delisting",
      "link": "https://cryptoslate.com/bit-global-drops-coinbase-lawsuit-over-wrapped-bitcoin-delisting/",
      "summary": "<p>BiT Global, a crypto custody firm tied to entrepreneur Justin Sun, has voluntarily dismissed its lawsuit against Coinbase over the delisting of Wrapped Bitcoin (WBTC). The move ends a months-long legal dispute that spotlighted growing tensions between centralized exchanges and token custodians as control over key infrastructure becomes increasingly contested. Filed on June 6 in [&#8230;]</p> <p>"
    },
    {
      "title": "BlackRock’s IBIT rockets to $70B in 341 days, 5x faster than previous record",
      "link": "https://cryptoslate.com/blackrocks-ibit-rockets-to-70b-in-341-days-5x-faster-than-previous-record/",
      "summary": "<p>BlackRock&#8217;s iShares Bitcoin Trust (IBIT) exchange-traded fund (ETF) crossed $70 billion in assets under management (AUM) on June 6, being the fastest to reach this mark in just 341 trading days. Bloomberg ETF analyst Eric Balchunas reported the milestone on X, noting that the fund beat the previous speed record of 1,691 days set by [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "On-Chain Data Flashes Bullish: Is Bitcoin Ready for a $110K Comeback?",
      "link": "https://www.newsbtc.com/bitcoin-news/on-chain-data-flashes-bullish-is-bitcoin-ready-for-a-110k-comeback/",
      "summary": "Bitcoin has resumed its upward trajectory, registering a modest 1.6% gain over the last 24 hours to trade at $107,428. The recovery comes after last week’s dip toward $100,000 levels, which had been triggered by market-wide volatility and profit-taking. While BTC remains approximately 4.2% below its all-time high of $111,000 reached last month, the weekly trend still reflects a 3.3% increase, suggesting buyers are gradually regaining confidence. This market behavior is mirrored in a set of on-chain indicators recently analyzed by CryptoQuant contributor Amr Taha. Related Reading: Bitcoin And Ethereum Defend Key Moving Averages – Bullish Signal Or Temporary Relief? Bitcoin On-Chain Metrics Reflect Accumulation Behavior In Taha&#8217;s analysis titled “On-Chain Data Hints at Bitcoin’s Next Leg Higher,” Taha examined several metrics that point to a potential continuation of the rally. These include the Binance Taker Buy/Sell Ratio, UTXO age bands, and the Long-Term Holder (LTH) realized cap. All three suggest that market participants are actively accumulating and that underlying sentiment is shifting toward renewed bullishness. One of the primary indicators Taha focused on is Binance’s Taker Buy/Sell Ratio, which has recently climbed to 1.1. This metric evaluates the volume of aggressive market buys versus market sells on the Binance exchange. A ratio above 1 typically implies that more participants are willing to pay the market price to buy than to sell, indicating stronger buyer conviction. According to Taha, such shifts historically precede continued price increases when supported by volume. Another key metric showing strength is the Buy/Sell Pressure Delta over the last 90 days. This indicator tracks the net difference between buying and selling pressure and is now halfway to its historical peak at 0.02. Taha explains that this suggests a market not yet overheated, with room for further accumulation. Combined with recent breakout behavior above the 1D–1W UTXO band, representing recently transacted coins, this hints that many new holders are currently in profit and choosing to hold rather than sell. LTH Conviction and Stablecoin Inflows Reinforce Bullish Case Taha also noted the Long-Term Holder (LTH) Realized Cap has now surpassed $56 billion, reflecting strong hands holding a larger share of Bitcoin supply. These coins have not moved in over 155 days and are considered to represent investors with higher conviction. The increase in this metric implies that fewer coins are being sold into the market, a signal that many investors are expecting higher valuations in the coming weeks or months. Related Reading: Bitcoin Leveraged Traders Are Back Betting On A Price Decline — What This Means In addition, more than $550 million in stablecoins have reportedly flowed into Binance in recent hours. Historically, such inflows to spot exchanges, as opposed to derivatives platforms, often suggest readiness to deploy capital for direct asset purchases. Notably, all of these indicators can be seen as a leading signal of potential volatility or buying pressure. If this pattern holds, Bitcoin’s short-term price activity may benefit from continued accumulation and institutional positioning. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "XRP Price Regains Traction, Can The Bulls Pump It This Time?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-regains-traction-2-25/",
      "summary": "XRP price started a fresh increase above the $2.25 zone. The price is now consolidating and might aim for an upward move above the $2.320 resistance. XRP price started a decent upward move above the $2.220 zone. The price is now trading above $2.250 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.270 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start another increase if it clears the $2.320 resistance zone. XRP Price Aims Fresh Increase XRP price formed a base and started a fresh increase from the $2.050 zone, like Bitcoin and Ethereum. There was a move above the $2.120 and $2.20 resistance levels. The bulls even pushed the price above the $2.25 level. Finally, the price tested the $2.320 resistance. A high was formed at $2.3294 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2.2250 swing low to the $2.3294 high. The price is now trading above $2.220 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $2.270 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.320 level. The first major resistance is near the $2.350 level. The next resistance is $2.40. A clear move above the $2.40 resistance might send the price toward the $2.420 resistance. Any more gains might send the price toward the $2.480 resistance or even $2.50 in the near term. The next major hurdle for the bulls might be $2.550. Are Dips Supported? If XRP fails to clear the $2.320 resistance zone, it could start another decline. Initial support on the downside is near the $2.2750 level. The next major support is near the $2.250 level and the 76.4% Fib retracement level of the upward move from the $2.2250 swing low to the $2.3294 high. If there is a downside break and a close below the $2.250 level, the price might continue to decline toward the $2.220 support. The next major support sits near the $2.20 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.2750 and $2.250. Major Resistance Levels – $2.320 and $2.350."
    },
    {
      "title": "Ethereum Price Pops Above $2,700: Are Bulls Back in Control?",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-pops-above-2700-2/",
      "summary": "Ethereum price started a fresh increase above the $2,550 zone. ETH is now consolidating and eyes more gains above the $2,740 resistance. Ethereum started a fresh increase above the $2,700 level. The price is trading above $2,600 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,540 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh surge if it clears the $2,740 zone in the near term. Ethereum Price Regains Pace Ethereum price started a fresh increase after it found support near the $2,400 level, like Bitcoin. ETH price was able to clear the $2,500 and $2,550 resistance levels. The bulls pushed the price above $2,650. ETH even spiked above $2,700. A high was formed at $2,731 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2,482 swing low to the $2,731 high. Ethereum price is now trading above $2,600 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $2,540 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,720 level. The next key resistance is near the $2,740 level. The first major resistance is near the $2,750 level. A clear move above the $2,750 resistance might send the price toward the $2,840 resistance. An upside break above the $2,840 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,880 resistance zone or even $2,920 in the near term. Are Dips Supported In ETH? If Ethereum fails to clear the $2,740 resistance, it could start a fresh decline. Initial support on the downside is near the $2,640 level. The first major support sits near the $2,580 zone and the 61.8% Fib retracement level of the upward move from the $2,482 swing low to the $2,731 high. A clear move below the $2,580 support might push the price toward the $2,540 support. Any more losses might send the price toward the $2,450 support level in the near term. The next key support sits at $2,350. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,640 Major Resistance Level – $2,740"
    },
    {
      "title": "Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC",
      "link": "https://www.newsbtc.com/news/bitcoin/relentless-bitcoin-accumulation-strategy-snaps-up-1045-more-btc/",
      "summary": "According to recent filings, MicroStrategy (rebranded to Strategy) added 1,045 Bitcoin to its holdings this week. The move pushed the firm’s average purchase price to $70,086, after buying at levels above $100,000 in recent weeks. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says So far, the Michael Saylor-led company has spent more than $40 billion on Bitcoin and is lining up more financing to keep the buys coming. Weekly Bitcoin Purchases Continue Strategy’s drip-feed gameplan has become routine. The firm bought just under 2,000 BTC over the last two weeks, but split those into smaller chunks. That steady rhythm helps avoid big bumps in the market. It also keeps the firm in the headlines on a weekly basis. Traders watch closely. When the company buys, prices tend to move up. Strategy has acquired 1,045 BTC for ~$110.2 million at ~$105,426 per bitcoin and has achieved BTC Yield of 17.1% YTD 2025. As of 6/8/2025, we hodl 582,000 $BTC acquired for ~$40.79 billion at ~$70,086 per bitcoin. $MSTR $STRK $STRF $STRDhttps://t.co/blyWfRskjE — Strategy (@Strategy) June 9, 2025 Rather than issue new MSTR shares, Strategy tapped its STRK and STRF stocks. The latest filings show $62.7 million in STRK and $43.3 million in STRF went into Bitcoin purchases. No new common shares were registered this round. That keeps Strategy at about 0.02 BTC per MSTR share—10 times more Bitcoin per share than any other name in the sector. Strategy's latest Bitcoin purchase filing with the SEC. Impact On Market Supply Corporate treasuries now hold roughly 3.4 million BTC. That stash includes what miners and governments no longer sell. It leaves less coin on the open market. Over-the-counter desks have seen their inventories drop from 236,000 BTC a month ago to just 123,500 BTC today. Even Coinbase Prime, one of the main outlets for big players, shows only 63,535 BTC available. Corporate Trends And Outlook Strategy’s moves still cast a long shadow. Only 26 other public companies have more than 1,000 BTC, and just seven hold over 10,000 BTC. On-chain data points to nearly 2,000 whale wallets that top those numbers. In the past week alone, five additional firms bought BTC, using their purchases to grab attention on social media. In all, 124 public companies have now listed Bitcoin on their balance sheets or signaled plans to buy. Related Reading: Ignore The Trump–Musk Noise: Bitcoin’s Backbone Stays Solid What It Means For Investors Based on reports, small-scale buys can spur fresh demand without the risk of giant, sudden orders. But average prices above $70,000 come with their own risk. If Bitcoin dips, paper losses mount fast. High interest rates add further pressure. Still, Strategy’s approach fuels a sense of scarcity. Every weekly buy reminds markets that big holders are in no rush to sell. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Rises Again—Are Bulls Charging Toward a New All-Time High?",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-rises-110k/",
      "summary": "Bitcoin price started a fresh increase above the $106,000 zone. BTC is now consolidating and might attempt to clear the $110,500 resistance. Bitcoin started a fresh upward move above the $107,000 zone. The price is trading above $107,000 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $106,850 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh decline if it breaks the $105,000 support zone. Bitcoin Price Gains Pace Bitcoin price started a fresh increase after it settled above the $103,500 support zone. BTC was able to surpass the $104,400 and $105,000 resistance levels. The bulls even pumped the price above the $108,000 resistance. A high was formed at $110,550 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $100,400 swing low to the $110,550 high. Bitcoin is now trading above $108,000 and the 100 hourly Simple moving average. There is also a bullish trend line forming with support at $106,850 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $110,000 level. The first key resistance is near the $110,500 level. The next key resistance could be $112,500. A close above the $112,500 resistance might send the price further higher. In the stated case, the price could rise and test the $113,800 resistance level. Any more gains might send the price toward the $115,000 level. Another Decline In BTC? If Bitcoin fails to rise above the $110,500 resistance zone, it could start another decline. Immediate support is near the $108,200 level. The first major support is near the $106,500 level and the trend line. The next support is now near the $105,500 zone and the 50% Fib retracement level of the upward move from the $100,400 swing low to the $110,550 high. Any more losses might send the price toward the $103,500 support in the near term. The main support sits at $102,000, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $108,000, followed by $106,500. Major Resistance Levels – $110,500 and $112,500."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Robert Mitchnick Discusses BlackRock’s Bitcoin ETF IBIT Success On Bloomberg",
      "link": "https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Robert-Mitchnick-Discusses-BlackRocks-Bitcoin-ETF-IBIT-Success-On-Bloomberg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg\" rel=\"nofollow\"> </a></p> <p>BlackRock’s Head of Digital Assets, Robert Mitchnick, explains the key factors driving the surge in Bitcoin ETFs.</p> <p>"
    },
    {
      "title": "KULR Technology Group Announces $300 Million ATM Offering To Invest in Their Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>KULR entered a $300 million ATM offering to fund its Bitcoin treasury reserve, with Cantor Fitzgerald &#038; Co. and Craig-Hallum Capital Group LLC.</p> <p>"
    },
    {
      "title": "BlackRock’s iShares Bitcoin Trust Shatters ETF Growth Record, Surpassing $70 Billion in Just 341 Days",
      "link": "https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BlackRock.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days\" rel=\"nofollow\"> </a></p> <p>BlackRock’s iShares Bitcoin Trust (IBIT) has officially made history. The Bitcoin ETF surged past $70 billion in assets under management (AUM), reaching the milestone in just 341 trading days. This achievement makes IBIT the fastest ETF to ever hit that threshold.&#160; To put that into perspective, the previous record-holder—SPDR Gold Shares (GLD)—took 1,691 days to [&#8230;]</p> <p>"
    },
    {
      "title": "New York City Won’t Be Issuing BitBonds Anytime Soon",
      "link": "https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/New-York-City-Mayor-Eric-Adams-Bitcoin-BitBonds.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon\" rel=\"nofollow\"> </a></p> <p>At Bitcoin 2025, NYC mayor, Eric Adams, proclaimed that he’s going to push to issue a BitBond, but judging by his past inaction on Bitcoin as well as a statement from NYC’s comptroller, odds are New Yorkers won’t see a BitBond in the near future.</p> <p>"
    },
    {
      "title": "Japan’s ANAP Holdings Launches Full Bitcoin Business Strategy with Goal of Over 1,000 BTC by August 2025",
      "link": "https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ANAP.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025\" rel=\"nofollow\"> </a></p> <p>ANAP Holdings, Inc. (3189: Tokyo Standard Market) has officially announced the launch of its “Bitcoin Business” in a formal corporate filing, detailing an entry into Bitcoin focused operations across treasury, finance, fashion, and mining. In a statement signed by President and CEO Yuta Sawaki, the company confirmed that its consolidated subsidiary ANAP Lightning Channel will [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Self-Driving Waymo Cars Torched During ICE Protest in Los Angeles",
      "link": "https://decrypt.co/324336/robotic-waymo-cars-torched-ice-protest-los-angeles",
      "summary": "Several Waymo self-driving taxis were destroyed amid growing tensions over ICE activity in Los Angeles."
    },
    {
      "title": "Apple Tones Down AI Hype While Showcasing Next iPhone, Mac Features",
      "link": "https://decrypt.co/324330/apple-tones-down-ai-hype-wwdc-2025",
      "summary": "At WWDC 2025, Apple introduced AI-powered updates and UX design overhaul—but the AI hype was taken down a notch."
    },
    {
      "title": "Bitcoin Soars Above $110K, Nearing Record as Ethereum and Dogecoin Rise",
      "link": "https://decrypt.co/324317/bitcoin-soars-above-110k-ethereum-dogecoin",
      "summary": "Bitcoin's price jumped past $110,000 for the first time in about two weeks to lead a broader upturn in digital assets."
    },
    {
      "title": "Sui DeFi Exchange Cetus Back in Action After $233 Million Exploit",
      "link": "https://decrypt.co/324313/sui-defi-exchange-cetus-back-in-action-after-233-million-exploit",
      "summary": "Following a damaging protocol vulnerability in May, Sui decentralized exchange Cetus is back online with a compensation plan."
    },
    {
      "title": "Plasma Attracts $500 Million for ICO—And One Trader Spent $100K on Ethereum Gas Fees",
      "link": "https://decrypt.co/324237/plasma-500-million-ico-trader-spent-100k-ethereum-gas",
      "summary": "Are ICOs back? Stablecoin network Plasma just attracted $500 million worth of deposits for its sale, with one trader paying $100K for an edge."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "How UK crypto taxes work and what you need to know",
      "link": "https://cryptobriefing.com/how-uk-crypto-taxes-work/",
      "summary": "<p>The increasing scrutiny on crypto tax compliance in the UK highlights the need for investors to maintain accurate records and understand tax obligations.</p> <p>"
    },
    {
      "title": "Did Paraguay just make Bitcoin legal tender? Suspected hack of president’s X account sparks confusion",
      "link": "https://cryptobriefing.com/paraguay-bitcoin-legal-tender-hack/",
      "summary": "<p>The incident highlights the vulnerability of digital platforms in disseminating misinformation, potentially impacting national and global markets.</p> <p>"
    },
    {
      "title": "ProShares, Bitwise seek SEC approval for ETFs tracking Circle stock",
      "link": "https://cryptobriefing.com/circle-stock-etfs-proshares-bitwise/",
      "summary": "<p>The approval of these ETFs could enhance investor access to crypto-related equities, potentially boosting market liquidity and innovation.</p> <p>"
    },
    {
      "title": "Tether to open-source Bitcoin Mining Operating System to empower small, mid-sized miners, says Paolo Ardoino",
      "link": "https://cryptobriefing.com/tether-bitcoin-mining-open-source/",
      "summary": "<p>Tether's open-source MOS could democratize Bitcoin mining, enhancing decentralization and security while enabling smaller players to compete.</p> <p>"
    },
    {
      "title": "Bitcoin rises as key US-China trade talks commence in London",
      "link": "https://cryptobriefing.com/bitcoin-market-reaction-us-china-trade/",
      "summary": "<p>Bitcoin's rebound highlights its sensitivity to geopolitical events, underscoring its potential as a barometer for global economic tensions.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Will Chainlink push past $14 and trigger a market squeeze? – Assessing…",
      "link": "https://ambcrypto.com/is-chainlink-link-ready-for-a-breakout-heres-why-14-is-the-key/",
      "summary": "<img alt=\"LINK\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-09T161205.751-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bullish structure forms as LINK eyes key resistance amid rising derivatives activity."
    },
    {
      "title": "Crypto cools off despite Asia stock rally – Is U.S. inflation the next shock?",
      "link": "https://ambcrypto.com/crypto-cools-off-despite-asia-stock-rally-is-u-s-inflation-the-next-shock/",
      "summary": "<img alt=\"Crypto Cools Off Despite Asia Stock Rally - Is U.S. Inflation the Next Shock?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-6-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Derivatives show signs of volatility ahead of key U.S. economic data release."
    },
    {
      "title": "Shiba Inu falls 20%, but whales surge back in – Is SHIB’s recovery next?",
      "link": "https://ambcrypto.com/shib-falls-20-but-whales-surge-back-in-is-shibs-recovery-next/",
      "summary": "<img alt=\"Shiba Inu\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-11.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Shiba Inu whales are back buying the dip, accumulating 1.93 trillion tokens over the past day."
    },
    {
      "title": "Nasdaq expands crypto index, adds 4 new assets— Impact on XRP and SOL?",
      "link": "https://ambcrypto.com/nasdaq-expands-crypto-index-adds-4-new-assets-impact-on-xrp-and-sol/",
      "summary": "<img alt=\"Nasdaq crypto\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Nasdaq-crypto-index.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Assessing impact of Nasdaq crypto inclusion and Japan partnership on XRP."
    },
    {
      "title": "Key Bitcoin metric hits 1.1 as buyers dominate – Here’s what’s next for BTC",
      "link": "https://ambcrypto.com/key-bitcoin-metric-hits-1-1-as-buyers-dominate-heres-whats-next-for-btc/",
      "summary": "<img alt=\"Key Bitcoin metric hits 1.1 as buyers dominate - Here&#039;s what&#039;s next for BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-92-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bullish strength across spot and on-chain metrics for Bitcoin as it stands."
    }
  ]
}