{
  "CoinDesk": [
    {
      "title": "CoinDesk 20 Performance Update: Uniswap (UNI) Surges 21.6% as Index Climbs Higher",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/10/coindesk-20-performance-update-uniswap-uni-surges-21-6-as-index-climbs-higher",
      "summary": ""
    },
    {
      "title": "Blockchain Initiatives Have Been Adopted by 60% of Fortune 500 Companies: Coinbase Survey",
      "link": "https://www.coindesk.com/markets/2025/06/10/blockchain-initiatives-have-been-adopted-by-60-of-fortune-500-companies-coinbase-survey",
      "summary": ""
    },
    {
      "title": "Ethereum Advocate William Mougayar to Lead Ecosystem's New Profile-Raising Initiative",
      "link": "https://www.coindesk.com/business/2025/06/10/ethereum-market-research-centre-introduced-by-eth-o-g-william-mougayar",
      "summary": ""
    },
    {
      "title": "Bitcoin Core 30 to Increase OP_RETURN Data Limit After Developer Debate Concludes",
      "link": "https://www.coindesk.com/tech/2025/06/10/bitcoin-core-30-to-increase-op_return-data-limit-after-developer-debate-concludes",
      "summary": ""
    },
    {
      "title": "Crypto Daybook Americas: BTC Holds Below $110K as QCP Sees ‘Tight Range’; Altcoins Outperform",
      "link": "https://www.coindesk.com/daybook-us/2025/06/10/crypto-daybook-americas-btc-holds-below-usd110k-as-qcp-sees-tight-range-altcoins-outperform",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Mystery whale opens $300M leveraged Bitcoin bet: James Wynn alt account?",
      "link": "https://cointelegraph.com/news/whale-300m-bitcoin-james-wynn-alt?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU5ZTctNDA3Yi03NGY0LWJiMTYtZDU3YTVjZDY4NGU3.jpg\" /></p><p>The mysterious $300 million leveraged Bitcoin long comes days after Wynn’s second $100 million leveraged Bitcoin position was liquidated, causing a near $25 million loss.</p>"
    },
    {
      "title": "Strategy Inc vs. BlackRock: Which is the better Bitcoin proxy stock for your portfolio?",
      "link": "https://cointelegraph.com/explained/strategy-inc-vs-blackrock-which-is-the-better-bitcoin-proxy-stock-for-your-portfolio?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9mMzA3ODY5YTZiMGZlYzNmZGNmMmIyYWIzMzgzYzFjMS5qcGc=.jpg\" /></p><p> Strategy Inc vs. IBIT: Best Bitcoin Proxy Stock in 2025? </p>"
    },
    {
      "title": "Why is Ethereum (ETH) price up today?",
      "link": "https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvNjJhOWU5MTEtNDNhMi00Y2M0LTkyYTEtZjQ4MTlkOGYwZGI1.jpg\" /></p><p>ETH price is up 7% on June 10 with persistent Ethereum ETF flows and record open interest backing Ether’s upside potential.</p>"
    },
    {
      "title": "87 deepfake scam rings taken down across Asia in Q1 2025: Report",
      "link": "https://cointelegraph.com/news/bitget-deepfake-scam-rings-crackdown-asia-q1-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmVjMjUtN2QyOS03M2U1LWE3YjYtZjNhNzViYTRiMjgw.jpg\" /></p><p>A new report from Bitget, SlowMist and Elliptic highlights the severity of deepfake scams, urging both individuals and organizations to adopt more stringent preventive measures.</p>"
    },
    {
      "title": "‘Apple should buy Bitcoin,’ Saylor says, as share buyback disappoints",
      "link": "https://cointelegraph.com/news/apple-buy-bitcoin-stock-buybacks-michael-saylor?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU5OTAtZTcyZC03Mjc4LWFhNzAtZTgxYTIzZTFhOWY4.jpg\" /></p><p>Bitcoin exposure may provide a lucrative financial opportunity for Apple’s stock buyback program, according to Michael Saylor.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Cardano launches Cardinal to fuse Bitcoin liquidity with DeFi ecosystem",
      "link": "https://cryptoslate.com/cardano-launches-cardinal-to-fuse-bitcoin-liquidity-with-defi-ecosystem/",
      "summary": "<p>Cardano has taken a new step in bridging the gap between Bitcoin and decentralized finance by launching Cardinal. This protocol allows the top blockchain network to interact with Cardano&#8217;s DeFi ecosystem. Cardano founder Charles Hoskinson highlighted the release on June 9, sharing a post from Roman Pellerin, Chief Technology Officer at Input Output Global (IOG), [&#8230;]</p> <p>"
    },
    {
      "title": "Staked ETH hits new all-time high, capturing 28% of total Ethereum supply amid 9% price surge",
      "link": "https://cryptoslate.com/insights/staked-eth-hits-new-all-time-high-capturing-28-of-total-ethereum-supply-amid-9-price-surge/",
      "summary": "<p>Staked ETH has reached a new all-time high of 34,824,875 ETH. The total represents 28.15% of the Ethereum supply now locked in staking contracts. The validator count stands at 1,088,277, and staking activity is pushing upward after a period of consolidation and a brief decline earlier in the month. Lido remains the leading staking entity, [&#8230;]</p> <p>"
    },
    {
      "title": "Solana snaps out of June slump with a 9% spike",
      "link": "https://cryptoslate.com/insights/solana-snaps-out-of-june-slump-with-a-9-spike/",
      "summary": "<p>Solana rallied from $147.99 to $161.21 in the four days ending June 10. The move contrasts with the trend seen over the previous 30 days, where SOL slipped by nearly 2% as volatile macroeconomic conditions weighed on the altcoin market. The resurgence follows last week&#8217;s flash crash that briefly drove the price down to $141, [&#8230;]</p> <p>"
    },
    {
      "title": "World Liberty Financial taps Aave for $7.5 million USDT loan – Onchain Lens",
      "link": "https://cryptoslate.com/world-liberty-financial-taps-aave-for-7-5-million-usdt-loan-onchain-lens/",
      "summary": "<p>World Liberty Financial (WLFI), a DeFi venture linked to US President Donald Trump, has drawn a $7.5 million USDT loan through the Aave lending platform. On June 10, blockchain analytics firm Onchain Lens reported that WLFI supplied assets worth more than $52 million to Aave. This included 7,900 Ethereum (ETH) valued at $21 million, 162.69 [&#8230;]</p> <p>"
    },
    {
      "title": "Average US house prices fall 99% in a decade when priced in Bitcoin",
      "link": "https://cryptoslate.com/average-us-house-prices-fall-99-in-a-decade-when-priced-in-bitcoin/",
      "summary": "<p>Two new Coinbase ads recently hit U.S. screens, reviving crypto’s populist pitch at a time when inflation is stubborn, Bitcoin is soaring, and Americans are once again talking about “building.” One spot reframes Bitcoin as “money from the future,” while another shows how a U.S. home’s price has dropped from 30,000 BTC to just 5 [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin’s $110K Sprint Coincides With Record-Low Exchange Reserves",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoins-110k-sprint-coincides-with-record-low-exchange-reserves/",
      "summary": "Bitcoin’s price shook off last week’s dip and climbed sharply on Tuesday morning in Asia, topping $110,000 briefly before settling around $109,450. Traders rushed back in after the asset dipped close to $100,000, feeding a sharp rebound that leaves Bitcoin just 2.8% shy of its record high. A blend of forced liquidations, surging derivatives volume, easing US–China trade tensions and steady on-chain withdrawals is driving the move. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Heavy Liquidations Shift The Balance According to Coinglass, nearly $203 million in Bitcoin positions were wiped out over the past 24 hours. Of that, $195 million were against shorts. When so many short bets unwind at once, it forces buyers to cover positions, which can send prices spiking. Yet history shows these “short squeezes” can reverse quickly when traders take profits. Based on reports, Bitcoin’s derivatives volume more than doubled, climbing over 110% to $110 billion. Open interest then followed suit, expanding 7.3% to almost $77 billion. These kinds of inflows indicate that new money is accumulating. Both open interest and volume rising tends to indicate enthusiasm—and a willingness to carry through positions with swings. Trade Diplomacy Lifts Risk Assets Talks resumed in London on June 9 between the US and China over tariffs and export rules. Even a hint of progress tends to boost appetite for riskier assets, and Bitcoin isn’t immune. Headlines of smoother trade ties lifted equities earlier this week—and crypto traders moved in tandem. If negotiations hit a snag, though, Bitcoin could slide with global markets. On-Chain Data Shows Steady Accumulation CryptoQuant’s numbers reveal that centralized exchanges have shed 550,000 BTC since July 2024, falling from 1.55 million to about 1.01 million today. As coins leave exchanges, float tightens. At the same time, the Coinbase Premium indicator rose, with US buyers paying more than overseas investors. Santiment also reports renewed accumulation among wallets holding 10–100 BTC. This pattern hints at long-term holding rather than quick trades. Related Reading: Ignore The Trump–Musk Noise: Bitcoin’s Backbone Stays Solid Correlation And Caution Remain When you consider the rally, Bitcoin still dances on the tunes of equity price swings. Futures have mixed bets between bulls and bears, showing portrait-wise signs that certainly not everybody is convinced this run is going to hold. High volatility would tend to wash out weak hands at the slightest hint of trouble, any reversal of risk sentiment, or a sudden macro shock would cost the rally dearly. Optimism is building as analysts talk of fresh all-time highs. Some even eye $150,000 by the end of the year if US debt levels climb further. But sustaining a rally of that magnitude will require more than forced liquidations. Traders will watch derivatives flows, on-chain reserves and trade headlines for signs of real, lasting demand before pushing prices much higher. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "XRP Eyes $2.50 Decision Zone As Macro Wave Structure Takes Shape",
      "link": "https://www.newsbtc.com/xrp-news/xrp-eyes-2-50-decision-zone-macro-wave-structure/",
      "summary": "XRP changed hands at roughly $2.30 in early European trading on Tuesday, extending a two-day bounce that has pulled the token back toward the upper half of the seven-month range that has confined it between about $2.00 and $2.80 since December. Analyst Quantum Ascend argues that this compression phase is now approaching a technical fulcrum that will determine whether the next move is an impulsive wave-three surge or one final wave-two washout. XRP Tightens Into Decision Zone In a video posted on 9 June, the trader noted that “we’ve been in this range… since early December… between like $2.80 and $2.00 just bouncing the whole time,” before zooming out to show what he calls the only Elliott-wave count that “makes sense”: a completed five-wave advance from last year’s lows followed by a five-wave corrective pull-back. “Right now we’re looking at a one-two-three-four-five on the way down… that’s the macro two… and now we’re waiting on three-four-five,” he said, adding that XRP still represents about 12.5% of his portfolio despite his tactical rotation into “alts with more gas left.” Quantum Ascend’s Fibonacci mapping reveals that the token has already retraced slightly more than 50% of its preceding leg higher—a textbook depth for a second-wave correction—and that the sell-off bottomed in the price region that coincided with the fourth wave of the prior move. “Makes sense, perfect spot for us to bounce,” he told viewers after plotting the swing low against the 0.5 Fib level. Related Reading: XRP Bull Trap Incoming? Analyst Sees $2.40 Fakeout Before Painful Crash Whether that bounce blossoms into a sustained breakout, he stressed, ultimately hinges on the market leader: “I think Bitcoin’s gonna make the decision for us,” he said, pointing out that XRP’s fate remains tightly coupled to any directional conviction in BTC. Bitcoin’s own advance toward key retracement resistance could, in his view, drag major altcoins—including XRP—into their respective inflection zones. The analyst now fixes on the 0.618–0.786 Fib band, which corresponds to $2.42–$2.52, as the “decision zone.” “There’s gonna be an area that we gotta be careful of… statistically it’s the area we’re most probable to roll over… between $2.42 and $2.52,” he warned, outlining the risk that XRP forms an A-B-C zig-zag and revisits lower supports before the larger impulsive leg begins. A rejection there would map onto the classical script of a complex second wave that fakes out early longs one final time before relinquishing control to bulls. Related Reading: XRP Price Remains Bullish Above $2, This Falling Channel Says $3.8 Is Coming Macro currents may soon add fuel. XRP’s next potential volatility catalyst is the US Securities and Exchange Commission’s 17 June deadline on Franklin Templeton’s spot-XRP exchange-traded fund proposal—a ruling some desks see as the token’s analogue to January’s Bitcoin ETF moment. While ETF speculation has helped price reclaim higher ground this month, XRP remains almost a dollar below its January all-time high of $3.40, leaving the $2.42–$2.52 pocket as the most technically significant hurdle in the short term. For now, traders will watch whether the current advance can print a daily close inside—or better, above—that corridor. A clean break would validate Quantum Ascend’s wave-three thesis and open the charts to measured moves targeting the mid-$3s. Failure, by contrast, risks a final capitulation toward the lower-$2 region before the larger bull structure can re-assert itself. Whatever the outcome, the analyst remains sanguine: “Whether it rolls over here one more time and we have to be patient or it just goes—that’s okay, because either way the end result is going to be the same.” At press time, XRP traded at $2.28. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "BlackRock’s Bitcoin ETF Becomes Fastest Ever To Reach $70 Billion AUM",
      "link": "https://www.newsbtc.com/bitcoin-news/blackrocks-bitcoin-etf-becomes-fastest-ever-to-reach-70-billion-aum/",
      "summary": "BlackRock’s iShares Bitcoin Trust (IBIT) has made headlines by amassing a staggering $70 billion in total assets, achieving this milestone faster than any other exchange-traded fund (ETF) in history. This remarkable feat occurred just 341 days after its launch, according to Bloomberg analyst Eric Balchunas, who noted that IBIT reached this figure five times quicker than the previous record holder, State Street’s GLD gold ETF, which took nearly 1,700 days. BlackRock’s IBIT Outshines Competitors As the most popular of the twelve Bitcoin ETFs currently available, IBIT stands out significantly in the market. Following closely behind are Fidelity’s FBTC and Grayscale’s GBTC, both of which have around $20 billion in assets. Related Reading: Dogecoin Is Going To $1 With The ‘Next Impulse’, Analyst Predicts The launch of IBIT and ten other Bitcoin ETFs at the start of last year by the world’s largest asset managers marked a significant shift in the investment landscape, fueled by long-awaited regulatory approval from the Securities and Exchange Commission (SEC). The debut of these funds highlighted a robust demand from investors eager to capitalize on Bitcoin’s price fluctuations. IBIT alone accumulated over $1 billion in assets within just four days of its market introduction. By November, IBIT had surpassed the total assets of BlackRock’s gold fund, solidifying its position as the largest among the 1,400 funds managed by the asset manager worldwide. Bitcoin ETF Market Thrives The momentum didn’t stop there; in December, IBIT became the fastest exchange-traded fund to hit $50 billion in assets, achieving this milestone five times quicker than BlackRock&#8217;s iShares Core MSCI EAFE ETF, which took nearly four years to reach the same level. “IBIT’s growth is unprecedented,” remarked Bloomberg ETF expert James Seyffart in an interview with Fortune Magazine on Monday. “It’s the fastest ETF to reach most milestones, outpacing any other ETF across all asset classes.” Related Reading: Pundit Says Do Not Ignore Ethereum Amid New All-Time Highs In Major Metric The surge in Bitcoin ETFs has coincided with significant increases in the cryptocurrency&#8217;s price. For instance, as Bitcoin reached an all-time high of $111,900 in late May, the cumulative net assets across all twelve Bitcoin ETFs surpassed $134 billion, reflecting the growing interest and investment in this digital asset class. Since reaching its record high, the market’s leading cryptocurrency has retraced, with the most important support line at $100,000 being tested on June 5. Nevertheless, Bitcoin has once again regained its bullish momentum, jumping past the $108,400 mark on Monday. With gains of 2% and 4% on the 24-hour and weekly time frames, respectively, the price of BTC is now only 2.7% below the record price level. This puts the cryptocurrency on the verge of a new price discovery phase after the normal pullback seen last week. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Why The Bitcoin Price Could See Another 70%-170% Jump From Here",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-70-170-jump/",
      "summary": "The Bitcoin price is still holding above $100,000 despite suffering a crash right before the weekend. It has since bounced back from the $104,000 level, suggesting that bulls are making their stand at this major psychological level. Now, with the crypto market sitting at what looks to be a critical point, questions are arising about what the next step could be from here. Can Bitcoin still rally, or is this the end of a rather short and underwhelming bull market? Bitcoin Price Still Has A Long Way To Go Crypto analyst Doctor Profit has been a vocal voice when it comes to the bullishness of the Bitcoin price. He has continued to call for higher prices even at a time when the wider community is expecting the cryptocurrency to keep falling from here. In fact, the crypto analyst believes that the leading crypto could see its price double from here, despite already hitting multiple new all-time highs. Related Reading: Ethereum Head &#38; Shoulders Pattern Breakdown: Can Bulls Reclaim Control? In a post on X, Doctor Profit explained the reasoning behind this and why he believes that the Bitcoin price still has room to run. The first thing he pointed to was the fact that a rare Golden Cross had appeared on the Bitcoin price chart. This happened three weeks ago, and back then, the analyst called out the chart formation, explaining that this meant that the bull run was not over. This is because every time Bitcoin had flashed a Golden Cross in the past, it had been the start of another massive run. Just like now, it is first followed by a 10% decline in price, which was achieved when Bitcoin fell from $111,900 to $100,000. Now that the first part of the trend seems to have been fulfilled, expectations are that the other parts will play out similarly. In addition to this, he explains that Bitcoin has also formed its diagonal resistance, which it is now looking to break out from. A successful break would put it back above $108,000 as it gears up for the next leg-up. Macro Factors That Support The Thesis Not only does the chart technicals show this possible recovery, but the upcoming Consumer Price Index (CPI) data, expected to be released on Wednesday, plays into this as well. Doctor Profit explains that Wall Street is already expecting the CPI to come in at 2.5%, a rather high number. Related Reading: Dogecoin’s Growth Pattern Hints At Massive June–July Rally After 5-Month Pullback Instead, he believes that the CPI will come in lower, putting it between 2.1% and 2.3%. A lower figure would mean that there is a slowdown in inflation, allowing room for more risk-taking and pushing markets such as stocks and crypto higher. Also, there is the matter of the negative funding rate, which suggests that there are more shorters in the market right now, expecting the price to tank. Data from Coinglass shows the Bitcoin funding rate has dropped to one of the lowest levels this year, and the analyst says this is a sign of a healthy market. “Overall, I see a strong trend and markets will continue to rise with first targets between 108-110k, and this is by far not the end,” Doctor Profit said. “The golden cross is promising us between 70-170% in gains in the coming months!” Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana Triangle Formation Breakout Targets Rally To $164 – Is A Recovery Around The Corner?",
      "link": "https://www.newsbtc.com/news/solana-triangle-formation-breakout-targets-rally-to-164-is-a-recovery-around-the-corner/",
      "summary": "Solana (SOL) has recovered from the recent market pullback after bouncing from its local bottom. Amid its recent breakout from a bullish formation, some market watchers suggest that the cryptocurrency could recover its start-of-year glory. Related Reading: Bitcoin Weekly Chart Flexes Strength—Is The Moonshot Just Getting Started? Solana Breakout Eyes $164 Solana is recording a 2.45% surge in the weekly timeframe after recovering from its recent drop to the $140 area. The altcoin has seen a significant recovery from its multi-month downtrend, which led the token to hit a 14-month low of $95 during the early April retraces. However, SOL lost the $160 area amid the recent market corrections, dipping 11% in one week. Over the weekend, its price bounced nearly 10%, reclaiming the $150 level as support and forming an ascending triangle pattern. Crypto analyst Ali Martinez highlighted the 3-day formation in Solana’s chart, suggesting a potential 6% jump to its recently lost support level. According to"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Robert Mitchnick Discusses BlackRock’s Bitcoin ETF IBIT Success On Bloomberg",
      "link": "https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Robert-Mitchnick-Discusses-BlackRocks-Bitcoin-ETF-IBIT-Success-On-Bloomberg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg\" rel=\"nofollow\"> </a></p> <p>BlackRock’s Head of Digital Assets, Robert Mitchnick, explains the key factors driving the surge in Bitcoin ETFs.</p> <p>"
    },
    {
      "title": "KULR Technology Group Announces $300 Million ATM Offering To Invest in Their Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>KULR entered a $300 million ATM offering to fund its Bitcoin treasury reserve, with Cantor Fitzgerald &#038; Co. and Craig-Hallum Capital Group LLC.</p> <p>"
    },
    {
      "title": "BlackRock’s iShares Bitcoin Trust Shatters ETF Growth Record, Surpassing $70 Billion in Just 341 Days",
      "link": "https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BlackRock.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days\" rel=\"nofollow\"> </a></p> <p>BlackRock’s iShares Bitcoin Trust (IBIT) has officially made history. The Bitcoin ETF surged past $70 billion in assets under management (AUM), reaching the milestone in just 341 trading days. This achievement makes IBIT the fastest ETF to ever hit that threshold.&#160; To put that into perspective, the previous record-holder—SPDR Gold Shares (GLD)—took 1,691 days to [&#8230;]</p> <p>"
    },
    {
      "title": "New York City Won’t Be Issuing BitBonds Anytime Soon",
      "link": "https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/New-York-City-Mayor-Eric-Adams-Bitcoin-BitBonds.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon\" rel=\"nofollow\"> </a></p> <p>At Bitcoin 2025, NYC mayor, Eric Adams, proclaimed that he’s going to push to issue a BitBond, but judging by his past inaction on Bitcoin as well as a statement from NYC’s comptroller, odds are New Yorkers won’t see a BitBond in the near future.</p> <p>"
    },
    {
      "title": "Japan’s ANAP Holdings Launches Full Bitcoin Business Strategy with Goal of Over 1,000 BTC by August 2025",
      "link": "https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ANAP.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025\" rel=\"nofollow\"> </a></p> <p>ANAP Holdings, Inc. (3189: Tokyo Standard Market) has officially announced the launch of its “Bitcoin Business” in a formal corporate filing, detailing an entry into Bitcoin focused operations across treasury, finance, fashion, and mining. In a statement signed by President and CEO Yuta Sawaki, the company confirmed that its consolidated subsidiary ANAP Lightning Channel will [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Is The Metaverse Back? Solana Token for VR Game Explodes",
      "link": "https://decrypt.co/324396/is-the-metaverse-back-solana-token-for-vr-game-explodes",
      "summary": "Virtual reality metaverse game Verse World launched a Solana token via Pump.fun that skyrocketed to a $112 million market cap."
    },
    {
      "title": "Aura Farming: Nibiru’s New 'Block Party' Rewards Real DeFi Activity",
      "link": "https://decrypt.co/324377/aura-farming-nibirus-new-block-party-rewards-real-defi-activity",
      "summary": "Participants in the layer-1 blockchain’s DeFi ecosystem earn Aura points through trading, liquidity, lending and quests."
    },
    {
      "title": "Franklin Templeton Unveils 'Intraday Yield' for Tokenized Assets on Benji Platform",
      "link": "https://decrypt.co/324315/franklin-templeton-unveils-intraday-yield-tokenized-assets-benji",
      "summary": "The 78-year-old bank said that stablecoins could now be used to purchase or redeem tokenized securities, too."
    },
    {
      "title": "Feds Charge Crypto Founder With Evading U.S. Sanctions, Laundering $500M",
      "link": "https://decrypt.co/324391/feds-charge-crypto-founder-with-evading-u-s-sanctions-laundering-500m",
      "summary": "Evita Pay founder Iurii Gugnin is accused of turning his crypto firms into a \"covert pipeline\" for sanctioned Russian entities."
    },
    {
      "title": "ChatGPT Global Outage Drags on for Hours—Here's What We Know",
      "link": "https://decrypt.co/324384/chatgpt-down-three-hours-heres-what-we-know",
      "summary": "ChatGPT suffers 3-hour worldwide outage affecting millions of users, with OpenAI investigating \"elevated error rates\" across most services."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Eric Trump-backed American Bitcoin discloses 215 BTC holdings",
      "link": "https://cryptobriefing.com/american-bitcoin-btc-disclosure/",
      "summary": "<p>The strategic focus on Bitcoin accumulation by American Bitcoin could influence market dynamics and drive broader adoption and infrastructure development.</p> <p>"
    },
    {
      "title": "French banking giant Société Générale confirms launch of new stablecoin on Ethereum and Solana",
      "link": "https://cryptobriefing.com/usd-coinvertible-launch-sg-forge/",
      "summary": "<p>Socit Gnrale's stablecoin launch signifies a pivotal shift in traditional banking towards embracing blockchain technology and digital finance.</p> <p>"
    },
    {
      "title": "How UK crypto taxes work and what you need to know",
      "link": "https://cryptobriefing.com/how-uk-crypto-taxes-work/",
      "summary": "<p>The increasing scrutiny on crypto tax compliance in the UK highlights the need for investors to maintain accurate records and understand tax obligations.</p> <p>"
    },
    {
      "title": "Did Paraguay just make Bitcoin legal tender? Suspected hack of president’s X account sparks confusion",
      "link": "https://cryptobriefing.com/paraguay-bitcoin-legal-tender-hack/",
      "summary": "<p>The incident highlights the vulnerability of digital platforms in disseminating misinformation, potentially impacting national and global markets.</p> <p>"
    },
    {
      "title": "ProShares, Bitwise seek SEC approval for ETFs tracking Circle stock",
      "link": "https://cryptobriefing.com/circle-stock-etfs-proshares-bitwise/",
      "summary": "<p>The approval of these ETFs could enhance investor access to crypto-related equities, potentially boosting market liquidity and innovation.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "RYO Project: Launching RYOPAY with first real-world use case in the grain trade industry",
      "link": "https://ambcrypto.com/ryo-project-launching-ryopay-with-first-real-world-use-case-in-the-grain-trade-industry/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"467\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-10-184057.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"835\" />The RYO Project, an innovative initiative born out of Japan, has launched RYOPAY, RYO&#8217;s stablecoin [&#8230;]"
    },
    {
      "title": "The GENIUS Act: What could stablecoin regulations look like after June 11?",
      "link": "https://ambcrypto.com/the-genius-act-what-could-stablecoin-regulations-look-like-after-june-11/",
      "summary": "<img alt=\"GENIUS Act moves forward\" class=\"attachment-full size-full wp-post-image\" height=\"659\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/GENIUS-Act-moves-forward.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1171\" />Will stablecoins finally be recognized under U.S. law, or get lost in amendment gridlock?"
    },
    {
      "title": "Ethereum’s stablecoin lead at risk? – Tether and Circle’s moves raise concerns",
      "link": "https://ambcrypto.com/ethereums-stablecoin-lead-at-risk-tether-and-circles-moves-raise-concerns/",
      "summary": "<img alt=\"Stablecoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Stablecoinwars.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Stablecoin sector has grown 4,600% from $5B to over $240B in the past five years."
    },
    {
      "title": "Bitcoin price volatility ahead? – Signals you should watch at $109K",
      "link": "https://ambcrypto.com/bitcoin-price-volatility-ahead-the-signals-you-should-watch-at-109k/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-93-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin’s bullish momentum persists, but rising risk signals suggest a possible shift toward distribution."
    },
    {
      "title": "Win big as Sportsbet.io gives away 10 Million USDT Club World Cup",
      "link": "https://ambcrypto.com/win-big-as-sportsbet-io-gives-away-10-million-usdt-club-world-cup/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"520\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-10-152759.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"932\" />To mark this summer’s Club World Cup, Sportsbet.io is launching one of its biggest promos [&#8230;]"
    }
  ]
}