{
  "CoinDesk": [
    {
      "title": "Deribit Sees Strong Demand From Institutions, Volume on Its Block RFQ Tool Reaches $23B in Four Months",
      "link": "https://www.coindesk.com/markets/2025/06/17/deribit-s-on-demand-liquidity-tool-for-large-bitcoin-ether-traders-registers-over-usd23b-in-volume-in-4-months",
      "summary": ""
    },
    {
      "title": "Pump.fun and Other Memecoin Accounts Suspended From X in Apparent Crackdown",
      "link": "https://www.coindesk.com/markets/2025/06/17/pumpfun-and-other-memecoin-accounts-suspended-from-x-in-apparent-crackdown",
      "summary": ""
    },
    {
      "title": "Dogecoin Shows ‘Higher-Highs’ Price Action in Short-Term Relief for Bulls",
      "link": "https://www.coindesk.com/markets/2025/06/17/dogecoin-shows-higher-highs-price-action-in-short-term-relief-for-bulls",
      "summary": ""
    },
    {
      "title": "XRP Leads Crypto Majors Gains as Bitcoin Continually Tested by Israel-Iran Tensions",
      "link": "https://www.coindesk.com/markets/2025/06/17/xrp-leads-crypto-majors-gains-as-bitcoin-continually-tested-by-israel-iran-tensions",
      "summary": ""
    },
    {
      "title": "Asia Morning Briefing: Tron's Public Listing Might be Investors' 'Visa' Moment for Stablecoins",
      "link": "https://www.coindesk.com/markets/2025/06/16/asia-morning-briefing-trons-public-listing-might-be-investors-visa-moment-for-stablecoins",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Pump.fun and its founder hit in X account suspension blitz",
      "link": "https://cointelegraph.com/news/pump-fun-x-account-suspended-crypto-account-blitz?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdjMzAtNjA5OC03OWIyLTlhNDMtOWIyNTUyYTc2YTUw.jpg\" /></p><p>X has suspended over 20 crypto-related accounts as of Monday, with the bans hitting Pump.fun and its co-founder, Alon Cohen.</p>"
    },
    {
      "title": "Optimism targets decentralization with ‘season 8’ governance revamp",
      "link": "https://cointelegraph.com/news/optimism-season-8-governance-decentralization-update?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdiZGUtMDJkNS03ZGNmLTkyYzgtMzY0NjNhN2I3MTNm.jpg\" /></p><p>A new approval process, where most Optimism proposals will auto-pass unless a stakeholder vetoes, will come into force on Aug. 1 to reduce the burden on contributors.</p>"
    },
    {
      "title": "Arthur Hayes says to trade new stablecoin IPOs like a ‘hot potato’",
      "link": "https://cointelegraph.com/news/arthur-hayes-trade-stablecoin-ipo-hot-potato?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDdmOTEtNjhlNi03NzdlLWFjZWUtNmU4YmE0N2I3NDhk.jpg\" /></p><p>The BitMEX founder warned that most new stablecoin issuers will be overvalued and likely fail due to locked distribution channels.</p>"
    },
    {
      "title": "9GAG founder’s MemeStrategy gains 29% after first Solana buy",
      "link": "https://cointelegraph.com/news/memestrategy-shares-pump-hong-kong-firm-buy-solana?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdiODAtNzU0Ny03MjFhLTk0MDktMDRjYmIyYzc1OTRl.jpg\" /></p><p>Hong Kong tech investment firm MemeStrategy has added Solana to its balance sheet and has pledged to stake Solana tokens to support network security and earn rewards.</p>"
    },
    {
      "title": "Paradigm urges jury clarity in Roman Storm’s Tornado Cash case",
      "link": "https://cointelegraph.com/news/paradigm-wants-law-clarity-in-roman-storm-case?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTYzNDItZDY4ZC03ZmVhLTgyN2MtYWZhMGIxYjA5Y2Zk.jpg\" /></p><p>Paradigm’s chief legal officer and general counsel said if Roman Storm is found guilty, it could slow future software development in the crypto and fintech industries.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin delivers 90% risk-adjusted return to 60/40 portfolios with 10% allocation, 2x gold’s risk efficiency",
      "link": "https://cryptoslate.com/bitcoin-delivers-90-risk-adjusted-return-to-60-40-portfolios-with-10-allocation-2x-golds-risk-efficiency/",
      "summary": "<p>Investors who added 10% in Bitcoin (BTC) to their &#8220;60/40 portfolio&#8221; strategies got a 90% risk-adjusted return in the past 12 months, outperforming gold&#8217;s 51% return in the same period. On a June 16 post via X, the profile Ecoinometrics highlighted BTC&#8217;s performance through June 13 and charted the result against total return. A 60/40 [&#8230;]</p> <p>"
    },
    {
      "title": "Dozens of memecoin-related X accounts including Pumpfun suspended for unknown reasons",
      "link": "https://cryptoslate.com/dozens-of-memecoin-related-x-accounts-including-pumpfun-suspended-for-unknown-reasons/",
      "summary": "<p>The official Pump.fun account and the personal handle of its founder Alon Cohen were seemingly suspended by X on June 16, along with a cohort of other accounts tied to the memecoin sector. As of press time, neither X nor the people behind the suspended accounts explained the reason for the suspensions. Users noticed that [&#8230;]</p> <p>"
    },
    {
      "title": "Bybit unveils TradFi platform to blend crypto and traditional markets",
      "link": "https://cryptoslate.com/bybit-unveils-tradfi-platform-to-blend-crypto-and-traditional-markets/",
      "summary": "<p>Bybit launched a new platform on June 16 that allows users to trade gold, forex, stock CFDs, global indices, and commodities directly within its app, a first for any major crypto exchange. The launch of Bybit TradFi expands the company’s offerings beyond digital assets, positioning it as a full-service financial hub aimed at bridging the [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin reclaims $108k amid upward consolidation as war tensions show signs of easing",
      "link": "https://cryptoslate.com/bitcoin-reclaims-108k-amid-upward-consolidation-as-war-tensions-show-signs-of-easing/",
      "summary": "<p>Bitcoin (BTC) reclaimed the $108,000 threshold on June 16 as tensions of war escalating in the Middle East fell after reports surfaced that Iran was open to negotiations with the US and Israel. Bitcoin&#8217;s move up regained the price level surrendered on June 12 while markets processed the initial flare-up in Israeli-Iranian hostilities. The “Bitfinex Alpha” [&#8230;]</p> <p>"
    },
    {
      "title": "JPMorgan files ‘JPMD’ trademark for digital asset payment services, hinting at potential stablecoin",
      "link": "https://cryptoslate.com/jpmorgan-files-jpmd-trademark-for-digital-asset-payment-services-hinting-at-potential-stablecoin/",
      "summary": "<p>JPMorgan filed a trademark application for the mark “JPMD,” covering trading, exchange, transfer, and payment services tied to virtual currency, digital tokens, and blockchain-enabled money. According to reports from June 16, the filing lists electronic fund transfers, real-time token trading, custody services, and secure online financial transactions. The document identifies JPMorgan Chase Bank, N.A., as [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Eyes Big Move As Price Compresses Between Key Levels – $2,100 Or $4,000 Next?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-eyes-big-move-as-price-compresses-between-key-levels-2100-or-4000-next/",
      "summary": "Ethereum (ETH) is attempting to retest the local range highs following last week’s market shakeout. However, some analysts believe that the cryptocurrency will continue its sideways move for the coming weeks before its next big move. Related Reading: Will The Bitcoin Price Move Above $110,000 Again? Global M2 Money Supply Shows What’s Next Ethereum Eyes Range High Resistance Last week, Ethereum attempted to reclaim the $2,800 barrier, hitting a three-month high of $2,879. However, the market shakeout, fueled by the Iran-Israel conflict, sent the cryptocurrency’s price to retest its local range’s lows before recovering over the weekend. Notably, ETH has been hovering between the $2,400-$2,680 range since the early May market recovery, which saw the King of Altcoins surge from the $1,800 mark toward its current price range for the first time in three months. Nonetheless, it has been rejected from the local range’s resistance four times in the past month. Market watcher Daan Crypto Trades noted that Ethereum’s price action has been consolidating between these two key levels, compressing just below the $2,800 area. This level has been a crucial area throughout the cycle, serving as a key support and resistance level since 2024. The trader considers this area to be “the most important level on this entire chart by far,” detailing that every major retest of this zone has led to either “a nice bounce” or “big dump.” Meanwhile, ETH “went on to really even further” after every reclaim of this level as support. Daan explained that its current price range is “becoming quite a tight range for how long it’s been trading here. You can see how important this is and that there’s likely a big move coming from this point somewhere in the next few weeks.” Based on this, he forecasted that “If we&#8217;d see a convincing break above $2.8K and hold there, that would be a good setup for a move to the cycle highs around ~$4K.” However, if it loses this current range, then the $2,100 area “is the big high timeframe level to watch.” Is A 2017 Repeat In The Making? Merlijn The Trader highlighted that Ethereum is now consolidating within its current range after breaking out of a multi-month falling wedge, which suggests that the cryptocurrency could soon experience a massive move. He pointed out that, historically, “this pause often precedes a surge,” adding that the Relative Strength Index (RSI) is also retesting the recent breakout zone. Additionally, the trader noted that ETH appears to be following its 2016-2017 playbook, with a similar structure to eight years ago. At the time, the cryptocurrency had an “explosive setup” that led ETH to a massive lift-off starting in 2017. After the market shakeout, the cryptocurrency moved sideways within a tight range while reclaiming the 50-day Moving Average (MA). Related Reading: PEPE Pumps 2.67% – Is The Memecoin Preparing For A Major Rebound? Following the key reclaim, Ethereum’s price experienced a massive surge toward new highs. According to Merlijn, “Same breakout zone. Same 50 MA reclaim. Sideways chop… then liftoff. But this time? Bigger market. Institutional fuel is backing ETH. No ceiling in sight. We’re not repeating history… We’re amplifying it.” As of this writing, Ethereum is trading at $2,640, a 3.7% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Cardano (ADA) Faces Trouble at Key Support — Is a Breakdown Looming?",
      "link": "https://www.newsbtc.com/analysis/ada/cardano-ada-faces-trouble-0-70/",
      "summary": "Cardano price started a fresh decline below the $0.680 zone. ADA is now consolidating and might struggle to stay above the $0.620 support. ADA price started a fresh decline below $0.70 and $0.680. The price is trading below $0.680 and the 100-hourly simple moving average. There is a key bullish trend line forming with support at $0.630 on the hourly chart of the ADA/USD pair (data source from Kraken). The pair could start a fresh decline if it dips below the $0.620 support zone. Cardano Price Dips Further In the past few days, Cardano saw a fresh decline below the $0.720, unlike Bitcoin and Ethereum. ADA even declined below the $0.70 level to enter a bearish zone. The bears even pushed the price below the $0.680 level. A low was formed at $0.6134 and the price recently corrected some losses. There was a move above the $0.620 and $0.6350 levels. The price climbed above the 23.6% Fib retracement level of the downward move from the $0.7311 swing high to the $0.6134 low. However, the bears remained active near $0.6560. Cardano price is now trading above $0.620 and the 100-hourly simple moving average. Besides, there is a key bullish trend line forming with support at $0.630 on the hourly chart of the ADA/USD pair. On the upside, the price might face resistance near the $0.650 zone. The first resistance is near $0.6560. The next key resistance might be $0.6720. It is close to the 50% Fib retracement level of the downward move from the $0.7311 swing high to the $0.6134 low. If there is a close above the $0.6720 resistance, the price could start a strong rally. In the stated case, the price could rise toward the $0.70 region. Any more gains might call for a move toward $0.7350 in the near term. Another Drop In ADA? If Cardano’s price fails to climb above the $0.6720 resistance level, it could start another decline. Immediate support on the downside is near the $0.630 level. The next major support is near the $0.620 level. A downside break below the $0.620 level could open the doors for a test of $0.60. The next major support is near the $0.5650 level where the bulls might emerge. Technical Indicators Hourly MACD – The MACD for ADA/USD is gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for ADA/USD is now below the 50 level. Major Support Levels – $0.630 and $0.620. Major Resistance Levels – $0.6560 and $0.6720."
    },
    {
      "title": "Ethereum’s $4K Target Within Reach, Here’s What Needs to Happen First",
      "link": "https://www.newsbtc.com/ethereum-news/ethereums-4k-target-within-reach-heres-what-needs-to-happen-first/",
      "summary": "The crypto market has been experiencing a rebound during today’s session with Ethereum showing strong momentum. The second largest crypto by market cap has been trending sideways displaying an increasing selling pressure on higher timeframes, but today ETH holders seem hopeful of further gains. Related Reading: Brace For Impact: Bitcoin Price Primed For Deep Correction Below $90,000 At the time of writing, Ethereum is trading at around $2,600 with a 3.5% gain on the past 24 hours. Over the past week, the ETH price shows larger gains with 4.3% returns, the best performance on this timeframe amongst the biggest cryptocurrencies. Ethereum price trends to the upside on the daily chart. Source: ETHUSD on Tradingview Ethereum Price On Brink Of Massive Recovery According to Daan Crypto, the current price action for Ethereum shows classical signs of compression. This action is usually recorded when an asset is about to experience a massive spike in volatility, either to the upside or the downside. The analyst pointed out that Ethereum has been trading in a tight range, trapped between two critical levels. If buyers manage to push the price above the first of these levels, sitting at $2,851, then the second crypto by market cap is likely to trend to the upside. ETH price trading on a tight range on the 2 day chart. Source: Daan Crypto via X On the contrary, if sellers regain control over the ETH market, and price dips below its current levels, then the price is more likely to return to the bottom of its current range, sitting at $2,168. Daan Crypto stated the following, warning his followers on taking positions as the Ethereum price consolidates: ETH Price action is compressing right below this big $2.8K level. If we&#8217;d see a convincing break above $2.8K and hold there, that would be a good setup for a move to the cycle highs around ~$4K. If we do lose this current range then $2.1K is the big high timeframe level to watch. No reason to get over excited in either direction until this current consolidation/compression resolves. ETH Price Rally to Ignite Massive Alt Season On a separate note, analyst Cantonese Cat showed the Ethereum price dominance chart, used to gauge the percentage of the total crypto market cap represented by ETH. As seen in the chart below, this chart is tightly compressed according to the Bollinger Band indicator. Related Reading: $8 Dogecoin? Analyst Says You’ll Regret Sleeping On This Chart When these bands compressed, they hint at an upcoming violent move suggesting that Ethereum will abandon its current range soon. If the crypto rallies, then other altcoins are likely to follow and kickstart the beginning of a global upward trend for these assets. ETH Dominance's Bolling Bands hint at upcoming volatility on the 2 day chart. Source: Cantonese Cat via X On the upcoming alt season, Jameson Lopp, Co-Founder and Chief Security Officer at crypto custodian CASA, stated the following noting the potential new variables that will trigger it: Altseason is coming, just not how you think. Instead of being driven by new tokens on crypto exchanges it will be from new equities on tradfi exchanges. Cover image from Unsplash, ETH/USD chart from Tradingview"
    },
    {
      "title": "XRP Price Climbs Higher — Is It Finally Turning Attractive to Bulls?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-climbs-higher-2-30/",
      "summary": "XRP price started a fresh increase above the $2.20 zone. The price is now correcting gains and might find bids near the $2.2150 zone. XRP price started a decent upward move above the $2.20 zone. The price is now trading above $2.20 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.180 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start another increase if it clears the $2.280 resistance zone. XRP Price Eyes Another Increase XRP price remained supported above the $2.080 level and started a decent increase, beating Bitcoin and Ethereum. The price climbed above the $2.150 and $2.20 resistance levels. The bulls pumped the price over 5% and pushed it above the $2.220 resistance. Finally, it tested the $2.3350 zone and recently corrected some gains. There was a move below the $2.30 level. The price tested the 50% Fib retracement level of the upward move from the $2.141 swing low to the $2.336 high. The price is now trading above $2.220 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.180 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.280 level. The first major resistance is near the $2.320 level. The next resistance is $2.3350. A clear move above the $2.3350 resistance might send the price toward the $2.380 resistance. Any more gains might send the price toward the $2.40 resistance or even $2.420 in the near term. The next major hurdle for the bulls might be $2.50. Another Decline? If XRP fails to clear the $2.280 resistance zone, it could start another decline. Initial support on the downside is near the $2.220 level. The next major support is near the $2.2150 level and the 61.8% Fib retracement level of the upward move from the $2.141 swing low to the $2.336 high. If there is a downside break and a close below the $2.2150 level, the price might continue to decline toward the $2.180 support. The next major support sits near the $2.120 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.2150 and $2.180. Major Resistance Levels – $2.280 and $2.3350."
    },
    {
      "title": "Crypto Funds Hit With Record Outflows, But Altcoin Buyers Smell Opportunity",
      "link": "https://www.newsbtc.com/news/crypto-funds-hit-with-record-outflows-but-altcoin-buyers-smell-opportunity/",
      "summary": "Crypto asset investment products experienced another challenging week as capital outflows continued for a second consecutive period. According to the latest report from CoinShares, a total of $584 million exited crypto-focused investment vehicles, pushing the two-week cumulative outflows to $1.2 billion. This movement coincides with investor uncertainty surrounding the likelihood of interest rate cuts by the US Federal Reserve this year, which James Butterfill, Head of Research at CoinShares, believes is contributing to waning sentiment in the market. Butterfill attributed the investor pullback to growing skepticism about macroeconomic policy shifts, particularly rate reductions. At the same time, exchange-traded product (ETP) activity hit a new low, with global ETP volumes falling to just $6.9 billion, marking the weakest weekly trading volume since the launch of spot Bitcoin ETFs in the United States earlier this year. Related Reading: Ethereum Whales Feast While Retail Flees—ETH Ocean Just Got Hungrier Bitcoin and Ethereum Bear the Brunt of The Crypto Outflows Bitcoin accounted for the majority of this week&#8217;s outflows, with $630 million leaving BTC investment products. Despite the significant movement of funds out of long Bitcoin positions, short Bitcoin products also recorded outflows totaling $1.2 million. This suggests that investors are not currently betting heavily on downside exposure, opting instead to stay on the sidelines amid uncertain market conditions. Ethereum similarly saw negative flow activity, with $58 million in outflows, continuing the trend of cautious investor behavior across major assets. The report also highlighted geographical breakdowns, noting that the United States led all regions with $475 million in outflows, followed by Canada at $109 million. Germany and Hong Kong recorded smaller outflows at $24 million and $19 million, respectively. In contrast, Switzerland and Brazil stood out as exceptions to the broader trend, bringing in net inflows of $39 million and $48.5 million, respectively. This divergence suggests that local factors or institutional strategies in those regions may be driving different investment behaviors. Altcoins Draw Selective Support While sentiment remained bearish for large-cap assets, some altcoins managed to attract capital inflows. Solana, Litecoin, and Polygon saw modest but notable gains of $2.7 million, $1.3 million, and $1 million, respectively. These inflows may reflect opportunistic positioning by investors seeking exposure to assets that have underperformed recently. Additionally, multi-asset investment products, which spread exposure across various cryptocurrencies, recorded $98 million in inflows. This signals that some investors are using recent price weaknesses to gain diversified access to the market rather than concentrating bets on single tokens. Related Reading: Still Sleeping On XRP? Analyst Says $8 Breakout Is ‘Just Waiting’ The continued divergence in fund flows highlights the complex sentiment currently influencing crypto markets. With macroeconomic uncertainty still dominating investor outlooks, digital asset markets remain reactive to both global monetary policy signals and evolving regional investment trends. Featured image created with DALL-E, Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "H100 Group Receives 144.8 BTC in Convertible Loan Deal",
      "link": "https://bitcoinmagazine.com/news/h100-group-receives-144-8-btc-in-convertible-loan-deal",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/H100-Group-Receives-144.8-BTC-in-Convertible-Loan-Deal-Now-Holds-169.2-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/h100-group-receives-144-8-btc-in-convertible-loan-deal\" rel=\"nofollow\"> </a></p> <p>H100 Group, Swedish health-tech firm, has received 144.8 BTC as part of a settlement tied to its convertible loan agreement, according to a company press release issued Monday. With this latest transaction, the Stockholm-based firm now holds a total of 169.2 BTC on its balance sheet. The 144.8 BTC was transferred as a part of [&#8230;]</p> <p>"
    },
    {
      "title": "Trump Media Files to Launch Bitcoin and Ethereum ETF",
      "link": "https://bitcoinmagazine.com/news/trump-media-files-to-launch-bitcoin-and-ethereum-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Trump-Media-Files-to-Launch-Bitcoin-and-Ethereum-ETF.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/trump-media-files-to-launch-bitcoin-and-ethereum-etf\" rel=\"nofollow\"> </a></p> <p>Trump Media &#38; Technology Group has filed a registration statement with the U.S. Securities and Exchange Commission to launch the Truth Social Bitcoin and Ethereum ETF, B.T. The ETF will directly hold Bitcoin and Ether, with an initial allocation of 75% Bitcoin and 25% Ether. Shares of the fund will be offered to investors to [&#8230;]</p> <p>"
    },
    {
      "title": "Michael Saylor and Pakistan’s Crypto Minister Bilal Talk Bitcoin and Global Investment",
      "link": "https://bitcoinmagazine.com/news/michael-saylor-and-pakistans-crypto-minister-bilal-talk-bitcoin-and-global-investment",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Michael-Saylor-and-Pakistans-Crypto-Minister-Bilal-Talk-Bitcoin-and-Global-Investment.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/michael-saylor-and-pakistans-crypto-minister-bilal-talk-bitcoin-and-global-investment\" rel=\"nofollow\"> </a></p> <p>Michael Saylor discussed how trust and leadership could attract global Bitcoin investments to Pakistan.</p> <p>"
    },
    {
      "title": "Senator Hagerty’s Vision Beyond The GENIUS Act: Make Tennessee A Hub For Bitcoin Mining",
      "link": "https://bitcoinmagazine.com/politics/senator-hagertys-vision-beyond-the-genius-act-make-tennessee-a-hub-for-bitcoin-mining",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Senator-Bill-Hagerty-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/senator-hagertys-vision-beyond-the-genius-act-make-tennessee-a-hub-for-bitcoin-mining\" rel=\"nofollow\"> </a></p> <p>While currently focused on stablecoin legislation, the Tennessee senator also has plans for Bitcoin mining and AI data centers in his home state.</p> <p>"
    },
    {
      "title": "Strategy Acquires 10,100 BTC, Surpasses 592,000 Bitcoin in Holdings",
      "link": "https://bitcoinmagazine.com/news/strategy-acquires-10100-btc-surpasses-592000-bitcoin-in-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Strategy-Acquires-10100-BTC-Surpasses-592000-Bitcoin-in-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/strategy-acquires-10100-btc-surpasses-592000-bitcoin-in-holdings\" rel=\"nofollow\"> </a></p> <p>Michael Saylor’s Strategy announces it has purchased an additional 10,100 BTC for approximately $1.05 billion, raising its total holdings to 592,100 BTC acquired at an average cost of $70,666 per Bitcoin. Strategy added another 10,100 Bitcoin to its treasury between June 9 and June 15, 2025, according to a Form 8-K filed Monday with the [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Eric Trump Denies Involvement in Tron Nasdaq Deal Despite Board Role",
      "link": "https://decrypt.co/325516/eric-trump-denies-involvement-tron-nasdaq-deal",
      "summary": "Eric Trump says he has no “public involvement\" in Tron’s reverse merger effort, despite sitting on the board of a bank brokering the deal."
    },
    {
      "title": "Solana-Based Pump.fun Among List of Crypto Trading Platforms Suspended from X",
      "link": "https://decrypt.co/325512/solana-pump-fun-crypto-trading-platforms-suspended-x",
      "summary": "Accounts linked to Pump.fun, GMGN and other Solana-based projects have been taken down without warning, triggering speculation as to why."
    },
    {
      "title": "Polymarket Odds on US Strike Against Iran Spike, Then Fall",
      "link": "https://decrypt.co/325506/polymarket-bets-on-us-strike-against-iran-spike-then-fall",
      "summary": "The conflict has sparked interest among punters, even as the odds of a U.S. strike against Iran on Polymarket fall."
    },
    {
      "title": "China’s $9 AI Video Tool Kling 2.1 Adds Audio—Can It Beat Google’s $250 Veo 3?",
      "link": "https://decrypt.co/325459/kling-ai-video-tool-audio-beat-googles-250-veo-3",
      "summary": "Kuaishou has rolled out synchronized sound effects for its video generator in a bid to challenge Google’s Veo3. But is it better?"
    },
    {
      "title": "Avalanche Launches Free Gaming 'Battle Pass' With AVAX and NFT Rewards",
      "link": "https://decrypt.co/325391/avalanche-launches-gaming-battle-pass-rewards",
      "summary": "The free Avalanche Battle Pass NFT, which can be minted at Magic Eden, provides token rewards to crypto gamers."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "SEC, Ripple ask court to delay appeal proceedings pending August 15 update",
      "link": "https://cryptobriefing.com/sec-ripple-settlement-delay-request/",
      "summary": "<p>The delay in appeal proceedings could signal a potential shift towards more collaborative resolutions in regulatory disputes within the crypto industry.</p> <p>"
    },
    {
      "title": "X accounts tied to Pump.fun, ElizaOS, and GMGN suspended",
      "link": "https://cryptobriefing.com/x-account-suspensions-pump-fun-elizaos/",
      "summary": "<p>The suspension of these accounts could disrupt upcoming projects and impact investor confidence in decentralized platforms.</p> <p>"
    },
    {
      "title": "JPMorgan files ‘JPMD’ trademark, hinting at possible stablecoin offering",
      "link": "https://cryptobriefing.com/jpmorgan-stablecoin-trademark-application/",
      "summary": "<p>JPMorgan's trademark move could accelerate mainstream adoption of digital currencies, influencing financial markets and regulatory landscapes.</p> <p>"
    },
    {
      "title": "Eric Trump says he loves Justin Sun but denies involvement in Tron’s public debut plan",
      "link": "https://cryptobriefing.com/eric-trump-tron-statement/",
      "summary": "<p>Eric Trump's denial of involvement in Tron's debut highlights potential complexities in crypto market entries and the influence of high-profile endorsements.</p> <p>"
    },
    {
      "title": "SEC formally accepts Trump Media’s Bitcoin spot ETF filing",
      "link": "https://cryptobriefing.com/sec-bitcoin-spot-etf-filing/",
      "summary": "<p>The SEC's review of Trump Media's Bitcoin ETF filing could influence future crypto investment products and regulatory approaches.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Top 12 staking platforms of June 2025",
      "link": "https://ambcrypto.com/top-12-staking-platforms-of-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/shubham-dhage-rzqjQjGvOBQ-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Staking is the system of earning rewards and interest by the process of holding or [&#8230;]"
    },
    {
      "title": "Are short-term whales quietly exiting as PEPE tests its critical support?",
      "link": "https://ambcrypto.com/are-short-term-whales-quietly-exiting-as-pepe-tests-its-critical-support/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-9.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Are whales beginning to exit as PEPE stalls below range highs?"
    },
    {
      "title": "SharpLink’s $463M Ethereum bet – Is it a sign of things to come?",
      "link": "https://ambcrypto.com/sharplinks-463m-ethereum-bet-is-it-a-sign-of-things-to-come/",
      "summary": "<img alt=\"SharpLink&#039;s $463M Ethereum bet - Is it a sign of things to come?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_46_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Institutional interest in Ethereum has been rising, mirroring Bitcoin’s early adoption phase."
    },
    {
      "title": "Fartcoin’s breakout odds – Will the third time be different for the memecoin?",
      "link": "https://ambcrypto.com/fartcoins-breakout-odds-will-the-third-time-be-different-for-the-memecoin/",
      "summary": "<img alt=\"Fartcoin&#039;s breakout odds - Will the third time be different for the memecoin?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Fartcoin-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Lack of heavy buying pressure behind Fartcoin means the memecoin could struggle to break the range formation."
    },
    {
      "title": "Bitcoin – What this ‘new historical low’ means for BTC’s price action",
      "link": "https://ambcrypto.com/bitcoin-what-this-new-historical-low-means-for-btcs-price-action/",
      "summary": "<img alt=\"Bitcoin - What this &#039;new historical low&#039; means for BTC&#039;s price action\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-24.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin's short-term movement has been pretty interesting lately."
    }
  ]
}