{
  "CoinDesk": [
    {
      "title": "Coinbase Comes Full Circle, Soars to Highest Price Since 2021 Nasdaq Debut",
      "link": "https://www.coindesk.com/markets/2025/06/26/coinbase-comes-full-circle-soars-to-highest-price-since-2021-nasdaq-debut",
      "summary": ""
    },
    {
      "title": "Bitcoin Holds Above $107K Ahead of Friday’s Big Options Expiry With $102K Max Pain Price",
      "link": "https://www.coindesk.com/markets/2025/06/26/btc-holds-above-107k-ahead-of-fridays-big-options-expiry-with-102k-max-pain-price",
      "summary": ""
    },
    {
      "title": "Lingerie Fighting Championships to Add $2M in Bitcoin to Treasury Ahead of Expansion to UK",
      "link": "https://www.coindesk.com/markets/2025/06/26/lingerie-fighting-championships-to-add-2m-in-bitcoin-to-treasury-ahead-of-expansion-to-uk",
      "summary": ""
    },
    {
      "title": "Core Scientific Soars 25% as WSJ Reports Buyout Talks With CoreWeave",
      "link": "https://www.coindesk.com/markets/2025/06/26/coreweave-back-in-talks-to-acquire-bitcoin-miner-core-scientific-wsj",
      "summary": ""
    },
    {
      "title": "NY Judge Slaps Down SEC, Ripple’s Second Request for an Indicative Ruling on Proposed $50M Settlement",
      "link": "https://www.coindesk.com/policy/2025/06/26/ny-judge-slaps-down-sec-ripple-s-second-request-for-an-indicative-ruling-on-proposed-usd50m-settlement",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "3 reasons why Bitcoin price could fall below $100,000",
      "link": "https://cointelegraph.com/news/3-reasons-why-bitcoin-price-could-fall-below-100-000?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzJjZWEtZDJmZS03MTE2LWE5NzEtMGM3YTRiYTRiY2M2.jpg\" /></p><p>Mounting macroeconomic risks, declining Bitcoin miner revenues, and cautious sentiment among investors could trigger a sharp BTC price correction.</p>"
    },
    {
      "title": "Banking Committee chair sets September goal for market structure bill",
      "link": "https://cointelegraph.com/news/senate-banking-committee-tim-scott-market-structure?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MmZkOTUtMzY5Zi03MmUwLTg0OGMtYjFhMTFhNDcxM2Iy.jpg\" /></p><p>After passing the GENIUS stablecoin bill, Republican leadership on the Senate Banking Committee has turned its sights to digital asset market structure.</p>"
    },
    {
      "title": "Bitwise adds in-kind redemptions to DOGE, APT ETF filings",
      "link": "https://cointelegraph.com/news/bitwise-adds-in-kind-redemptions-doge-apt-etf-filings?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FlM2EtMDdlZC03MmRjLTk3ZTMtODE2MTU3ZjY1MDE4.jpg\" /></p><p>Over 70 crypto exchange-traded funds are awaiting review from the United States Securities and Exchange Commission.</p>"
    },
    {
      "title": "Meta hires former OpenAI top talent amid AGI push",
      "link": "https://cointelegraph.com/news/meta-hires-former-openai-top-talent-agi-push?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzBmM2UtMzc2Zi03MzM5LTgwNGYtNWJkOTg3Y2NjNjEw.jpg\" /></p><p>Meta's latest AI hire follows several developments and partnerships aimed at making the tech giant a leader in the burgeoning sector.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "USDT on TRON Surpasses $80 Billion, Strengthening TRON’s Position as the Leading Stablecoin Network",
      "link": "https://cryptoslate.com/usdt-on-tron-surpasses-80-billion-strengthening-trons-position-as-the-leading-stablecoin-network/",
      "summary": "<p>June 26, 2025 &#8211; Geneva, Switzerland &#8211; TRON DAO announced today that the total circulating supply of USDT on the TRON blockchain has exceeded $80 billion, further cementing TRON’s position as the top blockchain for USDT activity. With USDT holding more than 63 percent of the global stablecoin market and surpassing 155 billion dollars in [&#8230;]</p> <p>"
    },
    {
      "title": "Dinari wins broker-dealer license to roll out tokenized stocks across US platforms",
      "link": "https://cryptoslate.com/dinari-wins-broker-dealer-license-to-roll-out-tokenized-stocks-across-us-platforms/",
      "summary": "<p>Dinari secured a US broker-dealer registration for its subsidiary, becoming the first platform cleared to offer blockchain-based shares of publicly traded companies to domestic investors, Reuters reported on June 26. The San Francisco firm stated that it will activate the licensed entity during the next quarter, following completion of onboarding with the Securities and Exchange [&#8230;]</p> <p>"
    },
    {
      "title": "Former Tether, Hut 8, Blackstone execs to launch $1B crypto treasury firm",
      "link": "https://cryptoslate.com/former-tether-hut-8-blackstone-execs-to-launch-1b-crypto-treasury-firm/",
      "summary": "<p>A group of high-profile financial executives, including former Blackstone dealmaker Chinh Chu and Tether co-founder Reeve Collins, are seeking to raise $1 billion to launch what could become the first publicly traded crypto treasury firm with a diversified portfolio, Bloomberg News reported on June 25, citing people familiar with the matter. The effort is being [&#8230;]</p> <p>"
    },
    {
      "title": "CoreWeave revives bid for Core Scientific causing shares to surge 33%",
      "link": "https://cryptoslate.com/coreweave-revives-bid-for-core-scientific-causing-shares-to-surge-33/",
      "summary": "<p>CoreWeave is negotiating to acquire Bitcoin (BTC) miner-turned-compute host Core Scientific, the Wall Street Journal reported on June 26, citing people familiar with the matter. The cloud infrastructure company attempted to acquire the miner for $5.75 per share in June 2024 but withdrew after Core Scientific’s board deemed the price inadequate. Core Scientific and CoreWeave [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin stays confined to $100k–$110k band as realized profit and network activity recede",
      "link": "https://cryptoslate.com/bitcoin-stays-confined-to-100k-110k-band-as-realized-profit-and-network-activity-recede/",
      "summary": "<p>Bitcoin (BTC) has traded between $100,000 and $110,000 for a seventh consecutive week due to slower profit realization, cooling transfer volume, and a cautious derivatives backdrop, according to a June 26 Glassnode report. The report cited the market&#8217;s struggles to extend May&#8217;s all-time high rally, with the 30-day realized profit gauge peaking in early May, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Silent Accumulation: A Falling Wedge On The Verge Of Explosion",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-falling-wedge-explosion/",
      "summary": "After months of muted price action, XRP appears to be quietly building pressure within a textbook falling wedge formation. With over seven months of consolidation and recent price activity pressing up against the wedge’s resistance, subtle bullish signs are beginning to emerge. As momentum coils tighter, this silent accumulation phase could be setting the stage for a significant breakout. XRP Chart Indicators Echo Uncertainty In a recent X post, GemXBT highlighted that XRP is currently exhibiting a sideways market structure. The price has been hovering around the $2.19 mark, showing signs of consolidation rather than a clear trend. This range-bound movement suggests that neither bulls nor bears are in control at the moment. Related Reading: Expert Charts 1,400% Course To $7.5 For XRP Price As RSI Falls To All-Time Low GemXBT further pointed out that the short-term moving averages — specifically the 5MA, 10MA, and 20MA- are beginning to converge. This alignment typically signals market indecision, and when combined with a neutral RSI reading near 50, it reinforces the lack of directional bias. Such conditions often precede a significant price move, though the direction remains uncertain. Adding to the neutral outlook, GemXBT noted that the MACD is flat, reflecting a lack of momentum in either direction. Volume is also relatively low, suggesting reduced trader participation and a possible wait-and-see approach by the market. This quiet environment could persist until a breakout or breakdown confirms the next move for XRP. A Bullish Break May Be Brewing According to XRPunkie in a post on X, XRP has been stuck in a falling wedge structure on the weekly chart for the past seven months. This prolonged consolidation phase reflects a period of tight price movement, with XRP gradually coiling within narrowing boundaries. Such a pattern often signals a potential breakout in the making, especially when observed over an extended timeframe. Related Reading: Ripple Plans To Take 14% Of SWIFT Volume, USDC Lands On XRPL – What Does This Mean For XRP Price? XRPunkie further highlighted that the past seven weeks of price action have occurred just beneath the wedge’s resistance line. This consistent pressure near resistance indicates growing strength on the buyers’ side. Additionally, XRP has formed a hidden bullish divergence, a signal that often hints at a continuation of the prevailing trend, in this case, pointing toward a possible upward move. The analyst emphasized that repeated testing of a resistance zone tends to weaken it over time. With XRP continuously knocking on the upper boundary of the wedge, XRPunkie believes a breakout may be imminent. He concluded with a clear stance: “Overall Bullish Soon,” suggesting that market conditions could soon favor the bulls if current momentum holds. At the time of writing, XRP was trading at $2.17 with a $128.61 billion market capitalization and $2.59 billion in 24-hour trading volume, reflecting ongoing consolidation in the market. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "A Tale Of 3 Mayors And Bitcoin’s Climb From $754 To $107,000",
      "link": "https://www.newsbtc.com/news/bitcoin/a-tale-of-3-mayors-and-bitcoins-jump-from-754-to-107k/",
      "summary": "According to Bitwise’s Jeff Park, Bitcoin has gone from a risky experiment to a six-figure asset over three New York mayoral terms. Related Reading: Bunker Buster: Ethereum Titans Stake $100 Million Amid US-Iran Hostilities It started near $754 when Michael Bloomberg left office in December 2013. Now, as the city prepares for its next election, it’s trading above $107,000. These numbers show a rise of about 14,590% in just over a decade. Mayoral Timeline Marks Bitcoin Growth Bill de Blasio took over in January 2014. At first, Bitcoin barely budged. But by December 2021, it hit roughly $47,000. That climb happened while de Blasio’s two terms played out on City Hall’s stage. The crypto market had its ups and downs, yet the overall trend pointed skyward under his watch. Worth noting that in the time it took New York to go from Bloomberg to Mamdani, Bitcoin soared from $754 to $106,000+ today. You may not see nor believe it right away, but this is actually not a coincidence. Separate money from state. — Jeff Park (@dgt10011) June 25, 2025 Bitcoin’s Surge Through Political Change When Eric Adams stepped in as mayor in January 2022, he made headlines by taking his first paychecks in Bitcoin. The move sent a clear message that New York was open to crypto. The market then endured a tough 2022 bear phase. Still, Bitcoin bounced back strong in 2023 and kept going. This month, it’s up about 3% and sits at $107,567, according to figures by Coingecko. Separate Money From State Park used the mayor count as a storytelling tool. He’s calling for a break between money and government. His view: people should choose how they handle their own cash. Political shifts come and go, but Bitcoin keeps growing on its own terms. That steady rise speaks to the idea of financial freedom outside state control. New Leadership And Future Trends Zohran Mamdani has surged ahead in the Democratic primary after Adams declared an Independent bid. Since Democrats usually win in New York, many see Mamdani as the likely next mayor. Related Reading: Double Win: Dogwifhat Jumps 24% Alongside Bitcoin’s $107K Push Park even joked that Bitcoin’s journey has moved “from Bloomberg to Mamdani.” That line underlines how the asset climbed, even as the city’s politics reshuffled itself. It’s easy to draw lines between mayoral posters and price charts. But Bitcoin’s real drivers go beyond City Hall. Global demand, big investors, shifts in mining, and moves by the Federal Reserve have all shaped its path. New York’s mayors provide handy markers on the timeline, not the engine of growth. On Crypto &#38; Politics As New York eyes November 2025, Bitcoin stands as proof that financial tools can live beyond politics. The question now isn’t whether the next mayor will back crypto. It’s how far Bitcoin will go when its story isn’t tied to any single office. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Ethereum Fakes Out Bears – Altcoin Rally Depends On Key Level Breakout",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-fakes-out-bears-altcoin-rally-depends-on-key-level-breakout/",
      "summary": "Ethereum is back in focus after reclaiming the critical $2,444 resistance, following a sharp recovery from its breakdown below the $2,200 mark. The move has revived bullish sentiment, with many analysts calling for Ethereum to lead the long-anticipated altseason. The swift rebound caught traders off guard, reinforcing the view that the recent drop was nothing more than a fakeout. Related Reading: Ethereum Gears Up For Breakout Above $2,800 – Bullish Momentum Builds Top analyst M-log1 commented on the reversal, stating that ETH is back in range. His analysis points to the idea that Ethereum’s price action has successfully shaken out weak hands while setting the stage for a bullish continuation. If momentum holds, ETH could attempt a move toward the higher range around $2,600–$2,800, a zone that has consistently acted as a battleground in previous cycles. Ethereum’s role as the leading altcoin makes its performance critical for broader market direction. A confirmed breakout here could trigger renewed confidence across the altcoin market and open the door for the long-awaited altseason. For now, bulls are in control—but Ethereum must hold current levels and push higher to keep the momentum alive and avoid another retracement into bearish territory. Ethereum Holds the Line: The Key to Unlocking Altseason? Ethereum surged following the announcement of a ceasefire between Israel and Iran, easing geopolitical tensions and triggering a sharp rebound across the crypto market. ETH, which had briefly broken down below the $2,200 mark, has since reclaimed key resistance near $2,444—indicating growing strength among bulls. While buyers initially lost control during the wave of uncertainty, they are now regaining momentum as the entire market braces for the next decisive move. Despite rising optimism, the macroeconomic backdrop remains fragile. Recession fears in the U.S. continue to build as leading indicators flash warning signs, and tightening global financial conditions may pressure risk assets in the coming months. Yet in the crypto space, focus is shifting toward Ethereum’s performance as the likely spark for the long-awaited altseason. M-log1 shared his view, saying, “ETH is back in range. Nice fake out after all.” His technical analysis suggests that Ethereum has reentered its consolidation zone, a move that could signal strength if followed by continued upward momentum. “If we want alts to do well,” he added, “we want ETH to move towards the higher range here and break out as soon as Uncle Bitcoin makes a new ATH.” With Bitcoin hovering just 4% below its all-time high, Ethereum is now in a critical position. A sustained breakout from current levels could trigger renewed risk appetite across the altcoin market, creating the perfect setup for a rotation. For now, Ethereum is holding the line—but it must maintain this bullish structure and break above resistance to lead the next phase of growth. All eyes remain locked on ETH as it charts the course for what comes next. Related Reading: Chainlink Reclaims Key Structure – Quiet Accumulation Could Fuel $25–$30 Surge ETH Regains Strength Near Key Resistance Levels Ethereum is showing signs of renewed momentum, trading at $2,451 after bouncing back strongly from a brief breakdown below the $2,200 level. The chart shows ETH has reclaimed the short-term descending trendline and is now testing major moving averages, with the 50-day SMA at $2,254, the 100-day at $2,639, and the 200-day just overhead at $2,780. This confluence of resistance above makes the $2,500–$2,800 zone a key battleground. Volume appears to be picking up alongside the price, signaling increased interest as ETH reclaims structure. This rally was partly fueled by the broader market response to geopolitical easing in the Middle East, but the technical setup now holds independent bullish potential. The recent price action forms what could be a classic “fakeout” and re-entry into range — a pattern that often precedes strong breakouts. To confirm a trend reversal, Ethereum needs to push and hold above the $2,650–$2,800 resistance band. Related Reading: Ethereum Whale Loads Up: $422M In ETH Bought In Under a Month If bulls can sustain this pressure, a run toward the March highs near $3,200 becomes increasingly likely. However, failure to build momentum here could see ETH range-bound or even revisit support near $2,200. For now, the trend is shifting in the bulls’ favor, with a breakout scenario back on the table. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Ethereum Not Out Of The Woods Yet: Why Another 30% Crash To $1,800 Is Coming",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-30-crash-to-1800/",
      "summary": "Crypto analyst Crypto Wave has indicated that Ethereum could witness another significant price crash, presenting a bearish outlook for the altcoin. This price crash is expected to mark Wave C of a corrective move, with ETH dropping to as low as $1,800. Why Ethereum Could Still Drop To As Low As $1,800 In an X post, Crypto Wave declared that the primary expectation remains that Ethereum will see one more leg down in wave c of wave 2, targeting the zone between $1,950 and $1,700. Specifically, his accompanying chart showed that the largest altcoin by market cap could drop to around $1,800. Related Reading: Ethereum Price Crash To $2,100 Triggers Fear, But Why Are Analysts Predicting A Rally To $6,000? The crypto analyst revealed that Ethereum has already hit the 0.5 fib retracement at $2,100, which is the minimum target for a Wave 2 correction. However, structurally, he claimed that this drop still looks like wave A only. Crypto Wave further explained that these ABC corrections are always three-part moves, and that is what he sees forming now for ETH. The broader crypto market, led by Bitcoin, has bounced back following the ceasefire between Israel and Iran. Ethereum has also rebounded, having dropped to as low as $2,100 last week. However, Crypto Wave suggested that the current market sentiment doesn’t invalidate this bearish setup for ETH and that it could still witness a deeper sell-off. The crypto analyst alluded to the fourth quarter of last year when Ethereum was underperforming heavily while many altcoins rallied. In line with this, he remarked that there could be a repeat of this scenario. However, on the other hand, Crypto Wave claimed that if ETH breaks above $2,880 impulsively, especially in one clean wave, then the correction could be over. He added that this would also put the altcoin in the early stages of a new bull cycle. 2021 Pattern Playing Out For ETH In an X post, crypto analyst Merlijn drew similarities between the current Ethereum price action and that of 2021. He stated that the 2021 playbook is repeating, with ETH having a dead count bounce, then a final retest before the parabolic leg. The analyst expects the altcoin to retest the $2,000 level before the massive move to the upside. Related Reading: Market Expert Who Predicted Ethereum Price Crash At $2,800 Reveals What’s Coming Next His accompanying chart showed that Ethereum could rally to as high as $11,000 on this uptrend. Merlijn had remarked that ETH has more firepower this time around than in 2021, which is why the altcoin could witness such a parabolic move to the upside. Interestingly, based on the chart, this rally is expected to happen between now and year-end. At the time of writing, the Ethereum price is trading at around $2,480, up over 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "XRP Gears Up For Major Move — Chart Signals Are Clear",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-gears-up-for-major-move-chart-signals-are-clear/",
      "summary": "XRP is showing all the signs of a move brewing, and the chart doesn&#8217;t lie. After a period of consolidation, price action is tightening, and technical indicators are flashing signals of an impending move. Whether it&#8217;s a surge to the upside or a sharp reversal, the setup is in place, and momentum is building. XRP looks loaded and ready to make its next move. Volume Remains Subdued — Calm Before The Storm? XRP price remains trapped inside a long-standing triangle, a pattern known for building pressure before sharp directional moves. The chart shows that sellers continue to push lower highs, compressing price action toward a support level. Related Reading: XRP Price Trades Sideways — Bulls Preparing for Next Push? Parshwa Turakhiya pointed out on X that the Exponential Moving Average (EMA) cluster between $2.17 and $2.23 is the key breakout zone capping any upward momentum. A clean break above this range could trigger a bullish reversal. On the other hand, $2.09 is the last line of defense for the bulls. If this level fails, the structure breaks down, and XRP could swiftly drop to $1.85. Despite the building tension, the Relative Strength Index (RSI) remains neutral, which Parshwa Turakhiya describes as &#8220;the calm before the volatility storm.&#8221; The chart structure suggests that a move is imminent. With early July just ahead, Parshwa Turakhiya warns that a breakout or breakdown is coming, and it won&#8217;t be subtle. XRP is on the edge of eruption. Fabio Zuccara stated that Dr. Profit, known for his sharp and historically accurate calls on XRP at $0.15, $0.38, and $0.50, has now projected a new mid-term target of $4.00. In a weekly chart shared via social media, XRP is forming a bullish structure, with a green arrow projecting a continuation move to the upside. Zuccara outlined a crucial level for maintaining the bullish trajectory. This rebound adds strength to the outlook, suggesting that momentum is building in favor of the bulls. In the same vein, SquirtleCharts revealed that XRP&#8217;s 4-hour chart has mapped out a precise path toward $3.00 target, with several resistance levels standing in the way, and each level varies in difficulty. The first is $2.22, the easy one, a weak resistance point that XRP could clear without much effort. Next is $2.33, which SquirtleCharts labels as &#8220;a lot harder,&#8221; signaling a barrier that may require volume and conviction to break. The $2.48 level is &#8220;not too bad,&#8221; a moderate resistance area that might slow the rally but not be a roadblock. Finally, the $2.65 is the &#8220;pretty hard,&#8221; a zone where bulls may face challenges. Perfect Technical Structure Sets Stage For Explosive Breakout Massive move incoming for XRP. After a clean bounce off the $2.00 support level, the setup is aligning perfectly on the daily chart. Related Reading: XRP Pullback Nearly Complete—Next Stop: $8 To $12, Says Analyst Sara emphasizes that the chart structure looks flawless, with price action respecting critical zones and now coiling for an explosive breakout, with momentum building and bulls defending the support zone. The next target is $3.50; a breakout might happen fast. Featured image from Istock images, chart from tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Tahini’s Bitcoin Treasury: How a Family Chain Outsmarted Inflation",
      "link": "https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/tahini-bitcoin-2020-treasury-playbook.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation\" rel=\"nofollow\"> </a></p> <p>Tahini’s, a Canadian fast-casual chain, embraced Bitcoin in 2020, leveraging it to compete with giants like McDonald’s. Here’s their treasury playbook.</p> <p>"
    },
    {
      "title": "Coinbase to Launch US Nano Bitcoin Perpetual-Style Futures In July",
      "link": "https://bitcoinmagazine.com/news/coinbase-to-launch-us-nano-bitcoin-perpetual-style-futures-in-july",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-to-Launch-US-Nano-Bitcoin-Perpetual-Style-Futures-In-July.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-to-launch-us-nano-bitcoin-perpetual-style-futures-in-july\" rel=\"nofollow\"> </a></p> <p>Coinbase Derivatives to introduce long-dated, regulated futures contracts with 24/7 trading and spot price tracking.</p> <p>"
    },
    {
      "title": "Japan’s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC",
      "link": "https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Japans-Metaplanet-Acquires-1234-More-Bitcoin-Total-Holdings-Reach-12345-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc\" rel=\"nofollow\">Japan&#8217;s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC</a></p> <p>The Japanese company continues accelerating its Bitcoin treasury strategy with a ¥19.27 billion purchase.</p> <p>"
    },
    {
      "title": "Kraken Launches Krak, a No-Fee App to Use and Store Bitcoin and Crypto",
      "link": "https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Launches-Krak-a-No-Fee-App-to-Use-and-Store-Bitcoin-and-Crypto.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto\" rel=\"nofollow\"> </a></p> <p>Bitcoin and crypto platform Kraken has officially launched Krak, a no-fee, all-in-one global money app that lets users spend, send, and save across over 300 fiat and digital assets—including Bitcoin. Designed to merge the best of banking, payments, and crypto into a single user experience, the Krak app is set to redefine how people move [&#8230;]</p> <p>"
    },
    {
      "title": "Castle Raises $1M to Bring Automated Bitcoin Treasury to Small & Medium-Sized Businesses",
      "link": "https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Castle-Raises-1M-to-Bring-Automated-Bitcoin-Treasury-to-Small-Medium-Sized-Businesses-2.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses\" rel=\"nofollow\">Castle Raises $1M to Bring Automated Bitcoin Treasury to Small &amp; Medium-Sized Businesses</a></p> <p>Backed by Boost VC and Winklevoss Capital, Castle aims to help SMBs protect their balance sheets by automating bitcoin allocations.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Metaplanet Boosts Bitcoin Stash Above $1.3 Billion With 1,234 BTC Buy",
      "link": "https://decrypt.co/327272/metaplanet-boosts-bitcoin-stash-above-1-3-billion",
      "summary": "Japan's biggest publicly traded Bitcoin treasury company now holds 12,345 BTC, following its latest purchase of 1,234 BTC."
    },
    {
      "title": "Avalanche Crypto Game 'Raini: The Lords of Light' Is Shutting Down",
      "link": "https://decrypt.co/327281/avalanche-crypto-game-raini-lords-light-shutting-down",
      "summary": "Blockchain games are closing left and right, with Avalanche-based NFT card game Raini: The Lords of Light the latest to join the list."
    },
    {
      "title": "Myriad Moves: Will Trump Drop Another F-Bomb? Plus Predictions on Ethereum and Wimbledon",
      "link": "https://decrypt.co/327269/myriad-moves-trump-drop-f-bomb-predictions-ethereum-wimbledon",
      "summary": "Myriad Markets users are placing predictions on President Trump's language, whether Ethereum will rise or fall, and Wimbledon's winner."
    },
    {
      "title": "Bitcoin Headed for One of the Largest Options Expiries of the Year",
      "link": "https://decrypt.co/327260/bitcoin-one-of-largest-options-expiries",
      "summary": "Bitcoin faces one of its largest options expiries with $15 billion in contracts set to expire Friday as volatility hits multi-year lows."
    },
    {
      "title": "Tether, Blackstone Vets Raising $1 Billion for Public Bitcoin, Ethereum and Solana Treasury",
      "link": "https://decrypt.co/327249/tehter-blackstone-veterans-raising-1-billion-bitcoin-ethereum-solana-treasury",
      "summary": "Former Tether and Blackstone execs plan to build a publicly traded crypto treasury spanning Bitcoin, Ethereum, Solana, and more."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Crypto exchange Bakkt files to raise up to $1 billion to support Bitcoin strategy",
      "link": "https://cryptobriefing.com/bakkt-bitcoin-strategy-funding/",
      "summary": "<p>Bakkt's fundraising could accelerate its shift towards crypto infrastructure, potentially influencing market dynamics and digital asset adoption.</p> <p>"
    },
    {
      "title": "US Treasury may release federal Bitcoin holdings report, says Bo Hines",
      "link": "https://cryptobriefing.com/us-bitcoin-holdings-treasury-report/",
      "summary": "<p>The potential release of the US Bitcoin holdings report could enhance transparency, influencing global crypto market dynamics and policy debates.</p> <p>"
    },
    {
      "title": "USDT on TRON surpasses $80 billion, strengthening TRON’s position as the leading stablecoin network",
      "link": "https://cryptobriefing.com/usdt-on-tron-stablecoin-leader/",
      "summary": "<p>USDT on TRON exceeds $80 billion in circulation, accounting for over half of global supply and leading active stablecoin network metrics.</p> <p>"
    },
    {
      "title": "Court rejects Ripple and SEC bid to slash $125M penalty and lift injunction on XRP sales to institutions",
      "link": "https://cryptobriefing.com/ripple-sec-penalty-court-decision/",
      "summary": "<p>The court's decision underscores the ongoing regulatory challenges and legal scrutiny facing the cryptocurrency industry.</p> <p>"
    },
    {
      "title": "Galaxy Digital secures $175 million for first venture fund to back early-stage crypto startups",
      "link": "https://cryptobriefing.com/early-stage-crypto-startups-fund/",
      "summary": "<p>Galaxy Digital's venture fund expansion could accelerate innovation in crypto, bridging traditional finance and blockchain, impacting global markets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin could hit a new ATH in Q3, but mid-term caution persists",
      "link": "https://ambcrypto.com/bitcoin-could-hit-a-new-ath-in-q3-but-mid-term-caution-persists/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoinsummer.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can BTC explode to a new ATH and shun historical weak summer returns?"
    },
    {
      "title": "Jupiter breaks trading volume record on Solana – Impact on SOL?",
      "link": "https://ambcrypto.com/jupiter-breaks-trading-volume-record-on-solana-impact-on-sol/",
      "summary": "<img alt=\"SOL\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_55_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Jupiter Exchange outpaces rivals, Solana could be next as its network activity skyrockets."
    },
    {
      "title": "Trump-linked WLFI token may soon be tradable after surprise reversal",
      "link": "https://ambcrypto.com/trump-linked-wlfi-token-may-soon-be-tradable-after-surprise-reversal/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-13-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />USD1 holds its peg as audit looms. WLFI announces trading, and institutional eyes are watching."
    },
    {
      "title": "Bitcoin: Analyst eyes 3 historical patterns for $160K rally",
      "link": "https://ambcrypto.com/bitcoin-analyst-eyes-3-historical-patterns-for-160k-rally/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-15-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will Bitcoin bulls use this ammo to punch through the $110K wall?"
    },
    {
      "title": "Metaplanet dethrones Tesla with 12,345 Bitcoin – ‘This is huge!’",
      "link": "https://ambcrypto.com/metaplanet-dethrones-tesla-with-12345-btc-this-is-huge/",
      "summary": "<img alt=\"Metaplanet dethrones Tesla with 12,345 BTC - &#039;This is huge!&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"745\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Metaplanet-overtakes-Tesla.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1324\" />The purchase was part of Metaplanet’s broader crypto strategy announced through its “555 Million Plan.\""
    }
  ]
}