{
  "CoinDesk": [
    {
      "title": "Bitcoin Holds Above $105K Despite Donald Trump’s Threats Against Elon Musk",
      "link": "https://www.coindesk.com/markets/2025/06/07/bitcoin-holds-above-usd105k-despite-donald-trump-s-threats-against-elon-musk",
      "summary": ""
    },
    {
      "title": "Ether Holds Steady Above $2,500 as ETF Demand Signals Institutional Confidence",
      "link": "https://www.coindesk.com/markets/2025/06/07/ether-holds-steady-above-usd2-500-as-etf-demand-signals-institutional-confidence",
      "summary": ""
    },
    {
      "title": "Coinbase, BiT Global End Legal Fight Over WBTC Delisting",
      "link": "https://www.coindesk.com/policy/2025/06/07/coinbase-bit-global-end-legal-fight-over-wbtc-delisting",
      "summary": ""
    },
    {
      "title": "Solana 's SOL Rebounds as Buyers Step In Above $147",
      "link": "https://www.coindesk.com/markets/2025/06/07/solana-s-sol-rebounds-from-usd147-support-as-double-bottom-pattern-signals-possible-breakout",
      "summary": ""
    },
    {
      "title": "Deutsche Bank Considers Stablecoin or Joining Industry-Led Initiative, Exec Says",
      "link": "https://www.coindesk.com/business/2025/06/07/deutsche-bank-considers-stablecoin-or-joining-industry-led-initiative-exec-says",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Tether CEO snubs IPO, says $515B valuation is &#039;a bit bearish’",
      "link": "https://cointelegraph.com/news/tether-ceo-paolo-ardoino-no-public-plans-bearish-valuation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDcyNmQtNDA5NS03NjJkLWI2ZmItYWQ1Nzg5NTU4YmRm.jpg\" /></p><p>Tether’s CEO points to the company’s growing Bitcoin and gold treasury as a reason why a speculative $515 billion valuation might actually be “a bit bearish.”</p>"
    },
    {
      "title": "Bitcoin core devs&#039; joint statement sparks heated debate among Bitcoiners",
      "link": "https://cointelegraph.com/news/bitcoiners-debate-bitcoin-core-developers-use-cases-transaction-relay?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjNlZTYtNDMxOS03OGM4LWJlY2QtZDg0OGM1NjRkNWFk.jpg\" /></p><p>The Bitcoin community is divided after core developers released a joint statement on transaction relay policy and use cases amid the ongoing OP_Return debate.</p>"
    },
    {
      "title": "Is a Bitcoin price rally to $150K possible by year&#039;s end?",
      "link": "https://cointelegraph.com/news/is-bitcoin-price-rally-to-150k-possible-by-year-end?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ5YWMtNjI2ZS03OGJjLWJkZGMtZTI4YjZlMGE3M2Ri.jpg\" /></p><p>A bearish RSI divergence, similar to 2021, suggests Bitcoin could face a 50%+ correction toward $64,000, challenging the $150K year-end target.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Bitcoin DeFi platform Alex Protocol loses $8.3M to exploit",
      "link": "https://cointelegraph.com/news/bitcoin-defi-platform-alex-protocol-loses-8-3m-to-exploit?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzRhMTMtYjJlZC03ZWU0LWE5NDktNGQxODFmOTRhZDNj.jpg\" /></p><p>Alex Lab Foundation said it will fully reimburse users affected by the $8.3 million exploit, with compensation issued in USDC following a structured claims process.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "The ‘Bitcoin Family’ has split and hidden seed phrase across 4 continents amid rising kidnappings",
      "link": "https://cryptoslate.com/the-bitcoin-family-has-split-and-hidden-seed-phrase-across-4-continents-amid-rising-kidnappings/",
      "summary": "<p>The ‘Bitcoin Family’ has completely overhauled its security measures amid rising cases of crypto-related kidnappings, according to a CNBC report. The family, which sold all their belongings in 2017 to invest in Bitcoin (BTC) and now travels around the world, has taken extreme measures amid a rise in perceived threats. This includes storing parts of [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase CEO says unnecessary account restrictions has reduced by 82%",
      "link": "https://cryptoslate.com/coinbase-ceo-says-unnecessary-account-restrictions-has-reduced-by-82/",
      "summary": "<p>Brian Armstrong, CEO of Coinbase, said in an X post on Friday that the platform has reduced the issue of unnecessary account freezes and restrictions by 82% so far. Noting that unnecessary account freezing has been a “major issue” for Coinbase users “for longer than is acceptable,” he wrote: “I could list a bunch of [&#8230;]</p> <p>"
    },
    {
      "title": "The future of crypto belongs to communities—treasury governance will get us there",
      "link": "https://cryptoslate.com/the-future-of-crypto-belongs-to-communities-treasury-governance-will-get-us-there/",
      "summary": "<p>The following is a guest post and analysis from Maarten Henskens, Head of Astar Foundation. Web3 has a problem with value capture. Despite billions in market capitalization, most projects continue to extract value from their communities rather than return it. While venture capitalists and founding teams reap substantial rewards through token sales and vesting schedules, [&#8230;]</p> <p>"
    },
    {
      "title": "Your weather app can’t save you — but a new system might",
      "link": "https://cryptoslate.com/your-weather-app-cant-save-you-but-a-new-system-might/",
      "summary": "<p>The following article is a guest post and opinion of Ting Peng, Head of Ecosystem at SkyX Network. What do you do when the weather app says light rain, but a flash flood tears through your town instead? You blame the app. Your rightful ire is a bit misplaced, though: It could very much be the [&#8230;]</p> <p>"
    },
    {
      "title": "Song A Day creator recounts ‘tax nightmare’ after making millions from NFT sale",
      "link": "https://cryptoslate.com/song-a-day-creator-recounts-tax-nightmare-after-making-millions-from-nft-sale/",
      "summary": "<p>Singer-songwriter Jonathan Mann recently shared the story of how earning millions in Ethereum (ETH) during a one-hour sale of his NFTs eventually became a &#8220;tax nightmare.&#8221; Mann has published one song a day over the past 17 years and released his 6,000th song on June 5, which was about the purported nightmare resulting from the [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Stabilizes At $104,000 Mid-Range As Market Eyes Next Breakout",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-stabilizes-at-104000-mid-range-as-market-eyes-next-breakout/",
      "summary": "Bitcoin saw a sharp price dip on Thursday amidst a public fallout between US President Donald Trump and the world&#8217;s richest man Elon Musk. The premier cryptocurrency, which had traded steadily within the $104,000–$106,000 range throughout the week, plunged to below $101,000 as tensions escalated between the two influential figures who attacked each other via their personally owned social media platforms i.e. X (formerly Twitter) and Truth Social. Since then, Bitcoin has shown some market resilience climbing back to around $104,000. With another consolidation developing, market analyst Crypto Daan has highlighted the price levels that are critical to the next price breakout. Related Reading: Bitcoin Sees Largest Net Taker Volume Drop Of 2025 – Traders React To Trump-Elon Clash Beyond $106K Or Below $100K &#8211; What’s Next For Bitcoin? The month of May proved largely bullish for Bitcoin as the digital asset surged from around $95,000 to establish a new all-time high near $112,000 marking the resumption of the larger crypto bull market. However, Bitcoin has noted a significant price correction since reaching this peak with market prices pegged around $104,000 on May 31. As seen in the first week of June, Bitcoin had hovered around $106,000 before its most recent price slump on Thursday. Due to this price action, Daan Crypto notes the digital asset is now trading within a price range of $100,000-$106,000, where it comfortably sits at the mid-range around $104,000. The analyst notes that if Bitcoin returns break below the lower range boundary at $100,000, the ongoing price correction could extend for 1-2 weeks. Going by BTC’s stairwell ascent in the past month, potential market support in such a bearish case would lie around $95,000 and $85,000. On the other hand, if the market bulls can force a return above the monthly high of $106,000, Daan Crypto explains that such development would indicate the market correction is over, and Bitcoin may be headed for another price discovery with potential initial targets of around $120,000. Related Reading: XRP Wave Structure Predicts Wild Fluctuations On Its Way To $4 ATH BTC Price Overview At the time of writing, Bitcoin trades at $104,650 following a price gain of 2.98% in the past day. Using larger time frames , the premier cryptocurrency is up by 1.12% on its weekly chart and 7.49% on the monthly chart indicating a strong bullish control of the market. Interestingly, the Relative Strength Index on the daily chart stands at 51.53 facing upward which supports the notion that Bitcoin’s correction might be over with price eyeing a return to the overbought zone above 70. With a market cap of $2.07 trillion, Bitcoin continues to rank as the world’s largest cryptocurrency and fifth largest asset in the world. Featured image from Pexels, chart from Tradingview"
    },
    {
      "title": "Chainlink Bullish Signal Stands Firm, But Bitcoin Is Calling The Shots",
      "link": "https://www.newsbtc.com/news/chainlink/chainlink-bullish-signal-holds/",
      "summary": "CRYPTOWZRD noted in a recent update on X that Chainlink ended the session with a bullish close, hinting at potential further gains ahead. However, the analyst emphasized that Bitcoin will ultimately dictate the move. Keeping a close eye on the intraday chart, the expert mentioned that an early pullback could present a scalp opportunity, as long as Bitcoin aligns with the bullish outlook. Breakout Likely With Strong Daily Candles Breaking down his latest analysis, the trader explained that LINK’s daily candle officially closed bullish, marking a key technical point in the current trend. Meanwhile, LINKBTC ended the session on a positive note, which adds weight to the bullish outlook for LINK in the short term. Related Reading: Chainlink Struggles At Key Resistance Level – $10 Support Back In Focus However, the analyst emphasized that more bullish daily closes on LINKBTC are needed to confirm momentum. A continuation of strength could lead to an impulsive breakout above the daily candle’s lower high trendline, igniting the next leg upward. A decisive move above the 0.000140 BTC resistance zone is expected to accelerate price action for LINK, giving bulls a clear signal to push higher. If momentum continues to build, LINK could rally toward the $16 resistance level, marking a major target for the current setup. For now, $12.50 remains a key support level on the daily timeframe and will act as a cushion if bearish pressure reemerges. Looking ahead, the analyst pointed out that Bitcoin and Bitcoin Dominance will remain the primary market drivers for Chainlink heading into the weekend. While maintaining a rational outlook, CRYPTOWZRD plans to monitor LINK’s intraday chart closely for any developing setups. Awaiting Chainlink Next Trade Setup In conclusion, CRYPTOWZRD emphasized that LINK’s intraday chart is showing signs of a bullish recovery, closely aligned with Bitcoin’s recent rebound. He expressed optimism that further upside is likely if current conditions persist, particularly if Bitcoin maintains its strength. Related Reading: Chainlink Holds Strong At $15.29 Support – Is A New Breakout Imminent? Despite the encouraging signs, CRYPTOWZRD noted that a temporary bearish pullback would be both natural and healthy within the current market context. Pullbacks often reset market conditions, providing better structure for stronger continuation patterns. He believes such a retracement could offer a favorable early entry point for long positions, especially for short-term or intraday traders looking to capitalize on the volatility. As the market continues to evolve, CRYPTOWZRD advises traders to wait for clear confirmation of the next trade setup before taking action. His statement emphasized that strategic patience will be key in identifying the most rewarding opportunities. For now, traders should track price behavior closely and prepare to act swiftly when the next valid entry signal presents itself. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Historical Data Points To Imminent 62% Price Surge – Analyst",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-historical-data-points-to-imminent-62-price-surge-analyst/",
      "summary": "The Bitcoin market was recently subject to a significant price dip as a public feud between US President Donald Trump and the world&#8217;s richest man, Elon Musk, on Thursday negatively impacted the US financial markets. During this period, the premier cryptocurrency crashed by an estimated 5% from $106,000 to trade below $101,000. Interestingly, despite the short-term volatility, several key technical indicators now point to a potentially bullish setup. In fact, this latest pullback appears to complete a series of signals that historically precede major price rallies. Related Reading: Bitcoin Sees Negative Funding On Binance – A Classic Setup For A Short Squeeze? Bitcoin Set For Price Surge, First Target At $130,000 In an X post on June 6, a market expert with X username CrypFlow shares a bullish Bitcoin prediction amidst an ongoing price correction. Aside from sharp price decline in the past week, the BTC market has witnessed a steady price correction since the premier cryptocurrency achieved a new-all time high of $111,970 on May 22. However, CrypFlow states that this price retracement alongside a host of other technical indicators suggest that Bitcoin is setting to repeat its price rally from Q4 2024. The first indicator observed by the analyst in the chart above is the golden cross which occurs when the 50-day simple moving average (50SMA) crosses above the 200-day simple moving average (200SMA) in early June 2025. The golden cross is a common bullish indicator that signals a shift in market momentum and was last seen in November 2024. Furthermore, there is a Bitcoin price breakout above a long-standing purple downward trendline that originated in December 2024. This breakout also mirrors another move seen in early November 2024, when BTC breached the descending resistance that began in March 2024. The ongoing price correction represents the final indicator as Bitcoin also suffered an estimated 10% price fall in November falling from $74,500 to $68,500 before initially an explosive price rally. CrypFlow’s analysis suggests that if Bitcoin is repeating its price rally from Q4 2024, the premier cryptocurrency could produce a 62% price gain translating into potential targets around $170,000. However, the analyst has set a more conservative initial price target of $130,000, representing a 25% gain from current market levels. Related Reading: Musk Exits DOGE, Clashes With Trump—Dogecoin Gets Caught In The Crossfire Bitcoin Price Prediction At press time, Bitcoin trades at $104,850 after a 2.57% gain in the past day. Meanwhile, the asset’s daily trading volume has dropped by 19.59%. According to data from prediction site Coincodex, the general BTC market sentiment remains bullish despite a Fear &#38; Greed Index of 45 which indicates Fear. The Coincodex analyst team are backing this market’s positivity with a price projection of $134,074 in five days and $155,864 in three months. Featured image from Getty Images, chart from Tradingview"
    },
    {
      "title": "Crypto Analyst Says This Bitcoin Top Signal Hasn’t Gone Off Yet — What To Know",
      "link": "https://www.newsbtc.com/news/bitcoin/his-bitcoin-top-signal-hasnt-gone-off-yet/",
      "summary": "The story has been somewhat the same for the price of Bitcoin over the past week, drifting further from its recently-notched all-time high of $111,814. On Friday, June 6, the premier cryptocurrency fell towards the $101,000 level, reflecting an uptick in the market volatility over the past few days. While the Bitcoin price has quickly recovered from this sudden downturn, there is still real concern about the market leader’s performance since reaching its record-high value. However, a new indicator suggests that the price of BTC might still have some time to run up to a new high. Analyst Predicts Four Months Of Opportunity For BTC In a recent post on the X platform, crypto expert Joao Wedson revealed that there might still be some degree of opportunity in the Bitcoin market. This observation is based on a model, which was accurate in predicting past all-time high prices for the world’s largest cryptocurrency by market capitalization. Related Reading: Traders Turn Bearish on Bitcoin Following High-Profile Political Tensions, Data Shows This revelation is based on the Max Intersect SMA Model (the blue line), which has accurately identified the tops of past Bitcoin cycles. According to Wedson’s post, this cycle top prediction model suggests that the price of BTC could still have around four months of upward growth potential — regardless of the volatility and market shakeout. As seen in the chart above, the price of Bitcoin reaches its current cycle peak whenever the Max Intersect SMA (simple moving average) hits the previous cycle top. In the 2021 cycle, the top prediction model hit the 2018 high of around $19,000 in November 2021, culminating in a then-all-time high of $69,000. Hence, when this Max Intersect SMA hits exactly $69,000 — the price top in the last cycle, that will represent the peak of this current cycle. Wedson also asserted that this model is pretty reliable, as it is backed by 200 tested algorithms. With this top prediction model still a bit off $69,000, the Bitcoin price might still be some months away from its peak. Bitcoin Price At A Glance As mentioned earlier, the price of BTC seems to be struggling after recently hitting its current all-time high above the $110,000 mark. This week’s performance must have tested investors’ patience as the flagship cryptocurrency mostly traded within a consolidation range. Related Reading: Ethereum Stabilizes After Market Drop – Key MA Reclaim Could Trigger A June Rally According to data from CoinGecko, the BTC price is up by a mere 0.2% in the last seven days. As of this writing, Bitcoin is valued at around $104,400, reflecting an over 2% price increase in the past 24 hours. Featured image from iStock, chart from TradingView"
    },
    {
      "title": "Can Bitcoin Price Bounce To $120,000 Or Will It Break Below $100,000?",
      "link": "https://www.newsbtc.com/news/bitcoin/can-bitcoin-bounce-to-120000/",
      "summary": "The Bitcoin price has continued to trade sideways since hitting a new all-time high (ATH) of $111,900 earlier in May. Amid the current price action, crypto analyst Decode has provided insights into whether the leading crypto will rally to $120,000 or drop below $100,000 next. Analyst Reveals What&#8217;s Next For The Bitcoin Price In an X post, Decode shared an accompanying chart in which he made an ABC wave analysis of the current Bitcoin price action. Based on his analysis, the leading crypto is expected to drop below $100,000 before it rallies to a new ATH of $120,000. The chart showed that BTC could fall to as low as $96,500 on the Wave B corrective move. Related Reading: Bitcoin Price Bounces Off Re-Accumulation Zone: Why $120,000 Could Be Next This drop to $96,500 is expected to happen this month. Once that is done, Decode predicts that the Bitcoin price could rally above $120,500 before the end of July. This will mark the Wave C impulsive move to the upside. This aligns with veteran trader Peter Brandt’s prediction that BTC could reach as high as $150,000 by late summer. However, crypto analyst KillaXBT has predicted that the Bitcoin price could hit the $120,000 target by mid-June. This coincides with the June FOMC meeting, which is scheduled for June 17 and 18. A Fed rate cut could serve as the catalyst for such a parabolic rally from the current BTC price level. According to CME FedWatch data, there is a 97.4% chance that the Fed would keep interest rates unchanged. As such, market participants aren’t expecting a rate cut, which is why the Bitcoin price could pump massively if Jerome Powell and the FOMC were to surprise everyone. Moreover, US President Donald Trump yesterday urged the Fed to cut rates by a full point. A Breakout Might Be On The Cards In an X post, crypto analyst Titan of Crypto suggested that a breakout could be imminent for the Bitcoin price. He noted that BTC is progressing inside a 4-hour falling wedge, which indicates a bullish reversal pattern. If confirmed, the analyst stated that the breakout could target the $107,500 and $109,500 zones, which are the Fibonacci confluence areas. Related Reading: Crypto Analyst Puts Bitcoin Price At $120,000 If This Range Breakout Happens Crypto analyst Kevin Capital highlighted the solid V-shape recovery for the Bitcoin price after the leading crypto dropped to as low as $100,000 on May 5. However, the analyst noted that BTC’s rebound back to the $105,000 zone won’t matter until it breaks above the $106,800 level. The leading crypto must also show actual follow-through with 3-day to 1-week closes to support a breakout. At the time of writing, the Bitcoin price is trading at around $105,000. Up over 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin 2025 Las Vegas: Here’s What Went Down",
      "link": "https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-2025_ig.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down\" rel=\"nofollow\"> </a></p> <p>My name is Jenna Montgomery, and maybe you’ve read some of my news articles here before, or seen me on the TikTok. But today, I wanted to switch it up and give you an inside look at the Bitcoin 2025 Conference in Las Vegas through my eyes as an intern, hired just one [&#8230;]</p> <p>"
    },
    {
      "title": "TakeOver Successfully Hosts Second Annual BitGala Celebrating Bitcoin in Las Vegas",
      "link": "https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/TakeOver-Successfully-Hosts-Second-Annual-BitGala-Celebrating-Bitcoin-in-Las-Vegas.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas\" rel=\"nofollow\"> </a></p> <p>LAS VEGAS, NV, May 26, 2025 &#8211; TakeOver, Magic Eden, Spark, and Stacks successfully hosted their second annual BitGala on May 26th at the Wynn in Las Vegas. The celebration brought together over 200 Bitcoin industry leaders and community members for an evening dedicated to celebrating Bitcoin. The BitGala was designed as a curated gathering [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini Files Draft With The SEC For Proposed IPO",
      "link": "https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini-Files-Draft-With-The-SEC-For-Proposed-IPO.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo\" rel=\"nofollow\"> </a></p> <p>Gemini has confidentially filed a draft registration statement with SEC for a proposed IPO of its Class A common stock.</p> <p>"
    },
    {
      "title": "‘MicroStrategy of Asia’ Metaplanet Aims To Acquire Over 210,000 BTC By the End of 2027",
      "link": "https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘MicroStrategy-of-Asia-Metaplanet-Aims-To-Acquire-Over-210000-BTC-By-the-End-of-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027\" rel=\"nofollow\"> </a></p> <p>Metaplanet Inc. plans to acquire over 210,000 BTC by the end of 2027, which is equivalent to 1% of Bitcoin’s total supply.</p> <p>"
    },
    {
      "title": "Know Labs, Inc. Announces Adopting a Bitcoin Treasury Strategy, Starting with 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Know-Labs-Inc.-Announces-Adopting-a-Bitcoin-Treasury-Strategy-Starting-with-1000-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>Know Labs, Inc. announces making a Bitcoin Treasury Strategy, holding 1,000 Bitcoin and placing Greg Kidd as the CEO of the company.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Cudis Bets on Wearables, AI and a Solana Token to Drive the Longevity Movement",
      "link": "https://decrypt.co/324052/cudis-bets-wearables-ai-solana-token-drive-longevity-movement",
      "summary": "Smart ring startup Cudis rewards users with crypto—via its new Solana and BNB token—for building consistent, healthy habits."
    },
    {
      "title": "SuiPlay0X1 Hands-On Preview: A Steam Deck Rival That Supports Crypto Games",
      "link": "https://decrypt.co/324013/suiplay0x1-preview-steam-deck-rival-crypto-games",
      "summary": "Launching at $599, the SuiPlay0X1 is a high-end mobile PC gaming device with crypto features. We went hands-on ahead of the release."
    },
    {
      "title": "French Exoskeleton Company Wandercraft Pivots to Humanoid Robots",
      "link": "https://decrypt.co/324103/french-exoskeleton-company-wandercraft-pivots-humanoid-robots",
      "summary": "Wandercraft repurposed the technology behind its exoskeletons to create Calvin 40, a utilitarian bot for factory jobs."
    },
    {
      "title": "Trump's SEC Is Ending Crypto Lawsuits and Investigations—These Are the Biggest",
      "link": "https://decrypt.co/308273/trump-sec-ending-crypto-lawsuits-investigations",
      "summary": "Under President Trump, the U.S. Securities and Exchange Commission is backing down from fights with crypto firms. Here's the growing list of former targets."
    },
    {
      "title": "SuiPlay0X1 Hands-On: A Crypto Handheld Console",
      "link": "https://decrypt.co/videos/interviews/SmRvf6q8/suiplay0x1-hands-on-a-crypto-handheld-console",
      "summary": "The SuiPlay0X1 is a crypto-fueled handheld console set to ship this summer, as it attempts to rival the Steam Deck and other crypto gaming hardware."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Circle rejected Ripple’s $5 billion buyout — now valued at over $20 billion after NYSE debut",
      "link": "https://cryptobriefing.com/circles-21-billion-valuation/",
      "summary": "<p>Circle's successful IPO highlights the growing legitimacy of stablecoins, potentially accelerating regulatory clarity and institutional adoption.</p> <p>"
    },
    {
      "title": "VanEck, 21Shares, and Canary urge SEC to revert to ‘first to file, first to approve’ standard for crypto ETFs",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec-standard/",
      "summary": "<p>The shift from a \"first-to-file\" to simultaneous approval for crypto ETFs may hinder innovation and favor larger firms, impacting market fairness.</p> <p>"
    },
    {
      "title": "Best way of staking USDT in 2025: Loopring AI-powered staking platform",
      "link": "https://cryptobriefing.com/ai-powered-staking-usdt-loopring/",
      "summary": "<p>Loopring's AI-powered staking platform offers up to 20% daily on USDT, leveraging AI &#38; Ethereum Layer 2 for optimal returns.</p> <p>"
    },
    {
      "title": "Elon Musk’s X names Polymarket as official prediction market partner",
      "link": "https://cryptobriefing.com/elon-musks-prediction-markets/",
      "summary": "<p>This partnership could enhance the accuracy of public sentiment analysis, potentially influencing decision-making in politics and finance.</p> <p>"
    },
    {
      "title": "Apple, X, and Google hold talks with crypto firms on stablecoin integration",
      "link": "https://cryptobriefing.com/stablecoin-integration-tech-discussions/",
      "summary": "<p>The integration of stablecoins by major tech firms could revolutionize global payment systems, enhancing efficiency and reducing costs.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Injective sees 24% monthly gain, but traders, THIS could derail INJ’s rally?",
      "link": "https://ambcrypto.com/injective-sees-24-monthly-gain-but-traders-this-could-derail-injs-rally/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/5E86D3FC-325F-4950-A95B-8E3925257F43.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />INJ is showing clear signs of a potential price rally."
    },
    {
      "title": "Bitcoin is scarcer than ever! – Why BTC’s $100K mark is only step one",
      "link": "https://ambcrypto.com/bitcoin-is-scarcer-than-ever-why-btcs-100k-mark-is-only-step-one/",
      "summary": "<img alt=\"Bitcoin: Locked, loaded, and scarcer than ever: Why BTC’s $100K mark is only step one!\" class=\"attachment-full size-full wp-post-image\" height=\"983\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika2-1-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1747\" />How will the 2028 halving slash supply and drive Bitcoin’s next price surge?"
    },
    {
      "title": "Stacks [STX] down 31% after Alex Protocol exploit – Details",
      "link": "https://ambcrypto.com/stacks-stx-down-31-after-alex-protocol-exploit-details/",
      "summary": "<img alt=\"Stacks [STX] down 31% after Alex Protocol exploit - Details\" class=\"attachment-full size-full wp-post-image\" height=\"907\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/ALEX-Protocol-was-exploited.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1612\" />This isn’t Alex's first exploit, as a Lazarus-linked breach in May 2024 cost $4.3M."
    },
    {
      "title": "Risk appetite migrates to stocks as Bitcoin braces itself – Here’s why that matters",
      "link": "https://ambcrypto.com/risk-appetite-migrates-to-stocks-as-bitcoin-braces-itself-heres-why-that-matters/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-1-3.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin was in a good place a few weeks ago, until it probably wasn't."
    },
    {
      "title": "Circle’s success fuels Gemini’s IPO move as ‘crypto firms can’t wait!’",
      "link": "https://ambcrypto.com/circles-success-fuels-geminis-ipo-move-as-crypto-firms-cant-wait/",
      "summary": "<img alt=\"Circle’s success fuels Gemini’s IPO move as &#039;crypto firms can’t wait!&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"723\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gemini-Files-S-1-For-US-IPO.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1286\" />Circle did it. Gemini’s next. Who’s lining up after?"
    }
  ]
}