{
  "CoinDesk": [
    {
      "title": "BNB Sees Modest Gains Following Iran Strikes",
      "link": "https://www.coindesk.com/markets/2025/06/23/bnb-sees-modest-gains-following-iran-strikes",
      "summary": ""
    },
    {
      "title": "Midnight Network Unveils NIGHT Tokenomics, 'Glacier Drop' Airdrop Mechanism",
      "link": "https://www.coindesk.com/business/2025/06/23/midnight-network-unveils-night-tokenomics-glacier-drop-airdrop-mechanism",
      "summary": ""
    },
    {
      "title": "A Startup Raises $15M, Led by Paradigm, Aiming to Rival HyperLiquid",
      "link": "https://www.coindesk.com/business/2025/06/23/hyperliquid-rival-gte-raises-usd15m-in-series-a-led-by-paradigm",
      "summary": ""
    },
    {
      "title": "Brazil’s Méliuz Buys $28.6M in Bitcoin, Becomes Top Public BTC Holder in Latin America",
      "link": "https://www.coindesk.com/markets/2025/06/23/brazils-meliuz-buys-286m-in-bitcoin-becomes-top-public-btc-holder-in-latin-america",
      "summary": ""
    },
    {
      "title": "Trump Media Share Buyback to be Funded Separately From BTC Treasury Strategy",
      "link": "https://www.coindesk.com/markets/2025/06/23/trump-media-share-buyback-to-be-funded-separately-from-btc-treasury-strategy",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "India wants 30% of your crypto gains, but that’s not the worst part",
      "link": "https://cointelegraph.com/explained/india-wants-30-of-your-crypto-gains-but-thats-not-the-worst-part?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9lZjg3NzFiYjJlYjUyNGY2MzJjZDQ5YTMxMzdiYjdlOS5qcGc=.jpg\" /></p><p>A 30% tax on crypto profits in India is only part of the story. Traders face even bigger hurdles under the current tax regime.</p>"
    },
    {
      "title": "Crypto hedge fund execs to raise $100M for BNB treasury vehicle — Report",
      "link": "https://cointelegraph.com/news/hedge-fund-execs-raise-100m-bnb-strategy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzlkMjAtYjI0OS03YWUxLWE2NGUtNTFkOTE3OTU2YzQz.jpg\" /></p><p>According to Bloomberg, former executives at Coral Capital Holdings want to create a BNB treasury company.</p>"
    },
    {
      "title": "Bitcoin supply is shrinking: Will Saylor’s relentless BTC buying cause a supply shock?",
      "link": "https://cointelegraph.com/explained/bitcoin-supply-is-shrinking-will-saylors-relentless-btc-buying-cause-a-supply-shock?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9kNDc2OTFmYmU3NDZjMTA4NjNiM2NhZTQ4Yjk4NTEyZC5qcGc=.jpg\" /></p><p>As Michael Saylor’s Strategy and other whales keep buying Bitcoin, the stage may be set for a historic supply shock.</p>"
    },
    {
      "title": "CoinFund-backed Veda raises $18M as stablecoin yield becomes ‘inevitable’",
      "link": "https://cointelegraph.com/news/veda-raises-18m-defi-yield-vault-platform?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzg3NGYtMjEyYy03MDU3LTkxNWMtZDliOGI5M2U5N2Zk.jpg\" /></p><p>The DeFi vault platform has received funding from several VCs, including CoinFund, Coinbase Ventures and Animoca Ventures.</p>"
    },
    {
      "title": "Missiles fly, yet Bitcoin holds, revealing BTC’s strength in global chaos",
      "link": "https://cointelegraph.com/news/missiles-fly-bitcoin-holds-revealing-btc-s-strength-in-global-chaos?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzljNjUtNzNmYi03YmZhLWE0NzMtMTU1MmEyNThlYzM4.jpg\" /></p><p>Bitcoin’s June price action during the Israel–Iran conflict shows that it remains a macro asset, albeit one increasingly shaped by global instability.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Texas to buy Bitcoin for state reserves long before Trump’s Bitcoin reserve delivers",
      "link": "https://cryptoslate.com/texas-to-buy-bitcoin-for-state-reserves-long-before-federal-bitcoin-reserve-delivers/",
      "summary": "<p>Texas is now legally empowered to build its own Bitcoin reserve funded with taxpayer dollars before the federal government takes any comparable action. Governor Greg Abbott on Saturday signed Senate Bill 21, a law that explicitly allows the state to buy and hold Bitcoin and other top-tier cryptocurrencies. The measure passed the Texas House and [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet’s latest $118 million Bitcoin buy dwarfs Strategy’s new acquisition fivefold",
      "link": "https://cryptoslate.com/metaplanet-outshines-strategy-in-latest-bitcoin-buying-spree/",
      "summary": "<p>Japan&#8217;s Metaplanet has outpaced Strategy in Bitcoin accumulation, purchasing 1,111 BTC last week, approximately five times more than the US-based firm acquired in the same period. According to a June 23 disclosure, Metaplanet spent approximately $118 million on its latest purchase, securing the Bitcoin at an average price of $105,468 per coin. With this addition, [&#8230;]</p> <p>"
    },
    {
      "title": "Nasdaq-listed Fiserv to launch USD-pegged stablecoin on Solana by the end of the year",
      "link": "https://cryptoslate.com/nasdaq-listed-fiserv-to-launch-usd-pegged-stablecoin-on-solana-by-the-end-of-the-year/",
      "summary": "<p>Fiserv Inc., a major player in global payments and financial services, has unveiled plans to launch a USD-pegged stablecoin called FIUSD on the Solana blockchain, according to a June 23 statement. The Nasdaq-listed company stated that the stablecoin was built using infrastructure from Paxos and Circle. It is expected to go live by the end [&#8230;]</p> <p>"
    },
    {
      "title": "Major Ethereum, Solana, XRP losses cause chance of Altcoin Season to drop to 12 month low amid Bitcoin strength",
      "link": "https://cryptoslate.com/ethereum-solana-xrp-losses-cause-altcoin-season-index-to-drop-to-lowest-in-a-year-amid-bitcoin-strength/",
      "summary": "<p>Altcoins are slipping further into decline as investors flock to Bitcoin amid escalating geopolitical tensions and a risk-off environment. Data from CoinGlass shows the Altcoin Season Index has plunged to 12, its weakest level in nearly a year, reflecting a deepening lack of interest in non-Bitcoin cryptocurrencies. The Altcoin Season Index tracks how non-Bitcoin assets [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin and Ethereum inflows surge past $1.2B despite rising geopolitical risks",
      "link": "https://cryptoslate.com/bitcoin-and-ethereum-inflows-surge-past-1-2b-despite-rising-geopolitical-risks/",
      "summary": "<p>Digital asset investment products recorded their tenth straight week of inflows, bringing in $1.24 billion last week, according to data from CoinShares. This continued streak has pushed year-to-date (YTD) inflows to $15.1 billion, a new record for this year. The inflows come at a time of heightened geopolitical tension, particularly following Israel&#8217;s military action against [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Holds Critical Support – $2,350 Level Could Define The Next Move",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-holds-critical-support-2350-level-could-define-the-next-move/",
      "summary": "Ethereum has dropped 17% since Friday, breaking down from the long-standing range that held firm since early May. The sharp sell-off came after news broke of US airstrikes targeting Iranian nuclear facilities, sending shockwaves across global markets and sparking panic selling in risk assets. ETH was no exception, plunging below multiple support zones before finding a temporary floor at $2,100. Related Reading: Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106 This level served as a critical demand area, and Ethereum has since managed to bounce, offering bulls a glimmer of hope in an otherwise uncertain market. However, the breakdown of the previous trading range indicates that momentum has clearly shifted in favor of the bears. According to top analyst Ted Pillows, Ethereum must reclaim the top of the former range to signal that the downside move was a deviation rather than a full breakdown. As investors digest the growing geopolitical risk and continue to react to macroeconomic pressures such as persistent inflation and hawkish Federal Reserve policy, Ethereum’s path forward remains uncertain. Still, the bounce from $2,100 provides a chance for bulls to reestablish control—if they can push the price back above key resistance levels in the sessions ahead. Ethereum Holds Support But Bears Still in Control Recent price action has taken a heavy toll on altcoins, with Ethereum leading the downturn as most assets fall to lower demand levels. Since reaching its early June high, Ethereum has shed over 26% of its value, now trading under intense bearish pressure. Despite the decline, bulls have managed to defend the critical $2,100 support level, providing a temporary floor in an otherwise fragile environment. Geopolitical instability—particularly the escalating conflict between the US, Israel, and Iran—continues to add volatility and risk aversion to the market. Investors remain cautious, with the broader macroeconomic backdrop dominated by high US Treasury yields, stubborn inflation, and a hawkish Federal Reserve. These factors have put additional weight on the crypto sector, especially on Ethereum, which is widely seen as the main catalyst for a potential altseason that has yet to materialize. Ted Pillows notes that Ethereum recently tested the $2,100 support and successfully bounced. However, he emphasizes that the price must reclaim the top of its previous range to regain bullish momentum. If ETH fails to break and hold above the $2,350 range low, it risks a deeper move toward the start of the previous impulse leg—or worse. The coming days will be critical for Ethereum. Reclaiming lost levels would indicate strength and possibly kick off the long-awaited altcoin rotation. But continued rejection could signal more downside ahead, with sentiment already fragile and demand still lacking. Until clarity returns, Ethereum remains in a decisive phase where every candle matters. Related Reading: Ethereum Weekly Chart Nears Tower Top Formation As US Launches Attack On Iran – Details ETH Price Analysis: Breakdown Below Key Structure Ethereum (ETH) has sharply declined, with the price now sitting around $2,248. This move marks a confirmed breakdown from the key range between $2,320 and $2,850, which had been holding since early May. The rejection from the upper resistance zone near $2,850, combined with high-volume selling, indicates clear bearish momentum. The current candle structure on the 3-day timeframe shows strong downward pressure, especially as ETH failed to hold above the 100-day and 200-day moving averages (currently at $2,638 and $2,776, respectively). These levels now act as dynamic resistance, adding more weight against any short-term bullish reversal attempts. ETH is also trading well below the 50-day moving average at $2,265, a level that has historically acted as a short-term directional signal. Unless price reclaims and consolidates above that zone, the bearish trend could continue toward the $2,000–$2,100 support cluster—an area that previously sparked buying interest during March&#8217;s recovery. Related Reading: Tron Energy Usage Surges 108% – Smart Contract Activity Accelerates Volume has spiked significantly on this drop, suggesting panic selling rather than a controlled correction. For bulls to regain control, ETH must reclaim the range low at $2,320 quickly. Otherwise, downside pressure could continue to dominate in the near term. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Analyst Puts XRP Cycle High At $20-$30, Here’s Why",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-cycle-high-at-20-30/",
      "summary": "The XRP price could be preparing for a historical rally, as a prominent crypto analyst has boldly predicted that the cryptocurrency could reach a fresh cycle top between $20 and $30. The forecast, which presents a massive upside for the altcoin, is based on the Elliott Wave Theory—a key technical analysis tool. XRP Wave Map Signals Cycle Top Ahead Crypto analyst, XForceGlobal on X (formerly Twitter) has presented a bold new forecast for XRP, projecting a cycle high between $20 and $30. The analyst shared a chart that dissects XRP’s price action over the last several months, suggesting that the cryptocurrency is currently in the final stages of a corrective wave before beginning a powerful multi-leg impulsive rally. If this wave count plays out as the market expert says, XRP could be on the verge of its most aggressive breakout to date. Related Reading: XRP Price Targets $3.61 In Short Term As ‘Cup’ Turns Hot The analysis focuses on XRP’s medium-term correction, which has taken the form of a complex WXY structure. According to the chart, XRP is nearing the completion of Wave 2, a corrective phase that began after the last upward impulse. XForceGlobal has pinpointed a key Fibonacci confluence zone between $1.60 and $1.90, where XRP’s pullback is expected to find support. The chart clearly marks this area as a potential springboard for the next bullish phase, as long as the price does not fall below the $1.618 level, which serves as the invalidation point for the current setup. Despite XRP’s historical track record of sluggish performance and ongoing skepticism within the crypto community about the bullish forecast, XForceGlobal maintains confidence that the cryptocurrency will reach the ambitious $20-$30 cycle top—a move he believes could unfold well into 2026. Intermediate Targets First, Cycle High Later According to XForceGlobal’s chart, once XRP completes its current corrective move, the analyst predicts that the first leg of this upcoming rally may take the cryptocurrency past the $5 mark in Wave 3, followed by a deeper Wave 4 pullback and a final thrust into Wave 5 toward $6 or more. Related Reading: XRP 5-Wave Count Shows When The Price Will Hit All-Time Highs Above $5 While these targets represent an intermediate-term bullish setup, on a macro scale, the long-term wave map implies that the whole structure could later culminate in a parabolic cycle top rally that sends XRP between $20 and possibly even $30. This optimistic outlook gains further credibility, as the analyst notes that XRP’s internal wave count for the flat scenario has taken longer to resolve than initially expected. Beyond technicals, XForceGlobal highlights that market psychology plays a central role in its bullish forecast. He notes that the XRP community has weathered regulatory battles, market crashes, and years of stagnation, most notably the US SEC lawsuit. This prolonged adversity has turned XRP holders into “battle-tested veterans” who are largely immune to fear-driven selling. This resilience, according to the analyst, could be the key to the next bullish phase of XRP’s price action. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "Cointelegraph and CoinMarketCap Hacked: Why Non-Custodial Wallets Are Necessary",
      "link": "https://www.newsbtc.com/news/cointelegraph-and-coinmarketcap-hacked-why-non-custodial-wallets-are-necessary/",
      "summary": "Want to check on Bitcoin’s latest price moves? Just pop over to CoinMarketCap and… enter your wallet info? On June 20, 2025, visitors to a number of major crypto sites, including CoinTelegraph and CoinMarketCap, were prompted to connect their crypto wallets before accessing the site. The pop-up was a hack, a wallet-stealer designed to siphon information away from users. CoinMarketCap users can create accounts and connect wallets to track their portfolios, so the pop-up itself might not have seemed entirely out-of-place. Users quickly uncovered the hack, and affected sites moved rapidly to limit the damage. The incident highlights a new potential vulnerability in the growing crypto ecosystem. With such attacks, phishing can occur even on trusted platforms. What Wallet? Hacks Exploited Common Wallet Connectivity Features The incident involved the injection of malicious JavaScript code into CoinMarketCap’s homepage. When unsuspecting users visited the site, they were greeted with a realistic-looking ‘Connect Wallet to Verify’ popup, mimicking standard Web3 wallet connection prompts. Users who clicked the popup and approved the transaction gave attackers full access to their wallets. The CMC hack reportedly had 39 victims with over $18K in losses. The script was since removed, and CMC has patched the vulnerability. Cointelegraph Also Targeted Just days later, on June 23, Cointelegraph, another prominent crypto news outlet, faced a similar attack. In this case, attackers managed to compromise an ad-serving network, injecting code that produced a fake token airdrop popup promoting a nonexistent ‘Cointelegraph token&#8217; or &#8216;CTG.&#8217; The popup redirected users to a phishing site designed to harvest wallet signatures. Once again, users who interacted and signed the transaction lost access to their funds. Cointelegraph quickly issued a warning across its social media channels and disabled the malicious script. Both the CMC and CT hacks are part of a growing category of crypto hacks focused on compromising wallets. Per CertiK’s quarterly report, these attacks produce the largest losses (over $1.450M in Q1 2025 alone). Wallet compromises are not as successful as other attacks, ranking last by incident count. But when they work, hackers can make off with vast amounts quickly. Vigilance and Knowing the Warning Signs: Key to Avoid Losses Binance founder and former CEO Changpeng Zhao (CZ) took to X and warned users to ‘be careful when authorizing wallet connect.’ Both the CMC and CT hacks used pop-ups, one for a simple wallet connect prompt, and one for a purported crypto airdrop. Cointelegraph&#8217;s official account also posted a warning, urging users to not click the pop-ups, connect wallets, or provide their personal information. Crypto airdrops and crypto presales are often used by legitimate projects to develop early interest and generate buzz about new projects, making such phishing attacks more convincing. Scammers create fakes in order to encourage investors to give away wallet information. The supposed project or token – in this case ‘CTG’ – never existed. How do investors stay safe? Avoiding any unexpected or unusual pop-ups, even from trust sources, is a first step. And when it comes to the crypto ICOs and presales, it&#8217;s important to get your info from trusted sources. This is where a new solution, Best Wallet, stands out. This new app is the only Web3 wallet with a presale directory where you can browse only audited, secure presale tokens. The wallet also employs Multi-Party Computation technology, protecting your key from phishing attacks and hacks. Best Wallet Token ($BEST) – The World’s First and Only Crypto Presale Wallet The evolution of crypto hacks is unfortunately part of crypto&#8217;s growing market and popularity. New Web3 solutions, like Best Wallet, are evolving to tackle these security challenges, becoming a critical part of the crypto economy. And the Best Wallet Token ($BEST) is here to power-up the Best Wallet ecosystem and provide additional perks for holders. With $BEST, token holders can trade and swap tokens more easily, participate in community governance, and earn higher staking rewards. The token also allows early access to the best crypto presales, gathered and vetted by Best Wallet in their ‘Upcoming Tokens’ section. Here, investors can find upcoming crypto projects, as well as all the key information, such as whitepapers and tokenomics, needed to do research before investing. That makes Best Wallet&#8217;s platform and token some of the handiest tools for crypto investors who want to avoid shady pop-ups and still stay ahead of the markets. Most importantly, Best Wallet is non-custodial and privacy-focused; investors control all their wallet keys and can sign up and swap crypto without KYC. The Best Wallet token presale has raised $13.5M so far, with the coin currently priced at $0.025225. Note that, given its sought-after, privacy-oriented wallet, the $BEST token could reach $0.05 by the end of 2026 after a successful launch, delivering 102% returns to early investors. If you&#8217;re interested in supporting the project, now&#8217;s the right opportunity to buy the Best Wallet Token at the lowest price. Visit Best Wallet&#8217;s Token presale today. Security in the Age of Web3 The recent front-end Cointelegraph and CoinMarketCap hacks mark a dangerous new phase in crypto security threats. Unlike traditional hacking methods that target backend systems or databases, these exploits weaponize the user interface, where trust is assumed but rarely verified. Secure Web3 wallets like Best Wallet can go a long way towards mitigating such growing risks. As always, do your own research before investing or choosing a crypto service provider. This article isn&#8217;t financial advice."
    },
    {
      "title": "XRP To $30 Beyond 2026? Analyst Reveals Key BTC Ratio To Watch",
      "link": "https://www.newsbtc.com/xrp-news/xrp-to-30-beyond-2026-analyst-reveals-key-btc-ratio-to-watch/",
      "summary": "The market technician known on X as Dr Cat (@DoctorCatX) has published a post that condenses years of his XRP/BTC work into one number—2,041 satoshis—and a set of time-stamped price targets that reach as high as $30 per XRP once Bitcoin hits $270,000. In"
    },
    {
      "title": "Bitcoin Down But Not Out—Analyst Sees Recovery Ahead Amid Middle East War",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-down-but-not-out-arthur-hayes-sees-recovery-ahead/",
      "summary": "Bitcoin briefly slid to $98,974 late on Sunday after US airstrikes targeted Iranian nuclear facilities. That was its weakest point since early May. But by Monday morning in Asia, the leading cryptocurrency topped $101,000 again. Traders are weighing whether this was just a hiccup or the start of a fresh trend. Related Reading: Stablecoin Wars Ignite: Peter Schiff Champions Gold-Backed Digital Assets Source: CoinMarketCap Arthur Hayes Sees Temporary Weakness According to Arthur Hayes, co-founder of BitMEX, the fall is only a short pause. On X, he wrote that “weakness shall pass” and predicted Bitcoin will “leave no doubt as to its safe haven status.” He said fresh money printing by central banks will be the main force driving prices back up. His view suggests that big dips can turn into buying chances when broader liquidity is rising. Do you hear that? … it’s the sound of the money printers revving up to do their patriotic duty. This weakness shall pass and $BTC will leave no doubt as to its safe haven status. pic.twitter.com/PTfZaAXFp7 — Arthur Hayes (@CryptoHayes) June 22, 2025 Market Dips On Geopolitical News Based on reports, it was US strikes on Iran that triggered the initial slide. The price drop happened late Sunday, pushing Bitcoin below six figures for the first time since early May. Yet buyers stepped in quickly, snapping up coins and lifting the price back above $101,000 during the first hours of trading in Asia. That pattern shows how headline shocks can spark fast moves, but also how quickly sentiment can flip. Altcoins Take A Hit Meanwhile, over the past 12 hours, most altcoins fell about 1.4%, dragging total crypto market cap down by roughly $50 billion to $3.20 trillion, according to data. Experts expect that trend to reverse once major headlines calm down. Market analysts pointed out that altcoins might start to outperform if macro risks ease. They said smaller tokens are already showing signs of strength, even as Bitcoin stalls. Key Technical Levels Hold Traders are watching two key lines: the short-term realized price at $98,000 and the trend support at $102,000. The realized price reflects the average breakeven point for holders, so it often acts like a floor. Related Reading: Pump.fun’s Big Launch Put On Ice Over Legal Drama The $102,000 has capped rallies over the past weeks. As long as Bitcoin stays in that $98,000–$102,000 range, there are chances for quick rallies. But a break below $98,000 could force more focus on cutting losses. Featured image from Imagen, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "ECD Automotive Design Secures $500M Facility to Acquire Bitcoin",
      "link": "https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ECD-Automotive-Design-Secures-500M-Facility-to-Acquire-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin\" rel=\"nofollow\"> </a></p> <p>Luxury auto builder will grow its Bitcoin treasury, expand operations, and offer $21,000 in upgrades to early customers who pay with Bitcoin and other crypto.</p> <p>"
    },
    {
      "title": "Anthony Pompliano Announces $1 Billion Merger in Record Bitcoin Treasury Company Fundraise",
      "link": "https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ProCap-Financial-has-raised-over-750-million-in-the-largest-initial-funding-round-for-a-public-Bitcoin-treasury-company.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise\" rel=\"nofollow\"> </a></p> <p>Anthony Pompliano announced a $1 billion merger creating ProCap Financial through a Special Purpose Acquisition Company (SPAC) transaction with Columbus Circle Capital Corp. (CCCM). The deal represents the largest initial fundraise in history for a public Bitcoin treasury company, raising $516.5 million in equity and $235 million in convertible notes.&#160;&#160; ProCap Financial will operate with [&#8230;]</p> <p>"
    },
    {
      "title": "Norway’s Green Minerals Announces Adoption Of Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/norways-green-minerals-announces-adoption-of-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norways-Green-Minerals-Announces-Adoption-Of-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norways-green-minerals-announces-adoption-of-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>The Norwegian miner is adopting Bitcoin to hedge inflation and support $1.2 billion in planned financing.</p> <p>"
    },
    {
      "title": "Genesis Digital Assets Limited Acquires 1000 Air-Cooled Miners to Mine Bitcoin",
      "link": "https://bitcoinmagazine.com/news/genesis-digital-assets-limited-acquires-1000-air-cooled-miners-to-mine-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Genesis-Digital-Assets-Limited-Acquires-1000-Air-Cooled-Miners-to-Mine-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/genesis-digital-assets-limited-acquires-1000-air-cooled-miners-to-mine-bitcoin\" rel=\"nofollow\"> </a></p> <p>GDA bought Auradine’s air-cooled Miners and plans to install all of them at its 40 MW data center in Glasscock County, Texas.</p> <p>"
    },
    {
      "title": "Strategy Buys $26 Million Worth Of Bitcoin",
      "link": "https://bitcoinmagazine.com/news/strategy-buys-26-million-worth-of-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/02/Michael-Saylor-Signals-Strategys-Next-Bitcoin-Buy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/strategy-buys-26-million-worth-of-bitcoin\" rel=\"nofollow\"> </a></p> <p>Enterprise software firm acquires 245 BTC amid market volatility, bringing total holdings to 592,345 BTC as institutional adoption continues to accelerate.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Pompliano Bitcoin Treasury ProCap Unveils $1 Billion SPAC Merger",
      "link": "https://decrypt.co/326510/pomplianos-bitcoin-treasury-procap-unveils-1-billion-spac-merger",
      "summary": "Instead of simply buying and holding Bitcoin, the company plans on putting capital to work."
    },
    {
      "title": "World War Solana Meme Coins Explode in Latest Attention Trend Amid Middle East Tensions",
      "link": "https://decrypt.co/326507/world-war-solana-meme-coins",
      "summary": "Following the United States bombing Iran on Sunday morning, crypto traders pumped some war-related meme coins."
    },
    {
      "title": "Strategy Scales Back Bitcoin Buys as BTC Dips",
      "link": "https://decrypt.co/326499/strategy-scales-back-bitcoin-buys-as-btc-dips",
      "summary": "The company bought 245 Bitcoin as tensions escalated in the Middle East."
    },
    {
      "title": "Bitcoin, Ethereum Funds Pulled in $1.2 Billion Amid Rising Global Tension Last Week",
      "link": "https://decrypt.co/326457/bitcoin-ethereum-funds-1-billion-rising-global-tension",
      "summary": "Bitcoin attracts $1.1 billion despite a price correction, while Ethereum posts its longest streak since 2021, data compiled by CoinShares shows."
    },
    {
      "title": "Teen Has 'Strong Incentives to Flee' After Pleading Guilty to $245M Bitcoin Heist, Gov Says",
      "link": "https://decrypt.co/326468/teen-has-strong-incentives-to-flee-after-pleading-guilty-to-245m-bitcoin-heist-gov-says",
      "summary": "The government argued that Veer Chatel’s co-conspirators could help him to flee the country to prevent him testifying against them."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Fintech giant Fiserv to launch FIUSD stablecoin and digital asset platform with Circle, Paxos, and Solana",
      "link": "https://cryptobriefing.com/fiusd-stablecoin-platform-launch/",
      "summary": "<p>Fiserv's FIUSD launch could revolutionize digital payments, enhancing real-time transactions and expanding blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Michael Saylor’s Strategy makes smallest Bitcoin purchase since mid-March",
      "link": "https://cryptobriefing.com/strategy-bitcoin-acquisition-record/",
      "summary": "<p>Saylor's ongoing Bitcoin acquisitions highlight a strategic commitment to digital assets, potentially influencing market dynamics and investor sentiment.</p> <p>"
    },
    {
      "title": "Hackers exploit Trezor’s website to send phishing emails",
      "link": "https://cryptobriefing.com/trezor-security-alert-phishing-warning/",
      "summary": "<p>This incident highlights the growing sophistication of phishing attacks, underscoring the need for enhanced cybersecurity measures in crypto platforms.</p> <p>"
    },
    {
      "title": "Bitcoin crashes as Iranian Parliament approval of Hormuz Strait closure threatens oil disruption, stokes global inflation",
      "link": "https://cryptobriefing.com/bitcoin-oil-disruption-inflation/",
      "summary": "<p>The potential closure of the Strait of Hormuz could trigger global economic instability, with rising oil prices exacerbating inflationary pressures.</p> <p>"
    },
    {
      "title": "Trump announces US airstrikes on Iran’s nuclear sites, Bitcoin dumps, then pumps",
      "link": "https://cryptobriefing.com/us-iran-airstrikes-nuclear-sites/",
      "summary": "<p>The airstrikes heighten geopolitical tensions, potentially destabilizing the region and impacting global markets and cryptocurrency volatility.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Why is crypto down today? – Iran’s threats shake BTC, inflation fears & more",
      "link": "https://ambcrypto.com/why-is-crypto-down-today-irans-threats-shake-btc-inflation-fears-more/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/WhyiscryptodowntodayBitcoin-1.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Experts downplay market fears on Iran's chokepoint on Strait of Hormuz"
    },
    {
      "title": "XRP’s price to $30? ETF odds hitting 95% means it’s possible!",
      "link": "https://ambcrypto.com/xrps-price-to-30-etf-odds-hitting-95-means-its-possible/",
      "summary": "<img alt=\"XRP&#039;s price to $30? ETF odds hitting 95% means it&#039;s possible!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika4.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP charts say caution, ETF odds say opportunity."
    },
    {
      "title": "Bitcoin’s price is slipping, and big money’s not buying it – What’s next?",
      "link": "https://ambcrypto.com/bitcoins-price-is-slipping-and-big-moneys-not-buying-it-whats-next/",
      "summary": "<img alt=\"Bitcoin&#039;s price is slipping, and big money&#039;s not buying it - What&#039;s next?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-1-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Short-term holders are feeling the heat as whale wallets go radio silent."
    },
    {
      "title": "HYPE defies trends: $17.5M whale play, $286K liquidations – Is $36 next?",
      "link": "https://ambcrypto.com/hype-defies-trends-17-5m-whale-play-286k-liquidations-is-36-next/",
      "summary": "<img alt=\"HYPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-23T115131.532-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE rallies against the trend as whales and liquidations strengthen its bullish structure."
    },
    {
      "title": "Gate’s nearly 70% MoM growth in derivatives volume tops global charts, featured in CoinDesk’s latest report",
      "link": "https://ambcrypto.com/gates-nearly-70-mom-growth-in-derivatives-volume-tops-global-charts-featured-in-coindesks-latest-report/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"516\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-23-175207.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"929\" />Gate has once again demonstrated its strong momentum and competitive edge in the crypto trading [&#8230;]"
    }
  ]
}