{
  "CoinDesk": [
    {
      "title": "SUI Rebounds From Key Support as Nasdaq-Listed Lion Group Eyes Treasury Purchase",
      "link": "https://www.coindesk.com/markets/2025/06/27/sui-rebounds-from-key-support-as-nasdaq-listed-lion-group-eyes-treasury-purchase",
      "summary": ""
    },
    {
      "title": "Bitcoin Treasury Corporation Acquires 292 BTC, Prepares for Toronto Trading Debut",
      "link": "https://www.coindesk.com/business/2025/06/27/bitcoin-treasury-corporation-acquires-292-btc-prepares-for-toronto-trading-debut",
      "summary": ""
    },
    {
      "title": "XRP's Price Volatility Crashes to Lowest Level Since Trump's Victory. What Next?",
      "link": "https://www.coindesk.com/markets/2025/06/27/xrp-s-price-volatility-crashes-to-lowest-level-since-trump-s-victory-what-next",
      "summary": ""
    },
    {
      "title": "ACX Token Slides 10% as Accusations of DAO Manipulation Rock Across Protocol",
      "link": "https://www.coindesk.com/markets/2025/06/27/acx-token-slides-10-as-accusations-of-dao-manipulation-rock-across-protocol",
      "summary": ""
    },
    {
      "title": "Market Cap of Euro Stablecoins Surges to Nearly $500M as EUR/USD Rivals Bitcoin's H1 Gains",
      "link": "https://www.coindesk.com/markets/2025/06/27/market-cap-of-euro-stablecoins-surges-to-nearly-500m-as-eurusd-rivals-bitcoins-h1-gains",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Three signs that XRP price will soon break out after 4-month consolidation",
      "link": "https://cointelegraph.com/news/xrp-price-will-soon-break-out-after-4-month-consolidation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzg3MTUtNGYwNS03MDE5LTlhNzAtNGIzN2U2YmY3NDU0.jpg\" /></p><p>XRP price fundamental and technical indicators are giving bulls hope that the current consolidation sets the stage for a move toward $5.</p>"
    },
    {
      "title": "Bitcoin long-term holders stack 800K BTC per month in record hodl run",
      "link": "https://cointelegraph.com/news/bitcoin-long-term-holders-stack-800-btc-per-month-record-hodl-run?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGM4Y2QtNjRlYi03ZGIxLTliNmQtOGM5N2Y4ZjQ5OGZm.jpg\" /></p><p>Bitcoin long-term holder supply has increased at a record rate over the past month, data from CryptoQuant reveals.</p>"
    },
    {
      "title": "Bit Digital plunges 15% after $150M public offering, Ethereum pivot",
      "link": "https://cointelegraph.com/news/bit-digital-stock-drops-ethereum-pivot-150m-offering?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWM3ZTItMmYyOS03ODcxLWFiNzItZmQ5Zjk3NjZjZGIx.jpg\" /></p><p>Bit Digital’s stock plummeted after announcing a $150 million share sale and a transition from Bitcoin mining to Ethereum staking.</p>"
    },
    {
      "title": "Genius Group eyes massive Bitcoin buys from billion-dollar lawsuits",
      "link": "https://cointelegraph.com/news/genius-group-lawsuit-dividend-bitcoin-buy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzEyMmUtYmM4My03NzgwLTg1OTAtYjY0OTgyMDFjODFi.jpg\" /></p><p>If successful, Genius Group’s $1 billion lawsuits could net shareholders $7 per share while boosting the company’s Bitcoin holdings by 5,000 BTC.</p>"
    },
    {
      "title": "UK’s The Smarter Web Company raises $56M days after big Bitcoin buy",
      "link": "https://cointelegraph.com/news/the-smarter-web-company-raises-56m-days-after-196-bitcoin-buy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTFhNDctODdkMS03MGRmLWJjZDEtNDk5ZTU2MDk0NmNk.jpg\" /></p><p>UK-based The Smarter Web Company has made a multimillion-dollar raise just days after it purchased $20 million worth of Bitcoin to bring its holdings to over 540 BTC.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin market cap overtakes Google’s $2.1 billion valuation as crypto equities also rise",
      "link": "https://cryptoslate.com/bitcoin-market-cap-overtakes-googles-2-1-billion-valuation-as-coinbase-stock-jumps-on-stablecoin-hopes/",
      "summary": "<p>Bitcoin has overtaken Google’s parent Alphabet to become the world’s sixth most valuable asset, and is now sitting within a few percent of Amazon. The move comes amid a renewed burst of crypto optimism, as Coinbase stock surges on imminent U.S. stablecoin regulation. This one-two punch of market and policy news is fuelling speculation that [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase hints at Bitcoin treasury as COIN stock reaches new heights",
      "link": "https://cryptoslate.com/coinbase-hints-at-bitcoin-treasury-as-coin-stock-reaches-new-heights/",
      "summary": "<p>Coinbase CEO Brian Armstrong has revealed that the exchange is steadily acquiring Bitcoin weekly, signaling what many believe could be the early stages of a treasury-building effort. Armstrong shared the update on June 27, stating that Coinbase has adopted a “Long Bitcoin” strategy. However, he stopped short of confirming whether these acquisitions are explicitly intended [&#8230;]</p> <p>"
    },
    {
      "title": "USDT on TRON Surpasses $80 Billion, Strengthening TRON’s Position as the Leading Stablecoin Network",
      "link": "https://cryptoslate.com/usdt-on-tron-surpasses-80-billion-strengthening-trons-position-as-the-leading-stablecoin-network/",
      "summary": "<p>June 26, 2025 &#8211; Geneva, Switzerland &#8211; TRON DAO announced today that the total circulating supply of USDT on the TRON blockchain has exceeded $80 billion, further cementing TRON’s position as the top blockchain for USDT activity. With USDT holding more than 63 percent of the global stablecoin market and surpassing 155 billion dollars in [&#8230;]</p> <p>"
    },
    {
      "title": "Dinari wins broker-dealer license to roll out tokenized stocks across US platforms",
      "link": "https://cryptoslate.com/dinari-wins-broker-dealer-license-to-roll-out-tokenized-stocks-across-us-platforms/",
      "summary": "<p>Dinari secured a US broker-dealer registration for its subsidiary, becoming the first platform cleared to offer blockchain-based shares of publicly traded companies to domestic investors, Reuters reported on June 26. The San Francisco firm stated that it will activate the licensed entity during the next quarter, following completion of onboarding with the Securities and Exchange [&#8230;]</p> <p>"
    },
    {
      "title": "Former Tether, Hut 8, Blackstone execs to launch $1B crypto treasury firm",
      "link": "https://cryptoslate.com/former-tether-hut-8-blackstone-execs-to-launch-1b-crypto-treasury-firm/",
      "summary": "<p>A group of high-profile financial executives, including former Blackstone dealmaker Chinh Chu and Tether co-founder Reeve Collins, are seeking to raise $1 billion to launch what could become the first publicly traded crypto treasury firm with a diversified portfolio, Bloomberg News reported on June 25, citing people familiar with the matter. The effort is being [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Declines Back To $2 As Legal Dispute With SEC Continues",
      "link": "https://www.newsbtc.com/xrp-news/xrp-price-declines-back-to-2-as-legal-dispute-with-sec-continues/",
      "summary": "The XRP price experienced a significant decline on Thursday following new developments in the ongoing legal dispute between Ripple Labs and the US Securities and Exchange Commission (SEC). Judge Analisa Torres&#8217; decision to deny the joint motion from Ripple and the SEC for an indicative ruling halted the XRP price recovery as it aimed to breach the nearest resistance level at $2.23. Key Issues Unresolved For Ripple Despite the SEC dropping its appeal, which indicated that the primary legal conflict between the two parties may be reaching a conclusion, Judge Torres&#8217; ruling highlighted that several procedural matters still require resolution, including necessary court approvals. In her judgment, she made it clear that private agreements cannot supersede public court decisions, stating, “The parties do not have the authority to agree not to be bound by a court’s final judgment… They have not come close to doing so here.” Related Reading: XRP Gears Up For Major Move — Chart Signals Are Clear In response to the ruling, Ripple&#8217;s Chief Legal Officer, Stuart Alderoty, took to social media platform X (formerly Twitter) to convey that the situation is now back in Ripple&#8217;s hands. The executive pointed out that the court has given them two options: either to dismiss their appeal regarding the historic institutional sales or to continue with the appeal. Regardless of the path chosen, Alderoty emphasized that XRP&#8217;s legal status as a non-security remains intact, reassuring stakeholders that it is business as usual. Expert Reactions To Torres’ Decision Legal expert Fred Rispoli also weighed in on the implications of the injunction, stating that it would not impact XRP in secondary markets or affect potential exchange-traded fund (ETF) filings awaiting approval by the SEC. He noted that the injunction is merely a court document and emphasized the low likelihood of Judge Torres calling Ripple and the SEC back into court unless the SEC believes Ripple is violating the terms of the injunction. Rispoli further questioned whether the SEC has the authority to grant Ripple the necessary exemptions to alleviate any restrictions imposed by the injunction, suggesting that such actions fall within the SEC&#8217;s executive powers. Ripple has asserted that it has adjusted its operations to align with the court&#8217;s findings, particularly regarding its past sales to institutional investors. Related Reading: Is The Bitcoin Top In? Bitcoin MVRV-Score Has The Answer Alderoty&#8217;s use of the term &#8220;historic institutional sales&#8221; in his recent statement indicates a shift in how both parties might approach future transactions, signaling a potential settlement that would allow XRP sales to institutions in a manner acceptable to the SEC. XRP Price Could Reach $5 Despite this temporary setback, market analysts remain optimistic about XRP&#8217;s future. Crypto analyst CryptoBullet recently noted that XRP&#8217;s two-week price chart resembles patterns seen in 2017, including a significant accumulation phase and a potential breakout. With this historical context in mind, the expert predicts a final surge in the XRP price, forecasting new all-time high targets between $4.50 and $5.40 for the cryptocurrency. As of press time, the XRP price has retreated to the $2.08 mark, which is a key support level for bulls anticipating further recovery of the token. In the last 24 hours, XRP has dropped 4.4%, and 10% in the last month. According to CoinGecko data, the XRP price remains 38% below its record high of $3.40. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Deaton Says Ripple IPO Could Trigger $100B Valuation, How High Will The XRP Price Be?",
      "link": "https://www.newsbtc.com/analysis/xrp/ripple-ipo-100b-xrp-price/",
      "summary": "The possibilities of a Ripple Initial Public Offering (IPO) have become higher as time goes on and the company moves toward a complete resolution of its SEC lawsuit. With expectations of the IPO rising, possible valuations have started to fly around as the company is one of the largest cryptocurrency companies. Most notably, pro-XRP lawyer and community member John Deaton has proposed that the Ripple IPO could lead to the company being valued at over $100 billion. Deaton Puts Ripple At $100 Billion The comment and valuation from lawyer John Deaton come after Circle, the company behind the USDC stablecoin, successfully completed its Initial Public Offering (IPO). So far, the crypto firm has found a lot of success in the market, surging from an initial $5 billion valuation to over $63 billion in valuation post-IPO. Related Reading: Bitcoin To Surge To $130,000 Next? What The Wave Count Says Deaton responded to a post on X (formerly Twitter), highlighting this feat, pointing out how Ripple could be even more successful in this regard. He explains that despite Ripple CEO Brad Garlinghouse saying that the company was in no rush to go public, the IPO should be timed correctly to have the right impact. Pointing to the current market environment, he points out that if Circle can grow to a $63 billion valuation, then it means that Ripple can soar even higher. Given XRP’s standing in the market as the 4th-largest cryptocurrency, ahead of Circle’s USDC, which sits at 7th place, Deaton believes that Ripple’s valuation post-IPO can rise to $100 billion. “If Circle can hit a 62B-75B market cap then Ripple, with nearly 40B XRP, currently valued at $2 (ie $80B), could certainly hit a $100B market cap in this environment,” Deaton wrote. As Bitcoinist reported, Ripple had issued a $700 million tender offer with shares priced at $175. This now puts the equity valuation of the company at $25 billion with 141 million outstanding shares as investors look favorably at the crypto firm. How High Could The XRP Price Go? Market experts have speculated that if the Ripple IPO does go through and the valuation soars, the XRP price will soar in tandem. Crypto investor Dennis Liu shared a video that suggested a successful IPO would be positive for the XRP price. He points out that a symbiotic relationship of the XRP coin related to the Ripple stock would be the dream of investors. Related Reading: Bitcoin Price Could Rally To $110,000 ATH As These Macroeconomic Factors Align Other market experts have debated that the XRP price would go double-digits to rise above $10 if this happens. In some cases, the XRP price has been pegged as high as $100 if Ripple does complete its IPO and begins trading as a publicly listed company. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "World Liberty Financial Receives $100 Million from UAE Crypto Investment",
      "link": "https://www.newsbtc.com/news/world-liberty-financial-receives-100-million-from-uae-crypto-investment/",
      "summary": "A fund based in the United Arab Emirates (UAE) has announced a significant investment of $100 million in the Trump-backed decentralized finance (DeFi) platform World Liberty Financial, and its native token WLFI. The investment was confirmed in a joint statement by Aqua 1 and World Liberty Financial, highlighting the collaboration as a step towards developing a blockchain financial ecosystem and integrating stablecoins. World Liberty Financial Partners With Aqua 1 Zak Folkman, co-founder of World Liberty Financial, expressed enthusiasm about the partnership, stating, &#8220;We’re excited to work hand-in-hand with the team at Aqua 1.” This investment positions Aqua 1 among the largest stakeholders in the Trump family&#8217;s cryptocurrency project. It is further strengthened by the backing of crypto billionaire Justin Sun, who is the top investor in the company with a substantial $75 million stake. Related Reading: XRP Gears Up For Major Move — Chart Signals Are Clear This marks the second investment from a UAE-based firm in World Liberty Financial within a short span; earlier this year, Abu Dhabi&#8217;s MGX used World Liberty Financial&#8217;s USD1 stablecoin to facilitate a $2 billion investment in Binance. David Lee, a founding partner at Aqua 1, stated that Aqua 1 and the decentralized platform will collaborate to “identify and nurture promising blockchain projects.” World Liberty Financial also plans to support the Aqua Fund, an investment vehicle focused on enhancing the digital economy in the Middle East. In addition, Aqua 1 will aid World Liberty Financial in expanding its reach into South America, Europe, Asia, and emerging markets. Both companies are also set to develop &#8220;BlockRock,&#8221; a platform aimed at tokenizing real-world assets (RWAs) to bridge traditional investments like real estate with the Web3 ecosystem. New App Launch Planned In tandem with these initiatives, World Liberty Financial is preparing to release an audit report of its stablecoin, USD1, within days. Folkman, speaking at the Permissionless conference in Brooklyn, New York, also mentioned that the platform&#8217;s WLFI token may soon become tradable. Launched two months prior to the US presidential election, WLFI has already generated substantial revenue for Trump’s family business through the sale of governance tokens. These tokens grant holders the ability to vote on project changes and influence its strategic direction. Related Reading: Is The Bitcoin Top In? Bitcoin MVRV-Score Has The Answer While WLFI is currently not tradable, Folkman hinted at forthcoming updates that users should watch for in the coming weeks. He also revealed that the company’s stablecoin has received its first attestation report, which will be available on the company&#8217;s website. To further facilitate user engagement, Folkman announced the upcoming launch of a new app designed to simplify cryptocurrency use for everyday investors. As of press time, the official TRUMP memecoin trades at $8.96, recording a major 30% drop in the monthly time frame. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Next Price Discovery Coming? Analyst Shares BTC’s 2025 Roadmap",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-next-price-discovery-coming-analyst-shares-btcs-2025-roadmap/",
      "summary": "This week, Bitcoin (BTC) has recovered from its recent drop below the $100,000 level and is attempting to turn the crucial $108,000 resistance into support for the fourth time. As we approach the second half of 2025, a market watcher has shared his forecast for BTC. Related Reading: Solana Price At ‘A Very Delicate Level’ – Analyst Says $148 Reclaim Is Key Bitcoin Sees Transitional Period On Thursday, analyst Rekt Capital shared a roadmap for BTC for the rest of the year. He noted that this cycle has been “truly a cycle of re-accumulation ranges,” explaining that these have formed throughout the cycle since the end of 2022 and evolved since the Bitcoin Halving last year. In the pre-having period, BTC registered brief price deviations with downside wicks below the re-accumulation range lows in the weekly chart. Meanwhile,"
    },
    {
      "title": "Bitcoin Binance Open Interest Shoots Up: Warning For BTC?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-binance-open-interest-warning-btc/",
      "summary": "Data shows the Bitcoin Open Interest on the cryptocurrency exchange Binance has recently shot up. What could this mean for the asset&#8217;s price? Bitcoin Binance Open Interest Has Seen A Sharp Increase As explained by an analyst in a CryptoQuant Quicktake post, the Bitcoin Open Interest on Binance has spiked. The &#8220;Open Interest&#8221; refers to an indicator that measures the total amount of BTC positions that are currently open on a given derivatives platform. When the value of the metric goes up, it means the investors are opening up fresh positions on the market. As the total amount of leverage present in the sector rises when new positions appear, this kind of trend can lead to the asset&#8217;s price becoming more volatile. Related Reading: Bitcoin Retests $108,000, But Holders Disagree On Direction On the other hand, the indicator observing a decline suggests the holders are either closing up positions of their own volition or getting liquidated by their platform. Since leverage goes down with such a trend, the cryptocurrency can become more stable following it. Now, here is a chart that shows the trend in the 24-hour percentage change of the Bitcoin Open Interest for the Binance exchange over the past month: As displayed in the above graph, the 24-hour change in the Binance Bitcoin Open Interest recently shot up to a notably positive value, implying the number of positions on the platform saw a significant jump. At the peak of this spike, the indicator hit a value of more than 6%. From the chart, it&#8217;s visible that there have been a couple of other occasions that the metric has breached this mark during the past month. Interestingly, each of these spikes coincided with points that preceded a period of consolidation/decline for Bitcoin. As the quant notes, This recurring pattern suggests that large inflows into leveraged positions often precede periods where short-term gains are realized, leading to potential price pullbacks or sideways movement as market participants de-risk. The analyst has also shared another chart, this one tracking the 7-day change in the Realized Cap of the short-term holders and long-term holders. The &#8220;Realized Cap&#8221; refers to an indicator that keeps track of the capital that the holders have invested into Bitcoin. Below is a chart that shows the change in this metric for two investor cohorts, short-term holders (holding time of 155 days or lesser) and long-term holders (holding time greater than 155 days). As is apparent from the graph, the 7-day change in the Realized Cap has recently been positive for long-term holders, which suggests capital has been maturing from the short-term holders into this cohort. Related Reading: Chainlink Holders Set Record As 1-Yr MVRV Signals ‘Opportunity’ That said, earlier in the month, the indicator hit a peak of $57 billion, but today it has come down to just $3.5 billion. So, while capital is still aging into long-term holders, it&#8217;s now happening at a much slower rate. BTC Price Bitcoin has been attempting to break past the $108,000 mark, but so far, it hasn&#8217;t found success as its price is still trading around $107,200. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Tahini’s Bitcoin Treasury: How a Family Chain Outsmarted Inflation",
      "link": "https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/tahini-bitcoin-2020-treasury-playbook.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation\" rel=\"nofollow\"> </a></p> <p>Tahini’s, a Canadian fast-casual chain, embraced Bitcoin in 2020, leveraging it to compete with giants like McDonald’s. Here’s their treasury playbook.</p> <p>"
    },
    {
      "title": "Coinbase to Launch US Nano Bitcoin Perpetual-Style Futures In July",
      "link": "https://bitcoinmagazine.com/news/coinbase-to-launch-us-nano-bitcoin-perpetual-style-futures-in-july",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-to-Launch-US-Nano-Bitcoin-Perpetual-Style-Futures-In-July.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-to-launch-us-nano-bitcoin-perpetual-style-futures-in-july\" rel=\"nofollow\"> </a></p> <p>Coinbase Derivatives to introduce long-dated, regulated futures contracts with 24/7 trading and spot price tracking.</p> <p>"
    },
    {
      "title": "Japan’s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC",
      "link": "https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Japans-Metaplanet-Acquires-1234-More-Bitcoin-Total-Holdings-Reach-12345-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-metaplanet-acquires-1234-more-bitcoin-total-holdings-reach-12345-btc\" rel=\"nofollow\">Japan&#8217;s Metaplanet Acquires 1,234 More Bitcoin, Total Holdings Reach 12,345 BTC</a></p> <p>The Japanese company continues accelerating its Bitcoin treasury strategy with a ¥19.27 billion purchase.</p> <p>"
    },
    {
      "title": "Kraken Launches Krak, a No-Fee App to Use and Store Bitcoin and Crypto",
      "link": "https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Launches-Krak-a-No-Fee-App-to-Use-and-Store-Bitcoin-and-Crypto.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-launches-krak-a-no-fee-app-to-use-and-store-bitcoin-and-crypto\" rel=\"nofollow\"> </a></p> <p>Bitcoin and crypto platform Kraken has officially launched Krak, a no-fee, all-in-one global money app that lets users spend, send, and save across over 300 fiat and digital assets—including Bitcoin. Designed to merge the best of banking, payments, and crypto into a single user experience, the Krak app is set to redefine how people move [&#8230;]</p> <p>"
    },
    {
      "title": "Castle Raises $1M to Bring Automated Bitcoin Treasury to Small & Medium-Sized Businesses",
      "link": "https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Castle-Raises-1M-to-Bring-Automated-Bitcoin-Treasury-to-Small-Medium-Sized-Businesses-2.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/castle-raises-1m-to-bring-automated-bitcoin-treasury-to-small-medium-sized-businesses\" rel=\"nofollow\">Castle Raises $1M to Bring Automated Bitcoin Treasury to Small &amp; Medium-Sized Businesses</a></p> <p>Backed by Boost VC and Winklevoss Capital, Castle aims to help SMBs protect their balance sheets by automating bitcoin allocations.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin ETFs Notch 13 Consecutive Days of Inflow—Why It Matters",
      "link": "https://decrypt.co/327337/bitcoin-etfs-13-consecutive-inflow-days",
      "summary": "Most Bitcoin ETF inflows are driven by long-only fundamental investors, not short-term traders, analyst Peter Chung told ."
    },
    {
      "title": "MrBeast Pulls AI Thumbnail Tool Following Backlash",
      "link": "https://decrypt.co/327338/mrbeast-pulls-ai-thumbnail-tool-backlash",
      "summary": "The YouTube star has made key changes to an AI tool he recently launched, following copyright concerns from content creators."
    },
    {
      "title": "Coinbase US Perpetuals Are Arriving Next Month as Stock Soars to New Heights",
      "link": "https://decrypt.co/327312/coinbase-us-perpetuals-are-arriving-next-month-as-stock-soars-to-new-heights",
      "summary": "Coinbase aims to fill what it describes as a “critical gap” in the U.S. market, where domestic traders have long relied on offshore platforms."
    },
    {
      "title": "Bakkt Files to Sell Up to $1 Billion in Securities For Potential Bitcoin Play",
      "link": "https://decrypt.co/327309/bakkt-files-1-billion-securities-bitcoin-play",
      "summary": "The platform is seeking new capital following a policy update earlier this month, allowing it to hold Bitcoin on its balance sheet."
    },
    {
      "title": "Bitwise Dogecoin, Aptos ETF Filing Updates Suggest Path to Approvals: Analyst",
      "link": "https://decrypt.co/327189/bitwise-dogecoin-aptos-etf-filing-approvals-analyst",
      "summary": "Amended Bitwise prospectuses for Dogecoin and Aptos ETFs are a good sign for their eventual approvals, a Bloomberg analyst told ."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Crypto exchange Bakkt files to raise up to $1 billion to support Bitcoin strategy",
      "link": "https://cryptobriefing.com/bakkt-bitcoin-strategy-funding/",
      "summary": "<p>Bakkt's fundraising could accelerate its shift towards crypto infrastructure, potentially influencing market dynamics and digital asset adoption.</p> <p>"
    },
    {
      "title": "US Treasury may release federal Bitcoin holdings report, says Bo Hines",
      "link": "https://cryptobriefing.com/us-bitcoin-holdings-treasury-report/",
      "summary": "<p>The potential release of the US Bitcoin holdings report could enhance transparency, influencing global crypto market dynamics and policy debates.</p> <p>"
    },
    {
      "title": "USDT on TRON surpasses $80 billion, strengthening TRON’s position as the leading stablecoin network",
      "link": "https://cryptobriefing.com/usdt-on-tron-stablecoin-leader/",
      "summary": "<p>USDT on TRON exceeds $80 billion in circulation, accounting for over half of global supply and leading active stablecoin network metrics.</p> <p>"
    },
    {
      "title": "Court rejects Ripple and SEC bid to slash $125M penalty and lift injunction on XRP sales to institutions",
      "link": "https://cryptobriefing.com/ripple-sec-penalty-court-decision/",
      "summary": "<p>The court's decision underscores the ongoing regulatory challenges and legal scrutiny facing the cryptocurrency industry.</p> <p>"
    },
    {
      "title": "Galaxy Digital secures $175 million for first venture fund to back early-stage crypto startups",
      "link": "https://cryptobriefing.com/early-stage-crypto-startups-fund/",
      "summary": "<p>Galaxy Digital's venture fund expansion could accelerate innovation in crypto, bridging traditional finance and blockchain, impacting global markets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Coinbase’s new perps come for Hyperliquid’s crown – ‘Net bearish for HYPE’",
      "link": "https://ambcrypto.com/coinbases-new-perps-come-for-hyperliquids-crown-net-bearish-for-hype/",
      "summary": "<img alt=\"Coinbase&#039;s new perps come for Hyperliquid&#039;s crown - &#039;Net bearish for HYPE&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Hyperliquid-HYPE-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE market remains cautious ahead of Coinbase direct competition against Hyperliquid."
    },
    {
      "title": "Meme Coin News: How to Buy Little Pepe (LILPEPE) as Presale Begins",
      "link": "https://ambcrypto.com/meme-coin-news-how-to-buy-little-pepe-lilpepe-as-presale-begins/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"431\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-27-142727.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"763\" />Little Pepe ($LILPEPE) is one of the latest meme coins to attract attention in 2025. [&#8230;]"
    },
    {
      "title": "$15B in Bitcoin Options expire today – Will it trigger a crypto market shake-up?",
      "link": "https://ambcrypto.com/15b-in-bitcoin-options-expire-today-will-it-trigger-a-crypto-market-shake-up/",
      "summary": "<img alt=\"$15B in Bitcoin Options expire today - Will it trigger a crypto market shake-up?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika3-1-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Could this expiry be the spark that breaks Bitcoin out of its current range?"
    },
    {
      "title": "How to play online casino in Norway with Bitcoin",
      "link": "https://ambcrypto.com/how-to-play-online-casino-in-norway-with-bitcoin/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"487\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-27-133651.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"744\" />Norway maintains strict control over gambling through a state monopoly that limits access to offshore [&#8230;]"
    },
    {
      "title": "Kaspa [KAS] on a long-term downtrend? Here’s why it should worry investors!",
      "link": "https://ambcrypto.com/kaspa-kas-on-a-long-term-downtrend-heres-why-it-should-worry-investors/",
      "summary": "<img alt=\"Kaspa [KAS] on a long-term downtrend? Here&#039;s why it should worry investors!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kaspa-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Kaspa's recovery from $0.06 support may be underway, but the bulls would likely struggle to make steady gains."
    }
  ]
}