{
  "CoinDesk": [
    {
      "title": "Eigen Labs Axes 25% of Staff to Focus on Building EigenCloud",
      "link": "https://www.coindesk.com/business/2025/07/09/eigen-labs-axes-25-of-staff-to-focus-on-building-eigencloud",
      "summary": ""
    },
    {
      "title": "Anthony Pompliano’s ProCap Appears Better Than Peers Based on the BTC HODLer's Own Data",
      "link": "https://www.coindesk.com/markets/2025/07/09/anthony-pomplianos-procap-appears-better-than-peers-based-on-the-btc-hodlers-own-data",
      "summary": ""
    },
    {
      "title": "New Zealand Wants to Ban Crypto ATMs in Anti-Money Laundering Overhaul",
      "link": "https://www.coindesk.com/policy/2025/07/09/new-zealand-wants-to-ban-crypto-atms-in-anti-money-laundering-overhaul",
      "summary": ""
    },
    {
      "title": "Bitcoin Treasury Firms Expand War Chests as Global Adoption Rises",
      "link": "https://www.coindesk.com/markets/2025/07/09/bitcoin-treasury-firms-expand-war-chests-as-global-adoption-rises",
      "summary": ""
    },
    {
      "title": "Focus on Market Cap, Trading Volume Rather Than Engagement for a Successful Token Launch, Research Shows",
      "link": "https://www.coindesk.com/markets/2025/07/09/focus-on-market-cap-trading-volume-rather-than-engagement-for-a-successful-token-launch-research-shows",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "South Korea plans to lift crypto venture business restrictions",
      "link": "https://cointelegraph.com/news/south-korea-to-lift-crypto-venture-restrictions?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmNlYjUtYWNmYi03MDc0LTk1ZjgtZTA3M2E5Y2IxZmE0.jpg\" /></p><p>South Korea may lift restrictions on crypto firms, allowing them venture status and access to tax breaks, funding and regulatory benefits.</p>"
    },
    {
      "title": "5 countries where crypto is (surprisingly) tax-free in 2025",
      "link": "https://cointelegraph.com/news/countries-where-crypto-is-tax-free?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2U2MDUtNjdkMC03NGQ3LWE4M2YtMjNkNmRhOTIyYzEx.jpg\" /></p><p>Looking to live tax-free with crypto in 2025? These five countries, including the Cayman Islands, UAE and Germany, still offer legal, zero-tax treatment for cryptocurrencies.</p>"
    },
    {
      "title": "Bitcoin gets &#039;highly favorable&#039; cues as DXY sets 21-year weakness record",
      "link": "https://cointelegraph.com/news/bitcoin-gets-highly-favorable-cues-dxy-sets-21-year-weakness-record?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTZjYzktZmVmZC03MGFlLThlNjQtODY5YWFjN2YwMjgw.jpg\" /></p><p>Bitcoin maintaining its inverse correlation to the US dollar means big wins on the horizon as the dollar strength DXY index trails below key moving averages.</p>"
    },
    {
      "title": "Crypto groups back lawsuit against DOJ crackdown on open-source code",
      "link": "https://cointelegraph.com/news/crypto-lobby-backs-dev-suing-doj-open-source-code?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VlNGMtYTVkMi03MDZhLThkYTMtOGRjODc1NTdhZGJm.jpg\" /></p><p>A coalition of major crypto groups is urging a federal court to reject the DOJ’s effort to apply money transmission laws to open-source software.</p>"
    },
    {
      "title": "OpenSea expands to mobile with Rally deal, eyes ‘onchain everything app’",
      "link": "https://cointelegraph.com/news/opensea-rally-deal-mobile-onchain-everything-app?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MmZmNzgtNGE4Ni03NWI0LTgwNTktOTYwMzkxNjIyNTU1.jpg\" /></p><p>OpenSea is going mobile after acquiring Rally, with plans to unify NFT and token trading, as well as expanding into DeFi, perpetuals and AI-powered tools.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "New Zealand to ban crypto ATMs in AML crackdown",
      "link": "https://cryptoslate.com/new-zealand-to-ban-crypto-atms-in-aml-crackdown/",
      "summary": "<p>New Zealand&#8217;s Ministry of Justice is set to ban crypto ATMs as part of a sweeping overhaul of the country&#8217;s anti-money laundering and counter-terrorism financing (AML/CFT) framework. The move forms part of a broader strategy to tighten regulations around financial crime while reducing compliance burdens for legitimate businesses. In a statement released on July 9, [&#8230;]</p> <p>"
    },
    {
      "title": "Survey finds gaps in mainstream Bitcoin coverage, leaving institutional investors exposed",
      "link": "https://cryptoslate.com/survey-finds-gaps-in-mainstream-bitcoin-coverage-leaving-institutional-investors-exposed/",
      "summary": "<p>A second-quarter survey of 18 mainstream news outlets logged 1,116 Bitcoin (BTC) stories and measured sentiment at 31% positive, 41% neutral, and 28% negative, according to Bitcoin analysis firm Perception. The data reveal a significant gap between finance-focused media that cover the market extensively and legacy publications that rarely address it. Sparse coverage Perception counted [&#8230;]</p> <p>"
    },
    {
      "title": "Joe Lubin forecasts Ethereum treasury strategies will reshape Wall Street perception",
      "link": "https://cryptoslate.com/joe-lubin-forecasts-ethereum-treasury-strategies-will-reshape-wall-street-perception/",
      "summary": "<p>Ethereum and Consensys co-founder Joe Lubin said companies adopting ETH treasury strategies will play a critical role in communicating the second-largest digital asset&#8217;s value to Wall Street, as major financial institutions ramp up blockchain use and process around 24 million transactions daily. Lubin made the statement during an interview with CNBC on July 8 in [&#8230;]</p> <p>"
    },
    {
      "title": "Stablecoin issuers’ $182 billion US Treasury hoard ranks 17th among countries, beating UAE and South Korea",
      "link": "https://cryptoslate.com/stablecoin-issuers-182-billion-us-treasury-hoard-ranks-17th-among-countries-beating-uae-and-south-korea/",
      "summary": "<p>Four US-dollar stablecoin issuers hold roughly $182 billion in US Treasury bills, an amount that would slot them 17th on the Treasury Department’s country-by-country league table. The amount in overnight Treasury-collateralized repos and Treasury-heavy money market funds would put the group between Norway’s $195.9 billion and Saudi Arabia’s $133.8 billion. Tether&#8217;s USDT tops the cohort. [&#8230;]</p> <p>"
    },
    {
      "title": "Volkswagen ADMT chooses Solana-based Hivemapper to power Robotaxi test fleet",
      "link": "https://cryptoslate.com/volkswagen-admt-chooses-solana-based-hivemapper-to-power-robotaxi-test-fleet/",
      "summary": "<p>Volkswagen ADMT, the automaker’s autonomous-driving subsidiary, will source real-time street-level data from Bee Maps, a spatial intelligence service that runs on Hivemapper’s Solana-based mapping network. According to Hivemapper CEO Ariel Seidman, the partnership “shifts mapping from static to living,” and that robotaxi fleets require data “that evolves as fast as the streets do.” Bee Maps [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Analyst Predicts 2,000% Cardano Rally: ‘Fractal Is Too Clean To Ignore’",
      "link": "https://www.newsbtc.com/news/cardano/analyst-predicts-2000-cardano-rally/",
      "summary": "Crypto-market commentator “Quantum Ascend” devoted a 8 June video to a single idea: the price structure that once catapulted Ethereum Classic to its bull-market peak is about to do the same for Cardano—and could deliver a twenty-fold advance if history “rhymes rather than repeats.” Speaking to his followers, the analyst opened by noting that ADA’s weekly chart “looks so similar” to the multi-year pattern that preceded Ethereum Classic’s vertical move in early 2021. “They have the same market makers,” he asserted, pointing out that Cardano founder Charles Hoskinson had early involvement in both projects. “It’s almost like a cheat code for this thing.” Cardano Set For 2,000% Explosion To illustrate the parallel, Quantum Ascend overlaid the two assets’ Elliott-wave counts. In his reading, Ethereum Classic completed its fifth impulsive wave during the last cycle, whereas Cardano is “waiting on that fifth wave” after a prolonged flag-shaped consolidation. He then dropped a Fibonacci retracement on Ethereum Classic’s 2020–21 third-to-fourth-wave segment, showing the final thrust topped out “just shy of the 2.36”—and repeated the exercise on Cardano’s current structure, which has advanced to the same proportional level. “Come on, it’s not perfect,” he conceded, “but you guys see how similar these structures are.” A second Fibonacci projection, stretching Cardano’s initial three-wave span to a full 1.618 extension, points to a conservative target “up around four bucks,” he said. But a more ambitious extrapolation of Ethereum Classic’s 3.618 climax would propel ADA into a zone between roughly 10.67 and 12.55—an area he calls his “primary” and “secondary” objectives. From the current price such a run would exceed 2,000 percent. “That’s violent,” he remarked after flicking his cursor to the comparative surge on the ETC chart. “Hopefully you can see how clean this is, because I feel really good about Cardano getting up into that $10 level.” Related Reading: Cardano (ADA) Turns Upward — Signs of a Recovery Emerge Quantum Ascend argued that the temporal spacing is also lining up. Ethereum Classic’s listing in August 2016 meant its multiyear base completed roughly four and a half years later; Cardano’s analogous base, begun in late 2017, is now of similar duration, though “the whole chart has taken a little bit longer on the consolidation.” For him, that extension merely “loads the spring” for a sharper repricing once last season begins in earnest. The analyst did allow for interim turbulence. In his scenario, ADA could hit the former all-time-high region around $3.12, “reject back down to $1.67” during a broader market-wide wave-four shake-out, and only then launch into a blow-off toward the upper Fibonacci cluster. Still, even that corrective loop reinforces the fractal: “Over here with Ethereum Classic it got to its last all-time high, rejected, and then went on one more big run.” Related Reading: Cardano Price Woes To Continue? Analyst Expects ADA To Fall To $0.47 Quantifying his own risk appetite, Quantum Ascend told viewers he is “pretty hyped on Cardano” and wants the token “in my portfolio because it is one of my higher-conviction plays for what’s about to happen here.” He concluded by sketching three tiers of price objectives—$4.90 (conservative), $10.67 (primary) and $12.45 (secondary). Whether altseason’s starting gun fires as cleanly as the fractal implies remains to be seen, but Quantum Ascend’s thesis hinges on a single proposition: when the same market makers move two historically linked assets through mirror-image patterns, ignoring the setup may prove costlier than betting against it. At press time, ADA traded at $0.59. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Is Already Outperforming Bitcoin In July, Is Altcoin Season Here?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-outperforming-bitcoin/",
      "summary": "With one week already gone in the month of July, Ethereum has already begun to perform better than Bitcoin. While the gap is still very close, the outperformance of Ethereum over Bitcoin for only the second time this year could signal the entrance of better things for the altcoin market. If this continues, then an altcoin season might be on the horizon, as historical data shows it always begins with ETH outperforming BTC. So, let’s take a look at how both assets have been performing. Ethereum Barrels Ahead Of Bitcoin In July So far, in the month of July, the Ethereum price has been putting in more green candles, suggesting that bulls are making their move again. This has led to a small outperformance when compared to the Bitcoin price over this time period and could be the signal that altcoin season could be starting soon. Related Reading: Shiba Inu Price Could See 180% Explosion As This Indicator Flashes Bullish Divergence Data from the CryptoRank website shows that Ethereum is already up more than 2.50% since the start of July. Meanwhile, the Bitcoin price, while having seen some price increases, is up only 1.20% at the time of this writing. Thus, Ethereum is already performing better in the month of July. If this outperformance continues, then this would be only the second time that the Ethereum price will be doing better than the Bitcoin price so far in 2025. The first was back in May, when the Ethereum price rallied by over 41% in one month. This was major compared to Bitcoin’s 11.1% move in that month. However, while the Bitcoin rally in the month of May saw its price reach new all-time highs, Ethereum continues to struggle and remains below its $4,800 all-time high levels. Nevertheless, Ethereum’s rally did translate to bullishness for the altcoin market as the likes of PEPE and BONK rallied by more than 100% in response to this. Related Reading: Bitcoin To Repeat Parabolic Phase From 2017 And 2021? Here’s The Target Given that Ethereum has led the altcoin season in the past, its outperformance of Bitcoin at this level remains a positive. If it continues, then the altcoin market could start to see further increases in price. And if Ethereum rises another 41% from here, it would put it right on the path to $4,000. However, the month of July has not historically been the best month for Ethereum, with an average return of +5.13%. The whole of the third quarter of the year is also a mixed bag for the altcoin, with an equal number of green and red closes over the last decade. Thus, it remains to be seen how the ETH price will perform this quarter and if it can successfully outpace Bitcoin. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana Ready For $160 Reclaim? Analysts Say Breakout Is A Matter Of Time",
      "link": "https://www.newsbtc.com/news/solana-ready-for-160-reclaim-analysts-say-breakout-is-a-matter-of-time/",
      "summary": "As the crypto market moves sideways, Solana (SOL) compresses between two key levels. Some analysts suggest that the cryptocurrency is about to break out and reclaim a crucial resistance level, which could trigger the long-awaited retest of the $200 barrier. Related Reading: Bitcoin Back In ‘Retesting Phase’ After Key Level Reclaim – The Calm Before The Storm? Solana Holds Key Support After recovering from last month’s downtrend, Solana has been attempting to reclaim the crucial $160 level to continue its bullish rally. The cryptocurrency traded between the $140-$180 range for two months, but briefly lost its post-breakout range in late June. Two weeks ago, SOL fell below the $130 area, hitting a two-month low of $126 on June 22. Since then, the altcoin has recovered, fueled by last week’s launch of a Solana staked crypto Exchange-Traded Fund (ETF) in the US by Rex Shares. Following the news, Solana’s price jumped toward the $160 resistance level but was rejected, hovering between the $145-$155 price range for the past week. On Tuesday, SOL fell below the $150 level, hitting the $147 support before bouncing. Analyst Ali Martinez noted that the $147.59 area is one of the most important support levels for Solana, as losing this level could trigger a pullback to the next key zone around the $141 mark. Similarly, market watcher Man of Bitcoin affirmed that SOL’s key support to maintain is around $141.91, adding that “a sustained break below this level would suggest that wave-C of (ii) is already underway.” The analyst previously warned that there is a potential scenario “with one more low in wave-5,” if the cryptocurrency doesn’t hold about the $148 mark. However, maintaining this support would build a base to target the local highs. SOL About To Retest $160? Analyst Carl Runefelt from The Moon Show affirmed that SOL is “about to break off” a triangle formation and test the $162 resistance. As the price compresses between the upper and lower boundaries, the analyst suggested that the cryptocurrency’s breakout is around the corner. Notably, Solana has been forming a one-week symmetrical triangle pattern in the daily chart. If the cryptocurrency successfully breaks above the $152-$153 zone, it could see a 10.87% jump toward the technical target of $167. The Cryptonomist highlighted that SOL broke out of a multi-day diagonal resistance on Sunday, which was retested and confirmed as support after bouncing around the $147 twice since the breakout. Related Reading: 50% Bitcoin Price Crash On The Horizon? Analyst Reveals $60,000 Target The analyst considers that the cryptocurrency is preparing for a continuation of its rally, targeting the one-week high and resistance of $160. Meanwhile, Crypto Jelle noted that despite the April downside deviation, Solana continues to trade within its $125-$180 Macro Range, currently hovering around the mid-range. To him, “it looks like it&#8217;s just waiting for BTC to break out. Once it reclaims $160, $200 should come quickly. Above there, new all-time highs are within reach.” As of this writing, Solana is trading at $151.51, a 3.6% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Bitcoin & Stablecoin Reserves Diverge On Binance: Liquidity Explosion Brewing?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-stablecoin-diverge-binance-explosion/",
      "summary": "On-chain data shows the Binance Exchange Reserve has diverged between Bitcoin and the stablecoins. Here&#8217;s what this could mean for the market. Bitcoin &#38; Stablecoin Exchange Reserves Have Decoupled On Binance In a CryptoQuant Quicktake post, an analyst has talked about the latest trend in the Binance Exchange Reserve for Bitcoin and the stablecoins. The &#8220;Exchange Reserve&#8221; here refers to an on-chain metric that keeps track of the total amount of a given asset that&#8217;s sitting on the wallets attached to a centralized exchange. When the value of this metric rises, it means the holders are making net deposits of the asset to the platform. Generally, investors use exchanges when they want to participate in trading activities, so them making inflows could signal appetite for trading the coin away. Related Reading: Ethereum ETF Inflows Hit 8-Week Streak—Institutions Still Buying For cryptocurrencies like Bitcoin, this is something that can naturally have a bearish impact on the price. The same, however, isn&#8217;t true in the case of the stablecoins, as they are, by definition, always stable around the same value as the fiat currency that they are pegged to. Investors usually store their capital in the form of these tokens when they want to avoid the volatility associated with assets like Bitcoin. Many of them, however, plan to eventually return back to the volatile side. Once they have decided to make the switch, they transfer their stablecoins to exchanges. When they make the swap to a coin like Bitcoin, its price naturally observes a buying boost. As such, stablecoin inflows can be bullish for the volatile cryptocurrencies. Now, here is the chart shared by the analyst that shows the trend in the Exchange Reserve of Binance for Bitcoin and the stablecoins over the last couple of years: As displayed in the above graph, the Binance Exchange Reserve for the two asset classes showed some correlation in 2024. But by the end of the year, a shift had occurred, with the stablecoins witnessing sharp inflows and Bitcoin outflows. The two have remained decoupled in 2025 so far, although their trends no longer diverge as extremely. The stablecoin Binance exchange reserve has recently been trending sideways, while the one for Bitcoin has rapidly been moving down. Related Reading: Dogecoin Resistance Walls Ahead: Analyst Flags 3 Key Levels Thus, it would appear that there is a large amount of fiat-tied tokens on the exchange potentially waiting to be deployed into the volatile side and at the same time, investors are also pulling out BTC supply, hinting at ongoing accumulation. This could hint at bullish conditions aligning on the largest cryptocurrency exchange, but it only remains to be seen whether the setup would reflect in the Bitcoin price or not. BTC Price Bitcoin is holding steady as its price is still trading around the $108,800 level. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com"
    },
    {
      "title": "2% Of All XRP Is In His Hands — But Who Is He?",
      "link": "https://www.newsbtc.com/altcoin/2-of-all-xrp-is-in-his-hands-but-who-is-he/",
      "summary": "A long‑time figure in the world of digital money and a noted XRP advocate stepped out of the shadows this week, sparking fresh chatter among investors and developers alike. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 Arthur Britto, who co‑founded Ripple Labs in 2012, broke a 14‑year silence with a single emoji on X. That tiny message carried big weight. His name rarely surfaces in headlines, but his work helped build XRP into one of the top assets by market value. Impact Of A Secretive Founder According to reports, Britto kept a low profile while helping craft the XRP Ledger’s code. He holds a 2% stake in XRP under a deal made when the company launched. That slice of holdings could be worth billions if the token’s price ever climbed high enough. Some in the market worry that if Britto ever sold even part of that stake, it might send prices tumbling. 🚨⚠️ HE CO-CREATED THE XRP LEDGER. HE HOLDS 2% OF ALL XRP. HE’S NEVER BEEN SEEN IN PUBLIC. Arthur Britto might be the most important figure in crypto you’ve never heard of. Let’s dive into the mystery.🧵👇 pic.twitter.com/xKyiYXIpGY — All Things XRP (@XRP_investing) July 5, 2025 The Satoshi Connection Based on reports, comparisons to Bitcoin’s creator have swirled around Britto for years. Some fans point to the fact that Satoshi Nakamoto’s last known post came just as the XRP Ledger went live. That timing alone has led people to whisper that Britto could be Satoshi under a different name. No proof supports that idea. Experts say it’s more likely just a coincidence. Britto’s lone emoji on X was verified by Ripple CTO David Schwartz. That confirmation set off a wave of theories about what might come next. Some speculated a new protocol update. Others thought it hinted at a partnership or a fresh product launch. So far, nothing public has followed"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Showed Up in DC — And Washington Took Notice",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Showed-Up-in-DC-—-And-Washington-Took-Notice-fotor-2025070812361.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice\" rel=\"nofollow\"> </a></p> <p>Reflections on the Bitcoin Policy Summit in Washington DC during May 2025. </p> <p>"
    },
    {
      "title": "Bow Valley Credit Union in Canada turns on Bitcoin purchases for Albertans",
      "link": "https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_an_orange_bull_running_through_an_Alberta_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans\" rel=\"nofollow\"> </a></p> <p>BVCU’s Bitcoin Gateway, with Balance Custody and Bull Bitcoin API, simplifies buying bitcoin. “Facilitates institutional adoption,” says Francis Pouliot. </p> <p>"
    },
    {
      "title": "KULR Secures $20M Bitcoin-Backed Credit Facility from Coinbase Credit",
      "link": "https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Secures-20M-Bitcoin-Backed-Credit-Facility-from-Coinbase-Credit.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit\" rel=\"nofollow\"> </a></p> <p>The deal sets up a multi-draw loan facility worth up to $20 million to expand its Bitcoin holdings.</p> <p>"
    },
    {
      "title": "Sequans Closes $384 Million Investment To Launch Bitcoin Treasury Initiative",
      "link": "https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Sequans-Closes-384-Million-Investment-To-Launch-Bitcoin-Treasury-Initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a fabless semiconductor company focusing on 5G/4G IoT semiconductor technology, has officially closed a $384 million strategic investment to kick off its Bitcoin treasury initiative. The deal combines $195 million in equity financing and $189 million in secured convertible debentures, reflecting growing institutional appetite for Bitcoin. The Offering included the sale of over [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet Enters ‘Bitcoin Gold Rush’ with Plans to Buy 210,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Metaplanet-Enters-Bitcoin-Gold-Rush-with-Plans-to-Buy-210000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027\" rel=\"nofollow\">Metaplanet Enters &#8216;Bitcoin Gold Rush&#8217; with Plans to Buy 210,000 BTC by 2027</a></p> <p>Japan’s top bitcoin treasury firm aims to grow its holdings to 210,000 BTC by 2027 and wants to use its growing reserves to buy cash-generating businesses.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "OmegaPro Founders Charged Over $650 Million Crypto ‘Global Fraud Scheme’",
      "link": "https://decrypt.co/329241/omegapro-founders-charged-over-650-million-crypto-global-fraud-scheme",
      "summary": "The duo allegedly used lavish Dubai events and luxury displays to lure investors into a bogus forex scheme that collapsed in 2023."
    },
    {
      "title": "New Zealand to Ban Crypto ATMs, Cap Transfers in AML Regime Shake-Up",
      "link": "https://decrypt.co/329228/new-zealand-bans-crypto-atms-caps-transfers",
      "summary": "With 221 machines nationwide, New Zealand joins countries reining in crypto kiosks over rising financial crime concerns."
    },
    {
      "title": "Inside North Korea's Hiring Scams Targeting Crypto Firms",
      "link": "https://decrypt.co/329225/inside-north-korea-hiring-scams-crypto-firms",
      "summary": "Companies and recruiters are warning that North Korea is hiring Europeans as fronts for job interviews, and the problem is only getting worse."
    },
    {
      "title": "Grok Glitch Inspires Wave of ‘MechaHitler’ Meme Coins",
      "link": "https://decrypt.co/329219/grok-glitch-inspires-mechahitler-meme-coins",
      "summary": "Rogue AI hallucinations by Grok have given rise to new crypto memes as well as associated tokens on Solana and Ethereum."
    },
    {
      "title": "Goblintown Heads to the Trenches With Solana Meme Coin Launch",
      "link": "https://decrypt.co/329100/goblintown-heads-trenches-solana-meme-coin-launch",
      "summary": "The creator of Ethereum NFT collection Goblintown thinks there's a better way to launch meme coins—and it just did so with GOB on Solana."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trillion-dollar bank clears Bitwise crypto ETF for advisor-managed accounts",
      "link": "https://cryptobriefing.com/crypto-etf-approval-bitwise-bank/",
      "summary": "<p>Institutional adoption of crypto ETFs signals a shift towards mainstream acceptance, potentially increasing crypto's role in diversified portfolios.</p> <p>"
    },
    {
      "title": "Phantom introduces in-wallet perps trading powered by Hyperliquid",
      "link": "https://cryptobriefing.com/in-wallet-perps-trading-phantom/",
      "summary": "<p>Phantom's integration of perpetual futures trading could significantly enhance user engagement and broaden crypto market accessibility.</p> <p>"
    },
    {
      "title": "ProShares’ XRP futures ETF listed on DTCC under ticker UXRP",
      "link": "https://cryptobriefing.com/proshares-xrp-etf-dtcc-listing/",
      "summary": "<p>The listing of ProShares' XRP futures ETF on DTCC suggests growing institutional interest and potential market expansion for crypto ETFs.</p> <p>"
    },
    {
      "title": "Amplifi partners with AIAPE to expand AI agent capabilities",
      "link": "https://cryptobriefing.com/amplifi-aiape-ai-agent-partnership-crypto-trading/",
      "summary": "<p>This partnership could enhance AI-driven trading efficiency, potentially reshaping digital asset markets and influencing future AI integrations.</p> <p>"
    },
    {
      "title": "Cardano Foundation unveils blockchain-based tool to simplify audit compliance and enhance financial reporting",
      "link": "https://cryptobriefing.com/blockchain-esg-compliance-cardano-reeve/",
      "summary": "<p>Cardano's blockchain tool could revolutionize audit compliance, boosting transparency and trust across various sectors and enhancing ESG efforts.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum vs. Solana: The $630B altcoin battle – Who will lead Q3?",
      "link": "https://ambcrypto.com/ethereum-vs-solana-the-630b-altcoin-battle-who-will-lead-q3/",
      "summary": "<img alt=\"SOL vs. ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika-1-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can Solana reassert dominance against Ethereum in Q3?"
    },
    {
      "title": "PENGU’s short-term price targets – A triangle breakout, $1M inflows, and more…",
      "link": "https://ambcrypto.com/pengus-short-term-price-targets-a-triangle-breakout-1m-inflows-and-more/",
      "summary": "<img alt=\"PENGU&#039;s short-term price targets - A triangle breakout, $1M Inflows, and more...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-08T174945.508-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PENGU’s rising inflows and breakout structure have been in line with renewed market activity, social engagement."
    },
    {
      "title": "Bitcoin supply drops, institutions load up $164M in BTC – Will prices follow?",
      "link": "https://ambcrypto.com/bitcoin-supply-drops-institutions-load-up-164m-in-btc-will-prices-follow/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Kelvin-_58_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin demand surges as institutions and whales accumulate, signaling potential continuation of the current bullish run."
    },
    {
      "title": "Bit Digital drops Bitcoin to join the Ethereum treasury bandwagon",
      "link": "https://ambcrypto.com/bit-digital-drops-bitcoin-to-join-the-ethereum-treasury-bandwagon/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ethereum-ETH-treasury-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will exodus from BTC miners to ETH treasury fuel the altcoin's price?"
    },
    {
      "title": "SEC reveals new Crypto ETF guidelines – Will Solana, Dogecoin be the first in line?",
      "link": "https://ambcrypto.com/sec-reveals-new-crypto-etf-guidelines-will-solana-dogecoin-be-the-first-in-line/",
      "summary": "<img alt=\"SEC reveals new Crypto ETF guidelines - Will Solana, Dogecoin be the first in line?\" class=\"attachment-full size-full wp-post-image\" height=\"756\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Crypto-ETFs-in-limbo.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1344\" />A new directive might go a long way towards crypto's development and evolution."
    }
  ]
}