{
  "CoinDesk": [
    {
      "title": "ADA Takes a Hard Fall as Traders Feel the Heat of War in the Middle East",
      "link": "https://www.coindesk.com/markets/2025/06/22/ada-takes-a-hard-fall-as-traders-feel-the-heat-of-war-in-the-middle-east",
      "summary": ""
    },
    {
      "title": "Dogecoin Drops 8% but Shows V-Shaped Recovery in Boost for Bulls",
      "link": "https://www.coindesk.com/markets/2025/06/22/dogecoin-drops-8-but-shows-v-shaped-recovery-in-boost-for-bulls",
      "summary": ""
    },
    {
      "title": "XRP Rebounds From Intraday Lows, Forms Bullish Pattern Above Key Support",
      "link": "https://www.coindesk.com/markets/2025/06/22/xrp-rebounds-from-intraday-lows-forms-bullish-pattern-above-key-support",
      "summary": ""
    },
    {
      "title": "Bitcoin Rallies Above $102K After Panic Sellers Dump Into War Fears",
      "link": "https://www.coindesk.com/markets/2025/06/22/bitcoin-rallies-above-usd102k-after-panic-sellers-dump-into-war-fears",
      "summary": ""
    },
    {
      "title": "Bullish Crypto Bets Liquidated for $595M as U.S. Bombs Iran Nuclear Sites",
      "link": "https://www.coindesk.com/markets/2025/06/22/bullish-crypto-bets-liquidated-for-595m-as-us-bombs-iran-nuclear-sites",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Break Singapore’s new crypto rules and you could face $200K fine or jail",
      "link": "https://cointelegraph.com/explained/break-singapores-new-crypto-rules-and-you-could-face-200k-fine-or-jail?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy84NGJjMGNiYWM0NzFhZDFlZDMxNTVkMTg0NjZhMDRlYi5qcGc=.jpg\" /></p><p>Singapore is tightening its grip on crypto misconduct. Under new rules, unlicensed promotions or shady practices could lead to steep fines or prison time.</p>"
    },
    {
      "title": "Lummis’ RISE Act is ‘timely and needed’ but short on details",
      "link": "https://cointelegraph.com/news/rise-act-cynthia-lummis-needed-but-vague?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhkYjYtZDkzNS03ZTNkLWI2MjUtZDI5MGVmNDI1YTY5.jpg\" /></p><p>Senator Lummis’ RISE Act may be a good start, but does it ask too much of doctors, lawyers and engineers — while shielding AI developers?</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Despite Trump’s backing, crypto is choosing MiCA over America: Paybis",
      "link": "https://cointelegraph.com/news/crypto-flows-to-europe-under-mica-trump-us-retreat?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzJlZGEtYjdhNS03ODdlLTkzN2MtYWNkZDc4MDgzNGM5.jpg\" /></p><p>MiCA’s licensing clarity helped Europe capture crypto flows as US retail activity declined despite a crypto-friendly Trump administration.</p>"
    },
    {
      "title": "Bitcoin price risks sub-$100K dive after Trump confirms Iran strikes",
      "link": "https://cointelegraph.com/news/bitcoin-price-risks-sub-100k-dive-after-trump-confirms-iran-strikes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzIyMzMtZWVhNS03ZDI0LWJiMWItMzllNGVkNzhiMGJk.jpg\" /></p><p>BTC price declines accelerate as the US hits Iran's nuclear facilities, but traders are hopeful that Bitcoin may even gain from geopolitical uncertainty.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Solana network extensions will redefine blockchain scaling",
      "link": "https://cryptoslate.com/solana-network-extensions-will-redefine-blockchain-scaling/",
      "summary": "<p>The following is a guest post and opinion from Aryan Sheikhalian, Head of Research at CMT Digital. Ethereum is betting big on a future filled with rollups. But in typical Solana fashion, the network is taking a different route—one that doesn’t just scale more blockspace, but bespoke execution environments with first-class developer control. Enter Network [&#8230;]</p> <p>"
    },
    {
      "title": "Oil markets tense amid U.S. airstrikes on Iran, while Bitcoin price holds steady",
      "link": "https://cryptoslate.com/oil-markets-tense-amid-u-s-airstrikes-on-iran-while-bitcoin-price-holds-steady/",
      "summary": "<p>Global oil markets are on high alert following U.S. airstrikes on three of Iran’s nuclear facilities, Fordow, Isfahan, and Natanz, with fears mounting over a potential closure of the critical Strait of Hormuz. The military action, announced by President Donald Trump last night, has intensified geopolitical tensions in the Middle East and raised concerns about [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto has grown up: Why the Rolex rally is on pause in 2025",
      "link": "https://cryptoslate.com/crypto-has-grown-up-why-the-rolex-rally-is-on-pause-in-2025/",
      "summary": "<p>The following is a guest post and opinion from Gracy Chen, CEO of Bitget. There was a time not too long ago when the pulse of the crypto market could be measured not only by candlestick charts but by the waitlists at luxury watch boutiques. During the 2020–2022 bull cycle, the correlation between Bitcoin and [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase CEO highlights 3 key reasons why the world needs crypto",
      "link": "https://cryptoslate.com/coinbase-ceo-highlights-3-key-reasons-why-the-world-needs-crypto/",
      "summary": "<p>As the world faces increasing economic woes from soaring debt and stubborn inflation to dwindling trust in financial institutions, Coinbase CEO says, “The world needs crypto, now more than ever.” He adds: “Debt is growing exponentially, inflation is crippling entire nations, economic freedom is declining.” Armstrong points to the astronomical level of U.S. federal debt, [&#8230;]</p> <p>"
    },
    {
      "title": "Pumpfun reportedly delays token auction to July amid legal troubles",
      "link": "https://cryptoslate.com/pumpfun-reportedly-delays-token-auction-to-july-amid-legal-troubles/",
      "summary": "<p>Pump.fun has delayed its public token sale once again, extending months of uncertainty for users and investors as the popular Solana-based launchpad wrestles with a flurry of lawsuits, Colin Wu reported on June 20. Pump.fun had aimed to raise $1 billion at a $4 billion valuation through its token auction originally set for June 25. The [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bears Will Be Washed Out Of Bitcoin If This Happens",
      "link": "https://www.newsbtc.com/news/bitcoin/bears-washed-out-bitcoin/",
      "summary": "Bitcoin’s narrow price movement over the past week contradicts a much different development in the futures market. According to Axel Adler Jr., an analyst at on-chain analytics platform CryptoQuant, a sharp rise in the long liquidation dominance metric could set the stage for a significant shift in sentiment that may completely wash out bears from the market. Adler shared the data in a recent post on X, accompanied by a chart showing previous points that resemble the current setup. Long Liquidation Spike Without Price Crash The dominance of long liquidations has jumped from 0% to +10% over the past seven days, a move that typically shows distress among bullish traders. However, what makes the current development especially noteworthy is the absence of a steep crash in Bitcoin’s price. Instead, in the just concluded week, Bitcoin held mostly within the $103,000 to $106,000 range until a recent drop, despite facing increasing pressure from long-side liquidations. Related Reading: XRP Daily RSI Trendline Breaks Down – What It Means For Price Axel Adler Jr. explained that this sustained liquidation of long positions without a full-blown price collapse indicates sustained buyer support. According to data from CryptoQuant, BTC’s long liquidations hit 2,200 BTC, the highest in the past week. Usually, a surge in long liquidations suggests that traders who were anticipating a price rally are being pushed out of their positions under pressure. The CryptoQuant chart below shows how spikes in long liquidation dominance, especially in the 15% to 20% range, have always preceded bullish reversals. According to the analyst, if this metric rises by another 5–7%, it could cause a high-probability scenario where bearish positions are washed out and flip Bitcoin’s price movements in favor of the bulls. Image From X: @AxelAdlerJr Large Wallets Accumulate As Retail Exits Data from Santiment, another on-chain analytics platform, shows an interesting dynamic playing out among Bitcoin holders. Over the past ten days, wallets holding over 10 BTC have increased by 231 addresses, which is a 0.15% rise. Meanwhile, smaller retail wallets containing between 0.001 and 10 BTC have dropped by 37,465 in the same timeframe. This trend highlights a divergence in sentiment between large and retail holders. Related Reading: XRP Price Crash Tests Critical Support At $2.1, Will It Break? According to Santiment, the shift where whales and sharks accumulate while retail exits is a bullish combination for Bitcoin. Bitcoin’s market value is hovering just below $104,000 during this accumulation phase, and there could be an eventual upward breakout once retail holders begin to reenter. Image From X: Santiment Despite the underlying on-chain strength, Bitcoin’s spot price has taken a short-term hit in the past 48 hours. During this timeframe, Bitcoin&#8217;s price has slipped below support levels between $106,000 and $103,000. At the time of writing, Bitcoin is trading at $102,670, down by 2.6% in the past 24 hours. The decline can be largely attributed to recent U.S. strikes on Iran. The U.S. military strikes on Iranian nuclear facilities (June 21-22) caused immediate risk aversion across markets. Bitcoin fell 3.2% after announcements of the strikes, much like its 6% drop during similar 2020 Iran tensions. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "US Bitcoin ETFs Hit 9 Days Inflow Streak Despite Price Struggles",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-etfs-hit-9-days-inflow-streak-despite-price/",
      "summary": "The spot Bitcoin ETFs (exchange-traded funds) have been in good form over the past few weeks, receiving renewed interest from investors in the United States. This recent spurt of momentum has been a rare bright spark in the crypto market, which has been overwhelmed with investor uncertainty lately. Interestingly, the typically straight line between the spot Bitcoin ETFs’ performance and the BTC price action has not been particularly straight in the past few weeks. While the crypto-linked financial products have shone in the past few days, the underlying premier cryptocurrency has seen better days. Spot Bitcoin ETFs Record $1 Billion In The Past Week According to the latest market data, the US-based spot Bitcoin ETF market recorded a total net inflow of $6.37 million on Friday, June 20. This performance marked the ninth successive day of positive capital influx for the crypto investment products, signaling increased investor interest and demand. Related Reading: Stablecoin Wars Ignite: Peter Schiff Champions Gold-Backed Digital Assets SoSoValue data shows that BlackRock’s iShares Bitcoin Trust (with the ticker IBIT) was the only BTC exchange-traded fund with net inflow on Friday. The trillion-dollar asset manager’s fund added a remarkable $46.91 million in value to close the week, as it continues to lead the pack in net assets. Fidelity Wise Origin Bitcoin Fund (FBTC) was the only other Bitcoin ETF that recorded any activity on Friday. According to market data, the second-largest spot BTC exchange-traded fund by net assets posted a daily net outflow of $40.55 million on the day. Nonetheless, the $6.37 million single-day performance pushed the US-based Bitcoin ETFs’ weekly record above the $1 billion mark. While this figure falls short of the exchange-traded funds’ performance ($1.39 billion) in the previous week, it still represents a trend in the right direction after enduring two weeks of nearly $300 million in outflows. Bitcoin Price Falls Below $101,000 Level Despite the positive performances of the US-based Bitcoin ETFs, BTC’s price has continued to struggle to build any sustained bullish momentum over the past two weeks. The flagship cryptocurrency seemed set for another trip to a new all-time-high price earlier this week before succumbing to some bearish pressure mid-week. In the late hours of Saturday, the price of BTC fell to below the $101,500 level as another wave of downward pressure hit the crypto market. As of this writing, the market leader is valued at around $101,484, reflecting an almost 2% price decline in the past 24 hours. According to data from CoinGecko, the price of Bitcoin is down by nearly 4% in the past seven days. Related Reading: Bitcoin Sees Modest Gains, But Demand Weakness Limits Breakout Potential Featured image from iStock, chart from TradingView"
    },
    {
      "title": "Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106",
      "link": "https://www.newsbtc.com/news/solana/solana-cracks-below-key-structure-head-and-shoulders-breakdown-points-to-106/",
      "summary": "Solana has broken down decisively, losing a critical support level following news that the United States launched an attack on Iranian nuclear facilities. The unexpected geopolitical development triggered widespread panic across financial markets, with altcoins taking the hardest hit. Solana, in particular, has seen significant selling pressure, dropping 20% from its May high of approximately $185 and now trading near $148. Related Reading: Ethereum Charts Signal Potential Bottom – All Eyes On Next Move This breakdown confirms investor concerns that SOL&#8217;s uptrend has weakened. Top analyst Carl Runefelt noted that Solana has completed a Head and Shoulders pattern—a bearish technical structure often signaling deeper downside. The price has broken below the neckline of this pattern, confirming the potential for continued declines in the short term. Adding to the bearish outlook is Solana&#8217;s inability to reclaim its prior support levels during brief bounces. With momentum indicators turning negative and broader market sentiment rattled, the likelihood of a swift recovery appears slim unless macro conditions stabilize. Solana Faces Deeper Correction As Bearish Pattern Unfolds Solana’s bullish momentum from late 2024 has all but faded, replaced by stagnation and sharp corrections as market conditions worsen. Now trading more than 50% below its all-time high, SOL continues to struggle under the weight of global macroeconomic uncertainty and rising geopolitical tensions. The US military strike on Iranian nuclear facilities has only added to the volatility, sending shockwaves through both traditional and crypto markets. While Solana was one of the strongest performers during the previous cycle, its price action has turned decisively bearish in recent weeks. Bulls have failed to maintain critical support levels, and the asset has now broken below its short-term trend structures. According to Runefelt, Solana has completed a Head and Shoulders pattern, a classic technical signal that often precedes a prolonged downtrend. The pattern’s neckline has been breached, and the projected bearish target now stands around $106.30—a level not seen since February. The breakdown also reflects broader weakness in the altcoin market. Despite earlier hopes for an altseason, capital has rotated out of risk assets, favoring Bitcoin and stablecoins amid uncertainty. Solana&#8217;s inability to reclaim prior highs or establish higher lows points to a market in retreat. Momentum indicators continue to flash red, and unless bulls reclaim lost ground quickly, SOL could be facing an extended period of consolidation or further losses. Related Reading: Tron Energy Usage Surges 108% – Smart Contract Activity Accelerates SOL Price Analysis: Breaking Below Key Support Solana is under pressure as it breaks below the critical 200-day simple moving average (SMA) around $149.54, a level that had previously acted as dynamic support. This breakdown signals growing bearish sentiment as price action confirms a loss of momentum following weeks of consolidation below the $155–$160 resistance zone. As of now, SOL is trading at approximately $135.99, down nearly 3% on the day and over 20% from its May highs. The chart shows a rejection near the 100-day SMA (green line), and the sustained move below both the 200-day and 50-day SMAs (blue line) points to a shifting structure, leaning heavily toward the downside. Volume remains elevated on red candles, confirming that the breakdown is supported by increasing sell pressure rather than a low-liquidity move. Related Reading: Ethereum Prepares For A Decisive Move: ETH/BTC Setup Could Trigger Altseason If the current trend continues, Solana could revisit the $120–$125 range, which previously served as strong support in early Q1 2025. The broader context of macroeconomic volatility and geopolitical tension, particularly the recent U.S. attack on Iran, adds to investor unease across risk assets, including altcoins like Solana. A daily close back above $149 would be needed to neutralize the short-term bearish structure and shift sentiment. Until then, downside risks dominate. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Slips Below $102,000 — Here’s The Next Support In Sight",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-slips-beneath-102000-heres-the-next-support/",
      "summary": "The Bitcoin price had a tough start to the weekend, plummeting from its $106,000 high to just above $103,000 on Friday, June 20. The flagship cryptocurrency became somewhat stable above this price zone, hovering around the $104,000 mark for most of the past day. However, the Bitcoin price faced another wave of bearish pressure in the late hours of Saturday, June 21, falling to around $101,500 as a result. Below is an analysis of the BTC price and what lies ahead for the world’s largest cryptocurrency by market capitalization. Next BTC Support Level Lies At $100,000: Analyst Popular crypto analyst with the pseudonym Titan of Crypto put forward an interesting analysis for the Bitcoin price as the market leader struggles to build any momentum. According to the online pundit, the price of BTC could be on its way to retest a crucial support area if it continues to lose its bullish impetus. Related Reading: Bitcoin Net Taker Volume Enters Deep Red On Binance — What’s Next For BTC Price? Using the Bitcoin price chart on the weekly timeframe, the next significant support level lies around the $99,000 – $100,000 range. The confluence of the Fair Value Gap (FVG) and the rising Tenkan-sen (red line) around this price region makes the zone a significant area to watch if selling pressure persists. The Tenkan-sen, a key component of the Ichimoku Cloud indicator, is often considered a significant line in analyzing short-term trends. The Tenkan-sen line is often seen as a key support and resistance level, as well as a signal line for potential trend reversals. The Fair Value Gap is a liquidity void often created by a sharp movement in price, indicating a lack of trading activity within a particular price range. FVGs are usually considered as potential regions of interest for future price corrections, as investors often look to fill the liquidity void. With the FVG and the Tenkan-sen set within this same region, Titan of Crypto noted that the Bitcoin price may find a support cushion around the $100,000. This level appears to be extremely crucial for the flagship cryptocurrency in the short term, especially as its bullish momentum wanes. Meanwhile, holding above this $100,000 support could be critical to Bitcoin’s long-term trajectory. It is worth noting that the price of BTC has not traded beneath $100,000 since May 8, reaching the $110,000 mark twice within that span. Bitcoin Price At A Glance After falling to around $101,400 in the late hours of Saturday, the price of Bitcoin has now returned around $103,000. As of this writing, the price of BTC stands at around $102,845, reflecting a 0.4% decline in the past 24 hours. Related Reading: Stablecoin Wars Ignite: Peter Schiff Champions Gold-Backed Digital Assets Featured image from iStock, chart from TradingView"
    },
    {
      "title": "Ethereum Weekly Chart Nears Tower Top Formation As US Launches Attack On Iran – Details",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-weekly-chart-nears-tower-top-formation-as-us-launches-attack-on-iran-details/",
      "summary": "Ethereum has officially broken below the long-standing range it had maintained since early May, losing the critical $2,320 support level. This breakdown was triggered by escalating geopolitical tensions, as news broke that the United States had launched attacks on Iranian nuclear facilities. The announcement sent shockwaves through global markets, sparking widespread risk-off behavior and panic selling across crypto. Ethereum, already trading near the bottom of its six-week consolidation range, quickly reacted with a sharp drop, dragging the broader altcoin market with it. Related Reading: Solana Analyst Sees $123 And $116 As Mid-Zone Support Levels – Here’s Why The move marks a critical shift in sentiment, as Ethereum now trades outside the range that had served as a battleground between bulls and bears for over a month. With volatility spiking and confidence shaken, traders are re-evaluating risk in light of escalating conflict in the Middle East and broader macroeconomic headwinds. According to top analyst Big Cheds, Ethereum&#8217;s weekly chart is now flirting with a potential tower top pattern completion — a bearish reversal structure that may signal further downside unless buyers reclaim key levels in the coming days. As the situation evolves, all eyes will remain on ETH’s ability to hold new support levels or risk further decline in a fragile market environment. Ethereum Slides 22% From June Highs – All Eyes On Weekly Structure Ethereum has lost over 22% of its value since peaking in early June, as global instability and heightened selling pressure weigh heavily on market sentiment. The asset has now broken below its six-week range, triggering concern among investors and adding to uncertainty across the broader crypto space. With rising tensions in the Middle East—particularly following US attacks on Iranian nuclear facilities—the market has entered a risk-off environment, dragging altcoins like Ethereum into deeper retracements. Despite the volatility, Ethereum remains at the center of investor focus, as many still expect it to lead the next altseason. However, with bulls losing control of key support zones, confidence in a near-term rally continues to waver. Analysts are now split: while some predict a deeper retracement toward the $2,000 region, others argue that Ethereum is nearing exhaustion on the downside and may soon recover. Big Cheds points to Ethereum’s weekly chart, where the price is currently flirting with a potential tower top pattern—a bearish reversal structure. If this pattern confirms, ETH may face another wave of downside before finding demand at lower supply levels. If buyers step in during this pivotal moment, a recovery from this structure could quickly follow. The coming sessions will be critical in determining whether this breakdown extends or turns into a fakeout with bullish continuation. For now, traders should remain cautious, as Ethereum&#8217;s next move could define the tone of the altcoin market heading into July. Related Reading: Tron Energy Usage Surges 108% – Smart Contract Activity Accelerates Ethereum Breaks Down Below Support As Volatility Spikes Ethereum has officially broken below the $2,320 support level, signaling a shift in short-term market structure as shown in the 4-hour chart. After weeks of ranging between $2,320 and $2,650, ETH failed to reclaim its moving averages and lost bullish momentum. The price is now trading around $2,260, down sharply from its June highs near $2,900. This recent leg down follows a clean breakdown through the 50, 100, and 200-period SMAs, confirming a strong bearish momentum. Volume spikes accompanied the drop, suggesting panic selling likely triggered by geopolitical turmoil in the Middle East. The price broke down aggressively with little resistance, meaning previous demand zones have now become weak. If buyers fail to step in quickly, Ethereum may revisit earlier May support levels around $2,100 or even $2,000. Related Reading: Ethereum Charts Signal Potential Bottom – All Eyes On Next Move From a technical standpoint, the breakdown invalidates the previous consolidation range, opening the door for a possible extended correction. Until ETH reclaims $2,320 and stabilizes above its moving averages, the risk of continued downside remains high. Market participants should watch closely for volume shifts or bullish divergences, but for now, Ethereum remains under pressure as uncertainty continues to dominate the macro environment. The next few sessions will be crucial for price discovery. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Norway Plans to Temporarily Ban New Bitcoin & Crypto Mining Centers to Conserve Energy",
      "link": "https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/NBX-Acquires-Bitcoin-Becomes-First-Public-Bitcoin-Treasury-Company-in-Norway.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy\" rel=\"nofollow\">Norway Plans to Temporarily Ban New Bitcoin &amp; Crypto Mining Centers to Conserve Energy</a></p> <p>Norway’s government will temporarily block the development of new Bitcoin and cryptocurrency mining facilities starting this year, prioritizing energy for other industries.</p> <p>"
    },
    {
      "title": "A Seed Phrase Isn’t Self Custody, It’s A Liability.",
      "link": "https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/seedlessheader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability\" rel=\"nofollow\"> </a></p> <p>Seed phrases were an improvement a decade ago. They’re long overdue for an upgrade.</p> <p>"
    },
    {
      "title": "Is the 4-Year Bitcoin Cycle Over? Rational Root Explains Why This Time Might Not Be Different",
      "link": "https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Is-the-4-Year-Bitcoin-Cycle-Over-Rational-Root-Explains.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root\" rel=\"nofollow\"> </a></p> <p>Rational Root joins Pro to debate whether the 4-year Bitcoin cycle is breaking down in the age of ETFs, passive flows, and institutions.</p> <p>"
    },
    {
      "title": "What Happens to Bitcoin When Quantum Computers Arrive?",
      "link": "https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ChaincodeReportHeader-fotor-20250620123039.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive\" rel=\"nofollow\"> </a></p> <p>A high level overview of the recent report by Chaincode Labs on the threat quantum computing poses to Bitcoin. </p> <p>"
    },
    {
      "title": "Coinbase Secures MiCA License to Serve 450 Million Europeans",
      "link": "https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans\" rel=\"nofollow\"> </a></p> <p>Coinbase has obtained its Markets in Crypto Assets (MiCA) license from Luxembourg&#8217;s Commission de Surveillance du Secteur Financier (CSSF), marking a significant regulatory milestone that enables them to offer its complete range of services across all 27 European Union member states. The license allows Coinbase to serve approximately 450 million Europeans under a unified regulatory [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Which Crypto IPOs Could Be Next Following Circle?",
      "link": "https://decrypt.co/326369/which-crypto-ipos-could-be-next-following-circle",
      "summary": "Following Circle’s hugely successful IPO, big names in the crypto industry are preparing listings as investor demand soars."
    },
    {
      "title": "Crypto Market Liquidations Top $701M as US Strikes Hit Iran's Nuclear Facilities",
      "link": "https://decrypt.co/326402/crypto-market-liquidations-top-701m-as-u-s-strikes-hit-irans-nuclear-facilities",
      "summary": "Ethereum led the crypto market selloff Sunday morning, after U.S. President Donald Trump ordered strikes on three Iranian nuclear facilities."
    },
    {
      "title": "'Public Good': Wyoming Plots August Debut for WYST Stablecoin",
      "link": "https://decrypt.co/326331/wyoming-plots-august-debut-wyst-state-stablecoin",
      "summary": "The Wyoming Stable Token Commission is targeting an August launch for its state stablecoin following years of preparation."
    },
    {
      "title": "How 'MapleStory N' Is Fighting Back Against Thousands of Hackers",
      "link": "https://decrypt.co/326266/how-maplestory-n-fighting-back-against-hackers",
      "summary": "MapleStory N is banning thousands of hackers a day, as abusers try to make a quick buck off the Avalanche blockchain game."
    },
    {
      "title": "From Free NFT Mint to Drinks at 7-Eleven: Rekt Is Reaching the Masses",
      "link": "https://decrypt.co/326337/from-nft-drinks-7-eleven-rekt-reaching-masses",
      "summary": "Rekt began life as free Ethereum NFT drop and now is a rising drink brand, with cans hitting 7-Eleven stores this week."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump announces US airstrikes on Iran’s nuclear sites, Bitcoin dumps, then pumps",
      "link": "https://cryptobriefing.com/us-iran-airstrikes-nuclear-sites/",
      "summary": "<p>The airstrikes heighten geopolitical tensions, potentially destabilizing the region and impacting global markets and cryptocurrency volatility.</p> <p>"
    },
    {
      "title": "Texas governor signs Bitcoin reserve bill into law",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-law/",
      "summary": "<p>Texas' Bitcoin reserve law could bolster financial resilience and set a precedent for other states to integrate crypto into fiscal strategies.</p> <p>"
    },
    {
      "title": "CoinMarketCap’s front-end compromised, investigation underway",
      "link": "https://cryptobriefing.com/coinmarketcap-security-breach-investigation/",
      "summary": "<p>This incident highlights the urgent need for enhanced cybersecurity measures in the crypto industry to protect user assets and data integrity.</p> <p>"
    },
    {
      "title": "Texas governor signs bill to protect state Bitcoin reserve as a permanent fund if established",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-protection-bill/",
      "summary": "<p>Texas' move to protect a potential Bitcoin reserve could set a precedent for state-level crypto asset management, influencing future fiscal policies.</p> <p>"
    },
    {
      "title": "XRP joins Solana and Litecoin in top ETF approval tier",
      "link": "https://cryptobriefing.com/spot-crypto-etf-approval-tier/",
      "summary": "<p>The increased likelihood of crypto ETF approvals could significantly boost market legitimacy and attract institutional investment.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin to $94K? – Analyst flags risk of BTC price dip: Here’s why",
      "link": "https://ambcrypto.com/bitcoin-to-94k-analyst-flags-risk-of-btc-price-dip-heres-why/",
      "summary": "<img alt=\"Bitcoin [BTC]\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-5-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is Bitcoin's recent price drop just the beginning of a much bigger fall?"
    },
    {
      "title": "Solana stalls at $135 – Assessing the odds of a 20% SOL dip",
      "link": "https://ambcrypto.com/solana-stalls-at-135-assessing-the-odds-of-a-20-sol-dip/",
      "summary": "<img alt=\"SOLANA\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-22T135914.561_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana's price could drop by over 20% and may reach the $114 level if the sentiment remains unchanged."
    },
    {
      "title": "Ethereum faces macro crisis: Can ETH’s $2K hold? – KEY insights reveal…",
      "link": "https://ambcrypto.com/ethereum-faces-macro-crisis-can-eths-2k-hold-key-insights-reveal/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-17.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Could $2,000 be ETH’s final lifeline before the plunge?"
    },
    {
      "title": "Mapping XRP’s road to $2.35 – Bulls, watch THESE levels next",
      "link": "https://ambcrypto.com/mapping-xrps-road-to-2-35-bulls-watch-these-levels-next/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-21T153947.783-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP’s optimism grows, but weak on-chain activity threatens breakout hopes below $2.35 resistance."
    },
    {
      "title": "VIRTUAL falls 12% amid $7.8M sell-off – Will more losses follow?",
      "link": "https://ambcrypto.com/virtual-falls-12-amid-7-8m-sell-off-more-losses-ahead-if/",
      "summary": "<img alt=\"VIRTUAL\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/1000001545.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bybit shorts. Aerodome exits. Active Addresses fall off. What is happening?"
    }
  ]
}