{
  "CoinDesk": [
    {
      "title": "SUI Reverses After Wild Swings; Trading Volume Spikes 11% Above 30-Day Average",
      "link": "https://www.coindesk.com/markets/2025/06/18/sui-reverses-sharply-after-24-hour-trading-volume-surges-11-above-30-day-average",
      "summary": ""
    },
    {
      "title": "We Need to Fix the So-Called GENIUS Bill",
      "link": "https://www.coindesk.com/opinion/2025/06/18/we-need-to-fix-the-so-called-genius-bill",
      "summary": ""
    },
    {
      "title": "UNI Rallies 70% From April Lows With Bullish Pattern Taking Shape, Up 24% in Past 30 Days",
      "link": "https://www.coindesk.com/markets/2025/06/18/uni-rallies-70-from-april-lows-with-bullish-pattern-taking-shape",
      "summary": ""
    },
    {
      "title": "Fed Leaves Rates Steady, Expects Weaker Growth, Sticky Inflation",
      "link": "https://www.coindesk.com/markets/2025/06/18/fed-leaves-rates-steady-expects-weaker-growth-sticky-inflation",
      "summary": ""
    },
    {
      "title": "Coinbase Debuts Stablecoin Payment Stack Following Shopify Partnership",
      "link": "https://www.coindesk.com/business/2025/06/18/coinbase-debuts-stablecoin-payment-stack-following-shopify-partnership",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "New York authorities freeze $300K linked to crypto scammers",
      "link": "https://cointelegraph.com/news/new-york-freeze-crypto-scam?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjViOTEtMjJhMS03MjRiLWExODktMjc2MzUzNDRiOTVl.jpg\" /></p><p>Officials reported that scammers had used crypto to pay for fake digital asset investment ads on social media platforms, leading to more than $1 million in losses for victims.</p>"
    },
    {
      "title": "Bitcoin supply squeeze intensifies as ‘ancient’ holders eclipse newly mined BTC",
      "link": "https://cointelegraph.com/news/bitcoin-supply-squeeze-intensifies-as-holders-surpass-daily-mined-btc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg0MGYtMmZiOC03MTFmLThiNWMtMGYyY2Y1MDkxNDc5.jpg\" /></p><p>The “ancient” Bitcoin cohort is growing faster than the amount of new coins mined, and with institutional flows accelerating, the path to $1 million BTC is starting to take shape.</p>"
    },
    {
      "title": "Ethereum and the battle for yield: What is ETH’s future?",
      "link": "https://cointelegraph.com/news/ethereum-and-the-battle-for-yield-will-eth-win?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzA2MWEtNGM1Ny03MWFjLTgxMmUtNjJjMmZhZTkyZjI2.jpg\" /></p><p>Ethereum staking yields are falling as yield-bearing stablecoins and DeFi protocols offer more competitive returns. Can ETH regain the upper hand in the yield wars?</p>"
    },
    {
      "title": "Chinese Central Bank pledges global expansion of digital yuan — Report",
      "link": "https://cointelegraph.com/news/china-central-bank-pledges-expand-international-cbdc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgzZWYtYmU0My03MjY5LWIwZTctODYwMzUxMGQ1ZGY1.jpg\" /></p><p>China has been looking to challenge the US dollar’s reserve status and wants to expand the digital yuan’s reach to include domestic and international payments.</p>"
    },
    {
      "title": "Deribit, Crypto.com integrate BlackRock&#039;s BUIDL as trading collateral",
      "link": "https://cointelegraph.com/news/deribit-crypto-com-accepting-blackrock-buidl-collateral?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzQ0ZWItZDM0NS03MTZjLTgwOTctMzU0OTVlYWU5YzNk.jpg\" /></p><p>The move will lower collateral requirements to access leverage for crypto trading due to the relatively stable value of US government debt.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin holds ground as Fed leaves interest rates unchanged",
      "link": "https://cryptoslate.com/bitcoin-holds-ground-as-fed-leaves-interest-rates-unchanged/",
      "summary": "<p>The Federal Reserve left its key interest rate steady on June 18, choosing caution as it monitors persistent inflation and global uncertainties. Bitcoin (BTC) remained largely stable, continuing to hold recent gains despite broader market jitters. The flagship crypto was trading at $104,110 as of press time, down 0.66% over the past 24 hours. Rates [&#8230;]</p> <p>"
    },
    {
      "title": "PancakeSwap surpasses Tether with $24.6M daily revenue, driven by record $10B trading surge",
      "link": "https://cryptoslate.com/insights/pancakeswap-surpasses-tether-with-24-6m-daily-revenue-driven-by-record-10b-trading-surge/",
      "summary": "<p>PancakeSwap has emerged as the highest revenue-generating platform in the crypto industry over the last 24 hours, outpacing even major players like Tether. According to DeFiLlama data, PancakeSwap generated $24.6 million in fees on July 17, eclipsing Tether’s $19.9 million during the same period. This marks the DEX platform’s second-largest single-day fee haul, just behind [&#8230;]</p> <p>"
    },
    {
      "title": "Two public firms announce plans to adopt HYPE as primary reserve asset for treasury",
      "link": "https://cryptoslate.com/two-public-firms-announce-plans-to-adopt-hype-as-primary-reserve-asset-for-treasury/",
      "summary": "<p>Lion Group Holding Ltd. (LGHL) and Eyenovia Inc. unveiled separate major financing moves this week to launch cryptocurrency treasury strategies centered on Hyperliquid’s HYPE token. LGHL announced it has secured a $600 million facility to launch the first and largest HYPE treasury in Asia. The Singapore-based trading and financial services firm also revealed intentions to include [&#8230;]</p> <p>"
    },
    {
      "title": "XRP network activity surges as Canada launches an XRP ETF",
      "link": "https://cryptoslate.com/xrp-network-activity-surges-as-canada-launches-an-xrp-etf/",
      "summary": "<p>Canadian asset manager 3iQ has launched an XRP-focused exchange-traded fund (ETF) on the Toronto Stock Exchange (TSX) under the XRPQ ticker. According to a June 18 statement, XRPQ will offer investors a six-month waiver on management fees and hold only long-term positions on the digital asset. These assets are sourced from reputable exchanges and over-the-counter [&#8230;]</p> <p>"
    },
    {
      "title": "Circle’s USDC and BlackRock’s BUIDL spearhead collateral innovation in derivatives markets",
      "link": "https://cryptoslate.com/circles-usdc-and-blackrocks-buidl-spearhead-collateral-innovation-in-derivatives-markets/",
      "summary": "<p>Crypto trading platforms increasingly adopt blockchain-native assets like the USDC stablecoin and tokenized treasuries such as BlackRock’s BUIDL to enhance collateral efficiency in derivatives markets. These instruments offer a blend of stability, yield, and compliance, making them attractive to institutional players seeking capital optimization. USDC and BUIDL gain momentum in crypto derivatives On June 18, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Is Ethereum Price Set To Repeat History As 2017 Playbook Returns? Why This Time Could Be Bigger",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-2017-playbook-returns/",
      "summary": "The Ethereum price action is showing remarkable similarities to its 2017 market cycle, with analysts pointing to a near-identical technical setup and market behaviour. Crypto analyst Merlijn the Trader, who shared a side-by-side weekly chart comparison of 2025 and 2017 on X (formerly Twitter), suggests that Ethereum is now following the same breakout pattern that once led to a historic rally. This time, however, the analyst believes that the move could be even more significant. Ethereum Price Mirrors Historic Breakout Pattern In the current 2025 chart, Ethereum has reportedly claimed the 50-week Moving Average (MA) after months of downward pressure and range-bound movement. Following a decisive breakout from support levels near $2,250, the price of the cryptocurrency is now consolidating below the 50 MA, forming a tight sideways pattern. Related Reading: The 5 Bullish Cases That Says Ethereum Price Could Reach $10,000 In 2025 According to Merlijn the Trader, this structure is visually and technically similar to price movements that occurred in late 2016 and early 2017, just before Ethereum began a powerful upward surge. The analyst’s 2017 Ethereum chart shows the altcoin breaking above the 50 MA, followed by a brief period of sideways action under resistance. Once momentum was built, the price launched into a parabolic rally that marked the beginning of its major bull cycle. Notably, the 2025 chart situated on the right panel displays an almost identical playbook to the 2017 setup, with Ethereum moving out of a prolonged accumulation phase and into a zone of consolidation beneath key resistance levels. However, this time, market conditions are significantly different. The analyst notes that the crypto space is far more developed, with increased institutional involvement, broader retail adoption, and growing infrastructure supporting Ethereum’s ecosystem. While the technical patterns align closely with the 2017 breakout, the scale and context suggest that the potential upside could even be greater. The similarities between Ethereum’s 2017 and 2025 price action lie in the timing of the 50 MA reclaim and the tight range of consolidation that follows. If ETH can maintain this trajectory and break above the current resistance zone, it could mark the beginning of a fresh macro rally, which the analyst predicts will not just repeat history but possibly amplify it. Ethereum Eyes $4,000 As 2017 Pattern Repeats Based on Merlijn The Trader’s comparable chart analysis, Ethereum may be on the verge of a major breakout, with technical patterns pointing to a potential price target above $4,000. In the 2017 setup, Ethereum skyrocketed past $28 from a low between $6 and $7.5 after reclaiming the 50 MA. Related Reading: Ethereum Staging A Repeat Of Bitcoin’s 2021 Cycle? Here’s The Target If history is any guide, Ethereum’s next move could propel it from its current price of $2,541 to $4,000, which aligns with the upper red horizontal line on the 2025 price chart or above the line to fresh all-time highs, with no ceiling in sight, according to the analyst. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Price Pressure Builds: Can BNB Punch Through The Ceiling Or Will 640 Catch The Fall?",
      "link": "https://www.newsbtc.com/analysis/bnb/bnb-price-pressure-builds/",
      "summary": "BNB finds itself at a pivotal moment as price action tightens between two critical technical zones. After a period of consolidation, the cryptocurrency is testing resistance near the 200-period moving average, hovering around the $653 mark. Meanwhile, support around the $640 level continues to hold firm, acting as a safety net for bulls trying to defend the current structure. 200 MA Acts As A Ceiling Against BNB Uptrend According to Thomas Anderson in a recent X post, the M15 BNB chart reveals that the price is currently testing resistance around the $651.50 level, marked by a horizontal yellow line. Related Reading: BNB Coils For Impact: Will $670 Crack Under Pressure? This move follows a recent bounce off the ascending white trendline support, indicating that buyers are still defending the short-term uptrend. However, price action remains just beneath the 200-period moving average (red line), which is acting as a dynamic resistance zone near the $653 mark. Momentum indicators are offering mixed signals at the moment. The MACD continues to print negative values, showing that bearish pressure hasn’t fully dissipated, while the RSI has started recovering from previously oversold conditions. This combination suggests the potential for a short-term bounce within the ascending channel. M30 And H1 Charts Are Aligning In an updated post, the analyst also went further to examine the BNB M30 chart, where price is currently trading at $650.10 and appears to be consolidating just below the 200-period moving average (red line) situated around the $653 level. This area is acting as a key short-term resistance zone, and price action has shown hesitation around it, reflecting a battle between buyers and sellers. Interestingly, the H1 chart mirrors this behavior, showing a broader ascending channel structure that suggests an underlying bullish bias, though still unconfirmed. Related Reading: BNB Price Reclaims $600 — Is This the Start of a Major Upside Move? The immediate resistance to watch remains near the $653 mark, aligned with the 200 MA on both the M30 and H1 timeframes. If bulls can muster enough strength to break and sustain above this level, it could trigger a fresh wave of upward momentum for BNB toward the next resistance at $657. This would represent a potential continuation of the ascending channel&#8217;s structure and hint at growing bullish control in the short term. On the flip side, if price fails to push above the $653 resistance, consolidation may begin to lose steam. In such a scenario, a retreat toward the previous swing low near the $640 level becomes likely. This support area has already proven its strength and could be the next level of defense if bearish pressure increases. Traders are watching closely, as these levels may determine BNB&#8217;s next directional move. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "Buy Bitcoin Now? Not Yet—Analyst Says Time Holds The Key",
      "link": "https://www.newsbtc.com/bitcoin-news/buy-bitcoin-now-not-yet-time-holds-key/",
      "summary": "In a post on June 17, prominent crypto strategist Astronomer (@astronomer_zero) outlined his high-conviction roadmap for Bitcoin’s next major breakout, emphasizing that timing—not just price—is the most critical factor for those still on the sidelines. Despite projecting a continuation of the broader uptrend that began at $18,000 in 2023, Astronomer warned that jumping in prematurely could blunt the risk-reward ratio of the next leg. “Planning to buy now into BTC is expected to net you a move of over 70% in a short period of time,” he wrote. “But the closer we get to those 10 weeks, confirmed with price action, the closer BTC is to breaking out.” Buy Bitcoin Now? His primary thesis: Bitcoin’s breakout will not occur before June 30, and any significant move is statistically more likely after that date. This aligns with what he calls one of the “most ancient crypto mechanics”—Bitcoin moves first, and altcoins follow. Related Reading: Analyst Predicts Bitcoin Price Crash As War Tensions Mount In Middle East Astronomer’s roadmap presents a tiered accumulation strategy rooted in probabilistic support zones. “Upon statistical analysis, the expected close before going up only is around $103k,” he wrote. “Probably a good level to start getting involved. […] The expected level to be reached based on all prior signals (lowest wick) is $96k. Probably a good level to buy heavy if given. […] And finally, the expected lowest close is $90k. Probably a good level to allocate (almost) all your dry powder.” But beyond the price levels, Astronomer places stronger emphasis on timing: “If the price doesn&#8217;t go as deep into the $90’s—which I don&#8217;t think is very likely—I expect June to close between $95-110k and not go much lower. Then I&#8217;d buy more and more the closer we get to those 10 weeks regardless of the price. Time is more important than price.” He also pointed to structural market dynamics supporting his thesis, including a bullish spot-to-perpetual rotation: “The order books start to rotate towards green into spot, red into perps (aggressive shorts, aggressive spot buys), simply visible with the increasing spot premiums.” Adding to the signal strength is a recent weekly hash ribbon print—“one that never failed,” he noted. Related Reading: $150,000 Bitcoin Is In Play—Unless This One Macro Metric Snaps Astronomer further offered guidance for navigating altcoins, advising traders to wait for the breakout rather than attempting to catch falling knives. “Buying alts when BTC breaks out […] is smarter than trying to knife catch them. To eliminate the drawdown and reap the upside rewards.” Summarizing his plan, he said, “If I was sidelined, I&#8217;d look to buy below $103k and as much as possible as close to $90k as possible. And the closer we get to those 10 weeks, confirmed with price action, the more confident I become.” Astronomer’s final message underscores that his bullish stance hasn’t changed since the flip at $18K: “No top being in yet, until we reach at least 170k+. That is the plan.” And for those still unsure? He offers a blunt reminder: “"
    },
    {
      "title": "Analyst Says Bitcoin Price Could Rise 3x To $300,000 As AVIV Levels Resemble Previous Bull Cycles",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-could-rise-3x-to-300000/",
      "summary": "Bitcoin has continued to hover above the $100,000 mark over the past few days, and its price action has stabilized around $105,000 in the wake of recent market tensions and despite inflows into Spot Bitcoin ETFs. A new analysis shared by crypto market commentator Gert van Lagen suggests that this current phase is going to precede an explosive move similar to those seen in previous market cycles. Backing his prediction with historical data and Glassnode’s AVIV Ratio chart, the analyst noted that the current on-chain structure echoes moments before Bitcoin’s major rallies in past bull markets. AVIV Ratio Flashes Familiar Pattern Before Market Top Bitcoin&#8217;s price volatility has slightly cooled since the initial surge to a new all-time high above $111,800 in May, and the latest candlestick structure suggests it may be preparing for another leg higher. Related Reading: Can Bitcoin Price Bounce To $120,000 Or Will It Break Below $100,000? Taking to the social media platform X, Gert van Lagen revealed a Bitcoin price prediction that centers around the true market Deviation metric known as the AVIV Ratio. This orange-colored line on the chart tracks a specific deviation in Bitcoin’s market behavior and has always crossed a red line denoting +3 standard deviations at or just before cycle tops. The current AVIV behavior can be compared to previous price points before market tops in previous cycles. For instance, in 2013, the AVIV Ratio flagged a major rally when Bitcoin was trading near $200, shortly before the price pushed past $1,200. In 2017, the metric behaved similarly when Bitcoin was trading at $3,700 and later peaked near $20,000. The current AVIV Ratio can also be compared to when Bitcoin was priced at $13,000 in the 2021 bull market run, before its surge to an all-time high of $69,000. According to the analyst, today’s AVIV ratio level is closely aligned with those previous mid-cycle breakouts. The current ratio has not yet crossed the red +3σ line, which the analyst refers to as the cycle top trigger. As such, its current reading suggests Bitcoin may be in the early phase of a major bull market expansion. If history repeats itself, a 3x move from today’s levels would be a standard price move in line with previous price action. $300,000 Target Within Sight If AVIV Behavior Holds Crypto analyst van Lagen stops short of calling for an immediate top, but his analysis implies that Bitcoin could be preparing for a new parabolic surge to the upside. Using the AVIV model as a reference, a conservative 3x multiplier on the current Bitcoin price places a possible target around $300,000. Related Reading: Key Fractal From 2023 Says Bitcoin Price Is Still Bullish, But A Crash To $90,000 Could Be Coming At the time of writing, Bitcoin is trading at $104,997, having decreased by 1.4% in the past 24 hours. This decline has brought its price down from an intraday high of $106,795 back into its consolidation range around $105,000. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Altcoin Alert: Expert Reveals Hottest Opportunities For The Summer Season",
      "link": "https://www.newsbtc.com/altcoin/altcoin-alert-expert-reveals-hottest-opportunities-for-the-summer-season/",
      "summary": "As geopolitical tensions in the Middle East continue to impact cryptocurrency prices, with Bitcoin (BTC) recently dipping below the $105,000 mark, market analyst VirtualBacon has shared insights suggesting that altcoins are gearing up for a potentially robust summer. Emerging AI Memecoins In a recent update on social media platform X (formerly Twitter), he highlighted several promising developments within the altcoin space. VirtualBacon pointed to an emerging wave of AI-focused Layer-1 blockchain projects, many backed by prominent figures in both the cryptocurrency and traditional finance sectors. He mentioned several names to watch, including Sahara Labs, Sentient AGI, and Gaianet, among others. While these projects have yet to release tokens, many are expected to conduct airdrops or early access rounds, presenting opportunities for early investors. Related Reading: On-Chain Analyst Warns: Bitcoin Peak Expected, Altcoins Facing -95% Plunge For those seeking “higher-risk, high-reward investments,” VirtualBacon noted the impressive performance of artificial intelligence (AI) agent memecoins. He cited the launch of IRIS, which skyrocketed from a $220,000 fully diluted valuation (FDV) to $120 million, representing a 600x return. Platforms such as Virtuals, CreatorBid, and SeedifyFund are turning user engagement into allocation opportunities, likening this phenomenon to a form of airdrop farming on steroids. In addition, VirtualBacon highlighted a relatively overlooked area: Bittensor subnet tokens. He mentioned that seasoned investors can now acquire early-stage subnets directly on Bittensor’s chain, with projects like SN65_TPN and inference_labs raising capital through token auctions at valuations below $4 million. Stablecoins Take Center Stage Turning to real-world assets (RWAs), VirtualBacon advised focusing on mid-cap infrastructure projects with tangible revenue streams. He pointed to CHEX and CPOOL, which has shown consistent upward movement, as examples of promising investments. Another emerging narrative is the merger and acquisition activity involving public companies and crypto projects. VirtualBacon noted that Tron is set to go public through a Nasdaq reverse merger, while Mixie has been acquired by Netcapital, which boasts a team that includes notable figures like Tim Draper and a co-founder of Helium. A particularly intriguing development is World Liberty Financial (WLF), co-founded by Eric and Donald Jr. Trump, which aims to become a major player in the decentralized finance (DeFi) space. With plans for its own stablecoin, USD1, and expected to launch in October, the token could have an estimated FDV of $10–15 billion, a conservative projection given its potential. VirtualBacon also pointed out that stablecoins are becoming central to macroeconomic strategies. Tether now ranks as the fifth-largest holder of US Treasuries, highlighting the increasing need for buyers in the market. The analyst urged investors to keep an eye on stablecoin projects that integrate artificial intelligence technology and yield generation, such as USD1, Circle’s USDC, and others. Liquidity Shifts To Altcoin Platforms In the gaming sector, liquidity is coalescing around BlackholeDex, a decentralized exchange (DEX) backed by the AVAX Foundation. With a fee-sharing model similar to Aerodrome and Shadow, BlackholeDex has launched veNFT staking, aligning long-term incentives for users. Related Reading: Ethereum Slows Down In June: Historical Data Says More Losses To Come Lastly, in the Solana ecosystem, Saros DLMM is emerging as a strong competitor to existing platforms like Jupiter and Meteora, utilizing similar bucket-based liquidity pools but with lower fees. It also plans a RADY meme airdrop for SAROS stakers, which could attract early adopters and fuel rapid growth, thus closing the list of highlighted altcoins. As of this writing, Ethereum, the market’s leading altcoin, is trading at $2,521. It has consolidated above this level after dropping sharply from its two-week high of $2,878. Featured image from DALL-E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "The Trolls Are Coming: Defending Bitcoin Mining from Patent Trolls",
      "link": "https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_GenerateThe-Trolls-Are-Coming_-Defending-Bitcoin-Mining-from-Patent-Trollsd_Image_9ib8k29ib8k29ib8-fotor-20250618125328.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls\" rel=\"nofollow\"> </a></p> <p>The clash between Malikie Innovations and Bitcoin miners exemplifies a classic conflict between open innovation and legacy fiat intellectual property rights.</p> <p>"
    },
    {
      "title": "Bitdeer Raises $330M to Expand Bitcoin Mining and AI Operations",
      "link": "https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BITDEER-EXPANDS-BITCOIN-MINING.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations\" rel=\"nofollow\"> </a></p> <p>Singapore-based Bitcoin mining firm Bitdeer Technologies Group has launched a $330 million convertible notes offering, aiming to strengthen its mining operations, develop ASIC rigs, and scale its AI infrastructure.&#160; The notes, due in 2031, carry an annual interest rate of 4.875% and may be converted into Bitdeer Class A shares at a 25% premium to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Tech Booms: Lightning Data Defies Digital Gold Narrative",
      "link": "https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_a_rough_gold_rock_with_Bitcoin_logo_stampe_2.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative\" rel=\"nofollow\"> </a></p> <p>Bitcoin tech shines in 2025 with 1.5 million Lightning users, $1.5 billion trading volume, and Block’s 9.7% yield, outpacing treasury hype.</p> <p>"
    },
    {
      "title": "K33 Announces Plans To Purchase Up To 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norwegian-Public-Company-K33-AB-Purchased-10-BTC-For-Their-New-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>K33 has launched a SEK 85 million share issue at a price of SEK 0.1036 per share.</p> <p>"
    },
    {
      "title": "The Blockchain Group Buys $20 Million Worth Of Bitcoin",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-buys-20-million-worth-of-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/10.4B-Bitcoin-Firm-Unchained-Announces-First-Regulated-Bitcoin-Native-Trust-Company-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-buys-20-million-worth-of-bitcoin\" rel=\"nofollow\"> </a></p> <p>European Bitcoin treasury company acquires 182 BTC through convertible bonds and warrant conversions, bringing total holdings to 1,653 BTC worth $172 million.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin Might Be Flat, But Traders Have Their Eyes on This Shiny New Token: Analysis",
      "link": "https://decrypt.co/325904/bitcoin-flat-traders-eyes-new-token-aero-analysis",
      "summary": "As Bitcoin clings to support levels and geopolitical shocks ripple across risk assets, there's an altcoin keeping things interesting."
    },
    {
      "title": "Are Criminals Really Switching From Crypto to Gold for Money Laundering?",
      "link": "https://decrypt.co/325887/criminals-switching-crypto-gold-money-laundering",
      "summary": "Police note UK criminals are turning to gold, not crypto, to launder money—but is it a growing trend or just a glittering myth?"
    },
    {
      "title": "Justice Dept. Files to Seize Record $225 Million Tied to 'Pig Butchering' Crypto Scams",
      "link": "https://decrypt.co/325882/justice-dept-seize-record-225-million-pig-butchering-crypto-scams",
      "summary": "The U.S. Department of Justice has filed to seize over $225 million in USDT—the largest-ever seizure tied to \"pig butchering\" crypto scams."
    },
    {
      "title": "Bitcoin Shrugs Off Fed Decision to Keep Rates Unchanged",
      "link": "https://decrypt.co/325643/bitcoin-shrugs-off-fed-decision-to-keep-rates-unchanged",
      "summary": "The largest cryptocurrency by market value has been trading about 5% under its all-time high set last month."
    },
    {
      "title": "WILL $HYPE FLIP $SOL? POTENTIAL PUMP.FUN CHAIN, BULL RUN INDICATORS",
      "link": "https://decrypt.co/videos/interviews/9ffa06y8/will-hype-flip-sol-potential-pumpfun-chain-bull-run-indicators",
      "summary": ". REKT RADIO LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. 00:00 - Intro 04:12 - Iran conflict talk 07:25 - James Wynn 09:52 - HYPE Vaults 12:00 - Hyperliquid 20:30 - PumpFun chain thesis 21:40 - Is Hyperliquid going to flip SOL 23:00 - Michael Saylor's Money Glitch 25:00 - 1 Million Hype Perp market creation 28:52 - CRCL's affect on the wider market 30:40 - What key indicators are we watching to predict if we're still in the bull market or not 33:00 - Chain popularity and culture, and what's cool 37:25 - Rollbits new onchain casino 41:25 - Are Crypto KOLs still cool? 50:00 - YEET Giveaway + Follow KICK channel 51:40 - Giveaway LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin holds steady at $104K as Fed eyes inflation from tariffs before easing",
      "link": "https://cryptobriefing.com/bitcoin-stability-fed-rate/",
      "summary": "<p>Bitcoin holds at $104K as the Fed keeps rates at 4.25% to 4.50%, citing tariff-driven inflation as reason to delay cuts.</p> <p>"
    },
    {
      "title": "US DOJ seeks to forfeit $225 million in crypto from global scam network",
      "link": "https://cryptobriefing.com/crypto-scam-forfeiture-seizure/",
      "summary": "<p>The DOJ's action highlights the increasing need for robust international cooperation and advanced digital forensics in combating crypto fraud.</p> <p>"
    },
    {
      "title": "Bitcoin stays resilient ahead of Fed meeting as investors await policy signals",
      "link": "https://cryptobriefing.com/bitcoin-resilient-ahead-fed-meeting/",
      "summary": "<p>Bitcoin's resilience amid Fed uncertainty highlights its potential as a hedge, but future rate signals could impact broader market liquidity.</p> <p>"
    },
    {
      "title": "Canada’s first XRP spot ETF goes live on Toronto Stock Exchange",
      "link": "https://cryptobriefing.com/canadas-first-xrp-spot-etf/",
      "summary": "<p>The launch of Canada's first XRP spot ETF could accelerate mainstream adoption of digital assets, enhancing financial market innovation.</p> <p>"
    },
    {
      "title": "Iran’s largest crypto exchange appears to have been exploited, suspected Israeli hackers threaten to leak source code and user data",
      "link": "https://cryptobriefing.com/nobitex-cyberattack-iran-exchange/",
      "summary": "<p>The breach highlights vulnerabilities in Iran's financial systems, potentially escalating geopolitical tensions and impacting regional cybersecurity.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Examining why Bitcoin’s bull run may have more room – MVRV ratio reveals…",
      "link": "https://ambcrypto.com/examining-why-bitcoins-bull-run-may-have-more-room-mvrv-ratio-reveals/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-18T135728.171-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin’s fundamentals remain strong, with holding behavior and undervaluation metrics supporting continued upside."
    },
    {
      "title": "All about Thailand’s new crypto policy – 5-year tax break, $30.7M boost & more…",
      "link": "https://ambcrypto.com/all-about-thailands-new-crypto-policy-5-year-tax-break-30-7m-boost-more/",
      "summary": "<img alt=\"Thailand crypto tax\" class=\"attachment-full size-full wp-post-image\" height=\"561\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Thailand-crypto-tax.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"998\" />Could Thailand’s crypto tax strategy challenge Dubai and Singapore?"
    },
    {
      "title": "Bitcoin: THIS ratio hints at a possible BTC supply shock – How?",
      "link": "https://ambcrypto.com/bitcoin-this-ratio-hints-at-an-upcoming-btc-supply-shock-how/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-18T130609.677-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin shows rising accumulation and supply tightening, but demand-side metrics point to market fragility."
    },
    {
      "title": "Bitcoin’s price test – Will $98K support hold amid growing caution?",
      "link": "https://ambcrypto.com/bitcoins-price-test-will-98k-support-hold-amid-growing-caution/",
      "summary": "<img alt=\"bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-31.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Support at $98.3K remains firm, even as leveraged money exits the scene."
    },
    {
      "title": "Bitcoin & HYPE set to soar? U.S. firms pour $844 mln into crypto treasuries",
      "link": "https://ambcrypto.com/bitcoin-hype-set-to-soar-u-s-firms-pour-844-mln-into-crypto-treasuries/",
      "summary": "<img alt=\"Bitcoin &amp; HYPE set to soar? U.S. firms pour $844 mln into crypto treasuries\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-4-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whales going aggressively long on BTC and HYPE amid $844M inflow into crypto treasuries."
    }
  ]
}