{
  "CoinDesk": [
    {
      "title": "DOJ Ties Kansas Bank Collapse to $225 Million 'Pig Butchering' Seizure",
      "link": "https://www.coindesk.com/policy/2025/06/18/doj-ties-kansas-bank-collapse-to-225-million-pig-butchering-seizure",
      "summary": ""
    },
    {
      "title": "Korean Crypto KOLs Fuel Massive $USELESS Rally as Traders Shrug Off Traditional Narratives: Asia Morning Briefing",
      "link": "https://www.coindesk.com/markets/2025/06/18/asia-morning-briefing-korean-crypto-kols-fuel-massive-useless-rally-as-traders-shrug-off-traditional-narratives",
      "summary": ""
    },
    {
      "title": "Crypto Lenders Hold Nearly $60B of Assets as New Wave of DeFi Adoption Sweeps In: Report",
      "link": "https://www.coindesk.com/markets/2025/06/18/crypto-lenders-hold-nearly-60b-of-assets-as-new-wave-of-defi-adoption-sweeps-in-report",
      "summary": ""
    },
    {
      "title": "SUI Reverses After Wild Swings; Trading Volume Spikes 11% Above 30-Day Average",
      "link": "https://www.coindesk.com/markets/2025/06/18/sui-reverses-sharply-after-24-hour-trading-volume-surges-11-above-30-day-average",
      "summary": ""
    },
    {
      "title": "We Need to Fix the So-Called GENIUS Bill",
      "link": "https://www.coindesk.com/opinion/2025/06/18/we-need-to-fix-the-so-called-genius-bill",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "‘Stablecoin summer’ as Coinbase, Circle surge on stablecoin bill",
      "link": "https://cointelegraph.com/news/coinbase-circle-stocks-surge-us-senate-genius-stablecoin-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg1NmYtMzk3Yy03N2Q3LWFiNTYtZDc5YTAzMGI4MTU4.jpg\" /></p><p>Crypto entrepreneur Anthony Pompliano says Coinbase’s stock surge indicates that “Wall Street wants Bitcoin and crypto assets.”</p>"
    },
    {
      "title": "Czech gov’t resists 4th overthrow attempt amid $45M Bitcoin scandal",
      "link": "https://cointelegraph.com/news/czech-party-survives-fourth-no-condifence-vote-amid-bitcoin-scandal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg0ZjYtMjJkNS03M2YxLWI3MTctMDUzOGZhNzQyYmRk.jpg\" /></p><p>The Czech Republic’s Civic Democratic Party survived another no-confidence vote, triggered by opposition party concerns over a $45 million Bitcoin donation linked to a convicted criminal.</p>"
    },
    {
      "title": "Trump on GENIUS stablecoin bill: ‘Get it to my desk, ASAP’",
      "link": "https://cointelegraph.com/news/donald-trump-urges-quick-passing-of-genuis-stablecoin-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTE5N2YtZTViZC03MzIyLWI5YjAtYjc3OTU5NDk1NGVk.jpg\" /></p><p>US President Donald Trump wants House members to pass the key stablecoin bill “LIGHTNING FAST” so that he can sign it into law.</p>"
    },
    {
      "title": "SOL price rally to $200 brewing, but 3 key catalysts must happen first",
      "link": "https://cointelegraph.com/news/sol-rally-to-200-brewing-but-3-key-catalysts-must-happen-first?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MmZkYjMtN2NhMS03MjU3LWExZDEtNmYwMTBlMDQ0M2Rm.jpg\" /></p><p>SOL price dips amid stagnant DApp growth and fading memecoin hype, but tokenized RWAs and a spot ETF approval could turn the tide.</p>"
    },
    {
      "title": "Pavel Durov warns France is experiencing societal collapse",
      "link": "https://cointelegraph.com/news/telegram-durov-warns-france-societal-collapse?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTljZmQtZTI5Ny03NTVkLTk1MzAtYzM1ZTM5ZjcxYTBm.jpg\" /></p><p>According to the Telegram founder, France’s political leaders continue to make poor choices regarding censorship.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "North Korean dev hijacks dormant Waves repositories, slips credential-stealing code in wallet updates",
      "link": "https://cryptoslate.com/north-korean-dev-hijacks-dormant-waves-repositories-slips-credential-stealing-code-in-wallet-updates/",
      "summary": "<p>A North Korean developer gained elevated privileges inside Waves Protocol&#8217;s Keeper-Wallet codebase, according to a June 18 report by Ketman. The report highlighted routine scans for Democratic People&#8217;s Republic of Korea (DPRK) activity on GitHub, which uncovered the account &#8220;AhegaoXXX&#8221; pushing updates to Keeper-Wallet. The wallet&#8217;s repositories showed no legitimate commits after August 2023, yet [&#8230;]</p> <p>"
    },
    {
      "title": "10-year Bitcoin holdings grow faster than daily issuance, marking scarcity signal after 2024 halving",
      "link": "https://cryptoslate.com/10-year-bitcoin-holdings-grow-faster-than-daily-issuance-marking-scarcity-signal-after-2024-halving/",
      "summary": "<p>On-chain data shows that Bitcoin’s (BTC) “ancient supply” is increasing faster than new BTC daily issuance, according to a June 18 research by Fidelity Digital Assets. The report treats ancient supply as Bitcoins that have remained unmoved for at least a decade, and it counted an average of 566 BTC entering the 10-year-plus cohort daily [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase launches stablecoin payment stack with USDC checkout targeting commerce giants",
      "link": "https://cryptoslate.com/coinbase-launches-stablecoin-payment-stack-with-usdc-checkout-targeting-commerce-giants/",
      "summary": "<p>Coinbase officially launched Coinbase Payments on June 18, a three-layer platform that enables commerce providers to add USDC checkout without running their blockchain infrastructure. The stack begins with Stablecoin Checkout, a wallet-native interface that supports hundreds of wallets, delivers gas-free transactions, and records payments in USDC. Beneath it, an E-commerce Engine exposes application programming interfaces [&#8230;]</p> <p>"
    },
    {
      "title": "Circle stock leaps to $200 record after 34% daily gain",
      "link": "https://cryptoslate.com/circle-stock-leaps-to-200-record-after-34-daily-gain/",
      "summary": "<p>Circle’s CRCL shares climbed 34% and closed at $199.59 on June 18 after registering a new all-time high at $200.90. The new price peak is roughly 6.5x the company’s initial public offering price of $31 set on June 5. The price leap came one day after the Senate advanced the Guiding and Establishing National Innovation [&#8230;]</p> <p>"
    },
    {
      "title": "Distribution or death: Arthur Hayes says only exchange-backed or bank-linked stablecoins can thrive",
      "link": "https://cryptoslate.com/distribution-or-death-arthur-hayes-says-only-exchange-backed-or-bank-linked-stablecoins-can-thrive/",
      "summary": "<p>Arthur Hayes said that stablecoin issuers who cannot immediately tap a large exchange, a Web2 platform, or a legacy bank will struggle to survive. In a June 16 blog post, the BitMEX co-founder recounted how the banking shutdowns in the 2010s in Hong Kong and Mainland China drove traders toward Tether. Bitfinex and Tether allowed [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Price Faces Downward Pressure — More Pain Before a Bounce?",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-faces-pressure-2540/",
      "summary": "Ethereum price started a fresh decline below the $2,620 zone. ETH is now consolidating losses and remains at risk of more losses below $2,500. Ethereum started a fresh decline below the $2,600 level. The price is trading below $2,540 and the 100-hourly Simple Moving Average. There is a rising channel forming with support at $2,480 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it clears the $2,565 resistance zone in the near term. Ethereum Price Faces Resistance Ethereum price started a fresh decline below the $2,620 pivot level, like Bitcoin. ETH price declined below the $2,600 and $2,550 levels. The bears even pushed the price below the $2,500 level. The pair tested the $2,450 zone and started a consolidation phase. There was a minor move above the $2,500 level. The price climbed above the 23.6% Fib retracement level of the downward wave from the $2,680 swing high to the $2,455 low. Ethereum price is now trading below $2,550 and the 100-hourly Simple Moving Average. Besides, there is a rising channel forming with support at $2,480 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,540 level. The next key resistance is near the $2,565 level. It is close to the 50% Fib retracement level of the downward wave from the $2,680 swing high to the $2,455 low. The first major resistance is near the $2,625 level. A clear move above the $2,625 resistance might send the price toward the $2,680 resistance. An upside break above the $2,680 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,800 resistance zone or even $2,880 in the near term. Another Decline In ETH? If Ethereum fails to clear the $2,540 resistance, it could start a fresh decline. Initial support on the downside is near the $2,480 level. The first major support sits near the $2,450 zone. A clear move below the $2,450 support might push the price toward the $2,320 support. Any more losses might send the price toward the $2,240 support level in the near term. The next key support sits at $2,150. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,450 Major Resistance Level – $2,540"
    },
    {
      "title": "These Altcoins Are Bucking The Trend—But Can They Keep It Up?",
      "link": "https://www.newsbtc.com/altcoin/altcoins-bucking-trend-but-can-they-keep-it-up/",
      "summary": "A few altcoins have diverged from the market with sharp rallies. Here&#8217;s whether they can sustain the momentum, according to social media data. Social Media Has Started Paying Attention To These Altcoins In a new insight post, the analytics firm Santiment has talked about some altcoins that have recently diverged from the rest of the market with notable price surges. Related Reading: Bitcoin NVT Enters Reversal Zone: BTC Dangerously Overvalued? Here are the coins in question and how their monthly returns have looked: As is visible above, these altcoins have managed to deliver sizeable profits during a period where the major assets have printed losses. Bitcoin (BTC), for instance, is down around 2% on this timeframe. Among the listed alts, two are particularly prominent in terms of market cap size: Hyperliquid (HYPE) and WhiteBIT Token (WBT). The former has seen a rise of 51.6% and the latter 59.2%. Now, can these coins sustain their runs? One hint can come from social media data. Santiment has shared two indicators related to social media: Social Dominance and Positive/Negative Sentiment. The first metric, the Social Dominance, tells us about what part of social media discussions related to the top 100 assets a particular cryptocurrency is responsible for. The indicator determines this by comparing the asset&#8217;s Social Volume, a count of"
    },
    {
      "title": "Bitcoin Price Struggles to Reclaim Resistance — Sideways Action Dominates",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-struggles-105500/",
      "summary": "Bitcoin price started a fresh decline below the $106,200 zone. BTC is now consolidating and facing resistance near the $105,500 zone. Bitcoin started a fresh decline below the $106,000 zone. The price is trading below $106,000 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance at $105,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $103,500 zone. Bitcoin Price Starts Consolidation Bitcoin price started a fresh decline below the $108,000 zone. BTC gained pace and dipped below the $107,000 and $106,000 levels. There was a clear move below the $105,500 support level. Finally, the price tested the $103,500 zone. A low was formed at $103,400 and the price started a minor recovery wave. There was a move above the 23.6% Fib retracement level of the downward move from the $108,924 swing high to the $103,400 low. However, the bears were active below the $105,500 zone. Bitcoin is now trading below $105,500 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance at $105,200 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $105,200 level. The first key resistance is near the $105,500 level. The next key resistance could be $106,150. It is near the 50% Fib retracement level of the downward move from the $108,924 swing high to the $103,400 low. A close above the $106,150 resistance might send the price further higher. In the stated case, the price could rise and test the $108,800 resistance level. Any more gains might send the price toward the $110,000 level. Another Decline In BTC? If Bitcoin fails to rise above the $105,500 resistance zone, it could start another decline. Immediate support is near the $104,200 level. The first major support is near the $103,500 level. The next support is now near the $102,650 zone. Any more losses might send the price toward the $101,200 support in the near term. The main support sits at $100,000, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level. Major Support Levels – $104,200, followed by $103,500. Major Resistance Levels – $105,500 and $106,200."
    },
    {
      "title": "Bitcoin Yearly Trend Suggests Cycle Top Near $205,000 By Year-End, Analyst Says",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-yearly-trend-suggests-cycle-top-near-205000-by-year-end-analyst-says/",
      "summary": "Bitcoin (BTC) has seen a moderate price correction since June 11, falling from around $111,000 to just above $104,000 at the time of writing. While rising geopolitical tensions in the Middle East may be weighing on the asset, several analysts maintain that BTC’s long-term bullish trajectory remains intact. Bitcoin To Top At $205,000? In a recent CryptoQuant Quicktake post, contributor Carmelo Aleman pointed to the Bitcoin Yearly Percentage Trend as a signal of strong potential growth in BTC’s price through the rest of 2025. Related Reading: Bitcoin Sees Negative Funding On Binance – A Classic Setup For A Short Squeeze? For the uninitiated, the Bitcoin Yearly Percentage Trend tracks BTC’s annual price performance since 2011, revealing a recurring pattern of three bullish years followed by one year of consolidation. This trend aligns closely with Bitcoin’s four-year halving cycle, helping investors identify long-term market phases beyond short-term volatility. Aleman shared the following chart to support his outlook for 2025. If BTC maintains the growth pace typically seen in the third year of this cycle, it could climb 120% in 2025. Such a surge would take BTC from $93,226 at the beginning of the year to as high as $205,097 &#8211; potentially marking the cycle top for this year. If realized, this would make 2025 the third consecutive year of gains and complete another full bullish cycle. This scenario suggests that BTC is currently in the final phase of its ongoing cycle, giving investors limited time to adjust their strategies to align with the market’s growth trajectory. Supporting this outlook, other cyclical metrics &#8211; such as Realized Cap &#8211; continue to post new all-time highs in 2025. Aleman concluded: The Bitcoin Yearly Percentage Trend is a tool that allows us to filter out daily market noise and reconnect with Bitcoin&#8217;s true cyclical nature. It reminds us that beyond micro metrics and short-term candles, Bitcoin adheres to a structural rhythm that repeats with striking consistency: three years of expansion followed by one of compression. On-Chain Indicators Suggest More Upside Beyond the Yearly Percentage Trend, several on-chain metrics continue to support a bullish case for BTC. Notably, both whale and retail BTC inflows to Binance have dropped to cycle-lows &#8211; often a sign that investors are holding in anticipation of further gains. Related Reading: Bitcoin Following ABCD Pattern? Analyst Sees Path To $137,000 Whales also appear to be accumulating ahead of a potential breakout. According to CryptoQuant analyst Amr Taha, Bitcoin whales withdrew 4,500 BTC from Binance on June 16 &#8211; a move historically associated with price rallies. Still, caution remains warranted. On-chain data indicates that short-term holders have been selling into the recent dip, which could temporarily suppress price momentum. At press time, BTC trades at $104,079, down 1.6% over the past 24 hours. Featured image with Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Dogecoin Danger: A Dip Under $0.16 Could Trigger A 30% Crash—Analyst",
      "link": "https://www.newsbtc.com/dogecoin-2/dogecoin-danger-a-dip-under-0-16-could-trigger-a-30-crash-analyst/",
      "summary": "Dogecoin’s price is back at a crucial line. It’s testing the $0.168 area for a second time since mid‑April. A clear break could send the meme coin spinning lower. Bulls and bears are watching every tick. Related Reading: Record‑High Ethereum Open Interest Signals Institutional Confidence Key Support Under Scrutiny According to crypto expert Ali Charts, Dogecoin fell roughly 30% from its mid‑May high. That slide brought it down to the same $0.168 mark that held as support last April. If prices drop below that level on a weekly close, there are hardly any bids to slow the fall. Below $0.168 lies what traders call a “gap area,” where past buying activity was sparse. That could open the door to steeper losses and fast moves. Cup And Handle Pattern Based on reports, the current chart forms part of a four‑year cup‑and‑handle setup. The lower boundary of a symmetrical triangle sits right where the handle meets its cup. A clean break above the triangle’s upper trendline would point to a target near $0.75. #Dogecoin $DOGE must hold above $0.168 to avoid a 30% price drop! pic.twitter.com/PDhqo7fpcK — Ali (@ali_charts) June 15, 2025 That projection comes from the 1.618 Fibonacci extension of the cup’s depth. Hitting $0.75 would mean a 350% gain from today’s levels. Momentum Indicators Signal Weakness Momentum readings have lost much of their shine. After a brief golden cross in May, the 50‑day moving average slipped under the 200‑day in early June. The MACD line is widening beneath its signal, hinting at longer‑term selling pressure. The RSI sits at 42, under the neutral 50 mark, and drifting lower. Under 50 on the RSI often points to more sellers than buyers. With those readings turning sour, bulls need a strong bounce around $0.168 to stay alive. ETF Decision Could Swing Sentiment All eyes now turn to June 15, when US regulators may rule on a spot Dogecoin ETF. Approval would let traditional money flow in from big funds. A thumbs‑down or a delay, on the other hand, could spark fresh sell‑offs. That decision could make or break the next leg of Dogecoin’s move. Related Reading: Trump Media Makes Moves On Bitcoin And Smartphone – What’s Next? According to CoinCodex data, Dogecoin has recorded 13 out of 30 green days over the past month, with price swings of about 10.57% on average. Their forecast pegs DOGE at $ 0.20 by July 18, a 17% rise from current levels. Market sentiment sits in the neutral zone, and on‑chain signals aren’t flashing clear buy or sell warnings. This week’s action around $0.168 will tell us if Dogecoin can steady itself. Holders and traders should watch volume, weekly closes, and that looming ETF call. If support holds, we may see a rebound. If it breaks, lower levels could come into view fast. Either way, Dogecoin is at a make‑or‑break moment—and everyone will be listening for the next big clue. Featured image from Unsplash, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    },
    {
      "title": "The Trolls Are Coming: Defending Bitcoin Mining from Patent Trolls",
      "link": "https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_GenerateThe-Trolls-Are-Coming_-Defending-Bitcoin-Mining-from-Patent-Trollsd_Image_9ib8k29ib8k29ib8-fotor-20250618125328.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls\" rel=\"nofollow\"> </a></p> <p>The clash between Malikie Innovations and Bitcoin miners exemplifies a classic conflict between open innovation and legacy fiat intellectual property rights.</p> <p>"
    },
    {
      "title": "Bitdeer Raises $330M to Expand Bitcoin Mining and AI Operations",
      "link": "https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BITDEER-EXPANDS-BITCOIN-MINING.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations\" rel=\"nofollow\"> </a></p> <p>Singapore-based Bitcoin mining firm Bitdeer Technologies Group has launched a $330 million convertible notes offering, aiming to strengthen its mining operations, develop ASIC rigs, and scale its AI infrastructure.&#160; The notes, due in 2031, carry an annual interest rate of 4.875% and may be converted into Bitdeer Class A shares at a 25% premium to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Tech Booms: Lightning Data Defies Digital Gold Narrative",
      "link": "https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_a_rough_gold_rock_with_Bitcoin_logo_stampe_2.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative\" rel=\"nofollow\"> </a></p> <p>Bitcoin tech shines in 2025 with 1.5 million Lightning users, $1.5 billion trading volume, and Block’s 9.7% yield, outpacing treasury hype.</p> <p>"
    },
    {
      "title": "K33 Announces Plans To Purchase Up To 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norwegian-Public-Company-K33-AB-Purchased-10-BTC-For-Their-New-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>K33 has launched a SEK 85 million share issue at a price of SEK 0.1036 per share.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Trump Pushes House to Pass GENIUS Act as Lawmakers Debate Crypto Oversight",
      "link": "https://decrypt.co/325996/trump-pushes-house-genius-act-lawmakers-debate-crypto",
      "summary": "The President has called on the House to approve the stablecoin bill, despite concerns over conflicts of interest and tech sector influence."
    },
    {
      "title": "Ohio House Approves Bill Exempting ‘Bitcoin Users’ From Minor Tax Burden",
      "link": "https://decrypt.co/325986/ohio-house-approves-bill-exempting-bitcoin-minor-tax-burden",
      "summary": "The bill, which seeks to grant crypto users and miners certain rights, now moves on to the Ohio State Senate."
    },
    {
      "title": "How Far Would You Go to Pump Your Meme Coin?",
      "link": "https://decrypt.co/325960/how-far-would-you-go-pump-meme-coin",
      "summary": "Leland King Fawcette aims to make it across all 50 U.S. states in time to break a record—and pump his Solana meme coin in the process."
    },
    {
      "title": "Bitdeer Stock Falls as Bitcoin Miner Aims to Raise $330 Million",
      "link": "https://decrypt.co/325884/bitdeer-stock-falls-bitcoin-miner-raise-330-million",
      "summary": "Singapore-based Bitcoin miner Bitdeer is raising funds, but not to buy up BTC. The firm's shares continued falling following the move."
    },
    {
      "title": "Crypto Prime Brokerage FalconX in Early Talks for IPO in 2025: Sources",
      "link": "https://decrypt.co/325918/crypto-prime-brokerage-falconx-early-talks-ipo",
      "summary": "FalconX is considering a public listing amid a broader crypto IPO boom, three sources told ."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin holds steady at $104K as Fed eyes inflation from tariffs before easing",
      "link": "https://cryptobriefing.com/bitcoin-stability-fed-rate/",
      "summary": "<p>Bitcoin holds at $104K as the Fed keeps rates at 4.25% to 4.50%, citing tariff-driven inflation as reason to delay cuts.</p> <p>"
    },
    {
      "title": "US DOJ seeks to forfeit $225 million in crypto from global scam network",
      "link": "https://cryptobriefing.com/crypto-scam-forfeiture-seizure/",
      "summary": "<p>The DOJ's action highlights the increasing need for robust international cooperation and advanced digital forensics in combating crypto fraud.</p> <p>"
    },
    {
      "title": "Bitcoin stays resilient ahead of Fed meeting as investors await policy signals",
      "link": "https://cryptobriefing.com/bitcoin-resilient-ahead-fed-meeting/",
      "summary": "<p>Bitcoin's resilience amid Fed uncertainty highlights its potential as a hedge, but future rate signals could impact broader market liquidity.</p> <p>"
    },
    {
      "title": "Canada’s first XRP spot ETF goes live on Toronto Stock Exchange",
      "link": "https://cryptobriefing.com/canadas-first-xrp-spot-etf/",
      "summary": "<p>The launch of Canada's first XRP spot ETF could accelerate mainstream adoption of digital assets, enhancing financial market innovation.</p> <p>"
    },
    {
      "title": "Iran’s largest crypto exchange appears to have been exploited, suspected Israeli hackers threaten to leak source code and user data",
      "link": "https://cryptobriefing.com/nobitex-cyberattack-iran-exchange/",
      "summary": "<p>The breach highlights vulnerabilities in Iran's financial systems, potentially escalating geopolitical tensions and impacting regional cybersecurity.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum: $500M shorts wiped, bulls poised – Can ETH retain its stride?",
      "link": "https://ambcrypto.com/ethereum-500m-shorts-wiped-bulls-poised-can-eth-retain-its-stride/",
      "summary": "<img alt=\"The next Ethereum move could be determined by THIS moving average\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ethereum-Featured-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum presented an attractive buying opportunity to investors, but it remained weak against Bitcoin."
    },
    {
      "title": "Bitcoin’s long-term price target – $466K after next halving?",
      "link": "https://ambcrypto.com/bitcoins-long-term-price-target-466k-after-next-halving/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250618_135900_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin trends suggest there’s still a major move ahead."
    },
    {
      "title": "Solana ETF hype builds: Is NOW the time to bet on SOL?",
      "link": "https://ambcrypto.com/solana-etf-hype-builds-is-now-the-time-to-bet-on-sol/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-32.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />VanEck’s ETF enters ‘active’ status - now it’s up to the SEC and the markets."
    },
    {
      "title": "Mapping Bitcoin’s road ahead: Is $93K or $107K next for BTC?",
      "link": "https://ambcrypto.com/mapping-bitcoins-road-ahead-is-93k-or-107k-next-for-btc/",
      "summary": "<img alt=\"Mapping Bitcoin&#039;s road ahead: Is $93K or $107K next for BTC?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-28.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Stir in the Futures market, but the rest of Bitcoin’s metrics tell a very different story."
    },
    {
      "title": "What happens to Bitcoin if the U.S. joins the Iran-Israel war?",
      "link": "https://ambcrypto.com/what-happens-to-bitcoin-if-the-u-s-joins-the-iran-israel-war/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BitcoinIsrael-Iranwar.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />There is bullish short-term market positioning, but uncertainty remains."
    }
  ]
}