{
  "CoinDesk": [
    {
      "title": "Trump Media, Owner of Truth Social, Looks to Issue $12B Worth of New Shares",
      "link": "https://www.coindesk.com/markets/2025/06/06/trump-media-owner-of-truth-social-looks-to-issue-12b-worth-of-new-shares",
      "summary": ""
    },
    {
      "title": "Shiba Inu Recovers Amid Massive $36M Whale Transaction; Still Stuck in Downward Channel",
      "link": "https://www.coindesk.com/markets/2025/06/06/shiba-inu-recovers-amid-massive-usd36m-whale-transaction-still-stuck-in-downward-channel",
      "summary": ""
    },
    {
      "title": "Strategy to Raise Nearly $1B With STRD Preferred Stock Offering to Accumulate BTC",
      "link": "https://www.coindesk.com/markets/2025/06/06/strategy-to-raise-nearly-1b-with-strd-preferred-stock-offering-to-accumulate-btc",
      "summary": ""
    },
    {
      "title": "Crypto Daybook Americas: Bitcoin, Jolted by Trump-Musk Clash, Rebounds Before Jobs Data",
      "link": "https://www.coindesk.com/daybook-us/2025/06/06/crypto-daybook-americas-bitcoin-jolted-by-trump-musk-clash-rebounds-before-jobs-data",
      "summary": ""
    },
    {
      "title": "Bitcoin Price Bounce to Near $104K, Though Encouraging, Falls Short of Bull Revival",
      "link": "https://www.coindesk.com/markets/2025/06/06/btc-price-bounce-to-near-usd104k-though-encouraging-is-still-short-of-bull-revival",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Michael Saylor’s Strategy ups Bitcoin bet with $1B stock offering",
      "link": "https://cointelegraph.com/news/saylor-s-strategy-upsizes-stock-offering-from-250m-to-1b?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ1MWQtZTZjYi03YWYyLWFiOGUtYzI4OWE3ZWVmYmE0.jpg\" /></p><p>Michael Saylor’s Strategy has quadrupled its previously announced $250 million stock offering as a new funding avenue for its Bitcoin investments.</p>"
    },
    {
      "title": "Europe gears up to regulate DeFi in 2026 as MiCA leaves sector in limbo",
      "link": "https://cointelegraph.com/news/eu-defi-regulation-2026-mica?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ0ZDEtMzlkNC03NWU2LWI0MTgtZmYwY2I3NjI0YmQz.jpg\" /></p><p>Europe plans to regulate decentralized finance in 2026, as lawmakers still struggle to define decentralization under MiCA, an EU crypto policy expert said.</p>"
    },
    {
      "title": "QRAMP protocol, explained: Can Bitcoin’s 21-million cap survive the future?",
      "link": "https://cointelegraph.com/explained/qramp-protocol-explained-can-bitcoins-21-million-cap-survive-the-future?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8wZjdlODdkODJkOThiM2M5NTJiZGY0YWVkZGFmMTk1NC5qcGc=.jpg\" /></p><p> With threats from quantum computing and growing cross-chain demand, QRAMP offers a non-custodial approach to protect and project Bitcoin. </p>"
    },
    {
      "title": "UK FCA proposes lifting ban on crypto ETNs for retail investors",
      "link": "https://cointelegraph.com/news/uk-fca-crypto-etn-retail-investor-ban-lift?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ0OTgtODU5Ni03NmFkLTgzZjItMDY2NTIxMWYxZjQw.jpg\" /></p><p>The UK’s Financial Conduct Authority has proposed lifting its retail ban on crypto exchange-traded notes (ETNs), signaling a shift toward broader crypto market access.</p>"
    },
    {
      "title": "Dogecoin price risks 66% drop to $0.06 as Trump-Musk feud intensifies",
      "link": "https://cointelegraph.com/news/dogecoin-price-risks-66-drop-to-0-06-trump-musk-feud?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWQyNTUtZDFkMS03OGM3LWFiYTQtZGFiMDRlNzU5YjE2.jpg\" /></p><p>Elon Musk’s feud with President Trump caused Dogecoin’s 7% drop in the last 24 hours, but sell-off risks to $0.06 remain.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "FCA clears path for UK retail crypto ETF trading—kind of",
      "link": "https://cryptoslate.com/fca-clears-path-for-uk-retail-crypto-etf-trading-kind-of/",
      "summary": "<p>The UK’s Financial Conduct Authority has proposed lifting its longstanding ban on crypto exchange-traded notes for retail investors, opening the door for broader access to regulated crypto exposure through public investment exchanges. The move, announced June 6, forms part of a broader regulatory push to bolster market competitiveness and reduce barriers for financial firms. Retail [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet’s ambitious $5.4B Bitcoin acquisition plan sets sights on 210k BTC",
      "link": "https://cryptoslate.com/metaplanets-ambitious-5-4b-bitcoin-acquisition-plan-sets-sights-on-210k-btc/",
      "summary": "<p>Metaplanet has launched what it calls Asia’s largest equity raise dedicated to Bitcoin. According to CEO Simon Gerovich, the company is issuing 555 million shares through moving strike warrants in a ¥770.9 billion ($5.4 billion) capital raise. The firm has also acquired 1,088 BTC for ¥16.9 billion ($117.5 million), increasing its on-chain holdings to 8,888 [&#8230;]</p> <p>"
    },
    {
      "title": "Yield bearing stablecoin comes to Solana via Maple Finance’s Chainlink integration",
      "link": "https://cryptoslate.com/yield-bearing-stablecoin-comes-to-solana-via-maple-finances-chainlink-integration/",
      "summary": "<p>Maple Finance has deployed its liquid yield-bearing stablecoin, syrupUSDC, on the Solana network using Chainlink’s Cross-Chain Interoperability Protocol, introducing new capital strategies and institutional lending primitives into one of crypto’s most liquid ecosystems. Maple&#8217;s native SYRUP token jumped 8% on the launch news, holding a market cap of nearly $420 million. The integration allows users [&#8230;]</p> <p>"
    },
    {
      "title": "Micro-cap Quantum Resistance Ledger’s QRL token jumps 33% amid quantum concerns for crypto",
      "link": "https://cryptoslate.com/micro-cap-quantum-resistance-ledgers-qrl-token-jumps-33-amid-quantum-concerns-for-crypto/",
      "summary": "<p>Quantum security concerns continue to ripple through digital asset markets following BlackRock’s recent warning about cryptographic vulnerabilities in Bitcoin and Ethereum, driving renewed attention to quantum-resistant infrastructure. Quantum Resistant Ledger (QRL), one of the few blockchain networks purpose-built for a post-quantum future, has seen its native token rise over 33% in the past month amid [&#8230;]</p> <p>"
    },
    {
      "title": "Aave DAO activates on-chain slashing mechanism with ‘Umbrella’ launch",
      "link": "https://cryptoslate.com/aave-dao-activates-on-chain-slashing-mechanism-with-umbrella-launch/",
      "summary": "<p>Aave has launched Umbrella, a fully on-chain staking-based risk management system designed to replace its legacy Safety Module with a more automated and capital-efficient framework. Built by BGD Labs and ratified by Aave governance, Umbrella allows users to stake interest-bearing aTokens, such as aUSDC, aWETH, and GHO, to provide real-time, automated coverage for bad debt [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Kuaishou’s Kling AI Tool Gears Up to Hit $100M in Sales; AI Coins Like SUBBD to Explode",
      "link": "https://www.newsbtc.com/news/ai-coins-like-subbd-to-explode/",
      "summary": "Kuaishou’s AI video tool – Kling – is now a top-earning AI video generation tool. In April and May of 2025 alone, it pulled in a hefty $14M. Given its high demand, Kling’s on track to hitting a whopping $100M in sales by February. This is proof that demand for AI-generated video content is exploding – a boon for AI crypto projects like SUBBD Token ($SUBBD). Kling Makes Pro-Quality AI Video Creation Affordable Since its June 2024 launch, Kling AI has rolled out over 20 updates. The changes were aimed at enhancing core model performance, refining image clarity, and introducing innovative features for video creators. By using the AI tool&#8217;s ‘inspiration credits,’ anyone, from solo creators to major brands, can tap into Kling&#8217;s powerful video creation capabilities. The model is extremely straightforward: Want sharper, high definition videos? Spend more credits. Want to save on budget? Lower the tool&#8217;s parameters. It’s super cost-effective, too. For just one dollar, you get 66 credits. Top-quality videos cost approximately 100 credits, whereas simpler versions cost just 20. By using Kling AI, creators now enjoy the freedom to scale their content based on budget, quality, and turnaround times. Tencent Holdings &#38; Alibaba Capitalize on AI Video Hype The AI video space is heating up with growing competition. Hunyuan Video, launched by Tencent Holdings in December 2024, delivers high-quality cinematic video generation with advanced features. These features include dynamic camera movement, lifelike reflections, and seamless transitions between realistic and animated picture styles. Alibaba is also in on the trend, having released Wan 2.1 in February 2025 – a proprietary suite of open-source AI models. The models are designed for high-quality video generation based on text and image inputs. It’s also gearing up for a major upgrade, Wan 2.1-VACE, which will expand its functionality with advanced tools for reference-to-video generation and video-to-video editing. Let&#8217;s not forget OpenAI. The company is now developing Sora, a new tool for automated video generation. And then there&#8217;s Runway AI&#8217;s $3B valuation. Each of these developments signals a promising future for the SUBBD Token ($SUBBD), which goes a step further. This new crypto project delivers a full-suite of AI powered tools – not just video creation, but also online content management. SUBBD Leverages AI &#38; Crypto to Reshape Creator Workflows $SUBBD powers a next-gen content creation platform that streamlines creators&#8217; workflows and boosts community engagement through AI and Web3 technology. The digital content creation industry is booming, predicted to grow at a CAGR of 9.59% and reach $39.3B by 2032. Yet, despite the growth, creators still face serious challenges: High management and platform fees; Strict content policies on major platforms; Fragmented AI tools requiring multiple subscriptions; Outdated or slow payment systems. Thankfully, this is where the SUBBD ecosystem comes in, offering a seamless experience for AI-assisted content creation, editing, and monetization. The project achieves this through various AI tools, including a video generator, custom voice creator, and automatic live-streams. Meanwhile, fans get direct access to their favorite creators, and can enjoy personalized ecosystem fees and exclusive content – without having to rely on intermediaries. Influencers also benefit significantly thanks to a personal AI assistant. This tool is programmed to manage interactions and content schedules. Beyond content and engagement optimization, the personal assistant is an all-in-one tool that also boosts earnings by slashing third-party fees. Buying $SUBBD also ensures subscription discounts, staking rewards at a 20% APY, and XP multipliers for the platform&#8217;s raffles, games, and events. SUBBD to Soar as AI Video Craze Blows Up Kuaishou’s Kling AI is on track to reach $100M in sales. This, coupled with the success of similar providers, like Hunyuan Video, Wan 2.1, Sora, and Runway, demonstrates just how quickly AI-driven video content is scaling. As demand for streamlined, AI-powered content creation continues to rise, SUBBD stands out with its crypto-AI platform that unlocks additional monetization opportunities for creators (including automated live streams and token rewards). To get involved, all you need to do is buy $SUBBD on presale for as little as $0.0556. The presale has raised over $600M so far, and the price is going to increase again in two days. High-earning creators moving to the platform could further push the coin to $0.438 this year – a 687% gain, based on the current price. Before making any investment decisions, always do your own research first and never spend more than you’d be willing to lose."
    },
    {
      "title": "XRP Price Sends Mixed Signals After 4 Green Daily Closes, Crash Or Rally?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-sends-mixed-signals/",
      "summary": "The XRP price has now moved back into bearish territory after a remarkable run on the daily chart that had been signaling possible bullish momentum. Crypto analyst Master Ananda points this out in a post that shows a disturbing trend in the XRP price chart. If this continues, then the future of XRP, at least in the short term, has become even more uncertain, with bears fighting for more control. 4 Green Daily Closes Fall to Nothing After suffering a crash along with the rest of the crypto market, the XRP price had faced a recovery that seemed to have put it right back on track to rally again. This saw the first green daily close on the last day of May and then carried on into the new month of June. The first three days also closed in the green, leading to four consecutive daily green closes, which is usually bullish for the price. Related Reading: Bitcoin Price Crash Below $100,000 Still Possible: Analysts Issue Downtrend Warnings However, there was just another part of the trend that was not completed to show that this was a bullish move, and it has to do with volume. As Master Ananda pointed out, a spike in volume was expected as the XRP price put in a higher low. This would mean there is the momentum needed to push the price back up. But this was not the case as the volume plummeted and remained muted. The absence of this expected volume suggests there is weakness surrounding the XRP price, and this played out as the next day saw a red close for the altcoin for the first time in June. If this lack of momentum continues, then the price could continue to plummet. So far, there is now resistance mounting at the 0.382 Fibonacci level, which is $2.2959. This resistance would need to be cleared with a spike in volume if there is to be a recovery in the XRP price. Otherwise, it risks a fall back down to the 0.236 Fibonacci level, meaning the first steps toward falling below $2. Related Reading: XRP Price Could Hit $21 This Bull Cycle With 1.618 Fib Level As Next Target XRP Price Could Fall As Volumes Suffer Data from Coinglass shows how bad the XRP volume has been recently. So far in June, daily volume has remained well below $5 billion, reminiscent of the bear market figures whenever the price was falling. This also shows reduced participation from investors who are wary of entering the market during such conditions. Interestingly, though, open interest remains rather high, $3.94 billion, showing that crypto traders are actively betting on the XRP price. However, the majority are betting that the XRP price will continue to fall from here, with Coinglass data showing 52.75% of all positions being short compared to only 47.25% betting the price will increase. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Circle Soars 168% In First Day Of Trading On NYSE Following Strong IPO",
      "link": "https://www.newsbtc.com/news/circle-soars-168-in-first-day-of-trading-on-nyse-following-strong-ipo/",
      "summary": "Shares of Circle Internet Group, the issuer of the market’s second-largest stablecoin, USDC, experienced a remarkable surge on Thursday, skyrocketing 168% as the company made its debut on the New York Stock Exchange (NYSE). Circle&#8217;s IPO Exceeds Expectations Circle&#8217;s stock opened at $69, well above its IPO pricing of $31. Throughout the day, the shares reached a peak of $103.75, showcasing strong investor enthusiasm. The IPO was priced late Wednesday, exceeding the anticipated range of $27 to $28, and substantially outpacing an earlier range of $24 to $26. This pricing strategy valued the company at approximately $6.8 billion before trading commenced. Related Reading: Messari Flags XRP’s Silent Rise As A Treasury Favorite—Here’s Why By the end of the trading session, Circle&#8217;s trading volume reached about 46 million shares, far surpassing the number of freely floating shares available. This impressive performance positions Circle alongside other cryptocurrency firms like Coinbase, Mara Holdings, and Riot Platforms as a notable player in the US market. CEO Jeremy Allaire emphasized the importance of building relationships with governments and policymakers, stating, “To realize our vision, we needed to forge relationships with governments&#8230; it’s got to work in mainstream society and you need to have those rules of the road.” Allaire highlighted Circle&#8217;s commitment to compliance and transparency, which he believes has contributed to the company&#8217;s success in a challenging regulatory environment. Could Higher Prices Follow For Future Listings? The strong debut of Circle&#8217;s IPO could signal a shift in how institutional investors approach upcoming listings, potentially leading to higher initial public offering prices for future offerings. Notable companies preparing for IPOs include Omada Health, which is pricing on Thursday, and Klarna, a fintech firm set to list next week. While Circle&#8217;s IPO share price initially set its market value at $6.1 billion—below its last private market valuation of $7.7 billion from 2021—Thursday&#8217;s trading surge adjusted that figure. Related Reading: Crypto Analyst Warns: This Bitcoin Bull Cycle Looks Nothing Like 2017 or 2021 By the close of trading, Circle&#8217;s market capitalization, excluding employee options, stood at an impressive $16.7 billion. The company successfully raised approximately $1.1 billion through the offering. Circle&#8217;s journey to this point has been marked by challenges, including its previous attempt to go public. Circle&#8217;s previous attempt to go public via a merger was with a special purpose acquisition company (SPAC), which collapsed in late 2022 due to regulatory hurdles. The company&#8217;s largest outside shareholders include General Catalyst and IDG Capital, holding approximately 8.9% and 8.8% of all stock, respectively. Other significant backers such as Accel, Breyer Capital, and Oak Investment Partners continue to support Circle’s vision in the evolving crypto marketplace. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "As Lagrange Crypto Token $LA Surges, Climbing 500%, Will Solaxy See Bigger Gains?",
      "link": "https://www.newsbtc.com/news/lagrange-crypto-la-surges-500-solaxy-next-5x-token/",
      "summary": "Thousands of tokens launch every day. Most crash quickly, becoming worthless in time (or all but worthless). So why do people keep investing? Because every now and then, a Lagrange ($LA) comes along. The utility token for the Lagrange Foundation, which aims to support a verifiable AI ecosystem, $LA climbed 560%+ in a few hours after securing listings across major exchanges. The move pushed the token’s market cap over $287M. What went right for $LA, and what does it say about other upcoming projects? Stars Aligned for $LA Launch Lagrange had a few things going for it: Foundational ecosystem: $LA fuels the base layer for an ambitious but detailed technical project (the ZK Prover Network). Strong early interest: Lagrange attracted major early development from the likes of Peter Thiel’s Founders Fund, which provided $13.2M in seed funding. Detailed project design: Tokenomics, fee generation, staking – Lagrange clearly defined how each element worked in the $LA ecosystem. Broad DEX/CEX listing: After the TGE (Token Generation Event), $LA went live on a number of major exchanges, including Coinbase, KuCoin, Bitget, and more. It was a combination of factors, rather than any one thing, that helped push the project up. Crucially, investors seem confident in the long-term outlook for the Lagrange Foundation. When some investors took profits off the initial surge, causing the token to dip, others bought the dip, pushing $LA back up. No two crypto projects are identical, and this goes for their future potential, as well. But we can take some of the basic principles from $LA’s success and apply them to other projects to get a better idea of their chances. And one project – Solaxy ($SOLX) – shows promising similarities to $LA. Solaxy ($SOLX) – Meme-Focused Multichain Token for Groundbreaking Solana Layer-2 Solaxy ($SOLX) might seem like your average Solana meme coin, at least at first glance. But under the surface, Solaxy isn’t just a meme coin – it’s the foundation of the first ever Solana Layer-2, designed to be the foundation of a whole generation of faster-than-ever Solana tokens. It might even become one of the best meme coins in 2025 and beyond. A closer look at the project shows how $SOLX and $LA share some critical features: $LA raised $13.2M in seed funding; $SOLX raised $44.5M in its crypto presale (set to end in 10 days). $LA provided detailed information about technical developments; $SOLX has already launched the Solaxy block explorer and bridge, with full operational status in June 2025. $LA serves to support key ZK products and features; $SOLX offers a blazing-fast blockchain to add to the $56B meme coin market Both $LA and $SOLX are multi-chain tokens; $LA supports Ethereum, Base, Arbitrum, Solana, Optimism, and Polygon, and $SOLX supports Solana and Ethereum Solaxy is working fast, rolling out key features in the techmap to push full deployment of the Layer-2 as soon as possible. There’s only ten days left for investors to get in during the presale. If $SOLX imitates $LA’s climb, this is the lowest the price will ever be, so learn how to buy Solaxy with our guide, and don&#8217;t delay. The current token price is $0.001746. Our price prediction shows that it could climb to $0.032 by the end of the year, passing even $LA&#8217;s success and delivering 1,735% returns to investors who get in now. Visit the Solaxy presale page. Factors for $LA’s Success Bode Well for $SOLX That 500% price increase was pretty sweet for early Lagrange investors, and who knows how far the $LA token will go? Some of the same factors that contributed to $LA’s big wins look promising for $SOLX as well. Will it be the next 5x token? Never invest in anything without doing your own research; this is not financial advice."
    },
    {
      "title": "Bitcoin RSI Dips Below 30—Is A New All-Time High Next?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-rsi-dips-below-30-new-all-time-high-next/",
      "summary": "Data shows the 14-day Bitcoin Relative Strength Index (RSI) has dropped into the oversold region. Here&#8217;s what this could mean for the asset. Bitcoin RSI Has Breached Below The 30 Mark In a new post on X, analyst Axel Adler Jr has talked about the latest trend in the RSI of Bitcoin. The &#8220;RSI&#8221; refers to an indicator from technical analysis (TA) that measures the speed and magnitude of changes occurring in any given asset&#8217;s price over a specific period. In the current case, the period is 14 days. This metric is generally used for spotting oversold or overbought conditions for the asset. When the RSI is greater than 70, it can be a sign that the price is heating up and may be due a correction to the downside. On the other hand, it being under 30 can imply the asset is becoming underbought. Related Reading: Solana’s Old Hands Are Moving—Is Trouble Brewing? Now, here is the chart shared by the analyst that shows the trend in the 14-day Bitcoin RSI over the last couple of years: As displayed in the above graph, the 14-day Bitcoin RSI has plummeted recently and is now below the 30 threshold. This naturally suggests the cryptocurrency is becoming oversold, at least from the perspective of this indicator. &#8220;Other metrics are also showing alerts,&#8221; notes Adler Jr. &#8220;I think now all conditions are in place to start testing the ATH.&#8221; Though, while bullish developments may have occurred on the RSI and other indicators, BTC has actually declined during the past day. On-chain data may provide hints about where the next potential support zone could be located for the asset. As the analytics firm Glassnode has revealed in its latest weekly report, the average cost basis of the short-term holders is located at $97,100. The short-term holders (STHs) refer to the Bitcoin investors who purchased their coins during the past 155 days. The cost basis of this group has often been a relevant level for the cryptocurrency, taking turns as support and resistance. In the chart, the analytics firm has also shown two other levels: the +1 and -1 standard deviation bands. Currently, the latter is situated at $83,200, so it&#8217;s possible that if BTC&#8217;s bearish momentum lasts for long enough to push it under the STH cost basis, this value could prove significant. However, before this level, there is another on-chain level that could be important. The level in question is part of the Spent Supply Distribution (SSD) Quantiles model, which basically tells us which price levels the investors selling their coins right now initially purchased them. Related Reading: Bitcoin’s Key Investors Double Down, Buy Another 79,000 BTC The 0.85 quantile is located at $95,600, which is quite close to the STH cost basis, so a retest of the zone could be a particularly vital one for Bitcoin. BTC Price At the time of writing, Bitcoin is floating around $101,000, down almost 5% in the last seven days. Featured image from Dall-E, CryptoQuant.com, Glassnode.com, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Palantir Is Violating Its Own Principles by Avoiding a Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/bitcoin-for-corporations/palantir-violates-principles-avoiding-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Palantir-Is-Violating-Its-Own-Principles-by-Avoiding-a-Bitcoin-Treasury-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bitcoin-for-corporations/palantir-violates-principles-avoiding-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>Palantir builds for sovereignty and resilience—but without a Bitcoin treasury, its mission remains unfinished and its capital strategy misaligned.</p> <p>"
    },
    {
      "title": "Bitcoin vs Stablecoins: Bitcoin is an Unreplicable Lifeline in Authoritarian Regimes",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Authoritarian-leader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-vs-stablecoins-bitcoin-is-an-unreplicable-lifeline-in-authoritarian-regimes\" rel=\"nofollow\"> </a></p> <p>Bitcoin operates beyond any government’s grasp. Its value isn’t in replacing stablecoins — it’s in doing what they fundamentally cannot do.</p> <p>"
    },
    {
      "title": "Bitcoin Life Insurer, Meanwhile, Becomes First Company to Publish Audited Financials Denominated in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Meanwhile-Insurance.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-life-insurer-meanwhile-becomes-first-company-to-publish-audited-financials-denominated-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Meanwhile Insurance Bitcoin (Bermuda) Limited (“Meanwhile”) announced it has become the first company in the world to release externally audited financial statements denominated entirely in Bitcoin. According to the announcement, the company reported 220.4 BTC in assets and 25.29 BTC in net income for 2024, a 300% year over year increase. “We’ve just made history [&#8230;]</p> <p>"
    },
    {
      "title": "President Trump’s Truth Social Files S-1 Form For Bitcoin ETF",
      "link": "https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Eric-Trump-Said-Everybody-Wants-Bitcoin.-Everybody-is-Buying-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-trumps-truth-social-files-s-1-form-for-bitcoin-etf\" rel=\"nofollow\">President Trump&#8217;s Truth Social Files S-1 Form For Bitcoin ETF</a></p> <p>Truth Social filed for an S-1 Form for a Bitcoin ETF.</p> <p>"
    },
    {
      "title": "Botanix Launches Federated Sidechain with 16 Members On Testnet",
      "link": "https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_giant_robot_spider_with_big_matrix_code_ch_2-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/botanix-launches-federated-sidechain-with-16-members\" rel=\"nofollow\"> </a></p> <p>Botanix launches a decentralized Bitcoin sidechain on testnet with a 16-node federation, using the Spiderchain protocol for EVM-compatible dApps. Mainnet set for Q3 2025.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "OpenAI Challenges Court Order to Preserve User Data in NYT Lawsuit",
      "link": "https://decrypt.co/323950/openai-challenges-court-order-user-data-nyt-lawsuit",
      "summary": "The AI firm said the order to retain deleted ChatGPT chats undermines user privacy as legal its battle escalates."
    },
    {
      "title": "Meta Oversight Board Slams Parent Company Over Viral Ronaldo Deepfake",
      "link": "https://decrypt.co/323942/meta-oversight-board-slams-parent-company-viral-ronaldo-deepfake",
      "summary": "Meta’s Oversight Board ordered the removal of a Ronaldo deepfake ad, calling out the platform’s weak enforcement of anti-fraud rules."
    },
    {
      "title": "How Circle’s IPO Stacks Up Against Other Crypto Market Debuts",
      "link": "https://decrypt.co/323939/how-circles-ipo-stacks-up-against-other-crypto-market-debuts",
      "summary": "Circle closed with an $18.4 billion valuation, well below Coinbase’s IPO but ahead of newer entrants like Fold and eToro."
    },
    {
      "title": "'A Different Era': Bored Ape Creator Yuga Labs Wants to Kill the ApeCoin DAO",
      "link": "https://decrypt.co/323902/bored-ape-creator-yuga-labs-wants-kill-apecoin-dao",
      "summary": "Bored Ape Yacht Club creator Yuga Labs has proposed axing the ApeCoin DAO, with plans to create a new entity to oversee the Ethereum token."
    },
    {
      "title": "VPN Usage Spikes in France as Pornhub Blocks Users Over Age Restrictions",
      "link": "https://decrypt.co/323881/vpn-usage-spikes-france-pornhub-age-restrictions",
      "summary": "Pornhub’s France block over age checks sparked a 1,000% ProtonVPN signup surge, highlighting pushback against ID laws."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "UK FCA plans to let consumers buy crypto ETNs, but keeps retail blocked from derivatives",
      "link": "https://cryptobriefing.com/fca-crypto-etns-retail-ban/",
      "summary": "<p>The FCA's decision may boost crypto market participation but raises concerns about retail investors' exposure to high-risk financial products.</p> <p>"
    },
    {
      "title": "World Liberty advisor faces six-figure loss after shorting $TRUMP on Trump-Musk fallout",
      "link": "https://cryptobriefing.com/shorting-trump-losses-advisor/",
      "summary": "<p>The fallout highlights the volatility and interconnectedness of crypto and traditional markets, emphasizing the risks of speculative trading.</p> <p>"
    },
    {
      "title": "Trump–Musk feud escalates as Musk accuses Trump of appearing in Epstein files",
      "link": "https://cryptobriefing.com/trump-musk-contracts-epstein-allegation/",
      "summary": "<p>Trump threatens to cut Musks government contracts after backlash over $1.6T bill. Musk fires back with Epstein claim as Tesla sinks 20%.</p> <p>"
    },
    {
      "title": "Truth Social Bitcoin and Ethereum ETF registered in Nevada",
      "link": "https://cryptobriefing.com/truth-social-cryptocurrency-investment-trusts/",
      "summary": "<p>This move could enhance crypto market accessibility and legitimacy, potentially influencing broader adoption and regulatory perspectives.</p> <p>"
    },
    {
      "title": "Trump’s sons send cease-and-desist to his meme coin team over Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/trump-branded-crypto-wallet-dispute/",
      "summary": "<p>The cease-and-desist highlights potential legal and reputational risks in unauthorized use of high-profile names in crypto ventures.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "FARTCOIN flies as Coinbase listing talks rise – Here’s what you should know",
      "link": "https://ambcrypto.com/fartcoin-flies-as-coinbase-listing-talks-rise-heres-what-you-should-know/",
      "summary": "<img alt=\"FARTCOIN flies as Coinbase listing talks rise - Here&#039;s what you should know\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-4.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />FARTCOIN spikes 14% on Coinbase buzz – The beginning of a big rally?"
    },
    {
      "title": "Top 8 exchanges to trade on in June 2025",
      "link": "https://ambcrypto.com/top-8-exchanges-to-trade-on-in-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1099\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/steve-johnson-0sPFjdcRhko-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Cryptocurrency has seen large-scale adoption in the past few years, with a global user base [&#8230;]"
    },
    {
      "title": "Top 8 VPNs of June 2025",
      "link": "https://ambcrypto.com/top-8-vpns-of-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"800\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/leon-seibert-2m71l9fA6mg-unsplash-scaled-e1749207437427.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1200\" />Virtual Private Networks, or VPNs, have become an essential part of the online experience. They [&#8230;]"
    },
    {
      "title": "Crypto market slides post Trump vs. Musk – But Samson Mow has ‘freedom advice’",
      "link": "https://ambcrypto.com/crypto-market-slides-post-trump-vs-musk-but-samson-mow-has-freedom-advice/",
      "summary": "<img alt=\"Trump vs Musk\" class=\"attachment-full size-full wp-post-image\" height=\"777\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Trump-vs-Musk.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1382\" />Bitcoin dips below $100K as Trump’s threats rattle Musk’s empire but HODLers stay strong."
    },
    {
      "title": "World Liberty Financial exec shorts TRUMP – Will it hold $10?",
      "link": "https://ambcrypto.com/world-liberty-financial-exec-shorts-trump-will-it-hold-10/",
      "summary": "<img alt=\"World Liberty Financial exec shorts TRUMP - Will it hold $10? \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/TRUMPWI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Trump family's crypto tensions may be far from over, going by recent updates."
    }
  ]
}