{
  "CoinDesk": [
    {
      "title": "Coinbase Debuts Stablecoin Payment Stack Following Shopify Partnership",
      "link": "https://www.coindesk.com/business/2025/06/18/coinbase-debuts-stablecoin-payment-stack-following-shopify-partnership",
      "summary": ""
    },
    {
      "title": "UK to Propose Restrictions on How Banks Can Deal With Crypto Next Year",
      "link": "https://www.coindesk.com/policy/2025/06/18/uk-to-propose-restrictions-on-how-banks-can-deal-with-crypto-next-year",
      "summary": ""
    },
    {
      "title": "Litecoin Bucks Bearish Trend as ETF Hopes Climb Amid Rising Global Tension",
      "link": "https://www.coindesk.com/markets/2025/06/18/litecoin-bucks-bearish-trend-as-etf-hopes-climb-amid-rising-global-tension",
      "summary": ""
    },
    {
      "title": "BNB Hits Resistance at $654 as Israel-Iran Conflict Rattles Crypto Traders",
      "link": "https://www.coindesk.com/markets/2025/06/18/bnb-hits-resistance-at-654-as-israel-iran-conflict-rattles-crypto-traders",
      "summary": ""
    },
    {
      "title": "Standard Chartered Sees New Growth Frontiers in Non-Stablecoin Tokenization",
      "link": "https://www.coindesk.com/markets/2025/06/18/standard-chartered-sees-new-growth-frontiers-in-non-stablecoin-tokenization",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Deribit, Crypto.com integrate BlackRock&#039;s BUIDL as trading collateral",
      "link": "https://cointelegraph.com/news/deribit-crypto-com-accepting-blackrock-buidl-collateral?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzQ0ZWItZDM0NS03MTZjLTgwOTctMzU0OTVlYWU5YzNk.jpg\" /></p><p>The move will lower collateral requirements to access leverage for crypto trading due to the relatively stable value of US government debt.</p>"
    },
    {
      "title": "Price predictions 6/18: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, HYPE, SUI, BCH",
      "link": "https://cointelegraph.com/news/price-predictions-6-18-btc-eth-xrp-bnb-sol-doge-ada-hype-sui-bch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgzZDgtNDhiYS03OWIyLWEzZDYtMTczOGQ0YTY1NjM4.jpg\" /></p><p>Bitcoin sell pressure ramps up as traders anticipate today’s FOMC results. Could BTC price fall to $100,000?</p>"
    },
    {
      "title": "Healthcare company onboards Trump crypto adviser, buys $20M BTC",
      "link": "https://cointelegraph.com/news/prenetics-health-company-bitcoin-investment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgzNzUtMjAxMy03Yjc5LThhNWUtZjlkMGNhNGVjNGUy.jpg\" /></p><p>The initial purchase of more than 187 BTC was part of a larger strategy to “substantially increase its Bitcoin holdings,” according to Prenetics.</p>"
    },
    {
      "title": "ZisK spins off from Polygon with ‘core minds behind Polygon zkEVM’",
      "link": "https://cointelegraph.com/news/polygon-cofounder-launches-zisk-zkevm?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmZmNjItNDA1Zi03NjBiLWIxYjItZTNkODI0YjJhZjY4.jpg\" /></p><p>Polygon co-founder Jordi Baylini continues to serve Polygon in an advisory capacity.</p>"
    },
    {
      "title": "Sandeep Nailwal’s Polygon takeover is his chance to ‘go all in’",
      "link": "https://cointelegraph.com/news/polygon-sandeep-nailwal-inside-decision?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVlNWYtYjUwNi03ZGY1LTlhMWItODkyYjRjNWRhOWNm.jpg\" /></p><p>Co-founder and new CEO Sandeep Nailwal opens up about dissolving Polygon’s board, closing zkEVM and why claiming sole leadership is the network’s best shot at relevance.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Two public firms announce plans to adopt HYPE as primary reserve asset for treasury",
      "link": "https://cryptoslate.com/two-public-firms-announce-plans-to-adopt-hype-as-primary-reserve-asset-for-treasury/",
      "summary": "<p>Lion Group Holding Ltd. (LGHL) and Eyenovia Inc. unveiled separate major financing moves this week to launch cryptocurrency treasury strategies centered on Hyperliquid’s HYPE token. LGHL announced it has secured a $600 million facility to launch the first and largest HYPE treasury in Asia. The Singapore-based trading and financial services firm also revealed intentions to include [&#8230;]</p> <p>"
    },
    {
      "title": "XRP network activity surges as Canada launches an XRP ETF",
      "link": "https://cryptoslate.com/xrp-network-activity-surges-as-canada-launches-an-xrp-etf/",
      "summary": "<p>Canadian asset manager 3iQ has launched an XRP-focused exchange-traded fund (ETF) on the Toronto Stock Exchange (TSX) under the XRPQ ticker. According to a June 18 statement, XRPQ will offer investors a six-month waiver on management fees and hold only long-term positions on the digital asset. These assets are sourced from reputable exchanges and over-the-counter [&#8230;]</p> <p>"
    },
    {
      "title": "Circle’s USDC and BlackRock’s BUIDL spearhead collateral innovation in derivatives markets",
      "link": "https://cryptoslate.com/circles-usdc-and-blackrocks-buidl-spearhead-collateral-innovation-in-derivatives-markets/",
      "summary": "<p>Crypto trading platforms increasingly adopt blockchain-native assets like the USDC stablecoin and tokenized treasuries such as BlackRock’s BUIDL to enhance collateral efficiency in derivatives markets. These instruments offer a blend of stability, yield, and compliance, making them attractive to institutional players seeking capital optimization. USDC and BUIDL gain momentum in crypto derivatives On June 18, [&#8230;]</p> <p>"
    },
    {
      "title": "North Korea’s hackers could have laundered as much as $1.5 billion in stolen crypto",
      "link": "https://cryptoslate.com/north-koreas-hackers-laundered-1-5-billion-in-stolen-crypto/",
      "summary": "<p>North Korea’s hackers has reportedly stolen nearly $2 billion from centralized crypto exchanges over the past year. Blockchain security researcher Tay Monahan attributes a significant portion of those funds, around $1.8 billion, to a series of major hacks targeting centralized crypto trading platforms like Bybit, DMM Bitcoin, WazirX, Phemex, and BingX. Despite setbacks such as [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini accuses CFTC of unfair legal campaign in formal complaint",
      "link": "https://cryptoslate.com/gemini-accuses-cftc-of-unfair-legal-campaign-in-formal-complaint/",
      "summary": "<p>Crypto exchange Gemini has filed a formal complaint against the Commodity Futures Trading Commission’s (CFTC) Division of Enforcement (DOE), accusing it of pursuing a prolonged and unjustified legal campaign. On June 17, Gemini co-founder Tyler Winklevoss revealed that the firm submitted the complaints to the CFTC’s Office of the Inspector General on June 13. According [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Buy Bitcoin Now? Not Yet—Analyst Says Time Holds The Key",
      "link": "https://www.newsbtc.com/bitcoin-news/buy-bitcoin-now-not-yet-time-holds-key/",
      "summary": "In a post on June 17, prominent crypto strategist Astronomer (@astronomer_zero) outlined his high-conviction roadmap for Bitcoin’s next major breakout, emphasizing that timing—not just price—is the most critical factor for those still on the sidelines. Despite projecting a continuation of the broader uptrend that began at $18,000 in 2023, Astronomer warned that jumping in prematurely could blunt the risk-reward ratio of the next leg. “Planning to buy now into BTC is expected to net you a move of over 70% in a short period of time,” he wrote. “But the closer we get to those 10 weeks, confirmed with price action, the closer BTC is to breaking out.” Buy Bitcoin Now? His primary thesis: Bitcoin’s breakout will not occur before June 30, and any significant move is statistically more likely after that date. This aligns with what he calls one of the “most ancient crypto mechanics”—Bitcoin moves first, and altcoins follow. Related Reading: Analyst Predicts Bitcoin Price Crash As War Tensions Mount In Middle East Astronomer’s roadmap presents a tiered accumulation strategy rooted in probabilistic support zones. “Upon statistical analysis, the expected close before going up only is around $103k,” he wrote. “Probably a good level to start getting involved. […] The expected level to be reached based on all prior signals (lowest wick) is $96k. Probably a good level to buy heavy if given. […] And finally, the expected lowest close is $90k. Probably a good level to allocate (almost) all your dry powder.” But beyond the price levels, Astronomer places stronger emphasis on timing: “If the price doesn&#8217;t go as deep into the $90’s—which I don&#8217;t think is very likely—I expect June to close between $95-110k and not go much lower. Then I&#8217;d buy more and more the closer we get to those 10 weeks regardless of the price. Time is more important than price.” He also pointed to structural market dynamics supporting his thesis, including a bullish spot-to-perpetual rotation: “The order books start to rotate towards green into spot, red into perps (aggressive shorts, aggressive spot buys), simply visible with the increasing spot premiums.” Adding to the signal strength is a recent weekly hash ribbon print—“one that never failed,” he noted. Related Reading: $150,000 Bitcoin Is In Play—Unless This One Macro Metric Snaps Astronomer further offered guidance for navigating altcoins, advising traders to wait for the breakout rather than attempting to catch falling knives. “Buying alts when BTC breaks out […] is smarter than trying to knife catch them. To eliminate the drawdown and reap the upside rewards.” Summarizing his plan, he said, “If I was sidelined, I&#8217;d look to buy below $103k and as much as possible as close to $90k as possible. And the closer we get to those 10 weeks, confirmed with price action, the more confident I become.” Astronomer’s final message underscores that his bullish stance hasn’t changed since the flip at $18K: “No top being in yet, until we reach at least 170k+. That is the plan.” And for those still unsure? He offers a blunt reminder: “"
    },
    {
      "title": "Analyst Says Bitcoin Price Could Rise 3x To $300,000 As AVIV Levels Resemble Previous Bull Cycles",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-could-rise-3x-to-300000/",
      "summary": "Bitcoin has continued to hover above the $100,000 mark over the past few days, and its price action has stabilized around $105,000 in the wake of recent market tensions and despite inflows into Spot Bitcoin ETFs. A new analysis shared by crypto market commentator Gert van Lagen suggests that this current phase is going to precede an explosive move similar to those seen in previous market cycles. Backing his prediction with historical data and Glassnode’s AVIV Ratio chart, the analyst noted that the current on-chain structure echoes moments before Bitcoin’s major rallies in past bull markets. AVIV Ratio Flashes Familiar Pattern Before Market Top Bitcoin&#8217;s price volatility has slightly cooled since the initial surge to a new all-time high above $111,800 in May, and the latest candlestick structure suggests it may be preparing for another leg higher. Related Reading: Can Bitcoin Price Bounce To $120,000 Or Will It Break Below $100,000? Taking to the social media platform X, Gert van Lagen revealed a Bitcoin price prediction that centers around the true market Deviation metric known as the AVIV Ratio. This orange-colored line on the chart tracks a specific deviation in Bitcoin’s market behavior and has always crossed a red line denoting +3 standard deviations at or just before cycle tops. The current AVIV behavior can be compared to previous price points before market tops in previous cycles. For instance, in 2013, the AVIV Ratio flagged a major rally when Bitcoin was trading near $200, shortly before the price pushed past $1,200. In 2017, the metric behaved similarly when Bitcoin was trading at $3,700 and later peaked near $20,000. The current AVIV Ratio can also be compared to when Bitcoin was priced at $13,000 in the 2021 bull market run, before its surge to an all-time high of $69,000. According to the analyst, today’s AVIV ratio level is closely aligned with those previous mid-cycle breakouts. The current ratio has not yet crossed the red +3σ line, which the analyst refers to as the cycle top trigger. As such, its current reading suggests Bitcoin may be in the early phase of a major bull market expansion. If history repeats itself, a 3x move from today’s levels would be a standard price move in line with previous price action. $300,000 Target Within Sight If AVIV Behavior Holds Crypto analyst van Lagen stops short of calling for an immediate top, but his analysis implies that Bitcoin could be preparing for a new parabolic surge to the upside. Using the AVIV model as a reference, a conservative 3x multiplier on the current Bitcoin price places a possible target around $300,000. Related Reading: Key Fractal From 2023 Says Bitcoin Price Is Still Bullish, But A Crash To $90,000 Could Be Coming At the time of writing, Bitcoin is trading at $104,997, having decreased by 1.4% in the past 24 hours. This decline has brought its price down from an intraday high of $106,795 back into its consolidation range around $105,000. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Altcoin Alert: Expert Reveals Hottest Opportunities For The Summer Season",
      "link": "https://www.newsbtc.com/altcoin/altcoin-alert-expert-reveals-hottest-opportunities-for-the-summer-season/",
      "summary": "As geopolitical tensions in the Middle East continue to impact cryptocurrency prices, with Bitcoin (BTC) recently dipping below the $105,000 mark, market analyst VirtualBacon has shared insights suggesting that altcoins are gearing up for a potentially robust summer. Emerging AI Memecoins In a recent update on social media platform X (formerly Twitter), he highlighted several promising developments within the altcoin space. VirtualBacon pointed to an emerging wave of AI-focused Layer-1 blockchain projects, many backed by prominent figures in both the cryptocurrency and traditional finance sectors. He mentioned several names to watch, including Sahara Labs, Sentient AGI, and Gaianet, among others. While these projects have yet to release tokens, many are expected to conduct airdrops or early access rounds, presenting opportunities for early investors. Related Reading: On-Chain Analyst Warns: Bitcoin Peak Expected, Altcoins Facing -95% Plunge For those seeking “higher-risk, high-reward investments,” VirtualBacon noted the impressive performance of artificial intelligence (AI) agent memecoins. He cited the launch of IRIS, which skyrocketed from a $220,000 fully diluted valuation (FDV) to $120 million, representing a 600x return. Platforms such as Virtuals, CreatorBid, and SeedifyFund are turning user engagement into allocation opportunities, likening this phenomenon to a form of airdrop farming on steroids. In addition, VirtualBacon highlighted a relatively overlooked area: Bittensor subnet tokens. He mentioned that seasoned investors can now acquire early-stage subnets directly on Bittensor’s chain, with projects like SN65_TPN and inference_labs raising capital through token auctions at valuations below $4 million. Stablecoins Take Center Stage Turning to real-world assets (RWAs), VirtualBacon advised focusing on mid-cap infrastructure projects with tangible revenue streams. He pointed to CHEX and CPOOL, which has shown consistent upward movement, as examples of promising investments. Another emerging narrative is the merger and acquisition activity involving public companies and crypto projects. VirtualBacon noted that Tron is set to go public through a Nasdaq reverse merger, while Mixie has been acquired by Netcapital, which boasts a team that includes notable figures like Tim Draper and a co-founder of Helium. A particularly intriguing development is World Liberty Financial (WLF), co-founded by Eric and Donald Jr. Trump, which aims to become a major player in the decentralized finance (DeFi) space. With plans for its own stablecoin, USD1, and expected to launch in October, the token could have an estimated FDV of $10–15 billion, a conservative projection given its potential. VirtualBacon also pointed out that stablecoins are becoming central to macroeconomic strategies. Tether now ranks as the fifth-largest holder of US Treasuries, highlighting the increasing need for buyers in the market. The analyst urged investors to keep an eye on stablecoin projects that integrate artificial intelligence technology and yield generation, such as USD1, Circle’s USDC, and others. Liquidity Shifts To Altcoin Platforms In the gaming sector, liquidity is coalescing around BlackholeDex, a decentralized exchange (DEX) backed by the AVAX Foundation. With a fee-sharing model similar to Aerodrome and Shadow, BlackholeDex has launched veNFT staking, aligning long-term incentives for users. Related Reading: Ethereum Slows Down In June: Historical Data Says More Losses To Come Lastly, in the Solana ecosystem, Saros DLMM is emerging as a strong competitor to existing platforms like Jupiter and Meteora, utilizing similar bucket-based liquidity pools but with lower fees. It also plans a RADY meme airdrop for SAROS stakers, which could attract early adopters and fuel rapid growth, thus closing the list of highlighted altcoins. As of this writing, Ethereum, the market’s leading altcoin, is trading at $2,521. It has consolidated above this level after dropping sharply from its two-week high of $2,878. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Crypto Gets A Green Light From Spanish Banking Giant",
      "link": "https://www.newsbtc.com/crypto/crypto-gets-a-green-light-from-spanish-banking-giant/",
      "summary": "Since late 2024, BBVA’s private‑banking arm in Switzerland has been quietly advising clients to add Bitcoin and Ether to their holdings. According to Philippe Meyer, who leads digital and blockchain solutions at BBVA Switzerland, wealthy customers should allocate between 3% and 7% of their portfolios to crypto. Based on reports, this advice aims to boost returns without exposing investors to outsized risk. Related Reading: Tether Enforces Freeze On $12 Million In Tron Funds Over Illicit Activity Early Adoption Timeline BBVA began executing crypto trades in 2021 for a handful of clients. By September 2024, Meyer says the bank had started formally recommending a 3% Bitcoin stake in balanced portfolios. Now, risk‑tolerant clients can move up to 7% into digital assets, reflecting BBVA’s growing confidence in crypto as a mainstream option. Philippe Meyer recently delivered a presentation at a blockchain conference in Lugano, Switzerland. Source: BBVA Switzerland. Client Reaction And Risk Views Many clients have responded well so far. Meyer notes that even a small 3% allocation “already boosts the performance” of a diversified portfolio and “you are not taking a huge risk” at that level. Short‑term swings still occur—crypto markets can drop 20% in a week—but private clients seem ready to ride those waves in pursuit of higher gains. According to Reuters, BBVA, Spain’s second-largest bank, has been advising its private banking clients since September 2024 to allocate 3% to 7% of their portfolios to cryptocurrencies based on their risk appetite. The guidance currently applies to Bitcoin and Ether, with plans… — Wu Blockchain (@WuBlockchain) June 17, 2025 Regulatory And Market Context Europe’s Markets in Crypto‑Assets regulation (MiCA) took full effect at the end of December 2024. This rulebook governs token issuers and service providers across the EU. Yet the European Securities and Markets Authority reports that 95% of EU banks avoid crypto activities entirely. BBVA stands out: in March 2025, Spain’s securities regulator gave it formal approval to offer Bitcoin and Ether trading in the country. Related Reading: Record‑High Ethereum Open Interest Signals Institutional Confidence Next Steps For App And Investors BBVA plans to roll out buy, sell, and portfolio management features inside its existing mobile app over the coming months. The launch will begin with select clients before expanding more broadly. As rival banks like Santander explore their own stablecoins—pegged to dollars and euros—BBVA’s move could spur a wave of mainstream crypto services. For now, only high‑net‑worth clients hear this crypto advice. But if allocations deliver solid returns and BBVA weathers any market crashes, other banks may follow. That would give more investors the chance to include crypto alongside stocks, bonds, and real estate. The real test will come if Bitcoin or Ether plunge sharply. If BBVA’s cautious plan holds up under stress, it may reshape how mainstream finance treats digital assets. Featured image from ESG News, chart from TradingView"
    },
    {
      "title": "Much Ado About Something? JPMorgan Launches USD Deposit Token – Not Stablecoin",
      "link": "https://www.newsbtc.com/news/jpmorgan-launches-usd-deposit-token-not-stablecoin/",
      "summary": "After days of rumors around the identity of the mysterious ‘JPMD’ token filed by JPMorgan, widely supposed to be a stablecoin, the truth has finally emerged. JPMD isn’t a stablecoin after all – it’s a deposit token on the Base blockchain (Coinbase’s own blockchain). With JPMD, institutions have a round-the-clock method of making deposits, incorporating established banking systems with blockchain technology. It’s one more step along the path towards crypto as a normal part of everyday life, alongside core crypto projects like Best Wallet token. Time to learn more about why JPMorgan thinks deposit tokens are part of the future of crypto. Not a Surprise After All: JPMorgan Champions Deposit Tokens Perhaps everyone should have guessed what JPMD was. After all, one of the largest banks in the US is hardly likely to do anything without a lot of research and preparation. And in this case, JPMorgan has been championing blockchain-powered deposit tokens since at least 2022. That was when the company published an extensive report on the utility and function of proposed deposit tokens. Calling them ‘a foundation for stable digital money,’ JPMorgan outlined a number of core advantages a deposit token could offer to traditional banks: ✔️ Digital form of commercial bank money – deposit token fills the role of existing deposit claims ✔️ Blockchain-native programmability – with deposit tokens, banks can access smart contracts, an atomic settlement option, and automated processing ✔️ Payment efficiency and cost reduction – on-chain deposit tokens provide real-time transfers; no more waiting for deposits to settle after-hours ✔️ Seamless integration with banking – established use cases, existing support networks, and even clear legal status; there’s little to prevent immediate use of deposit tokens within the current banking infrastructure That last point is critical. Even while stablecoins draw increased attention, deposit tokens like JPMD hold one clear advantage: they fit neatly into existing rules and regulations. Trademark Filed, JPMorgan Builds Base for Crypto-Finance Integration JPMorgan filed the trademark application on June 15, 2025. As it turns out, the deposit token will be built on the Base blockchain and will leverage that chain to provide round-the-clock crypto access for its clients (Coinbase is one). If JPMD takes off – and it should, since JPMorgan has a market cap of roughly $738B – it could be the next step in the growing conjunction between crypto and finance. Institutions have led crypto adoption in recent months, but there are growing signs that retail adoption won’t be far behind. Success in a fully integrated crypto-financial world will rest partly on the power of your crypto wallet. Best Wallet app is a leading non-custodial crypto wallet, and now the Best Wallet Token launch takes the wallet to the next level. Best Wallet Token ($BEST) – Upgrade Your Crypto Wallet to be Future-Proof Best Wallet Token ($BEST) takes the power of the Best Wallet app up a notch. $BEST token holders gain: ✅ Exclusive crypto presale access ✅ Reduced trading fees ✅ Increased staking rewards ✅ Governance rights and participation Best Wallet is the only crypto presale wallet, offering an Upcoming Tokens feature where you can research and invest in the best crypto presales. It’s all part of a growing crypto ecosystem where Best Wallet, Best Wallet Token, and the upcoming Best Card work together to equip you to navigate a brave new crypto world. That gives $BEST unique utility, even among other crypto presales. Currently, tokens cost $0.025195, and early investors can stake them for a 104% variable APY. Our price prediction sees the token price potentially reaching $0.035215 by the end of the year, delivering 40% returns to anyone who buys in now. Learn how to buy Best Wallet token, and don’t forget to visit the Best Wallet Token presale page today. JPMorgan, Best Wallet Show Path Forward for Crypto Together, the launch of both $BEST and $JPMD highlights the way forward for crypto. Traditional finance and crypto are no longer separate things – they’re two sides of the same coin, and crypto wallets connect them. Before purchasing $BEST, do your own research. This isn’t financial advice."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "The Trolls Are Coming: Defending Bitcoin Mining from Patent Trolls",
      "link": "https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_GenerateThe-Trolls-Are-Coming_-Defending-Bitcoin-Mining-from-Patent-Trollsd_Image_9ib8k29ib8k29ib8-fotor-20250618125328.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls\" rel=\"nofollow\"> </a></p> <p>The clash between Malikie Innovations and Bitcoin miners exemplifies a classic conflict between open innovation and legacy fiat intellectual property rights.</p> <p>"
    },
    {
      "title": "Bitdeer Raises $330M to Expand Bitcoin Mining and AI Operations",
      "link": "https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BITDEER-EXPANDS-BITCOIN-MINING.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations\" rel=\"nofollow\"> </a></p> <p>Singapore-based Bitcoin mining firm Bitdeer Technologies Group has launched a $330 million convertible notes offering, aiming to strengthen its mining operations, develop ASIC rigs, and scale its AI infrastructure.&#160; The notes, due in 2031, carry an annual interest rate of 4.875% and may be converted into Bitdeer Class A shares at a 25% premium to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Tech Booms: Lightning Data Defies Digital Gold Narrative",
      "link": "https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_a_rough_gold_rock_with_Bitcoin_logo_stampe_2.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative\" rel=\"nofollow\"> </a></p> <p>Bitcoin tech shines in 2025 with 1.5 million Lightning users, $1.5 billion trading volume, and Block’s 9.7% yield, outpacing treasury hype.</p> <p>"
    },
    {
      "title": "K33 Announces Plans To Purchase Up To 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norwegian-Public-Company-K33-AB-Purchased-10-BTC-For-Their-New-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>K33 has launched a SEK 85 million share issue at a price of SEK 0.1036 per share.</p> <p>"
    },
    {
      "title": "The Blockchain Group Buys $20 Million Worth Of Bitcoin",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-buys-20-million-worth-of-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/10.4B-Bitcoin-Firm-Unchained-Announces-First-Regulated-Bitcoin-Native-Trust-Company-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-buys-20-million-worth-of-bitcoin\" rel=\"nofollow\"> </a></p> <p>European Bitcoin treasury company acquires 182 BTC through convertible bonds and warrant conversions, bringing total holdings to 1,653 BTC worth $172 million.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin Shrugs Off Fed Decision to Keep Rates Unchanged",
      "link": "https://decrypt.co/325643/bitcoin-shrugs-off-fed-decision-to-keep-rates-unchanged",
      "summary": "The largest cryptocurrency by market value has been trading about 5% under its all-time high set last month."
    },
    {
      "title": "WILL $HYPE FLIP $SOL? POTENTIAL PUMP.FUN CHAIN, BULL RUN INDICATORS",
      "link": "https://decrypt.co/videos/interviews/9ffa06y8/will-hype-flip-sol-potential-pumpfun-chain-bull-run-indicators",
      "summary": ". REKT RADIO LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. 00:00 - Intro 04:12 - Iran conflict talk 07:25 - James Wynn 09:52 - HYPE Vaults 12:00 - Hyperliquid 20:30 - PumpFun chain thesis 21:40 - Is Hyperliquid going to flip SOL 23:00 - Michael Saylor's Money Glitch 25:00 - 1 Million Hype Perp market creation 28:52 - CRCL's affect on the wider market 30:40 - What key indicators are we watching to predict if we're still in the bull market or not 33:00 - Chain popularity and culture, and what's cool 37:25 - Rollbits new onchain casino 41:25 - Are Crypto KOLs still cool? 50:00 - YEET Giveaway + Follow KICK channel 51:40 - Giveaway LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    },
    {
      "title": "Coinbase, Circle Stocks Spike Double Digits After Stablecoin Bill Clears Senate",
      "link": "https://decrypt.co/325840/coinbase-circle-stocks-spike-double-digits-genius-act",
      "summary": "Coinbase and Circle are soaring after a key stablecoin bill cleared the Senate—but Fed rate cuts could test their biggest revenue stream."
    },
    {
      "title": "Publicly Traded Solana Treasury Firm Is 'Showing What's Next' for Strategy's Bitcoin Model",
      "link": "https://decrypt.co/325793/publicly-traded-solana-firm-showing-whats-next-strategy-bitcoin",
      "summary": "Newly established Solana treasury company DeFi Development Corp. is taking a unique approach in building its digital asset stash."
    },
    {
      "title": "'Global Response' to Crypto Regulation Needed as US Advances GENIUS Act: FCA",
      "link": "https://decrypt.co/325790/global-response-crypto-regulation-fca",
      "summary": "Lord Chris Holmes argued \"right-size regulation\" benefits innovation, adding that only \"grifters and chancers\" want a regulatory-free environment."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "US DOJ seeks to forfeit $225 million in crypto from global scam network",
      "link": "https://cryptobriefing.com/crypto-scam-forfeiture-seizure/",
      "summary": "<p>The DOJ's action highlights the increasing need for robust international cooperation and advanced digital forensics in combating crypto fraud.</p> <p>"
    },
    {
      "title": "Bitcoin stays resilient ahead of Fed meeting as investors await policy signals",
      "link": "https://cryptobriefing.com/bitcoin-resilient-ahead-fed-meeting/",
      "summary": "<p>Bitcoin's resilience amid Fed uncertainty highlights its potential as a hedge, but future rate signals could impact broader market liquidity.</p> <p>"
    },
    {
      "title": "Canada’s first XRP spot ETF goes live on Toronto Stock Exchange",
      "link": "https://cryptobriefing.com/canadas-first-xrp-spot-etf/",
      "summary": "<p>The launch of Canada's first XRP spot ETF could accelerate mainstream adoption of digital assets, enhancing financial market innovation.</p> <p>"
    },
    {
      "title": "Iran’s largest crypto exchange appears to have been exploited, suspected Israeli hackers threaten to leak source code and user data",
      "link": "https://cryptobriefing.com/nobitex-cyberattack-iran-exchange/",
      "summary": "<p>The breach highlights vulnerabilities in Iran's financial systems, potentially escalating geopolitical tensions and impacting regional cybersecurity.</p> <p>"
    },
    {
      "title": "US Senate passes GENIUS stablecoin bill, advancing it to the House for final approval",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house/",
      "summary": "<p>US Senate passes the GENIUS stablecoin bill, advancing it to the House for a vote in 3 weeks with rules on backing, audits, and oversight.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin: THIS ratio hints at a possible BTC supply shock – How?",
      "link": "https://ambcrypto.com/bitcoin-this-ratio-hints-at-an-upcoming-btc-supply-shock-how/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-18T130609.677-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin shows rising accumulation and supply tightening, but demand-side metrics point to market fragility."
    },
    {
      "title": "Bitcoin’s price test – Will $98K support hold amid growing caution?",
      "link": "https://ambcrypto.com/bitcoins-price-test-will-98k-support-hold-amid-growing-caution/",
      "summary": "<img alt=\"bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-31.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Support at $98.3K remains firm, even as leveraged money exits the scene."
    },
    {
      "title": "Bitcoin & HYPE set to soar? U.S. firms pour $844 mln into crypto treasuries",
      "link": "https://ambcrypto.com/bitcoin-hype-set-to-soar-u-s-firms-pour-844-mln-into-crypto-treasuries/",
      "summary": "<img alt=\"Bitcoin &amp; HYPE set to soar? U.S. firms pour $844 mln into crypto treasuries\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-4-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whales going aggressively long on BTC and HYPE amid $844M inflow into crypto treasuries."
    },
    {
      "title": "SEC delays Solana ETFs despite 90% approval odds: ‘Timeline unknown’",
      "link": "https://ambcrypto.com/sec-delays-solana-etfs-despite-90-approval-odds-timeline-unknown/",
      "summary": "<img alt=\"SEC delays Solana ETFs despite 90% approval odds: &#039;Timeline unknown&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Solana-ETF-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Market focus has shifted to July or October for a likely U.S spot SOL ETF approval."
    },
    {
      "title": "Iran’s Nobitex crypto exchange hit by $81 mln hack – Israel group claims responsibility",
      "link": "https://ambcrypto.com/irans-nobitex-crypto-exchange-hit-by-81-mln-hack-israel-group-claims-responsibility/",
      "summary": "<img alt=\"Iran&#039;s Nobitex crypto exchange hit by $81 mln hack - Israel group claims responsibility\" class=\"attachment-full size-full wp-post-image\" height=\"659\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Nobitex-Exploited-for-over-80-Million.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1171\" />Another week, another $80 million lost - Are centralized crypto exchanges becoming the weakest link in Web3?"
    }
  ]
}