{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: CryptoQuant Warns of $92K BTC Drop as Analyst Views Diverge",
      "link": "https://www.coindesk.com/markets/2025/06/19/asia-morning-briefing-cryptoquant-warns-of-92k-btc-drop-as-analyst-views-diverge",
      "summary": ""
    },
    {
      "title": "NEAR Protocol Surges 5% as Buyers Dominate Amid Middle East Tensions",
      "link": "https://www.coindesk.com/markets/2025/06/19/near-protocol-surges-5-as-buyers-dominate-amid-middle-east-tensions",
      "summary": ""
    },
    {
      "title": "XRP Tests Key Support as Traders Watch for Breakout Signal",
      "link": "https://www.coindesk.com/markets/2025/06/19/xrp-tests-key-support-as-traders-watch-for-breakout-signal",
      "summary": ""
    },
    {
      "title": "SOL Slips Below $144 Even as Sol Strategies Eyes Nasdaq to Deepen Its Bet",
      "link": "https://www.coindesk.com/markets/2025/06/19/sol-slips-below-usd144-even-as-sol-strategies-eyes-nasdaq-to-deepen-its-bet",
      "summary": ""
    },
    {
      "title": "Elon Musk's X to Offer Investments, Trading 'Soon:' FT",
      "link": "https://www.coindesk.com/business/2025/06/19/elon-musks-x-to-offer-investments-trading-soon-ft",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Arizona Senate revives Bitcoin reserve bill after reconsideration vote",
      "link": "https://cointelegraph.com/news/arizona-senate-revives-bitcoin-reserve-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjQ2MWItMzNmYy03Mjc5LTllODAtMWZlZTgyNmNkMDAx.jpg\" /></p><p>The Arizona Senate has voted to revive House Bill 2324, a Bitcoin reserve bill that initially failed in the House.</p>"
    },
    {
      "title": "North Korea targets crypto workers with new info-stealing malware",
      "link": "https://cointelegraph.com/news/north-korea-targets-crypto-job-seekers-to-plant-password-jacking-malware?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzBjYmEtMWU0Mi03NmRmLWI5YTktZWNiNmI1ZmNiYjhi.jpg\" /></p><p>North Korean threat actors have been deploying malware through fake crypto job sites, targeting blockchain professionals to steal wallet credentials, Cisco Talos says.</p>"
    },
    {
      "title": "Bitcoiners split on $94K or $114K for BTC’s next move as it trades sideways",
      "link": "https://cointelegraph.com/news/bitcoin-predictions-new-highs-100k-retrace-crypto-analyst-poll?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzViYjktYTkxMi03MTdkLWFjMDgtNDVlNzhhNDc2NGU1.jpg\" /></p><p>A recent poll on X shows that half of the respondents bet that Bitcoin would rise to $114,000, while the other half expect it to fall well below $100,000.</p>"
    },
    {
      "title": "Bitcoin sentiment at ‘peak FUD’ with divide between bears and bulls — Santiment",
      "link": "https://cointelegraph.com/news/bitcoin-split-bears-bulls-sentiment-peak-fear-santiment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTNiZjktOGY3NS03YzA4LWE0NDUtMWI2NGI0NjI1YmI1.jpg\" /></p><p>Santiment’s social media analysis found 1 bullish comment for every 1 bearish comment, which hasn’t happened since Donald Trump’s tariffs tanked markets in April.</p>"
    },
    {
      "title": "Semler Scientific plans Bitcoin holdings of 105,000 BTC by 2027",
      "link": "https://cointelegraph.com/news/semler-scientific-plans-105000-bitcoin-by-2027?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjU3NWYtMzk0NS03OWZkLTlhMzItMDk4YmVmNTE3MTU3.jpg\" /></p><p>Health tech firm Semler Scientific wants to boost its Bitcoin holdings from 3,800 BTC to 105,000 BTC by 2027 and has appointed a new director to lead the plan.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Jupiter halts governance voting to tackle burnout and refocus on innovation",
      "link": "https://cryptoslate.com/jupiter-halts-governance-voting-to-tackle-burnout-and-refocus-on-innovation/",
      "summary": "<p>Solana’s largest decentralized exchange aggregator, Jupiter, has decided to halt all community voting through next year and keep its governance Treasury sealed until 2027, citing community burnout and a need to prioritize building new products. The move temporarily disables one of the main utilities for Jupiter’s native token, JUP, which powers governance proposals and decisions [&#8230;]</p> <p>"
    },
    {
      "title": "Circle approaches $50B valuation amid evolving regulatory landscape in the US",
      "link": "https://cryptoslate.com/insights/circles-stock-rally-propels-valuation-to-nearly-50-billion/",
      "summary": "<p>Circle, the issuer of the USD Coin (USDC) stablecoin, is edging closer to a $50 billion valuation after a major rally in its stock price. Since debuting at $31, Circle&#8217;s shares (CRCL) have climbed over 540%, now trading around $200, according to Yahoo Finance. This surge has helped push Circle&#8217;s valuation to approximately $48.4 billion [&#8230;]</p> <p>"
    },
    {
      "title": "Elon Musk’s X accelerates fintech pivot with plans for in-app payments and trading",
      "link": "https://cryptoslate.com/elon-musks-x-accelerates-fintech-pivot-with-plans-for-in-app-payments-and-trading/",
      "summary": "<p>X (formerly known as Twitter) is ramping up efforts to integrate financial services directly into its ecosystem and moving beyond its roots in social networking, the Financial Times reported on June 19. According to the report, the social media giant is preparing to let users carry out a wide range of financial transactions within the [&#8230;]</p> <p>"
    },
    {
      "title": "Trump family cuts stake in World Liberty Financial by 20%",
      "link": "https://cryptoslate.com/trump-family-cuts-stake-in-world-liberty-financial-by-20/",
      "summary": "<p>President Donald Trump&#8217;s family has reduced its stake in World Liberty Financial (WLFI) in the last couple of weeks, Forbes reported on June 20. DT Marks DEFI LLC, the Trump family’s main holding company for the project, has trimmed its ownership from 75% in December 2024 to about 60% by January and further down to [&#8230;]</p> <p>"
    },
    {
      "title": "Tether CEO Paolo Ardoino unveils PearPass as response to record 16 billion password leak",
      "link": "https://cryptoslate.com/tether-ceo-paolo-ardoino-unveils-pearpass-as-response-to-record-16-billion-password-leak/",
      "summary": "<p>Tether CEO Paolo Ardoino announced a new open-source password manager, PearPass, after an unprecedented 16 billion passwords were leaked in what experts now call the largest credential breach ever recorded. Ardoino wrote: “The cloud has failed us. Again. 16 billion passwords just leaked. It’s time to ditch the cloud.&#8221; He pledged that PearPass will work [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Action Tightens — Breakout Looms to The Upside",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-action-tightens-2-20/",
      "summary": "XRP price started a fresh decline below the $2.20 zone. The price is now consolidating losses and might recover if it clears the $2.20 hurdle. XRP price started a fresh decline below the $2.150 zone. The price is now trading below $2.20 and the 100-hourly Simple Moving Average. There is a contracting triangle forming with resistance at $2.170 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start a fresh increase if there is a close above the $2.20 resistance zone. XRP Price Eyes Upside Break XRP price reacted to the downside below the $2.20 support zone, like Bitcoin and Ethereum. The price declined below the $2.180 and $2.150 support levels. The pair tested the $2.120 support A low was formed at $2.120 and the price started to trade in a range. There was a minor recovery wave above the 23.6% Fib retracement level of the downward move from the $2.335 swing high to the $2.120 low. The price is now trading below $2.20 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.170 level. There is also a contracting triangle forming with resistance at $2.170 on the hourly chart of the XRP/USD pair. The first major resistance is near the $2.20 level. The next resistance is $2.2280 or the 50% Fib retracement level of the downward move from the $2.335 swing high to the $2.120 low. A clear move above the $2.2280 resistance might send the price toward the $2.250 resistance. Any more gains might send the price toward the $2.2850 resistance or even $2.320 in the near term. The next major hurdle for the bulls might be $2.350. Another Drop? If XRP fails to clear the $2.20 resistance zone, it could start another decline. Initial support on the downside is near the $2.1450 level. The next major support is near the $2.120 level. If there is a downside break and a close below the $2.120 level, the price might continue to decline toward the $2.050 support. The next major support sits near the $2.00 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.1450 and $2.120. Major Resistance Levels – $2.170 and $2.20."
    },
    {
      "title": "Dogecoin Gears Up For 60% Move—Will It Be Up Or Down?",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-gears-60-move-will-it-be-up-or-down/",
      "summary": "An analyst has explained how Dogecoin could be primed for a 60% price move. Here&#8217;s the range that could end up deciding the direction of the break. Dogecoin Is Nearing The End Of A Triangle Pattern In a new post on X, analyst Ali Martinez has talked about how Dogecoin is currently looking from a technical analysis (TA) perspective. Below is the chart shared by the analyst that shows the trend in the 1-day price of DOGE. As displayed in the graph, the daily Dogecoin price has been trading inside what appears to be a triangular channel. A triangle is a TA pattern that forms whenever an asset&#8217;s price observes consolidation between two converging trendlines. Related Reading: Solana Plunges 13%: Can Key On-Chain Support Stop The Fall? The upper line of the pattern is likely to provide resistance to the price, while the lower one support. A break out of either of the lines can signal a continuation of trend in that direction. There are a few different types of triangles, with a few popular ones being the Symmetrical, Ascending, and Descending variations. The orientation of the trendlines decides the type of the triangle. In a Symmetrical Triangle, the lines converge at a roughly equal and opposite slope. This means that as the price travels inside the pattern, both upward and downward volatility shrinks in an even manner. For the Ascending and Descending versions, however, there is a bias to the upside or downside. In the former, the upper trendline is parallel to the time-axis and the price progressively makes higher lows. Similarly, the latter involves lower highs with a flat support level. From the chart, it&#8217;s apparent that the Triangle that Dogecoin has been moving inside for the past few months is similar to a Symmetrical Triangle, but it has a slight tilt toward the downside. It&#8217;s also visible that DOGE is nearing in on the end of the triangle. Generally, triangle breakouts become more likely to occur as the asset approaches the apex, as the consolidation range squeezes tight in this region. Related Reading: These Altcoins Are Bucking The Trend—But Can They Keep It Up? Considering that Dogecoin may be in this zone now, it&#8217;s possible that its spring may be ready to uncoil. Based on the pattern forming in the daily price, the analyst has noted that DOGE looks primed for a 60% move. As for which way a break would happen, that naturally comes down to which line the memecoin exits the triangle from. &#8221; All you need to do is wait for a daily close outside of the $0.16 to $0.22 range to determine the direction of the trend,&#8221; notes Martinez. DOGE Price At the time of writing, Dogecoin is floating around $0.168, down more than 11% over the last seven days. Featured image from Dall-E, charts from TradingView.com"
    },
    {
      "title": "Ethereum Price Stuck In a Range — Are Bulls Ready to Break Out?",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-stuck-2450/",
      "summary": "Ethereum price started a fresh decline below the $2,600 zone. ETH is now consolidating losses and might attempt to recover above the $2,550 resistance. Ethereum started a fresh decline below the $2,580 level. The price is trading below $2,550 and the 100-hourly Simple Moving Average. There is a rising channel forming with support at $2,490 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it settles above the $2,620 resistance zone in the near term. Ethereum Price Eyes Upside Break Ethereum price started a fresh decline below the $2,600 support level, like Bitcoin. ETH price declined below the $2,550 and $2,540 levels. The bears even pushed the price below the $2,500 level. The pair tested the $2,450 zone and started a consolidation phase. There was a minor move above the $2,520 level. The price climbed above the 23.6% Fib retracement level of the downward move from the $2,680 swing high to the $2,456 low. Ethereum price is now trading below $2,540 and the 100-hourly Simple Moving Average. Besides, there is a rising channel forming with support at $2,490 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,540 level. The next key resistance is near the $2,565 level. It is close to the 50% Fib retracement level of the downward move from the $2,680 swing high to the $2,456 low. The first major resistance is near the $2,620 level. A clear move above the $2,620 resistance might send the price toward the $2,660 resistance. An upside break above the $2,660 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,720 resistance zone or even $2,800 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,565 resistance, it could start a fresh decline. Initial support on the downside is near the $2,490 level. The first major support sits near the $2,455 zone. A clear move below the $2,455 support might push the price toward the $2,360 support. Any more losses might send the price toward the $2,320 support level in the near term. The next key support sits at $2,250. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,455 Major Resistance Level – $2,565"
    },
    {
      "title": "Is Bitcoin Gearing Up for a Breakout? On-Chain Signals Say ‘Watch This Level’",
      "link": "https://www.newsbtc.com/bitcoin-news/is-bitcoin-gearing-up-for-a-breakout-on-chain-signals-say-watch-this-level/",
      "summary": "Bitcoin continues to trade below its recent all-time high as selling pressure and macroeconomic developments keep the asset in consolidation. At the time of writing, BTC is priced at $104,835, down 2.1% over the past week and around 6.3% off from its peak of $111,814 recorded last month. Despite the broader trend, on-chain data reveals emerging patterns that may signal what could come next in the market. Following the Federal Reserve’s decision to keep interest rates unchanged in its latest policy meeting, analysts have noted diverging trends in Bitcoin’s price and derivatives market activity. Related Reading: Bitcoin’s Momentum Wobbles—Analyst Predicts Correction Below $94K Derivatives Deleveraging and Liquidation Clusters Shape Price Structure According to Amr Taha, a contributor on CryptoQuant’s QuickTake platform, BTC has been hovering above the $104,000 support zone, where strong demand appears to be absorbing sell pressure. However, Taha pointed out that open interest on Binance has declined, forming lower lows, a sign that the derivatives market is undergoing progressive deleveraging. Taha’s analysis emphasized a technical divergence: while price has remained relatively stable around the $104,000 level, open interest has been falling. This divergence suggests that traders are reducing leveraged positions, possibly due to market uncertainty or as a response to the Fed’s cautious stance. Notably, the $104K region has emerged as a critical liquidity pocket, with data showing long positions being liquidated massively in this area. The dominance of long-side liquidations, with few short liquidations, reflects a flush-out of recent entrants attempting to ride the previous rally. The analyst argued that this deleveraging phase could pave the way for a price rebound if macro conditions remain favorable. Historically, Bitcoin has responded positively to rate pauses, often resuming upward movement when signs of seller exhaustion appear. The stabilization of open interest, combined with reduced liquidations, might act as a foundation for a new upward push in the near term. Bitcoin Whale Activity on Binance and Shifts in Market Behavior In a separate analysis, another CryptoQuant analyst, Oinonen, highlighted growing whale activity on Binance. Since 2023, the whale ratio metric on the exchange has surged dramatically, climbing from 0.08 in mid-2023 to as high as 0.77 in 2025. This shift marks a 400% increase and indicates significant accumulation behavior among large holders. Whale inflows and retention on Binance have generally coincided with longer-term confidence during periods of market volatility. Related Reading: Bitcoin Channel Break Below $105,000 Sparks Panic, Analysts Predict Further Crashes Moreover, the data shows that during recent episodes of elevated volatility, Binance users have leaned toward holding rather than exiting positions. Inflows to the platform have remained low, particularly from both whales and retail participants, suggesting that market participants are refraining from panic selling and instead are anticipating future price appreciation. Featured image created with DALLE, Chart from TradingView"
    },
    {
      "title": "Bitcoin Price Bottoms Out? Recovery Hopes Rise After Base Formation",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-bottoms-out-103500/",
      "summary": "Bitcoin price started a fresh decline below the $106,000 zone. BTC is now consolidating and might soon aim for a fresh increase above the $105,500 zone. Bitcoin started a fresh decline below the $106,000 zone. The price is trading below $105,500 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance at $104,850 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $103,500 zone. Bitcoin Price Faces Resistance Bitcoin price started a fresh decline below the $107,500 zone. BTC gained pace and dipped below the $106,200 and $106,000 levels. There was a clear move below the $105,000 support level. Finally, the price tested the $103,500 zone. A low was formed at $103,400 and the price started a consolidation phase. It climbed above the 23.6% Fib retracement level of the downward move from the $108,925 swing high to the $103,400 low. However, the bears were active below the $105,000 zone. Bitcoin is now trading below $105,000 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance at $104,850 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $105,000 level. The first key resistance is near the $105,500 level. The next key resistance could be $106,150. It is near the 50% Fib retracement level of the downward move from the $108,925 swing high to the $103,400 low. A close above the $106,150 resistance might send the price further higher. In the stated case, the price could rise and test the $108,000 resistance level. Any more gains might send the price toward the $108,800 level. Another Drop In BTC? If Bitcoin fails to rise above the $105,000 resistance zone, it could start another decline. Immediate support is near the $104,150 level. The first major support is near the $103,500 level. The next support is now near the $102,500 zone. Any more losses might send the price toward the $101,200 support in the near term. The main support sits at $100,000, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $104,150, followed by $103,500. Major Resistance Levels – $105,000 and $106,200."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Semler Scientific Appoints Joe Burnett as Director of Bitcoin Strategy, Targets 105,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/semler-scientific-appoints-joe-burnett-as-director-of-bitcoin-strategy-targets-105000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Semler-Scientific-Appoints-Joe-Burnett-as-Director-of-Bitcoin-Strategy-Targets-105000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/semler-scientific-appoints-joe-burnett-as-director-of-bitcoin-strategy-targets-105000-btc-by-2027\" rel=\"nofollow\"> </a></p> <p>Semler Scientific, the second U.S. publicly traded company to adopt Bitcoin as its primary treasury reserve asset, has appointed Joe Burnett as Director of Bitcoin Strategy while announcing a Bitcoin accumulation plan. The healthcare technology company targets holding 10,000 Bitcoin by year end 2025, 42,000 by 2026, and 105,000 by 2027.&#160; The announcement comes as [&#8230;]</p> <p>"
    },
    {
      "title": "President Donald Trump: America Will Show The World How To Win With Digital Assets Like Never Before",
      "link": "https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/President-Trump-Says-22We-Are-Going-to-Show-the-World-How-to-WIN-with-Digital-Assets-Like-Never-Before22.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before\" rel=\"nofollow\"> </a></p> <p>President Donald Trump posted on Truth Social Tuesday evening regarding recent Senate legislation, stating the U.S. will &#8220;show the World how to WIN with Digital Assets like never before.&#8221;"
    },
    {
      "title": "3 Misconceptions About US Debt",
      "link": "https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FRED-chart.png\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt\" rel=\"nofollow\"> </a></p> <p>This newsletter explores three common misconceptions about U.S. federal debt and deficits.</p> <p>"
    },
    {
      "title": "The Smarter Web Company Acquires £8.1M in Bitcoin For Treasury Holdings",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Smarter-Web-Company-Acquires-8.1M-in-Bitcoin-For-Treasury-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings\" rel=\"nofollow\"> </a></p> <p>The London listed firm now holds 346.63 Bitcoin worth £27.2 million, reinforcing its long-term strategy to integrate Bitcoin into corporate finance through its \"10 Year Plan.\"</p> <p>"
    },
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Arizona Senate Passes Bitcoin Reserve Bill for Seized Crypto, Heads to House For Debate",
      "link": "https://decrypt.co/326175/arizona-senate-passes-bitcoin-reserve-bill-for-seized-crypto-heads-to-house-for-debate",
      "summary": "The bill seeks to establish a state-managed digital asset fund using crypto seized through criminal forfeiture."
    },
    {
      "title": "Massive Data Breach Hits Billions of Logins Across Google, Facebook and GitHub",
      "link": "https://decrypt.co/326163/data-breach-hits-billions-logins-google-facebook-github",
      "summary": "A data breach including over 16 billion passwords has sent a shockwave through the tech world as users scramble to protect themselves."
    },
    {
      "title": "Hyperliquid Token Hits 10-Day Low Following Recent Record High",
      "link": "https://decrypt.co/326147/hyperliquid-token-hits-10-day-low-following-recent-record-high",
      "summary": "Analysts told that the dip may represent a reaction to recent corporate treasury buy-ins and a decline in trading volume."
    },
    {
      "title": "Telegram Boss Pavel Durov Temporarily Permitted to Leave France: Report",
      "link": "https://decrypt.co/326141/telegram-boss-pavel-durov-permitted-travel-to-dubai",
      "summary": "The crypto-friendly app's boss was arrested in France last year and is under investigation."
    },
    {
      "title": "AI Infrastructure Firm Gradient Bags $10 Million to Develop Protocols on Solana",
      "link": "https://decrypt.co/326140/ai-infrastructure-firm-gradient-bags-10-million-to-develop-protocols-on-solana",
      "summary": "Pantera and Multicoin Capital lead the funding for startup creating peer-to-peer protocols Lattica and Parallax, aiming to distribute AI computing across everyday devices."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Arizona revives Bitcoin reserve bill and passes it in Senate",
      "link": "https://cryptobriefing.com/arizona-bitcoin-reserve-fund-bill/",
      "summary": "<p>Arizona's legislative actions on digital assets could set a precedent for integrating cryptocurrencies into state financial systems, despite political challenges.</p> <p>"
    },
    {
      "title": "Trump-affiliated company cuts stake in World Liberty Financial to 40%",
      "link": "https://cryptobriefing.com/world-liberty-stake-reduction/",
      "summary": "<p>The reduced stake may signal a strategic shift in investment focus, potentially impacting the company's influence in the crypto sector.</p> <p>"
    },
    {
      "title": "Seamless Protocol launches plug and play Leverage Tokens as ERC-20 assets on Base",
      "link": "https://cryptobriefing.com/launch-leveraged-defi-tokens/",
      "summary": "<p> Seamless Protocol debuts Leverage Tokens on Base, packaging passive DeFi strategies into tradable ERC-20s for one-click exposure.</p> <p>"
    },
    {
      "title": "Only 30% of crypto miners comply with Russia’s new rules, finance ministry official says",
      "link": "https://cryptobriefing.com/crypto-mining-compliance-russia/",
      "summary": "<p>The low compliance rate among crypto miners in Russia highlights challenges in enforcing regulations, potentially impacting energy policies and economic oversight.</p> <p>"
    },
    {
      "title": "Elon Musk’s X will soon launch investment and trading features as part of ‘everything app’ vision",
      "link": "https://cryptobriefing.com/financial-services-expansion-elon-musk-x/",
      "summary": "<p>Musk's X expansion into finance could redefine digital ecosystems, merging social media with financial services, impacting user engagement.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Tron: $0.30 in sight for TRX, but only if bulls clear THIS level",
      "link": "https://ambcrypto.com/tron-0-30-in-sight-for-trx-but-only-if-bulls-clear-this-level/",
      "summary": "<img alt=\"Tron\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-19T121527.815-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TRX defends $0.27 support as whales accumulate and address activity rebounds."
    },
    {
      "title": "‘Cardano may be about to outperform Bitcoin’ – The case for ADA’s bull run",
      "link": "https://ambcrypto.com/cardano-may-be-about-to-outperform-bitcoin-the-case-for-adas-bull-run/",
      "summary": "<img alt=\"&#039;Cardano may be about to outperform Bitcoin,&#039; - The case for ADA&#039;s bull run\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-37.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A rare reversal signal stirs altcoin optimism, but history urges a cautious approach."
    },
    {
      "title": "Ethereum whale stakes $18M at a loss, but retail is dumping! – Who’s right?",
      "link": "https://ambcrypto.com/ethereum-whale-stakes-18m-at-a-loss-but-retail-is-dumping-whos-right/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-30.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A dormant Ethereum whale wakes up to stake 7,182 ETH worth $18.08 million"
    },
    {
      "title": "What is JPMorgan’s JPMD deposit token, and could it replace stablecoins?",
      "link": "https://ambcrypto.com/what-is-jp-morgans-jpmd-deposit-token-and-could-it-replace-stablecoins/",
      "summary": "<img alt=\"JP Morgan’s JPMD Deposit Token\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/JPMorgans-JPMD-Deposit-Token.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />JPMorgan to launch JPMD to bridge traditional banking and blockchain—challenging stablecoin giants USDT and USDC."
    },
    {
      "title": "Polkadot hits KEY support – Assessing the odds of DOT’s bullish reversal",
      "link": "https://ambcrypto.com/will-polkadot-dot-dump-below-3-50/",
      "summary": "<img alt=\"Polkadot (DOT): &quot;Accumulation ENDS,&quot; experts warn – Will $3.50 hold?\" class=\"attachment-full size-full wp-post-image\" height=\"900\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan_20250619_194730_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1600\" />DOT’s teetering at $3.50—will whales ride it to $30 or let it fall through the floor?"
    }
  ]
}