{
  "CoinDesk": [
    {
      "title": "Eric Trump to Headline BTC Asia in August",
      "link": "https://www.coindesk.com/markets/2025/07/08/eric-trump-to-headline-btc-asia-in-august",
      "summary": ""
    },
    {
      "title": "Crypto Traders Shrug Off Dormant Bitcoin Whale Moves, With Profit-Taking on XRP, DOGE, SOL",
      "link": "https://www.coindesk.com/markets/2025/07/08/crypto-traders-shrug-off-dormant-bitcoin-whale-moves-with-profit-taking-on-xrp-doge-sol",
      "summary": ""
    },
    {
      "title": "XRP Builds Strength Above $2.26 With $2.38 in Sight. Next Leg Incoming?",
      "link": "https://www.coindesk.com/markets/2025/07/08/xrp-builds-strength-above-226-with-238-in-sight-next-leg-incoming",
      "summary": ""
    },
    {
      "title": "Bitcoin Traders Chase $130K Bets in Anticipation of Renewed Bullish Volatility",
      "link": "https://www.coindesk.com/markets/2025/07/08/bitcoin-traders-chase-usd130k-bets-in-anticipation-of-renewed-bullish-volatility",
      "summary": ""
    },
    {
      "title": "Dubai Sets RWA Milestone With First Approval of Tokenized Money Market Fund",
      "link": "https://www.coindesk.com/policy/2025/07/08/dubai-sets-rwa-milestone-with-first-approval-of-tokenized-money-market-fund",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "How Vietnam is using crypto to fix its FATF reputation",
      "link": "https://cointelegraph.com/news/how-vietnam-is-using-crypto-to-fix-its-fatf-reputation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2UzZTQtMjdlZC03NWYwLTg1MmQtM2VhNzk3NzRmZGJk.jpg\" /></p><p>Vietnam is leveraging crypto regulation to meet FATF standards, combat digital asset fraud and rebuild its international financial reputation.</p>"
    },
    {
      "title": "Bitcoin miner BitFuFu mines 445 BTC for its biggest production month",
      "link": "https://cointelegraph.com/news/bitfufu-record-bitcoin-mining-june-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGYzMzYtMWNlZi03ZDI2LTllNTItNzY3YjhjNTA0ODJi.jpg\" /></p><p>Bitcoin miners had a mixed bag in June, with Australian-based miner IREN reporting a record-breaking month for revenues, but lower Bitcoin production.</p>"
    },
    {
      "title": "Bots behind most tokens on Pump.fun and LetsBonk: Coinbase exec",
      "link": "https://cointelegraph.com/news/pumpfun-letsbonk-top-creators-are-bots-coinbase-exec?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjVjZGQtYmI1OC03ZDI2LThmZmUtNGY2NTZiYTYwZjE3.jpg\" /></p><p>Bots are likely behind most of the memecoins launched on Pump.fun and LetsBonk, according to Coinbase's head of product, Conor Grogan.</p>"
    },
    {
      "title": "BlackRock iShares Bitcoin ETF surpasses 700K Bitcoin",
      "link": "https://cointelegraph.com/news/blackrock-ishares-bitcoin-etf-surpasses-700k-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzI0YmEtMDM0Ny03MTAzLWFjY2EtYjY2M2M1NWQ3ZjM3.jpg\" /></p><p>BlackRock’s iShares Bitcoin ETF now holds 55% of the total Bitcoin held across all US spot Bitcoin ETFs.</p>"
    },
    {
      "title": "Vitalik Buterin advocates ‘copyleft’ licensing in crypto",
      "link": "https://cointelegraph.com/news/vitalik-buterin-advocates-copyleft-licenses-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTIzNWEtMDEyYi03MmZiLWE5ZTQtODg1ZTJhYjNkOTMz.jpg\" /></p><p>Ethereum co-founder Vitalik Buterin now backs open-source licenses, arguing they better promote open innovation as crypto becomes more “competitive and mercenary.”</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Solana’s tokenized stock market more than triples in two weeks to hit $48M",
      "link": "https://cryptoslate.com/solanas-tokenized-stock-market-more-than-triples-in-two-weeks-to-hit-48m/",
      "summary": "<p>Solana’s tokenized stock market hit $48.53 million on July 4, up more than threefold from $15.28 million on June 20, according to on-chain data tracked by rwa.xyz. Solana’s tokenized stocks capitalization expanded more than threefold in two weeks, outpacing every other tracked network during the period. Furthermore, the tokenized stock market on Solana represented 11.4% [&#8230;]</p> <p>"
    },
    {
      "title": "EU regulators probing Robinhood’s tokenized equity plans after OpenAI raises concerns",
      "link": "https://cryptoslate.com/eu-regulators-probing-robinhoods-tokenized-equity-plans-after-openai-raises-concerns/",
      "summary": "<p>Robinhood’s private equity tokens, offering exposure to tech stocks like SpaceX and OpenAI, have triggered regulatory scrutiny in Europe after OpenAI raised concerns and said that the digital assets do not represent equity ownership in the company, CNBC reported on July 7. The Bank of Lithuania, which serves as Robinhood’s primary regulator in the European [&#8230;]</p> <p>"
    },
    {
      "title": "Cloudflare’s bot paywall could ignite a tokenized content gold rush",
      "link": "https://cryptoslate.com/cloudflares-bot-paywall-could-ignite-a-tokenized-content-gold-rush/",
      "summary": "<p>The following is a guest post and opinion from Ahmad Shadid, CEO at O.XYZ. For years, a broken value exchange has defined the web. AI companies, racing to build powerful models, deployed bots to scrape a vast internet of content without permission or compensation. This practice of harvesting news, art, and data undermined the creators [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin remains stuck in $100k-$110k band as retail and whales enter potential standoff",
      "link": "https://cryptoslate.com/bitcoin-remains-stuck-in-100k-110k-band-as-retail-and-whales-enter-potential-standoff/",
      "summary": "<p>Bitcoin (BTC) continued to trade between $100,000 and $110,500 for a second consecutive week as smaller investors replaced whales on the buy side, Bitfinex Alpha reported on July 7. The report noted that BTC spent most of July so far within a 10% channel, capped by the January high of $109,590 and floored near the [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum co-founder Vitalik Buterin advocates copyleft to counter tech monopolies",
      "link": "https://cryptoslate.com/ethereum-co-founder-vitalik-buterin-advocates-copyleft-to-counter-tech-monopolies/",
      "summary": "<p>Ethereum co-founder Vitalik Buterin said he is rethinking his long-held preference for permissive software licenses, advocating for broader use of &#8220;copyleft&#8221; frameworks as open source enters what he described as a more competitive and concentrated era. In a blog post published on July 7, Buterin explained that permissive licenses such as MIT or CC0 have [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Back In ‘Retesting Phase’ After Key Level Reclaim – The Calm Before The Storm?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-back-in-retesting-phase-after-key-level-reclaim-the-calm-before-the-storm/",
      "summary": "After achieving its highest weekly close to date, Bitcoin (BTC) is now attempting to confirm two crucial levels as support before continuing its rally to new highs. Some analysts have suggested that the cryptocurrency may be experiencing a “calm before the storm” phase. Related Reading: Brazil’s Central Bank Hacked—$40M In Crypto Washed In Aftermath Bitcoin Set For Key Support Confirmations Bitcoin managed to close above two crucial levels over the past few days, recording its highest weekly close in history. Last week, the flagship crypto positioned itself for a reclaim of its final major weekly resistance around $109,000 after nearing this area for four days. On Sunday, BTC surged above the key barrier and closed the week around the $109,200 mark, also successfully confirming its diagonal daily trendline as support. Now, the cryptocurrency is retesting the final resistance to confirm the breakout. Rekt Capital affirmed that the goal is to turn this resistance into support, as it could push BTC to new all-time highs (ATH). He explained that “given how price barely Weekly Closed above the final Weekly resistance, it offers very little chance for price to cleanly retest this level into support; that is, this retest is likely going to be a volatile one.” Nonetheless, the analyst noted that the cryptocurrency has significant High Timeframe (HTF) support beneath it that “should act as a demand area to springboard price into Price Discovery Uptrend 2 over time.” Notably, Bitcoin reclaimed and held the high zone of its re-accumulation range, around the $104,400 mark, as support over the past two weeks. Meanwhile, June Monthly Closed above the $102,464 level and retested it post-breakout “to enable this current July upside candle,” setting it as a monthly support. Additionally, the $107,244 level also emerged as a crucial area after last month’s close, driving BTC “back to its retesting phase.” BTC To Breakout After The Summer? Rekt Capital considers BTC’s current phase as “the calm before the storm,” adding that “for as long as"
    },
    {
      "title": "Dogecoin Resistance Walls Ahead: Analyst Flags 3 Key Levels",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-resistance-walls-analyst-flags-3-key/",
      "summary": "An analyst has pointed out three key resistance levels for Dogecoin that could be to keep an eye on, based on on-chain data. Dogecoin URPD Shows These Price Levels Stand Out In a new post on X, analyst Ali Martinez has shared DOGE levels that could be important resistance boundaries. The levels in question correspond to major supply walls on the Dogecoin UTXO Realized Price Distribution (URPD). The URPD is an on-chain indicator from the analytics firm Glassnode that tells us about the total amount of the memecoin&#8217;s supply that was last purchased at the different price levels that it has visited over history. Related Reading: Bitcoin In For Another 460% Run? This Rare Fiat Signal Just Returned Now, here is the chart posted by Martinez that shows how the URPD looks for Dogecoin right now: As displayed in the above graph, the level closest to the latest Dogecoin spot price that stands out in terms of the URPD is $0.18. The investors last purchased around 8.94% of the asset&#8217;s supply around this mark. Naturally, as the level is above the spot price, all of these holders would be in the red at the moment. Generally, investors in loss look forward to retests of their break-even mark so that they can get their money &#8216;back.&#8217; Often, these holders push for the exit as soon as this happens, fearing that the price would go back down again in the near future. As such, whenever the price retests the cost basis of a notable part of the supply from below, a significant selling reaction can sometimes appear in the market. This can provide resistance to the cryptocurrency. Considering that the $0.18 level is particularly large, it can act as a point of notable resistance. Similarly, the analyst has also flagged two other levels: $0.21 (7.24% of supply) and $0.36 (3.82% of supply). Interestingly, between these two, there aren&#8217;t any significant supply walls, meaning that if Dogecoin can get into this zone, it may, at least in theory, have an easier time climbing up. In the scenario that DOGE gets rejected at the resistance, however, it may have to find support at the in-profit supply zones. Holders belonging to these levels can react to declines to their cost basis by buying more, as they may believe the drawdown to be just a dip-buying opportunity. Related Reading: Shiba Inu Supply Most Centralized Among Top Coins—62% Held By Just 10 Whales The only level below the current Dogecoin spot price that stands out in terms of supply is all the way down at $0.07. It hosts the acquisition mark of 20.03% of the memecoin&#8217;s supply, which means that it&#8217;s massive in size, and so, could be a strong support center. DOGE Price At the time of writing, Dogecoin is floating around $0.168, up 1.6% in the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "BNB Price Gears Up for Upside Break — Will Bulls Deliver?",
      "link": "https://www.newsbtc.com/analysis/bnb/bnb-price-gears-up-665/",
      "summary": "BNB price is gaining pace above the $650 support zone. The price is now showing positive signs and might aim for more gains in the near term. BNB price is attempting to recover from the $620 support zone. The price is now trading above $655 and the 100-hourly simple moving average. There is a key contracting triangle forming with resistance at $662 on the hourly chart of the BNB/USD pair (data source from Binance). The pair must stay above the $655 level to start another increase in the near term. BNB Price Eyes More Gains After forming a base above the $620 level, BNB price started a fresh increase. There was a move above the $645 and $650 resistance levels, like Ethereum and Bitcoin. The price even surged above the $660 level. A high was formed at $666 before there was a downside correction. The price dipped below the 50% Fib retracement level of the upward move from the $650 swing low to the $666 swing high. The price is now trading above $655 and the 100-hourly simple moving average. On the upside, the price could face resistance near the $662 level. There is also a key contracting triangle forming with resistance at $662 on the hourly chart of the BNB/USD pair. The next resistance sits near the $665 level. A clear move above the $665 zone could send the price higher. In the stated case, BNB price could test $672. A close above the $672 resistance might set the pace for a larger move toward the $680 resistance. Any more gains might call for a test of the $700 level in the near term. Another Decline? If BNB fails to clear the $662 resistance, it could start another decline. Initial support on the downside is near the $655 level and the 61.8% Fib retracement level of the upward move from the $650 swing low to the $666 swing high. The next major support is near the $650 level. The main support sits at $644. If there is a downside break below the $644 support, the price could drop toward the $632 support. Any more losses could initiate a larger decline toward the $620 level. Technical Indicators Hourly MACD – The MACD for BNB/USD is gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BNB/USD is currently above the 50 level. Major Support Levels – $655 and $650. Major Resistance Levels – $662 and $665."
    },
    {
      "title": "XRP Price Pops and Drops — Can Bulls Regain Control?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-pops-and-drops-2-25/",
      "summary": "XRP price started a strong upward move above the $2.250 zone and tested $2.35. The price is now correcting gains below the $2.30 level. XRP price started a fresh increase above the $2.250 zone. The price is now trading above $2.250 and the 100-hourly Simple Moving Average. There was a break below a bullish trend line with support at $2.2650 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above the $2.240 zone. XRP Price Fails To Retains Gains XRP price started a fresh increase after it settled above the $2.250 level, beating Bitcoin and Ethereum. The price was able to climb above the $2.2850 resistance level. The bulls were able to push the price above the $2.30 level. However, the bears remained active near the $2.350 zone. The price faced rejection and started a fresh decline. It declined below the 50% Fib retracement level of the upward move from the $2.205 swing low to the $2.353 high. Besides, there was a break below a bullish trend line with support at $2.2650 on the hourly chart of the XRP/USD pair. The price is now trading above $2.250 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.280 level. The first major resistance is near the $2.2880 level. A clear move above the $2.2880 resistance might send the price toward the $2.320 resistance. Any more gains might send the price toward the $2.350 resistance or even $2.3650 in the near term. The next major hurdle for the bulls might be $2.40. More Losses? If XRP fails to clear the $2.2880 resistance zone, it could start another decline. Initial support on the downside is near the $2.250 level. The next major support is near the $2.240 level and the 76.4% Fib retracement level of the upward move from the $2.205 swing low to the $2.353 high. If there is a downside break and a close below the $2.240 level, the price might continue to decline toward the $2.220 support. The next major support sits near the $2.20 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.250 and $2.240. Major Resistance Levels – $2.2880 and $2.320."
    },
    {
      "title": "Bitcoin Traders Are Betting Against the Rally, Will It Backfire?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-traders-are-betting-against-the-rally-will-it-backfire/",
      "summary": "Bitcoin has continued to trade within a tight range just below its previous all-time high, showing recent signs of upward movement but falling short of reclaiming its peak price. The asset recorded a seven-day high of $110,307, but it has since cooled, with current trading levels around $108,311, representing a slight 0.3% drop over the last 24 hours. While the broader market maintains cautious optimism, several indicators suggest that market participants remain split on where Bitcoin is headed next. Related Reading: Are Bitcoin Retail Traders Back In The Market? On-Chain Data Suggests So Bitcoin Shorts Increase on Binance Despite Price Climb Despite the price strength seen in recent days, certain signals hint at increasing friction between bullish price action and bearish positioning from traders. According to a recent analysis by CryptoQuant contributor BorisVest, Bitcoin’s rise is being met with a counterintuitive decline in funding rates on Binance, the largest crypto exchange by volume. This trend could play a crucial role in shaping short-term market behavior. BorisVest noted that as Bitcoin consolidates within the $100,000 to $110,000 range, funding rates on Binance have gradually declined. This suggests that a significant number of traders are taking short positions—essentially betting that Bitcoin’s rally will soon reverse. The analyst explained that this behavior indicates skepticism about the sustainability of the recent price gains, particularly among retail and leverage-focused traders. “The declining funding rates show that users on Binance are increasingly shorting Bitcoin,” he explained. “This dynamic often creates forced exits as short positions come under pressure, leading to liquidations or forced margin increases. These events can further propel upward price movement as positions get closed out automatically.” Given Binance’s dominance in trading volume, BorisVest emphasized that its funding rate trend serves as a strong proxy for overall market sentiment. If current positioning continues, the market may see a short squeeze, which could accelerate Bitcoin’s momentum toward new highs. On-Chain Metric Flags Caution as NVT Golden Cross Edges Higher While futures market dynamics are drawing attention, on-chain data is also showing signs worth monitoring. Another CryptoQuant analyst, Burak Kesmeci, highlighted the movement of Bitcoin’s NVT Golden Cross metric, a tool used to assess market value in relation to on-chain transaction volume. This metric has historically signaled local tops when it moves above specific thresholds. In his analysis, Kesmeci pointed out that the NVT Golden Cross successfully identified three prior short-term peaks in 2025, each followed by corrections ranging from 9% to over 20%. Related Reading: Bitcoin Exchange Outflows Continue To Rise: Investor Confidence At An All-Time High? The metric currently sits at 1.98, below the 2.2 threshold that has often indicated overheated market conditions, but is trending upward. “While the current level isn’t yet in the danger zone,” Kesmeci wrote, “its upward trajectory could be an early warning that price momentum is beginning to overextend.” However, the analyst cautioned against interpreting the signal as immediately bearish. In previous cases, the NVT Golden Cross remained elevated for several days before a correction followed. This behavior may instead point to continued strength among bulls, at least in the medium term, even if a near-term pullback remains possible. Featured image created with DALL-E, Chart form TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "U.S. Court Brings Coin Center’s Tornado Cash Appeal To A Close",
      "link": "https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Tornado-Cash-Trial.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close\" rel=\"nofollow\"> </a></p> <p>Coin Center’s appeal to the U.S. Treasury Department’s Office of Foreign Asset Control (OFAC) regarding Tornado Cash is now over.</p> <p>"
    },
    {
      "title": "CleanSpark Announces Mining 685 Bitcoin Worth Over $74 Million In June",
      "link": "https://bitcoinmagazine.com/news/cleanspark-announces-mining-685-bitcoin-worth-over-74-million-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/CleanSpark-Announces-Bitcoin-Mining-Results-From-June-2025.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/cleanspark-announces-mining-685-bitcoin-worth-over-74-million-in-june\" rel=\"nofollow\"> </a></p> <p>CleanSpark mined 685 bitcoin in June, sold 578 BTC for over $61 million, and became the first miner to reach 50 EH/s using fully self-operated infrastructure.</p> <p>"
    },
    {
      "title": "Nakiki SE to Become First German Public Company With ‘Pure’ Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/nakiki-se-to-become-first-german-public-company-with-pure-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Nakiki-SE-to-Become-First-German-Public-Company-With-‘Pure-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/nakiki-se-to-become-first-german-public-company-with-pure-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>German listed company plans to become the nation’s first public firm with a pure Bitcoin treasury.</p> <p>"
    },
    {
      "title": "Trustodial: An Ontological Dilemma",
      "link": "https://bitcoinmagazine.com/technical/trustodial-an-ontological-dilemma",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Trustodial.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/trustodial-an-ontological-dilemma\" rel=\"nofollow\"> </a></p> <p>\"Trustodial\" systems like statechains introduce a dilemma in terms of what constitutes self custodial.</p> <p>"
    },
    {
      "title": "Semler Scientific Acquires 187 More Bitcoin, Surpassing 4,600 BTC in Holdings",
      "link": "https://bitcoinmagazine.com/news/semler-scientific-acquires-187-more-bitcoin-surpassing-4600-btc-in-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Semler-Scientific.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/semler-scientific-acquires-187-more-bitcoin-surpassing-4600-btc-in-holdings\" rel=\"nofollow\"> </a></p> <p>Semler Scientific has purchased an additional 187 Bitcoin for approximately $20 million, according to a new SEC filing. The acquisition brings the firm’s total Bitcoin holdings to 4,636 BTC, worth about $502 million at current market prices. The company disclosed the purchases were made between June 4 and July 2 at an average price of [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "DigitalX Taps Animoca’s Yat Siu, Raises $13.5M to Buy Bitcoin",
      "link": "https://decrypt.co/329044/digitalx-animoca-yat-siu-buy-bitcoin",
      "summary": "Roughly $12.8 million will go toward Bitcoin purchases, with the remainder slated for operating expenses and working capital."
    },
    {
      "title": "Apple’s Top AI Exec Leaves For Meta Amid Aggressive Hiring Trend",
      "link": "https://decrypt.co/329041/apple-top-ai-exec-leaves-metas-superintelligence-lab",
      "summary": "The executive's departure signals intensifying competition for elite talent and deepens concerns over Apple's generative AI strategy."
    },
    {
      "title": "Shenzhen Warns of Stablecoin Scams as Neighboring Hong Kong Pushes Ahead",
      "link": "https://decrypt.co/329038/shenzhen-warns-stablecoin-scams-neighboring-hong-kong",
      "summary": "Mainland officials have urged public caution amid a rise in crypto fraud as Hong Kong prepares to roll out rules for stablecoin issuers."
    },
    {
      "title": "US Politician’s Tweet Revives Cultural Debate Over UAPs",
      "link": "https://decrypt.co/329029/us-politicians-tweet-revives-cultural-debate-uaps",
      "summary": "A viral post has reignited debate over whether some UFO sightings may reflect ancient religious imagery rather than extraterrestrial life."
    },
    {
      "title": "Here's How All Major AI Platforms Stacked Up in a Harry Potter Sorting Hat Quiz",
      "link": "https://decrypt.co/328949/ai",
      "summary": "A developer tested 17 language models and discovered they're overwhelmingly associated with the Ravenclaw team, with one notable exception."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Ripple CEO Brad Garlinghouse to testify before US Senate Banking Committee on crypto legislation",
      "link": "https://cryptobriefing.com/crypto-market-legislation-senate-hearing/",
      "summary": "<p>Garlinghouse's testimony could accelerate US crypto regulation, potentially fostering innovation and consumer protection in digital markets.</p> <p>"
    },
    {
      "title": "SEC pushes Solana ETF issuers to refile by end of July, signals fast-track approval path",
      "link": "https://cryptobriefing.com/solana-etf-approval-sec-fast-track/",
      "summary": "<p>The SEC's expedited process for Solana ETFs could accelerate mainstream crypto adoption and diversify investment options in the US market.</p> <p>"
    },
    {
      "title": "US govt moves $200K in Ethereum to Coinbase after test transaction",
      "link": "https://cryptobriefing.com/us-government-ethereum-wallet-test-deposit-coinbase-prime/",
      "summary": "<p>The US government's Ethereum transaction hints at potential future asset management strategies, impacting market perceptions and crypto policies.</p> <p>"
    },
    {
      "title": "US government abandons Tornado Cash appeal after policy reversal",
      "link": "https://cryptobriefing.com/tornado-cash-sanctions-reversal/",
      "summary": "<p>The US government's policy reversal on Tornado Cash may influence future regulatory approaches to crypto technologies and international software.</p> <p>"
    },
    {
      "title": "Plume Network brings real-world yield to TRON’s global payment ecosystem via SkyLink integration",
      "link": "https://cryptobriefing.com/real-world-yield-tron-plume/",
      "summary": "<p>Plume Network integrates SkyLink with TRON, enabling users global access to real-world yield from asset-backed financial products.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Hong Kong to launch stablecoin licensing in August 2025 – Details",
      "link": "https://ambcrypto.com/hong-kong-to-launch-stablecoin-licensing-in-august-2025-details/",
      "summary": "<img alt=\"Hong Kong stablecoins\" class=\"attachment-full size-full wp-post-image\" height=\"561\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Hong-Kong-stablecoins.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"998\" />With the U.S. racing ahead, can Hong Kong’s cautious stablecoin rollout really compete on a global stage?"
    },
    {
      "title": "Bitcoin Rainbow chart’s latest forecast – Is a bull run to $200K coming up in 2025?",
      "link": "https://ambcrypto.com/bitcoin-rainbow-charts-latest-forecast-is-a-bull-run-to-200k-coming-up-in-2025/",
      "summary": "<img alt=\"Bitcoin Rainbow chart&#039;s latest forecast - Is a bull run to $200K coming up in 2025?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-Rainbow-Chart-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />If the Bitcoin Rainbow Chart and the Pi Cycle Top Indicator prove reliable once again, we could see higher prices."
    },
    {
      "title": "Bitcoin’s first $109K weekly close stirs breakout talk – Here’s what happens now!",
      "link": "https://ambcrypto.com/bitcoins-first-109k-weekly-close-stirs-breakout-talk-heres-what-happens-now/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250707_142701_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can BTC flip $110K resistance after soaking up $107K liquidity?"
    },
    {
      "title": "WazirX faces legal battle after users accuse exchange of freezing crypto, fiat balances",
      "link": "https://ambcrypto.com/wazirx-faces-legal-battle-after-users-accuse-exchange-of-freezing-crypto-fiat-balances/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"939\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Users-sue-WazirX.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1670\" />The next key hearing is set for 15 July 2025 - Here's what to expect..."
    },
    {
      "title": "Story [IP] gains over 10% amid liquidity surge, but is a reversal here?",
      "link": "https://ambcrypto.com/ip-gains-over-10-amid-liquidity-surge-a-reversal-seems-close-heres-why/",
      "summary": "<img alt=\"IP gains over 10% amid liquidity surge: A reversal seems close - Here&#039;s why\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />IP sees significant gains, but market coalition pushes back."
    }
  ]
}