{
  "CoinDesk": [
    {
      "title": "Suspect in French Crypto Kidnappings Arrested in Morocco",
      "link": "https://www.coindesk.com/policy/2025/06/04/suspect-in-french-crypto-kidnappings-arrested-in-morocco",
      "summary": ""
    },
    {
      "title": "Circle Prices IPO at $31 Per Share, Valuing Stablecoin Issuer at $6.9 Billion",
      "link": "https://www.coindesk.com/markets/2025/06/04/circle-debuts-on-nyse-at-31-per-share-valuing-stablecoin-issuer-at-62-billion",
      "summary": ""
    },
    {
      "title": "Vitalik Buterin Uses Privacy Tool Railgun Again, Signaling Ongoing Embrace of On-Chain Anonymity",
      "link": "https://www.coindesk.com/tech/2025/06/04/vitalik-buterin-uses-privacy-tool-railgun-again-signaling-ongoing-embrace-of-on-chain-anonymity",
      "summary": ""
    },
    {
      "title": "The Protocol: Berachain Follows Ethereum’s Pectra Upgrade With ‘Bectra’",
      "link": "https://www.coindesk.com/tech/2025/06/04/the-protocol-berachain-follows-ethereum-s-pectra-upgrade-with-bectra",
      "summary": ""
    },
    {
      "title": "Trio of Soft Economic Reports Boost Fed Rate Cut Odds, but What About Bitcoin?",
      "link": "https://www.coindesk.com/markets/2025/06/04/trio-of-soft-economic-reports-boost-fed-rate-cut-odds-but-what-about-bitcoin",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Ethereum Foundation says next 18 months ‘pivotal’ amid new treasury policy",
      "link": "https://cointelegraph.com/news/ethereum-foundation-new-treasury-policy-18-months-pivotal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNkMDMtNTE5ZC03ZDk0LTljMmYtZWFmYjgyZWMzZDZl.jpg\" /></p><p>The Foundation backing the Ethereum blockchain has laid out a new treasury policy to ensure it allocates resources efficiently while supporting its DeFi ecosystem.</p>"
    },
    {
      "title": "Stablecoin giant Circle again boosts IPO to $1.05 billion",
      "link": "https://cointelegraph.com/news/stablecoin-issuer-circle-upsize-ipo-1-billion?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNkMzEtNmNlOS03ODViLTljNmYtZmZmYmJhOWEwZTAz.jpg\" /></p><p>USDC issuer Circle has again upsized its initial public offering above the marketed range, selling 34 million shares at $31 each.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Trump’s crypto ties cloud digital assets legislation in Congress",
      "link": "https://cointelegraph.com/news/trump-crypto-ties-cloud-digital-assets-legislation-congress?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDZhNWMtZGYzMS03MzA4LTkzZjUtNzJmYjY2MmMwMTM0.jpg\" /></p><p>Members in two House committee hearings debated a framework for digital assets while raising concerns about the US president using his position to profit from the industry.</p>"
    },
    {
      "title": "JPMorgan to accept crypto ETFs as collateral for loans — Report",
      "link": "https://cointelegraph.com/news/jpmorgan-accept-crypto-etfs-collateral-loans-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNjOTItOTJmZC03MjJjLWFhZmUtNDgxOTY5MTc3M2Jh.jpg\" /></p><p>In some cases, the bank will look at crypto holdings when determining net worth, which may affect how much can be borrowed.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Moroccan police arrests suspect behind recent crypto-related kidnappings in France",
      "link": "https://cryptoslate.com/moroccan-police-arrests-suspect-behind-recent-crypto-related-kidnappings-in-france/",
      "summary": "<p>Moroccan police have arrested a dual-national French-Moroccan man wanted for an alleged connection with a series of kidnappings in France that targetted individuals with crypto holdings, Reuters reported on June 4, citing a source familiar with the case. According to the source, Moroccan police identified the man as Bajjou Badiss Mohamed AmiDe, who is 24 [&#8230;]</p> <p>"
    },
    {
      "title": "Systemic risk on the rise as leverage interdependencies tighten between CeFi, DeFi and crypto treasuries",
      "link": "https://cryptoslate.com/systemic-risk-on-the-rise-as-leverage-interdependencies-tighten-between-cefi-defi-and-crypto-treasuries/",
      "summary": "<p>Interconnections between centralized and decentralized crypto lending are heightening systemic risk, Galaxy Digital&#8217;s research arm said in a June 4 report on first-quarter borrowing data. The report estimated that as of March 31, over $39 billion in crypto-collateralized debt was outstanding across decentralized lending apps, centralized lenders, and crypto-backed stablecoin issuers. DeFi protocols accounted for [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation unveils comprehensive treasury plan to balance capital and privacy commitments",
      "link": "https://cryptoslate.com/ethereum-foundation-unveils-comprehensive-treasury-plan-to-balance-capital-and-privacy-commitments/",
      "summary": "<p>Ethereum Foundation has released a sweeping update to its treasury management strategy, signaling a more mature, structured approach to capital allocation amid ETH&#8217;s growing global influence and rising institutional scrutiny. The new framework, published on June 4, outlines how the foundation will manage reserves, deploy capital in DeFi protocols, and assess privacy standards, while maintaining [&#8230;]</p> <p>"
    },
    {
      "title": "Brazil’s central bank plans to use CBDC data to guide interest rate decisions",
      "link": "https://cryptoslate.com/brazils-central-bank-plans-to-use-cbdc-data-to-guide-interest-rate-decisions/",
      "summary": "<p>Brazil’s Central Bank plans to treat transaction data from its central bank digital currency (CBDC) infrastructure, called Drex, as a direct input for setting the country’s interest rate benchmark. Central bank executive Henrique Videira said on June 4 at the Token Nation conference in São Paulo that every payment and asset transfer recorded on Drex’s [&#8230;]</p> <p>"
    },
    {
      "title": "Circle set to exceed IPO expectations after overwhelming investor demand",
      "link": "https://cryptoslate.com/circle-set-to-exceed-ipo-expectations-after-overwhelming-investor-demand/",
      "summary": "<p>Circle is poised to price its initial public offering above its marketed range after receiving investor orders for more than 25x the number of shares available, Bloomberg reported on June 4, citing people familiar with the matter. The stablecoin issuer and its backers are offering 32 million shares at a price range of $27 to [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin To $130,000 In September? Smart Money Loads Up On Calls",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-130000-in-september-smart-money-loads-up/",
      "summary": "Singapore-based trading desk QCP Capital says the options market is sending an unmistakable signal: large players are quietly positioning for a break to $130,000 by the end of Q3, even as spot Bitcoin languishes near $105,000. $130,000 Bitcoin Bets Heating Up In a note to clients on Wednesday, the firm highlighted “a surprise uptick in job openings” that lifted risk appetite across equities, nudging the S&#38;P 500 toward the psychologically charged 6,000 mark. “A steady NFP would cement the Fed’s narrative of a resilient labour market, reinforcing expectations that rates will remain on hold,” QCP wrote, adding that front-end Bitcoin volatility has already “slipped below 40 vol” as traders park on the sidelines before Friday’s payroll print. Despite the calm surface, options flows tell a livelier story. “September $130K calls were lifted at 47 vol,” QCP observed, pointing to “pockets of topside interest heading into Q3.” With the one-month volatility term structure now flatter than at any point since May, opportunistic funds have found it inexpensive to buy long-dated vega while selling short-dated gamma. The dynamic mirrors a broader decline in equity volatility—VIX is plumbing its own three-month lows—and has left Bitcoin’s implied curve looking “wholly normalised,” QCP noted, with skew suggesting “little directional conviction” in the near term. Related Reading: Bitcoin Price Crash: Why $107,500 And $103,500 Are The Levels To Watch That benign backdrop may not last. The desk warned that tariff frictions and Washington’s so-called “Big Beautiful Bill” could roil macro data just as the US debt-ceiling saga re-enters the headlines. “In the absence of a clear catalyst, BTC is unlikely to break materially out of its current range,” the note said, but Q3 “could prove more challenging” as fiscal risks and trade tensions “introduce potential headline volatility.” China has already flashed early signs of stress: futures volumes in 10- and 30-year Chinese government bonds have fallen to their lowest levels since February, a fact QCP attributes to “broader risk aversion and sidelined positioning.” Meanwhile, markets await any progress on an anticipated Xi-Trump dialogue—an event that could shift sentiment on tariffs. For now, however, Bitcoin remains pinned. Spot has hugged the $105,000 handle for five straight sessions, open interest is light, and realized volatility has compressed into a mid-teens annualized band—conditions that historically precede a sharp expansion. Whether that expansion resolves higher or lower hinges on the very catalysts traders are bracing for: payrolls data, central-bank rhetoric, and the tariff announcements that dominated headlines earlier in the year. Related Reading: Bitcoin 3–5 Year Holders Slow Selloff—Waiting for Higher Prices? Yet the willingness of sophisticated desks to pay up for September upside is hard to ignore. A cluster of large prints in the $130,000 strike, executed at implied vols roughly seven points above the prevailing curve, suggests at least some investors expect Bitcoin to test new highs before month-end September. QCP stops short of endorsing the trade outright but underscores the asymmetry: “With vols crushed and skew flat, the cost of owning topside gamma has rarely looked this attractive,” the firm writes. That calculus—cheap optionality against a potentially volatile macro backdrop—explains the growing divergence between spot lethargy and options optimism. If the payroll report arrives soft, the Fed pivot narrative could re-ignite; if tariff negotiations sour, Bitcoin’s digital-gold appeal may resurface. Either path feeds volatility, and volatility is precisely what long-vega buyers are banking on. At press time, BTC traded at $104,648. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Slips Again, Triggering Fresh Fears of a Deeper Correction",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-slips-104200/",
      "summary": "Bitcoin price started a fresh decline and tested the $104,200 zone. BTC is now consolidating and might struggle to clear the $106,800 resistance zone. Bitcoin started a consolidation phase above the $104,000 zone. The price is trading below $106,000 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $104,450 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it clears the $106,800 resistance zone. Bitcoin Price Dips To Support Bitcoin price started a fresh decline and traded below the $105,650 support zone. BTC even traded below the $105,200 level and tested the $104,200 zone. A low was formed at $104,279 and the price is now consolidating losses. There was a move above the $104,500 level and the 23.6% Fib retracement level of the recent decline from the $106,820 swing high to the $104,279 low. Bitcoin is now trading below $106,000 and the 100 hourly Simple moving average. There is also a connecting bullish trend line forming with support at $104,450 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $105,500 level. It is close to the 50% Fib retracement level of the recent decline from the $106,820 swing high to the $104,279 low. The first key resistance is near the $106,220 level. The next key resistance could be $106,800. A close above the $106,800 resistance might send the price further higher. In the stated case, the price could rise and test the $107,500 resistance level. Any more gains might send the price toward the $110,000 level. More Losses In BTC? If Bitcoin fails to rise above the $106,000 resistance zone, it could start another decline. Immediate support is near the $104,500 level and the trend line. The first major support is near the $104,200 level. The next support is now near the $103,200 zone. Any more losses might send the price toward the $102,500 support in the near term. The main support sits at $101,200, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $104,200, followed by $103,200. Major Resistance Levels – $105,500 and $106,800."
    },
    {
      "title": "Bitcoin Signals Strength As Long-Term Holder Realized Cap Surges Past $20 Billion – Details",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-signals-strength-as-long-term-holder-realized-cap-surges-past-20-billion-details/",
      "summary": "Despite recent volatility, several key indicators are pointing to a bullish undercurrent for Bitcoin (BTC). These include Binance’s rising market dominance, renewed accumulation by long-term holders (LTH), and significant BTC withdrawals from major crypto exchanges. Bitcoin Showing Signs Of Renewed Strength At the time of writing, Bitcoin is trading in the mid-$100,000 range &#8211; approximately 6.1% below its latest all-time high (ATH) recorded on May 22. The flagship cryptocurrency has declined more than 3.5% over the past seven days amid renewed concerns over global trade tensions and tariffs. Related Reading: Bitcoin Surges With Low Retail Interest – Is A Second Wave Coming? However, according to a recent CryptoQuant Quicktake post by contributor Amr Taha, several bullish signals have emerged since the start of June. Most notably, the LTH Net Position Realized Cap recently crossed the $20 billion threshold, reflecting increased confidence among seasoned investors. For context, LTHs are entities that have held BTC for over 155 days. Often referred to as &#8220;smart money,&#8221; these investors typically follow long-term strategies and are less likely to sell during short-term market corrections. The Realized Cap metric tracks the total value of BTC held by LTHs, based on the price at which coins were last moved. A rising value in this metric implies accumulation by long-term investors &#8211; behavior that historically precedes bullish continuation phases. Meanwhile, major exchanges such as Kraken and Bitfinex have witnessed substantial BTC outflows. Over two consecutive days, more than 20,000 BTC exited these platforms &#8211; marking one of the largest short-term withdrawal spikes in recent months. Such major Bitcoin withdrawals from exchanges are considered bullish because they signal that investors intend to hold their BTC in private wallets rather than sell it, reducing the available supply for trading. This supply contraction can create upward pressure on price, especially when demand remains steady or increases. At the same time, Binance has strengthened its lead in spot market dominance. Since early June, its share of BTC spot trading volume has increased from 26% to 35%, signalling growing market activity. This uptick aligns with BTC testing key resistance levels. Taha remarked: The convergence of rising exchange dominance, long-term holder confidence, and supply tightening paints a bullish picture for Bitcoin. While short-term corrections are possible, the underlying demand and reduction in available BTC on exchanges suggest that the uptrend is far from over. BTC Benefitting From Neutral Funding Rates, Low Selling Pressure Recent on-chain data shows that the BTC derivatives market has undergone a complete reset, with its funding rates now hovering around zero, not showing any directional bias. Similarly, selling pressure on BTC has remained subdued, evident from low Binance inflows. Related Reading: Bitcoin Upward Momentum ‘Highly Likely’ To Continue, On-Chain Data Shows That said, some caution is warranted. Fresh on-chain data suggests that cracks may be forming in the sustainability of the current bullish momentum. At press time, BTC trades at $105,022, down 0.3% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "American Rapper Cardi B Endorses WAP Token Again—But Is It A Rugpull?",
      "link": "https://www.newsbtc.com/meme-coins/american-rapper-cardi-b-endorses-wap-token-again-but-is-it-a-rugpull/",
      "summary": "Cardi B’s recent post about the meme token Wet A*s P*ssy (WAP) turned into a dramatic market shakeup. Within minutes, WAP’s market cap plunged from $2 million to just $150,000. The token’s price shot up to $0.0020 briefly, then tumbled over 90% back to $0.00019, wiping away almost all of this week’s gains. Related Reading: Is $250K Bitcoin Possible This Year? This Research Chief Thinks So Celebrity Tweet Sparks Chaos According to reports, Cardi B shared a wallet address on her official X account with the caption “even wetter than last time.” That single message sent ripples through the crypto world. Prices leaped, then crashed. Market watchers were left scratching their heads as billions of dollars in value seemed to vanish in mere moments. Suspicious Wallet Activity Blockchain trackers spotted something odd. A handful of wallets bought big chunks of WAP just five days before the tweet. They offloaded their tokens almost immediately after Cardi B’s post, banking roughly 10 times their original stake. So today, @iamcardib remembered that she still held a large portion of the $WAP supply and decided to run another pump and dump. The token went from 2.5M to 139k a couple of minutes after the tweet The dump was triggered by some wallets that bought the token around five days… pic.twitter.com/7Nwr27rcZA — dethective (@dethective) June 3, 2025 These sudden sells helped push the token’s price back down to around $0.00019. Based on reports, this pattern looks like a classic pump-and-dump. It raises questions about whether insiders planned the entire move. POV you might owe millions pic.twitter.com/j9FGLgoSBM — ZachXBT (@zachxbt) June 4, 2025 History Of WAP Controversies This isn’t the first time WAP caused trouble. Back in October 2024, Cardi B gave it a shout-out, and security firm PeckShield flagged the token for possible malicious deeds. That earlier buzz even led to an investigation by the UAE’s Securities and Commodities Authority after investors raised alarms over fraud and market manipulation. Many in the crypto community thought everyone would steer clear this time. Instead, the past slipped from memory, leading to heavy losses all over again. Investors Left Holding The Bag In the last 24 hours, WAP’s value dropped another 80%. Now it trades near the same levels it was at the end of May. Everyday traders who jumped on the hype found themselves staring at red numbers. Based on reports, some wallets walked away with tenfold returns in minutes. Meanwhile, others ended up with nearly worthless tokens. The speed of this rise-and-fall serves as a harsh reminder: if you buy a token right as it peaks, you might be stuck when the next crash hits. Related Reading: $500M Bet On Solana: Education Platform Aims To Supercharge Its Treasury Cardi B’s follow-up post clarified that her account was not hacked, promising more from “$WAP space” soon. Yet this explanation did little to calm nerves. Critics say it’s hard to separate the artist’s genuine interest from a planned marketing push. Some point out that even if she didn’t directly benefit, her endorsement gave insiders exactly the spotlight they needed to unload their shares. Featured image from Andrew Kelly/Reuters/USA Today, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Crash Below $100,000 Still Possible: Analysts Issue Downtrend Warnings",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-crash-below-100000/",
      "summary": "Despite the recent rally to a new all-time high (ATH) of $111,900, crypto analysts have warned that the Bitcoin price could still witness a massive crash that will send it below $100,000. These analysts highlighted fundamentals and technicals that could spark this price crash. Analysts Highlight Why Bitcoin Price Could Still Crash Below $100,000 In a TradingView post, crypto analyst Stephan mentioned the geopolitical tensions, with the Russia-Ukraine conflict intensifying as one of the factors that could spark the Bitcoin price crash. He explained how this conflict could drive investors toward safe-haven assets, such as gold. The analyst also noted that Bitcoin ETFs experienced modest outflows last week. Related Reading: Bitcoin Price Crash To $104,000: What You Need To Know In June Stephan’s accompanying chart showed that the Bitcoin price could drop to as low as $96,765 as it retests the psychological $100,000 support level. Crypto analyst Nova also warned that Bitcoin could drop to $100,000 while providing a technical analysis of the flagship crypto’s current price action. In a TradingView post, Nova stated that if the Bitcoin price faces resistance around the $106,406 daily level and continues to correct, it could extend the decline to retest the psychologically important $100,000 mark. She further revealed that the Relative Strength Index (RSI) on the daily chart is at 53, trending downwards to the neutral level of 50. This indicates weakening bullish momentum. Nova also stated that the Moving Average Convergence Divergence (MACD) showed a bearish crossover last week. Meanwhile, the analyst alluded to the increasing red histogram bars below the baseline, which she claimed further signal a potential correction ahead. Her accompanying chart showed that the Bitcoin price could drop to $99,000 as it retests the $100,000 level. Crypto analyst Kevin Capital also called for caution at the current Bitcoin price level. He stated that nothing has changed for the flagship crypto and indicated that there was no need to be ultra bullish at this current level. The analyst earlier warned that things could get sketchy looking for BTC if it fails to reclaim $106,800 soon enough. BTC Could Still Rally To $135,000 This Year In an X post, crypto analyst Titan of Crypto raised the possibility of the Bitcoin price rallying to $135,000 this year. He noted that BTC has broken out of a right-angled descending broadening wedge, and if the price holds above the breakout zone, $135,000 becomes a realistic target. The analyst added that the structure is clean. Related Reading: Head And Shoulders Pattern Says Bitcoin Price Is Headed Down Toward $95,000 Crypto analyst Mikybull Crypto stated that the Bitcoin price is gearing up for a new all-time high. He further remarked that $120,000 remains a magnet for the flagship crypto in this market cycle. Meanwhile, veteran trader Peter Brandt predicted that BTC could reach $150,000 by late summer 2025. At the time of writing, the Bitcoin price is trading at around $105,400, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Matador Technologies Raises C$1.64M To Invest in Their Bitcoin Reserve",
      "link": "https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Matador-Technologies-Raising-C1-Million-to-Invest-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve\" rel=\"nofollow\"> </a></p> <p>Matador Technologies announced it raised C$1,644,300 across the issuance of 2,652,097 units to add more bitcoin to their reserve.</p> <p>"
    },
    {
      "title": "Support The Blockchain Regulatory Certainty Act (BRCA) To Protect Noncustodial Services",
      "link": "https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Blockchain-Regulatory-Certainty-Act-Save-Our-Wallets-Bitcoin-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services\" rel=\"nofollow\"> </a></p> <p>Call your local elected officials and tell them to support the BRCA, which protects developers of noncustodial technology as well as a variety of services that preserve privacy and make it easier to scale Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: The Key To Scaling Bitcoin",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Layer2-Introduction.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bitcoin and other blockchains are robust and decentralized systems, but they do not scale. In order to make them work, a layered approach is necessary.</p> <p>"
    },
    {
      "title": "JPMorgan to Offer Clients Financing Against Bitcoin & Crypto ETFs",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-Morgan-Plans-to-Offer-Clients-Financing-Against-Crypto-ETFS.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs\" rel=\"nofollow\">JPMorgan to Offer Clients Financing Against Bitcoin &#038; Crypto ETFs</a></p> <p>JPMorgan Chase &#38; Co. plans to allow its trading and wealth-management clients to use cryptocurrency-linked assets, including spot Bitcoin exchange-traded funds (ETFs), as collateral for loans, according to Bloomberg. The bank will begin with BlackRock’s iShares Bitcoin Trust (IBIT), and additional ETFs are expected to be added over time. The policy will apply globally, spanning [&#8230;]</p> <p>"
    },
    {
      "title": "BTCPay Server: The Backbone of Bitcoin Commerce, 2025",
      "link": "https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_young_modern_wizard_male_futuristic_clothi_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025\" rel=\"nofollow\"> </a></p> <p>With plugins for Boltz swaps and WooCommerce, BTCPay Server’s open-source platform supports merchants globally, no middleman required.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Why Democrat Zoltan Istvan Is Backing Basic Income, Home Robots in California Governor Bid",
      "link": "https://decrypt.co/323798/democrat-zoltan-istvan-basic-income-home-robots-california-governor-bid",
      "summary": "Running to lead California, Zoltan Istvan said the state needs Universal Basic Income and robots before jobs begin to vanish."
    },
    {
      "title": "Stablecoin Giant Circle Raises $1.1B in IPO, Valued at $6.9B Ahead of NYSE Debut",
      "link": "https://decrypt.co/323795/stablecoin-giant-circle-raises-1-billion-ipo-nyse-debut",
      "summary": "Stablecoin firm Circle priced its shares at $31, above the marketed range, ahead of its trading debut on the NYSE under ticker CRCL."
    },
    {
      "title": "'Unclaimed' Bitcoin in California Could Be Seized—But There's a Catch",
      "link": "https://decrypt.co/323787/unclaimed-bitcoin-california-seized-theres-catch",
      "summary": "The California House passed a bill that would let the state seize crypto sitting on exchanges—but advocates say it's actually a good thing."
    },
    {
      "title": "Bitcoin Dips But XRP and Dogecoin Fall Further Amid Tariff, Economic Uncertainty",
      "link": "https://decrypt.co/323742/bitcoin-dips-xrp-dogecoin-fall-further",
      "summary": "Bitcoin dropped by about 1% but major altcoins fell deeper into the red as investors weighed steel tariffs and wider macro uncertainties."
    },
    {
      "title": "'Flappy Bird' Is Making a Crypto Gaming Push After All",
      "link": "https://decrypt.co/323735/flappy-bird-crypto-gaming-push",
      "summary": "Popular mobile game Flappy Bird is once more taking flight in Web3 after closing down its Telegram game and launching on Android."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "JPMorgan Chase set to accept Bitcoin, crypto ETFs as loan collateral",
      "link": "https://cryptobriefing.com/jpmorgan-crypto-loan-collateral/",
      "summary": "<p>JPMorgan's move to accept crypto ETFs as collateral could accelerate mainstream adoption and integration of digital assets in traditional finance.</p> <p>"
    },
    {
      "title": "BlackRock’s Bitcoin ETF futures go live on Moscow Exchange as fund surpasses $70 billion AUM",
      "link": "https://cryptobriefing.com/bitcoin-futures-moscow-exchange/",
      "summary": "<p>The integration of Bitcoin ETFs into Russia's financial markets may signal a shift towards broader acceptance and regulation of crypto assets.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus files with SEC for potential $300M XRP reserve strategy, stock surges pre-market",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy/",
      "summary": "<p>Webus's strategic XRP reserve plan could enhance global payment solutions, potentially transforming cross-border transactions and boosting investor confidence.</p> <p>"
    },
    {
      "title": "Trump’s top crypto advisor meets with Pakistan blockchain chief to discuss Bitcoin",
      "link": "https://cryptobriefing.com/bitcoin-strategic-cooperation-pakistan/",
      "summary": "<p>Pakistan's strategic Bitcoin initiatives could strain IMF relations, highlighting challenges for emerging markets in crypto adoption.</p> <p>"
    },
    {
      "title": "Eric Trump threatens legal action over unauthorized Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/eric-trump-crypto-wallet-warning/",
      "summary": "<p>The incident highlights the complexities and potential legal challenges of using high-profile branding in the rapidly evolving crypto space.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin whales are dumping – Is the top in? Profit-taking hits $500M/hour",
      "link": "https://ambcrypto.com/bitcoin-whales-are-dumping-is-the-top-in-profit-taking-hits-500m-hour/",
      "summary": "<img alt=\"Bitcoin whales are dumping - Is the top in? Profit-taking hits $500M/hour\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-15.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />They might be selling, but they're certainly not panicked."
    },
    {
      "title": "Ethereum: Whales now hold $365mln in ETH – Is a run to $3.4K loading?",
      "link": "https://ambcrypto.com/ethereum-whales-now-hold-365mln-in-eth-is-a-run-to-3-4k-loading/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-04T131548.055-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum whale demand surges as a bullish pattern nears breakout above $2,830."
    },
    {
      "title": "Satoshi Nakamoto surpasses Bill Gates in wealth with $116.7B net worth – Elon Musk next?",
      "link": "https://ambcrypto.com/satoshi-nakamoto-surpasses-bill-gates-in-wealth-with-116-7b-net-worth-elon-musk-next/",
      "summary": "<img alt=\"Satoshi Nakamoto surpasses Bill Gates in wealth with $116.7B net worth - Elon Musk next?\" class=\"attachment-full size-full wp-post-image\" height=\"1091\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Nakamoto-Is-Now-Richer-Than-Bill-Gate.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1939\" />He’s never been seen, but his crypto stash could soon overtake Zuckerberg, Buffett, and maybe Musk next."
    },
    {
      "title": "Miners may shape Bitcoin’s fate – But first, ETF outflows need to stop",
      "link": "https://ambcrypto.com/miners-may-shape-bitcoins-fate-but-first-etf-outflows-need-to-stop/",
      "summary": "<img alt=\"Miners may shape Bitcoin’s fate - But first, ETF outflows need to stop\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_32_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />MARA Digital's BTC accumulation grows as ETF outflows surge, raising hopes for potential price stability."
    },
    {
      "title": "Solana’s memecoin powerhouse Pump.fun eyes $1B raise at $4B valuation",
      "link": "https://ambcrypto.com/solanas-memecoin-powerhouse-pump-fun-eyes-1b-raise-at-4b-valuation/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Solana-Pumpfun-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here's experts' outlook on Pump.fun's expected token launch."
    }
  ]
}