{
  "CoinDesk": [
    {
      "title": "BlackRock's Spot Ether ETF Registers Record Trading Volume of 43M Amid Net Inflows of $158M",
      "link": "https://www.coindesk.com/markets/2025/07/10/blackrock-s-spot-ether-etf-registers-record-trading-volume-of-43m-amid-net-inflows-of-usd158m",
      "summary": ""
    },
    {
      "title": "Hyperliquid Trader Fumbles $26M ETH Short Profit, Faces $716K Loss After Doubling Down",
      "link": "https://www.coindesk.com/markets/2025/07/10/hyperliquid-trader-fumbles-26m-eth-short-profit-faces-716k-loss-after-doubling-down",
      "summary": ""
    },
    {
      "title": "Justin Sun Wants to Make TRUMP a Global Crypto Brand With $100M Buy",
      "link": "https://www.coindesk.com/markets/2025/07/10/justin-sun-wants-to-make-trump-a-global-crypto-brand-with-100m-buy",
      "summary": ""
    },
    {
      "title": "Shiba Inu Smashes Triangle Pattern Against Bitcoin, But Looks Weak Against Dogecoin",
      "link": "https://www.coindesk.com/markets/2025/07/10/shiba-inu-smashes-triangle-pattern-against-bitcoin-but-looks-weak-against-dogecoin",
      "summary": ""
    },
    {
      "title": "XRP Traders Target $6 as Ripple’s RLUSD Surges Past $500M Market Cap",
      "link": "https://www.coindesk.com/markets/2025/07/10/xrp-traders-target-6-as-ripples-rlusd-surges-past-500m-market-cap",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Australia to test CBDCs, stablecoins in next stage of crypto play",
      "link": "https://cointelegraph.com/news/australia-digital-currency-trial-tokenized-asset-markets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzVkMGQtODkyYy03YzQ4LWI3M2QtNzc3ZmQ5YTcxMzhm.jpg\" /></p><p>The trial is part of Project Acacia, an initiative from the RBA exploring how digital money and tokenization could support financial markets in Australia.</p>"
    },
    {
      "title": "Bitcoin investors have now splashed over $50B on US spot ETFs",
      "link": "https://cointelegraph.com/news/us-bitcoin-etfs-reach-50b-milestone-just-18-months-after-launch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzg2NWMtZDVmZi03MGJkLWExZGUtNzExNmZjY2JiNDM4.jpg\" /></p><p>BlackRock and Fidelity’s spot Bitcoin ETFs have led the charge, with momentum only slightly dented due to outflows from Grayscale's Bitcoin fund.</p>"
    },
    {
      "title": "Nvidia becomes first company to hit $4T valuation, thanks to AI boom",
      "link": "https://cointelegraph.com/news/nvidia-becomes-first-4t-market-cap-company-on-ai-boom?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MmZlODUtYTFkZi03YzQ4LWE4ZWItODEwNTg5MGVkNmFk.jpg\" /></p><p>Nvidia’s stock hit an all-time high of $164.32, making it the first $4 trillion company as AI demand drives yearly gains.</p>"
    },
    {
      "title": "Bitcoin Depot discloses data breach that doxed 27K customers",
      "link": "https://cointelegraph.com/news/bitcoin-depot-discloses-data-breach-27k-customers?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2YxOGQtZTIyZS03MjVmLWFiNDQtNjVjMTVhYmI0NzFi.jpg\" /></p><p>Bitcoin Depot has disclosed that 27,000 of its customers data was breached, but said there was “no evidence of customer information being misused.”</p>"
    },
    {
      "title": "Bitcoiners underprepared for possible $133K price tag in September",
      "link": "https://cointelegraph.com/news/bitcoin-price-traders-not-prepared-surge-september-analyst-forecasts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5Njc5YjEtMzljZi03MmFkLTgyYzYtMTE3MTY4MDM2ZGRl.jpg\" /></p><p>10x Research’s Bitcoin trend model says there’s a 60% chance for Bitcoin to move higher over the next two months, with history pointing to a 20% gain.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Ethereum regains $2,700 amid lowest long/short ratio in two years and ETF cash floods",
      "link": "https://cryptoslate.com/ethereum-regains-2700-amid-lowest-long-short-ratio-in-two-years-and-etf-cash-floods/",
      "summary": "<p>Ethereum (ETH) reclaimed the $2,700 threshold one day after spot exchange-traded funds (ETFs) listed in the US tracking the asset surpassed $4.5 billion in cumulative net inflows on July 8, according to Farside Investors&#8217; data. As of press time, Ethereum is priced at $2,723.98, up by 4.1% in the past 24 hours. ETH lost the [&#8230;]</p> <p>"
    },
    {
      "title": "Rex-Osprey Solana staking ETF doubles cumulative inflows to $41M on July 8",
      "link": "https://cryptoslate.com/rex-osprey-spot-solana-etf-doubles-cumulative-inflows-to-41m-on-july-8/",
      "summary": "<p>The first US-listed spot Solana exchange-traded fund (ETF) received $21 million of net inflows on July 8, lifting its running total to $41.2 million, based on Farside Investors’ data. The one-day addition to the Rex-Osprey’s Solana + Staking ETF (SSK) 104% of the $20.2 million raised over the previous three trading sessions, effectively doubling net [&#8230;]</p> <p>"
    },
    {
      "title": "Greece recovers part of funds stolen in Bybit hack as its first crypto asset seizure",
      "link": "https://cryptoslate.com/greece-recovers-part-of-funds-stolen-in-bybit-hack-as-its-first-crypto-asset-seizure/",
      "summary": "<p>Greek authorities carried out the country’s first-ever crypto seizure after tracing funds linked to the record-breaking $1.4 billion hack of crypto exchange Bybit earlier this year. The Hellenic Anti-Money Laundering Authority issued a freezing order on a suspect wallet following a months-long investigation aided by blockchain analytics firm Chainalysis. The operation targeted funds allegedly stolen [&#8230;]</p> <p>"
    },
    {
      "title": "SEC Crypto Task Force head warns assets remain securities regardless of tokenization",
      "link": "https://cryptoslate.com/sec-crypto-task-force-head-warns-assets-remain-securities-regardless-of-tokenization/",
      "summary": "<p>Hester Peirce, head of the US Securities and Exchange Commission&#8217;s (SEC) Crypto Task Force, said that putting securities on a blockchain &#8220;does not have magical abilities to transform the nature of the underlying asset.&#8221; In a July 9 statement, Peirce emphasized that tokenized shares, notes, or entitlements &#8220;are still securities,&#8221; requiring issuers, intermediaries, and traders [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin hits fresh all-time high above $112k as traders parse new US tariff shock",
      "link": "https://cryptoslate.com/bitcoin-hits-fresh-all-time-high-above-112k-as-traders-parse-new-us-tariff-shock/",
      "summary": "<p>Bitcoin (BTC) reached a new all-time high of $112,040 on July 9, edging above the previous intraday peak of $111,917.37 recorded on May 22, TradingView data shows. The breakout arrived hours after President Donald Trump dispatched formal tariff letters to seven nations, unveiling duties of up to 30% that take effect Aug. 1. According to [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Consolidates Below All-Time High as Spot Market Drives Momentum",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-consolidates-below-all-time-high-as-spot-market-drives-momentum/",
      "summary": "Bitcoin’s price movement remains in focus as it continues to consolidate just below its previous all-time high. Despite a brief surge that brought it within range of its $111,000 peak, the asset has struggled to establish a breakout. As of the time of writing, Bitcoin is trading around $108,927, representing a 0.2% increase over the past 24 hours. The persistence of this consolidation phase comes amid growing market discussions around spot and derivatives behavior. Related Reading: Bitcoin’s Liquidity Lifeline Just Got Cut—What You Need To Know Binance Spot-Perpetual Delta Reflects Cautious Leverage One of the more notable on-chain observations comes from CryptoQuant contributor BorisVest, who analyzed the prolonged negative delta between spot and perpetual prices on Binance. According to the analyst, this delta has remained in negative territory since December 2024. That means the spot price of Bitcoin has consistently traded above the perpetual futures price on Binance, an unusual structure during what appears to be a bullish market trend. “When the delta flipped negative last December, Bitcoin had just marked a then-ATH,” BorisVest noted. He explained that this divergence signaled an aggressive buildup of long positions in the perpetual market, just before Bitcoin corrected to $74,000. Despite Bitcoin reaching new highs recently, the delta still hasn’t reversed. “The sustained gap shows that leveraged traders have yet to commit to the rally in full,” he added. This trend could indicate a phase of accumulation in the spot market, which historically precedes stronger price movements. The analyst also warned that when perpetual prices eventually flip above spot prices, it may signal a shift toward a more speculative environment. In such scenarios, sudden price corrections could occur if long positions are unwound rapidly. Traders monitoring the spot-perpetual relationship can potentially use this as a signal to adjust their risk exposure. Dollar Weakness May Signal Tailwinds for Bitcoin Another CryptoQuant analyst, Darkfost, highlighted a macroeconomic trend that could further influence Bitcoin’s trajectory, the weakening US dollar. The US Dollar Index (DXY), which tracks the value of the dollar relative to a basket of foreign currencies, is currently trading at its most significant deviation below its 200-day moving average in over two decades. This decline coincides with rising US debt levels and has historically aligned with strength in risk-on assets like Bitcoin. Darkfost pointed out that when the dollar loses its traditional safe-haven appeal, capital often flows toward alternative assets. Related Reading: Bitcoin Price Crash To $92,000 Or New ATHs? Analyst Explains The 2 Options “Historical data shows that these periods have consistently benefited Bitcoin,” the analyst stated. While Bitcoin has yet to respond in full to this shift, the trend could support a future upward move, especially if liquidity continues to increase. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin Rally Ahead? DXY Breakdown Suggests Capital Shift To Risk-On Assets",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-rally-ahead-dxy-breakdown-suggests-capital-shift-to-risk-on-assets/",
      "summary": "The US national debt recently hit a new all-time high (ATH), surging above $36.5 trillion and putting significant pressure on the US Dollar Index (DXY). As the DXY struggles under the weight of mounting debt, crypto analysts believe capital may soon shift to risk-on assets like Bitcoin (BTC). DXY Breakdown Suggests Bitcoin Rally According to a recent CryptoQuant Quicktake post by contributor Darkfost, the DXY has dropped to a historically weak level, currently trading 6.5 points below its 200-day moving average (MA) &#8211; the largest deviation in the past 21 years. Related Reading: Bitcoin Short-Term Holder Floor Rises Toward $100,000, Reinforcing Bullish Sentiment For the uninitiated, the DXY measures the value of the US dollar relative to a basket of six major foreign currencies, including the euro, yen, pound, Canadian dollar, Swedish krona, and Swiss franc. It is widely used as an indicator of USD strength or weakness and often influences investor sentiment across global financial markets. While a breakdown in the DXY might seem alarming at first, it historically benefits risk-on assets like BTC. A weakening dollar typically precedes capital rotation into alternative asset classes. Following that logic, the recent softness in the USD could prompt investors to reassess their portfolios &#8211; potentially increasing allocation to digital assets. Darkfost illustrated this point with the below chart. The chart highlights periods where the DXY traded below its 365-day MA. Historically, these phases have aligned with strong BTC price appreciation. The analyst added: We are currently in a phase where the weakness of the DXY could fuel a new rise in BTC but the price didn&#8217;t reacted yet. This tool serves as a valuable indicator for identifying early bull market phases and periods of euphoria, not because of pure technical triggers, but because it reflects increasing liquidity potentially flowing into crypto markets. According to data from CoingGecko, BTC is currently trading just about 2.2% below its ATH of $111,814 recorded on May 22. With BTC decisively breaking through a bullish flag, the flagship cryptocurrency looks set to hit a new ATH in the near-term. Some Warning Signs To Watch Out For Despite a favorable macro backdrop, several warning signs could dampen BTC’s bullish momentum. For instance, Bitcoin’s Apparent Demand metric has recently turned negative. Related Reading: Bitcoin Realized Dominance Signals Weak Hands Capitulating, Strong Hands Rising Similarly, some on-chain metrics suggest that the BTC rally may be running out of steam. Bitcoin’s NVT Golden Cross recently showed signs of a potential local top. That said, Bitcoin continues to show resilience, absorbing persistent selling pressure in the derivatives market and avoiding a breakdown below the $100,000 mark. At press time, BTC trades at $109,520, up 0.7% over the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Solana (SOL) Spikes to $160 — Will Bulls Power Past This Wall?",
      "link": "https://www.newsbtc.com/analysis/solana-sol-spikes-to-160/",
      "summary": "Solana started a fresh increase above the $155 zone. SOL price is now consolidating gains and might struggle to rise above the $160 resistance. SOL price started a fresh upward move above the $150 and $155 levels against the US Dollar. The price is now trading above $152 and the 100-hourly simple moving average. There is a key bullish trend line forming with support at $155 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could start a fresh increase if it clears the $160 resistance zone. Solana Price Aims Higher Solana price started a decent increase after it cleared the $152 resistance, like Bitcoin and Ethereum. SOL climbed above the $155 level to enter a short-term positive zone. However, the price is facing a major hurdle at $160 and $162. A high is formed at $159.24 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $148 swing low to the $160 high. Solana is now trading above $155 and the 100-hourly simple moving average. There is also a key bullish trend line forming with support at $155 on the hourly chart of the SOL/USD pair. On the upside, the price is facing resistance near the $160 level. The next major resistance is near the $162 level. The main resistance could be $165. A successful close above the $165 resistance zone could set the pace for another steady increase. The next key resistance is $178. Any more gains might send the price toward the $185 level. Another Decline in SOL? If SOL fails to rise above the $160 resistance, it could start another decline. Initial support on the downside is near the $155 zone and the trend line. The first major support is near the $152 level or the 61.8% Fib retracement level of the upward move from the $148 swing low to the $160 high. A break below the $152 level might send the price toward the $145 zone. If there is a close below the $145 support, the price could decline toward the $136 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $155 and $152. Major Resistance Levels – $160 and $162."
    },
    {
      "title": "Is Bitcoin Ready to Pop? Analyst Warns of Sell-Side Liquidity Squeeze as Whales Take Over",
      "link": "https://www.newsbtc.com/bitcoin-news/is-bitcoin-ready-to-pop-analyst-warns-of-sell-side-liquidity-squeeze-as-whales-take-over/",
      "summary": "Bitcoin continues to hover just below its previous all-time high, consolidating around the $109,000 mark despite a modest 1.9% gain over the past day. The asset reached a 7-day high of $110,307 but has yet to reclaim the historic high of $111,814, a level set back in May. While short-term price action remains within a tight range, on-chain data reveals deeper structural developments that could shape Bitcoin’s trajectory in the weeks ahead. As attention focuses on Bitcoin&#8217;s potential for a breakout, some analysts are turning to supply dynamics for clues. One notable observation comes from CryptoQuant contributor Chairman Lee, who has identified a significant reduction in BTC held on centralized exchanges. This trend may serve as a key indicator of future price behavior, especially in the context of institutional demand and exchange activity. Related Reading: Last Time This Happened, Bitcoin Jumped $50,000—Is History Repeating? Bitcoin Exchange Reserves Drop to Multi-Year Lows Chairman Lee’s analysis highlights a continued decline in exchange-held Bitcoin, with reserves falling to a multi-year low of 2.4 million BTC. This figure is down from over 3.1 million BTC reported in mid-2023. The consistent drawdown in exchange balances is interpreted as a signal that selling pressure is decreasing, which historically has preceded price expansions. According to Lee, “This persistent decline in reserve levels suggests that sell-side liquidity is drying up… Historically, such conditions—where BTC held on exchanges is low—precede major bullish expansions as demand exceeds supply.” In past market cycles, including the 2020–2021 bull run, similar drops in exchange reserves were followed by sharp upward movements in Bitcoin’s price. The logic is based on basic supply-demand mechanics: when available BTC becomes scarce on exchanges, any increase in demand, particularly from ETFs or institutional buyers, can lead to accelerated price growth. Lee emphasizes that this current trend could act as a foundational tailwind, potentially supporting further gains if current demand patterns remain in place. Binance Dominates Whale Transaction Flows Another piece of the market structure puzzle comes from CryptoQuant analyst Crazzyblockk, who examined large-scale BTC transactions across major centralized exchanges. According to his report, Binance has maintained its position as the dominant venue for Bitcoin whale activity. Whale flows are defined in this context as daily inflows or outflows exceeding 1,000 BTC. Binance has recorded cumulative whale inflows of 31.36 million BTC and outflows of 30.82 million BTC, along with 53.2 million whale transactions, significantly more than any other exchange. Notably, these numbers do not reflect unique BTC, but rather total flow volumes that include repeated movements of the same coins. High transaction volumes suggest Binance is favored for its liquidity and infrastructure, allowing whales to engage in trading, custody shifts, and arbitrage with minimal friction. Related Reading: Bitcoin &#38; Stablecoin Reserves Diverge On Binance: Liquidity Explosion Brewing? The data also places HTX Global and Kraken in the second and third positions, respectively, for whale inflows, though their volumes are substantially lower than Binance’s. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "XRP Price Flashes Strength — Bulls Looking for Continuation",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-flashes-strength-2-40/",
      "summary": "XRP price started a fresh increase above the $2.320 zone. The price is now showing positive signs and might climb above the $2.45 resistance. XRP price started a fresh increase above the $2.350 zone. The price is now trading above $2.320 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.380 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above the $2.350 zone. XRP Price Rallies Over 5% XRP price started a fresh increase after it settled above the $2.30 level, beating Bitcoin and Ethereum. The price was able to climb above the $2.350 resistance level. The recent move was positive and the bulls pushed the price above the $2.40 level. A high was formed at $2.437 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2.250 swing low to the $2.437 high. The price is now trading above $2.350 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.380 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.4350 level. The first major resistance is near the $2.450 level. A clear move above the $2.450 resistance might send the price toward the $2.50 resistance. Any more gains might send the price toward the $2.550 resistance or even $2.60 in the near term. The next major hurdle for the bulls might be near the $2.750 zone. Another Decline? If XRP fails to clear the $2.450 resistance zone, it could start another decline. Initial support on the downside is near the $2.380 level and the trend line zone. The next major support is near the $2.350 level or the 50% Fib retracement level of the upward move from the $2.250 swing low to the $2.437 high. If there is a downside break and a close below the $2.350 level, the price might continue to decline toward the $2.320 support. The next major support sits near the $2.2650 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.380 and $2.350. Major Resistance Levels – $2.4350 and $2.450."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Hits New All Time High at $112,000 As Corporations Buy Record Amounts of BTC",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-at-112000-as-corporations-buy-record-amounts-of-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-at-112000-As-Corporations-Buy-Record-Amounts-of-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-at-112000-as-corporations-buy-record-amounts-of-btc\" rel=\"nofollow\"> </a></p> <p>Bitcoin's ATH signals a new era of institutional adoption, with major players like BlackRock, Strategy, and Smarter Web Company expanding their commitment to the digital asset.</p> <p>"
    },
    {
      "title": "Donald Trump Jr. Invests $4 Million in Bitcoin Treasury Company Thumzup Media",
      "link": "https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Donald-Trump-Jr.-Invests-4-Million-in-Bitcoin-Treasury-Company-Thumzup-Media.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media\" rel=\"nofollow\"> </a></p> <p>The social media firm, which reported just $151 in revenue last quarter, has drawn Trump Jr.’s interest after adopting a Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Myths Busted And Conflicts of Interest Noted at Senate Banking Crypto Market Structure Hearing",
      "link": "https://bitcoinmagazine.com/news/myths-busted-and-conflicts-of-interest-noted-at-senate-banking-crypto-market-structure-hearing",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Crypto-Market-Structure-Hearing-July-9-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/myths-busted-and-conflicts-of-interest-noted-at-senate-banking-crypto-market-structure-hearing\" rel=\"nofollow\"> </a></p> <p>U.S. senators and crypto specialists propose stipulations for digital asset market structure legislation while highlighting the reality of illicit financing on public blockchains and noting the Trump family’s crypto dealings.</p> <p>"
    },
    {
      "title": "Emirates Signs A Deal To Integrate Bitcoin And Crypto Payments",
      "link": "https://bitcoinmagazine.com/news/emirates-signs-a-deal-to-integrate-bitcoin-and-crypto-payments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Dubai-just-became-the-first-government-in-the-world-to-allow-people-to-pay-for-public-services-using-cryptocurrency-thanks-to-a-new-partnership-with-Crypto.com_.-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/emirates-signs-a-deal-to-integrate-bitcoin-and-crypto-payments\" rel=\"nofollow\"> </a></p> <p>Emirates has signed a memorandum of understanding with Crypto.com to integrate Bitcoin and crypto payments into its booking systems, marking a significant step toward mainstream adoption of Bitcoin in the travel industry. The agreement, signed in the presence of Emirates Chairman Sheikh Ahmed bin Saeed Al Maktoum, will enable customers to pay for flights using [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Expands Bitcoin Mining Operations to 750 PH/s, Targets 1.25 EH/s by Late Summer",
      "link": "https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Expands-Bitcoin-Mining-Operations-to-750-PHs-Targets-1.25-EHs-by-Late-Summer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer\" rel=\"nofollow\"> </a></p> <p>KULR Technology Group, Inc., a Bitcoin-first company focused on sustainable energy solutions, announced today the successful deployment of 3,570 Bitmain S19 XP 140T mining machines in Asuncion, Paraguay. This new infrastructure brings KULR’s total Bitcoin mining capacity to 750 petahash per second (PH/s), with a goal of reaching 1.25 exahash per second (EH/s) by late [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Australia’s Tokenization Push Could Cement ‘Even Greater Financial Control’",
      "link": "https://decrypt.co/329454/australia-tokenization-push-greater-financial-control",
      "summary": "Australia has approved 24 tokenized asset use cases under Project Acacia, enabling real-money trials across major banks and fintechs."
    },
    {
      "title": "Elon Musk’s xAI Launches ‘Remarkable, Terrifying’ Grok 4 Model",
      "link": "https://decrypt.co/329451/elon-musks-xai-launches-remarkable-terrifying-grok-4-model",
      "summary": "xAI’s latest AI model aims to challenge OpenAI, even as the team quietly addresses past missteps this week."
    },
    {
      "title": "Trump’s Truth Social Teases Upcoming Utility Token, Shills ‘Patriot’ Subscription",
      "link": "https://decrypt.co/329448/trumps-truth-social-teases-upcoming-utility-token-shills-patriot-subscription",
      "summary": "The social platform founded by Donald Trump is rolling out a loyalty rewards system with plans for a utility token."
    },
    {
      "title": "DeFi Lender Deploys $1M for Student Loans to the Philippines, Indonesia—But at What Cost?",
      "link": "https://decrypt.co/329244/pencil-finance-crypto-rails-student-loans-philippines-indonesia",
      "summary": "The launch positions education lending as a new use case for tokenized real-world assets, combining investor yield with social impact."
    },
    {
      "title": "Judge Recommends Dropping Logan Paul’s Ex-Assistant From 'CryptoZoo' Lawsuit",
      "link": "https://decrypt.co/329446/judge-logan-pauls-ex-assistant-cryptozoo-investor-lawsuit",
      "summary": "Logan Paul’s former assistant Danielle Strobel’s early token access and equity stake weren’t enough to establish jurisdiction, a judge found."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "xAI introduces Grok 4; Elon Musk predicts Grok will start inventing new technologies by 2026",
      "link": "https://cryptobriefing.com/grok-4-ai-model-xai/",
      "summary": "<p>Grok 4's advancements could revolutionize technology and physics, potentially reshaping industries and scientific understanding by 2026.</p> <p>"
    },
    {
      "title": "Ben ‘BitBoy’ Armstrong faces six charges for harassing phone calls, released after arrest",
      "link": "https://cryptobriefing.com/bitboy-legal-troubles-armstrong-arrest/",
      "summary": "<p>The ongoing legal issues surrounding Ben Armstrong highlight the potential reputational risks and legal challenges for crypto influencers.</p> <p>"
    },
    {
      "title": "SEC pushes back decision on in-kind creations and redemptions for BlackRock Ethereum ETF",
      "link": "https://cryptobriefing.com/sec-ethereum-etf-decision-delay/",
      "summary": "<p>The SEC's delay in approving in-kind processes for crypto ETFs may slow innovation and market efficiency in the digital asset space.</p> <p>"
    },
    {
      "title": "Bitcoin hits $112K new ATH after breaking past key resistance",
      "link": "https://cryptobriefing.com/bitcoin-hits-new-all-time-high-at-112k/",
      "summary": "<p>The surge in Bitcoin's value highlights increased institutional interest and regulatory optimism, but also underscores heightened market volatility.</p> <p>"
    },
    {
      "title": "Donald Trump Jr.-backed Thumzup to acquire Ether, XRP, Solana following board approval",
      "link": "https://cryptobriefing.com/bitcoin-treasury-strategy-trump-investment/",
      "summary": "<p>Thumzup's crypto expansion, despite financial losses, highlights a growing trend of Trump-affiliated ventures embracing digital assets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Trump’s Truth Social files for a blue-chip crypto ETF – Details inside!",
      "link": "https://ambcrypto.com/trumps-truth-social-files-for-a-blue-chip-crypto-etf-details-inside/",
      "summary": "<img alt=\"Trump Crypto\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Kelvin-_60_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Trump Social's ETF filing could drive fresh momentum for BTC, ETH, SOL, XRP and CRO."
    },
    {
      "title": "Bitcoin: Does THIS fractal metric signal a final BTC push before…",
      "link": "https://ambcrypto.com/bitcoin-does-this-fractal-metric-signal-a-final-btc-push-before/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Kelvin-_59_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin may see a short-term rally as fractal and MVRV metrics hint at looming correction ahead."
    },
    {
      "title": "FLOKI price prediction – A 30% rally may be next, but what’s fueling it really?",
      "link": "https://ambcrypto.com/floki-price-prediction-a-30-rally-may-be-next-but-whats-fueling-it-really/",
      "summary": "<img alt=\"FLOKI price prediction - A 30% rally may be next, but what&#039;s fueling it really?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-09T175939.486_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />FLOKI is on a good run right now, but is it too good to last?"
    },
    {
      "title": "Why POL’s 10% price rally might stop, DESPITE $10M ETH inflows",
      "link": "https://ambcrypto.com/why-pols-10-price-rally-can-stop-despite-10m-eth-inflows/",
      "summary": "<img alt=\"Why POL&#039;s 10% price rally can stop, DESPITE $10M ETH inflows\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/7CA3B8F6-DBDF-4CA2-AF4C-CABCDC7673EF.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />POL rallied, but how long will it really rally for?"
    },
    {
      "title": "Bitcoin’s $110K mind game – Fear, greed, and dormant 80K BTC’s wake-up call!",
      "link": "https://ambcrypto.com/bitcoins-110k-mind-game-fear-greed-and-a-dormant-80k-btc-wake-up-call/",
      "summary": "<img alt=\"Bitcoin’s $110K mind game - Fear, greed, and a dormant 80K BTC wake-up call!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika1-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Greed vs. Fear - Will $110K break Bitcoin?"
    }
  ]
}