{
  "CoinDesk": [
    {
      "title": "Bankrupt Crypto Exchange FTX Slams Three Arrows Capital’s $1.53B Claim: “3AC Is Owed Nothing”",
      "link": "https://www.coindesk.com/policy/2025/06/23/bankrupt-crypto-exchange-ftx-slams-three-arrows-capital-s-usd1-53b-claim-3ac-is-owed-nothing",
      "summary": ""
    },
    {
      "title": "BTC Bounces Back Above $102K After Iranian Strikes on U.S. Bases in the Gulf",
      "link": "https://www.coindesk.com/markets/2025/06/23/btc-bounces-back-above-102k-after-iranian-strikes-on-us-bases-in-the-gulf",
      "summary": ""
    },
    {
      "title": "Trump's Crypto Ties Still Toxic With Some Dems, Including One Seen as Industry Ally",
      "link": "https://www.coindesk.com/policy/2025/06/23/trump-s-crypto-ties-still-toxic-with-some-dems-including-one-seen-as-industry-ally",
      "summary": ""
    },
    {
      "title": "Hedge Fund Veterans Plan $100M BNB Treasury Bet",
      "link": "https://www.coindesk.com/markets/2025/06/23/hedge-fund-veterans-plan-100m-bnb-treasury-bet",
      "summary": ""
    },
    {
      "title": "Bitcoin Bounce Fails, Tumbling Below $100K as Iran Reportedly Prepares Retaliation Against U.S.",
      "link": "https://www.coindesk.com/markets/2025/06/23/bitcoin-bounce-fails-tumbling-below-100k-as-iran-reportedly-prepares-retaliation-against-us",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "As stablecoin bill heads to House, Senate shifts to market structure",
      "link": "https://cointelegraph.com/news/stablecoin-bill-house-senate-crypto-market-structure?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5NDA5Y2MtOTM5YS03NjQ1LWI4NTYtOGU4MWE2ODIwYjk4.jpg\" /></p><p>The digital assets subcommittee in the Senate will hold a Tuesday hearing to discuss a bipartisan effort to establish a crypto market structure.</p>"
    },
    {
      "title": "Semiconductor firm Sequans to raise $384M for Bitcoin treasury",
      "link": "https://cointelegraph.com/news/semiconductor-firm-sequans-raise-384m-bitcoin-treasury?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzlkODQtMzI4ZC03ZGQ5LWI3ZTEtYTc0ZjQ4ZWQyMDg2.jpg\" /></p><p>Roughly 240 companies now hold Bitcoin in their treasuries, nearly doubling from 124 just weeks ago. Combined, they control around 4% of the total BTC supply.</p>"
    },
    {
      "title": "Bitcoin eyes $104K CME gap as analysis says &#039;World War 3&#039; off the table",
      "link": "https://cointelegraph.com/news/bitcoin-cme-gap-analysis-says-world-war-3-off-the-table?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzlkODMtNThhMi03ZTI5LWJjNGMtNzg2ZjlhYTQ1MzM1.jpg\" /></p><p>Bitcoin price strength gradually returns after multiweek lows as risk assets show overwhelming confidence that a long war in the Middle East will not happen.</p>"
    },
    {
      "title": "India wants 30% of your crypto gains, but that’s not the worst part",
      "link": "https://cointelegraph.com/explained/india-wants-30-of-your-crypto-gains-but-thats-not-the-worst-part?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9lZjg3NzFiYjJlYjUyNGY2MzJjZDQ5YTMxMzdiYjdlOS5qcGc=.jpg\" /></p><p>A 30% tax on crypto profits in India is only part of the story. Traders face even bigger hurdles under the current tax regime.</p>"
    },
    {
      "title": "Crypto hedge fund execs to raise $100M for BNB treasury vehicle — Report",
      "link": "https://cointelegraph.com/news/hedge-fund-execs-raise-100m-bnb-strategy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzlkMjAtYjI0OS03YWUxLWE2NGUtNTFkOTE3OTU2YzQz.jpg\" /></p><p>According to Bloomberg, former executives at Coral Capital Holdings want to create a BNB treasury company.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Circle’s post-IPO valuation surges to $66.9 billion, outpaces USDC supply",
      "link": "https://cryptoslate.com/insights/circles-post-ipo-valuation-surges-to-66-9-billion-outpaces-usdc-supply/",
      "summary": "<p>Circle’s market capitalization has quickly outpaced the circulating supply of its stablecoin USDC less than a month after the company went public. Data from shows that USDC’s current circulating supply is approximately $61.27 billion. Meanwhile, Circle’s market capitalization has surged to around $66.9 billion, according to figures from Yahoo Finance. Circle&#8217;s rapid valuation climb can [&#8230;]</p> <p>"
    },
    {
      "title": "Texas to buy Bitcoin for state reserves long before Trump’s Bitcoin reserve delivers",
      "link": "https://cryptoslate.com/texas-to-buy-bitcoin-for-state-reserves-long-before-federal-bitcoin-reserve-delivers/",
      "summary": "<p>Texas is now legally empowered to build its own Bitcoin reserve funded with taxpayer dollars before the federal government takes any comparable action. Governor Greg Abbott on Saturday signed Senate Bill 21, a law that explicitly allows the state to buy and hold Bitcoin and other top-tier cryptocurrencies. The measure passed the Texas House and [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet’s latest $118 million Bitcoin buy dwarfs Strategy’s new acquisition fivefold",
      "link": "https://cryptoslate.com/metaplanet-outshines-strategy-in-latest-bitcoin-buying-spree/",
      "summary": "<p>Japan&#8217;s Metaplanet has outpaced Strategy in Bitcoin accumulation, purchasing 1,111 BTC last week, approximately five times more than the US-based firm acquired in the same period. According to a June 23 disclosure, Metaplanet spent approximately $118 million on its latest purchase, securing the Bitcoin at an average price of $105,468 per coin. With this addition, [&#8230;]</p> <p>"
    },
    {
      "title": "Nasdaq-listed Fiserv to launch USD-pegged stablecoin on Solana by the end of the year",
      "link": "https://cryptoslate.com/nasdaq-listed-fiserv-to-launch-usd-pegged-stablecoin-on-solana-by-the-end-of-the-year/",
      "summary": "<p>Fiserv Inc., a major player in global payments and financial services, has unveiled plans to launch a USD-pegged stablecoin called FIUSD on the Solana blockchain, according to a June 23 statement. The Nasdaq-listed company stated that the stablecoin was built using infrastructure from Paxos and Circle. It is expected to go live by the end [&#8230;]</p> <p>"
    },
    {
      "title": "Major Ethereum, Solana, XRP losses cause chance of Altcoin Season to drop to 12 month low amid Bitcoin strength",
      "link": "https://cryptoslate.com/ethereum-solana-xrp-losses-cause-altcoin-season-index-to-drop-to-lowest-in-a-year-amid-bitcoin-strength/",
      "summary": "<p>Altcoins are slipping further into decline as investors flock to Bitcoin amid escalating geopolitical tensions and a risk-off environment. Data from CoinGlass shows the Altcoin Season Index has plunged to 12, its weakest level in nearly a year, reflecting a deepening lack of interest in non-Bitcoin cryptocurrencies. The Altcoin Season Index tracks how non-Bitcoin assets [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Dominance Hits New Cycle High Above 66% – How This 4-Year ATH Affects Altcoin SeasonBitcoin Dominance Hits New Cycle High Above 66% – How This 4-Year ATH Affects Altcoin Season",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-dominance-new-high/",
      "summary": "The Bitcoin dominance has hit a new cycle high, providing a bearish outlook for altcoins and any potential altcoin season. Crypto analyst Finsends has commented on this development and how it could affect the altcoin season moving forward. What’s Next As Bitcoin Dominance Hits New High? In an X post, Finsends stated that the Bitcoin dominance has made a new high and that it feels like it can never go down again. However, he opined that there should be a bigger correction starting somewhere around the current levels. The analyst added that the potential target area for a top in this scenario goes up to 68.56%. Related Reading: Rising Bitcoin Dominance Above 64% Dashes Hopes Of Altcoin Season, Here’s Why His accompanying chart showed that the Bitcoin dominance could hit this projected top of 68.56% in July, after which a decline would begin. Based on the chart, the BTC.D could drop to as low as 48% on this decline, paving the way for a potential altcoin season. If so, then altcoins could witness significant gains in the second half of the year and outperform BTC in the process. In an X post, crypto analyst Michaël van de Poppe also commented on the rising Bitcoin dominance and a potential altcoin season. He noted that the altcoin season indicator has hit its lowest number in two years. The analyst added that the lows of this indicator over the last six years were in June or July. Based on this, he remarked that there seems to be a pattern since the indicator has hit a low again this June. Michaël van de Poppe didn’t predict when exactly altcoin season could begin or if the Bitcoin dominance would top anytime soon. However, before now, he had expressed confidence that the alt season would still happen. The analyst noted that the last cycle was also called a Bitcoin cycle until altcoins started to run and heavily outperformed. What Needs To Happen For Altcoins To Take Off In another X post, Michaël van de Poppe stated that altcoins are in need of an upward push from Ethereum, and that this needs to happen through a push of Bitcoin. He further remarked that once the BTC price bottoms out, that is a very likely moment for Ethereum to continue outperforming the flagship crypto, with the Bitcoin dominance declining. Related Reading: Analyst Calls Start Of Altcoin Season Amid Deviation Of Cyclical Lows – Details The analyst believes that altcoins would start “shining” when the next leg upwards for Ethereum takes place, possibly ushering in altcoin season. He declared that once altcoins start to shine, market participants can expect them to heavily outperform the markets. However, for now, Michaël van de Poppe believes investors need to have some more patience. At the time of writing, the Bitcoin price is trading at around $101,700, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Wobbles? Metaplanet Buys Big, Breaks $1 Billion Mark",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-wobbles-metaplanet-buys-big-breaks-1-billion-mark/",
      "summary": "Metaplanet has again beefed up its Bitcoin holdings. According to the Tokyo-listed investment firm, it bought 1,111 BTC on Monday for about $118.2 million. The average price paid was roughly $106,408 per coin. Bitcoin has fallen more than 5% over the last week, trading just above $101,000. Related Reading: Dogecoin Breaks Free—Could Soar 60%, Analyst Says Performance Metrics Climb Higher Metaplanet’s own numbers show a quarter-to-date BTC yield of 108%, up from 96% in Q1 and a hefty 310% in Q4 2024. That metric tracks Bitcoin per fully diluted share, so it puts the firm’s strategy under a clear spotlight. Based on reports, the company gained 4,367 BTC valued at $451 million in this period, using prices from Bitflyer. *Metaplanet Acquires Additional 1,111 $BTC, Total Holdings Reach 11,111 BTC* pic.twitter.com/7ceEeSh1X4 — Metaplanet Inc. (@Metaplanet_JP) June 23, 2025 Balance Sheet Swells to 11,111 BTC With the new purchase, Metaplanet’s total stash now stands at 11,111 BTC, worth just over $1.07 billion. Its cost basis for those coins sits at about $95,869 each. Metaplanet’s shares dipped 3.5% on the day of the announcement, a sign that investors may be worried about how the firm is funding its buy-ups. Source: Metaplanet Funding Through Bonds And Shares Based on reports, the company has raised cash via zero-coupon bonds and equity rights since January. It issued over 210 million shares under a program it calls the “210 Million Plan.” Evo Fund has snapped up many of those bonds and rights. Between May and June 2025, Metaplanet pulled in over $300 million, earmarking every dollar for more Bitcoin. Ambitious Target Of 210,000 BTC Metaplanet has set a goal to hold 210,000 BTC by the end of 2027. That is 10 times its current pile. To reach that number, it will need to keep tapping the capital markets—and it plans to. The firm even created a dedicated Bitcoin Treasury Operations arm in December 2024, moving away from its hotel management roots. Related Reading: Stablecoin Wars Ignite: Peter Schiff Champions Gold-Backed Digital Assets Dilution And Risk For Shareholders Metaplanet’s fully diluted share count rose to close to 760 million as of June 23. That puts its Bitcoin per 1,000 shares at 0.0146 BTC. More bonds and shares mean more dilution for existing investors. If Bitcoin’s price slips, the cost of raising money could climb, eating into any gains from the crypto itself. Metaplanet’s approach mirrors what some other big holders have done. It’s a bold stance. If Bitcoin holds up or heads higher, the firm could see big returns. But it will need to balance fresh capital raises against the risk of pushing down its own stock. For now, Metaplanet shows no sign of slowing down its Bitcoin buying. The only real question is how far this strategy can run before the bills come due. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Ethereum Holds Critical Support – $2,350 Level Could Define The Next Move",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-holds-critical-support-2350-level-could-define-the-next-move/",
      "summary": "Ethereum has dropped 17% since Friday, breaking down from the long-standing range that held firm since early May. The sharp sell-off came after news broke of US airstrikes targeting Iranian nuclear facilities, sending shockwaves across global markets and sparking panic selling in risk assets. ETH was no exception, plunging below multiple support zones before finding a temporary floor at $2,100. Related Reading: Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106 This level served as a critical demand area, and Ethereum has since managed to bounce, offering bulls a glimmer of hope in an otherwise uncertain market. However, the breakdown of the previous trading range indicates that momentum has clearly shifted in favor of the bears. According to top analyst Ted Pillows, Ethereum must reclaim the top of the former range to signal that the downside move was a deviation rather than a full breakdown. As investors digest the growing geopolitical risk and continue to react to macroeconomic pressures such as persistent inflation and hawkish Federal Reserve policy, Ethereum’s path forward remains uncertain. Still, the bounce from $2,100 provides a chance for bulls to reestablish control—if they can push the price back above key resistance levels in the sessions ahead. Ethereum Holds Support But Bears Still in Control Recent price action has taken a heavy toll on altcoins, with Ethereum leading the downturn as most assets fall to lower demand levels. Since reaching its early June high, Ethereum has shed over 26% of its value, now trading under intense bearish pressure. Despite the decline, bulls have managed to defend the critical $2,100 support level, providing a temporary floor in an otherwise fragile environment. Geopolitical instability—particularly the escalating conflict between the US, Israel, and Iran—continues to add volatility and risk aversion to the market. Investors remain cautious, with the broader macroeconomic backdrop dominated by high US Treasury yields, stubborn inflation, and a hawkish Federal Reserve. These factors have put additional weight on the crypto sector, especially on Ethereum, which is widely seen as the main catalyst for a potential altseason that has yet to materialize. Ted Pillows notes that Ethereum recently tested the $2,100 support and successfully bounced. However, he emphasizes that the price must reclaim the top of its previous range to regain bullish momentum. If ETH fails to break and hold above the $2,350 range low, it risks a deeper move toward the start of the previous impulse leg—or worse. The coming days will be critical for Ethereum. Reclaiming lost levels would indicate strength and possibly kick off the long-awaited altcoin rotation. But continued rejection could signal more downside ahead, with sentiment already fragile and demand still lacking. Until clarity returns, Ethereum remains in a decisive phase where every candle matters. Related Reading: Ethereum Weekly Chart Nears Tower Top Formation As US Launches Attack On Iran – Details ETH Price Analysis: Breakdown Below Key Structure Ethereum (ETH) has sharply declined, with the price now sitting around $2,248. This move marks a confirmed breakdown from the key range between $2,320 and $2,850, which had been holding since early May. The rejection from the upper resistance zone near $2,850, combined with high-volume selling, indicates clear bearish momentum. The current candle structure on the 3-day timeframe shows strong downward pressure, especially as ETH failed to hold above the 100-day and 200-day moving averages (currently at $2,638 and $2,776, respectively). These levels now act as dynamic resistance, adding more weight against any short-term bullish reversal attempts. ETH is also trading well below the 50-day moving average at $2,265, a level that has historically acted as a short-term directional signal. Unless price reclaims and consolidates above that zone, the bearish trend could continue toward the $2,000–$2,100 support cluster—an area that previously sparked buying interest during March&#8217;s recovery. Related Reading: Tron Energy Usage Surges 108% – Smart Contract Activity Accelerates Volume has spiked significantly on this drop, suggesting panic selling rather than a controlled correction. For bulls to regain control, ETH must reclaim the range low at $2,320 quickly. Otherwise, downside pressure could continue to dominate in the near term. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Analyst Puts XRP Cycle High At $20-$30, Here’s Why",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-cycle-high-at-20-30/",
      "summary": "The XRP price could be preparing for a historical rally, as a prominent crypto analyst has boldly predicted that the cryptocurrency could reach a fresh cycle top between $20 and $30. The forecast, which presents a massive upside for the altcoin, is based on the Elliott Wave Theory—a key technical analysis tool. XRP Wave Map Signals Cycle Top Ahead Crypto analyst, XForceGlobal on X (formerly Twitter) has presented a bold new forecast for XRP, projecting a cycle high between $20 and $30. The analyst shared a chart that dissects XRP’s price action over the last several months, suggesting that the cryptocurrency is currently in the final stages of a corrective wave before beginning a powerful multi-leg impulsive rally. If this wave count plays out as the market expert says, XRP could be on the verge of its most aggressive breakout to date. Related Reading: XRP Price Targets $3.61 In Short Term As ‘Cup’ Turns Hot The analysis focuses on XRP’s medium-term correction, which has taken the form of a complex WXY structure. According to the chart, XRP is nearing the completion of Wave 2, a corrective phase that began after the last upward impulse. XForceGlobal has pinpointed a key Fibonacci confluence zone between $1.60 and $1.90, where XRP’s pullback is expected to find support. The chart clearly marks this area as a potential springboard for the next bullish phase, as long as the price does not fall below the $1.618 level, which serves as the invalidation point for the current setup. Despite XRP’s historical track record of sluggish performance and ongoing skepticism within the crypto community about the bullish forecast, XForceGlobal maintains confidence that the cryptocurrency will reach the ambitious $20-$30 cycle top—a move he believes could unfold well into 2026. Intermediate Targets First, Cycle High Later According to XForceGlobal’s chart, once XRP completes its current corrective move, the analyst predicts that the first leg of this upcoming rally may take the cryptocurrency past the $5 mark in Wave 3, followed by a deeper Wave 4 pullback and a final thrust into Wave 5 toward $6 or more. Related Reading: XRP 5-Wave Count Shows When The Price Will Hit All-Time Highs Above $5 While these targets represent an intermediate-term bullish setup, on a macro scale, the long-term wave map implies that the whole structure could later culminate in a parabolic cycle top rally that sends XRP between $20 and possibly even $30. This optimistic outlook gains further credibility, as the analyst notes that XRP’s internal wave count for the flat scenario has taken longer to resolve than initially expected. Beyond technicals, XForceGlobal highlights that market psychology plays a central role in its bullish forecast. He notes that the XRP community has weathered regulatory battles, market crashes, and years of stagnation, most notably the US SEC lawsuit. This prolonged adversity has turned XRP holders into “battle-tested veterans” who are largely immune to fear-driven selling. This resilience, according to the analyst, could be the key to the next bullish phase of XRP’s price action. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "Cointelegraph and CoinMarketCap Hacked: Why Non-Custodial Wallets Are Necessary",
      "link": "https://www.newsbtc.com/news/cointelegraph-and-coinmarketcap-hacked-why-non-custodial-wallets-are-necessary/",
      "summary": "Want to check on Bitcoin’s latest price moves? Just pop over to CoinMarketCap and… enter your wallet info? On June 20, 2025, visitors to a number of major crypto sites, including CoinTelegraph and CoinMarketCap, were prompted to connect their crypto wallets before accessing the site. The pop-up was a hack, a wallet-stealer designed to siphon information away from users. CoinMarketCap users can create accounts and connect wallets to track their portfolios, so the pop-up itself might not have seemed entirely out-of-place. Users quickly uncovered the hack, and affected sites moved rapidly to limit the damage. The incident highlights a new potential vulnerability in the growing crypto ecosystem. With such attacks, phishing can occur even on trusted platforms. What Wallet? Hacks Exploited Common Wallet Connectivity Features The incident involved the injection of malicious JavaScript code into CoinMarketCap’s homepage. When unsuspecting users visited the site, they were greeted with a realistic-looking ‘Connect Wallet to Verify’ popup, mimicking standard Web3 wallet connection prompts. Users who clicked the popup and approved the transaction gave attackers full access to their wallets. The CMC hack reportedly had 39 victims with over $18K in losses. The script was since removed, and CMC has patched the vulnerability. Cointelegraph Also Targeted Just days later, on June 23, Cointelegraph, another prominent crypto news outlet, faced a similar attack. In this case, attackers managed to compromise an ad-serving network, injecting code that produced a fake token airdrop popup promoting a nonexistent ‘Cointelegraph token&#8217; or &#8216;CTG.&#8217; The popup redirected users to a phishing site designed to harvest wallet signatures. Once again, users who interacted and signed the transaction lost access to their funds. Cointelegraph quickly issued a warning across its social media channels and disabled the malicious script. Both the CMC and CT hacks are part of a growing category of crypto hacks focused on compromising wallets. Per CertiK’s quarterly report, these attacks produce the largest losses (over $1.450M in Q1 2025 alone). Wallet compromises are not as successful as other attacks, ranking last by incident count. But when they work, hackers can make off with vast amounts quickly. Vigilance and Knowing the Warning Signs: Key to Avoid Losses Binance founder and former CEO Changpeng Zhao (CZ) took to X and warned users to ‘be careful when authorizing wallet connect.’ Both the CMC and CT hacks used pop-ups, one for a simple wallet connect prompt, and one for a purported crypto airdrop. Cointelegraph&#8217;s official account also posted a warning, urging users to not click the pop-ups, connect wallets, or provide their personal information. Crypto airdrops and crypto presales are often used by legitimate projects to develop early interest and generate buzz about new projects, making such phishing attacks more convincing. Scammers create fakes in order to encourage investors to give away wallet information. The supposed project or token – in this case ‘CTG’ – never existed. How do investors stay safe? Avoiding any unexpected or unusual pop-ups, even from trust sources, is a first step. And when it comes to the crypto ICOs and presales, it&#8217;s important to get your info from trusted sources. This is where a new solution, Best Wallet, stands out. This new app is the only Web3 wallet with a presale directory where you can browse only audited, secure presale tokens. The wallet also employs Multi-Party Computation technology, protecting your key from phishing attacks and hacks. Best Wallet Token ($BEST) – The World’s First and Only Crypto Presale Wallet The evolution of crypto hacks is unfortunately part of crypto&#8217;s growing market and popularity. New Web3 solutions, like Best Wallet, are evolving to tackle these security challenges, becoming a critical part of the crypto economy. And the Best Wallet Token ($BEST) is here to power-up the Best Wallet ecosystem and provide additional perks for holders. With $BEST, token holders can trade and swap tokens more easily, participate in community governance, and earn higher staking rewards. The token also allows early access to the best crypto presales, gathered and vetted by Best Wallet in their ‘Upcoming Tokens’ section. Here, investors can find upcoming crypto projects, as well as all the key information, such as whitepapers and tokenomics, needed to do research before investing. That makes Best Wallet&#8217;s platform and token some of the handiest tools for crypto investors who want to avoid shady pop-ups and still stay ahead of the markets. Most importantly, Best Wallet is non-custodial and privacy-focused; investors control all their wallet keys and can sign up and swap crypto without KYC. The Best Wallet token presale has raised $13.5M so far, with the coin currently priced at $0.025225. Note that, given its sought-after, privacy-oriented wallet, the $BEST token could reach $0.05 by the end of 2026 after a successful launch, delivering 102% returns to early investors. If you&#8217;re interested in supporting the project, now&#8217;s the right opportunity to buy the Best Wallet Token at the lowest price. Visit Best Wallet&#8217;s Token presale today. Security in the Age of Web3 The recent front-end Cointelegraph and CoinMarketCap hacks mark a dangerous new phase in crypto security threats. Unlike traditional hacking methods that target backend systems or databases, these exploits weaponize the user interface, where trust is assumed but rarely verified. Secure Web3 wallets like Best Wallet can go a long way towards mitigating such growing risks. As always, do your own research before investing or choosing a crypto service provider. This article isn&#8217;t financial advice."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "The Blockchain Group Acquires 75 BTC After €7.2M Raise",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/10.4B-Bitcoin-Firm-Unchained-Announces-First-Regulated-Bitcoin-Native-Trust-Company-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise\" rel=\"nofollow\"> </a></p> <p>Total holdings reach 1,728 BTC as YTD yield climbs to 1,231.7%, reinforcing its Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Fintech Company DigiAsia Corp to Launch Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Southeast-Asian-fintech-company-aims-to-raise-100-million-for-long-term-Bitcoin-holdings-as-part-of-their-corporate-treasury-initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DigiAsia Corp, a leading Southeast Asian Fintech-as-a-Service platform, has signed an indicative term sheet for up to $3 million in non-recourse debt financing to kickstart its Bitcoin treasury acquisition strategy. The funding comes from High West Capital Partners and is expected to close within 45 days.&#160; The $3 million facility represents the first phase of [&#8230;]</p> <p>"
    },
    {
      "title": "ECD Automotive Design Secures $500M Facility to Acquire Bitcoin",
      "link": "https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ECD-Automotive-Design-Secures-500M-Facility-to-Acquire-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin\" rel=\"nofollow\"> </a></p> <p>Luxury auto builder will grow its Bitcoin treasury, expand operations, and offer $21,000 in upgrades to early customers who pay with Bitcoin and other crypto.</p> <p>"
    },
    {
      "title": "Anthony Pompliano Announces $1 Billion Merger in Record Bitcoin Treasury Company Fundraise",
      "link": "https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ProCap-Financial-has-raised-over-750-million-in-the-largest-initial-funding-round-for-a-public-Bitcoin-treasury-company.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise\" rel=\"nofollow\"> </a></p> <p>Anthony Pompliano announced a $1 billion merger creating ProCap Financial through a Special Purpose Acquisition Company (SPAC) transaction with Columbus Circle Capital Corp. (CCCM). The deal represents the largest initial fundraise in history for a public Bitcoin treasury company, raising $516.5 million in equity and $235 million in convertible notes.&#160;&#160; ProCap Financial will operate with [&#8230;]</p> <p>"
    },
    {
      "title": "Norway’s Green Minerals Announces Adoption Of Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/norways-green-minerals-announces-adoption-of-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norways-Green-Minerals-Announces-Adoption-Of-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norways-green-minerals-announces-adoption-of-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>The Norwegian miner is adopting Bitcoin to hedge inflation and support $1.2 billion in planned financing.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Coinbase Target Price Raised After ‘Transformative Week’: Benchmark",
      "link": "https://decrypt.co/326522/coinbase-target-price-raised-transformative-week-benchmark",
      "summary": "The company’s new license in Europe is bullish, along with the GENIUS Act’s passage, Benchmark analysts said."
    },
    {
      "title": "Trump Media Reaffirms $2.3 Billion Bitcoin Treasury Plan Amid Share Buyback",
      "link": "https://decrypt.co/326520/trump-media-reaffirms-bitcoin-treasury-plan-share-buyback",
      "summary": "President Trump's publicly traded Trump Media and Technology Group is buying back shares—but still plans to buy Bitcoin too."
    },
    {
      "title": "Pompliano Bitcoin Treasury ProCap Unveils $1 Billion SPAC Merger",
      "link": "https://decrypt.co/326510/pomplianos-bitcoin-treasury-procap-unveils-1-billion-spac-merger",
      "summary": "Instead of simply buying and holding Bitcoin, the company plans on putting capital to work."
    },
    {
      "title": "World War Solana Meme Coins Explode in Latest Attention Trend Amid Middle East Tensions",
      "link": "https://decrypt.co/326507/world-war-solana-meme-coins",
      "summary": "Following the United States bombing Iran on Sunday morning, crypto traders pumped some war-related meme coins."
    },
    {
      "title": "Strategy Scales Back Bitcoin Buys as BTC Dips",
      "link": "https://decrypt.co/326499/strategy-scales-back-bitcoin-buys-as-btc-dips",
      "summary": "The company bought 245 Bitcoin as tensions escalated in the Middle East."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin drops below $100K, then rebounds after Iran reportedly fires missiles toward US military targets in Qatar and Iraq",
      "link": "https://cryptobriefing.com/bitcoin-price-drop-mideast-tensions/",
      "summary": "<p>Geopolitical tensions can significantly impact cryptocurrency markets, highlighting their volatility and sensitivity to global events.</p> <p>"
    },
    {
      "title": "Crypto fund veterans to raise $100M to build BNB strategic reserve",
      "link": "https://cryptobriefing.com/bnb-treasury-strategy-listed-company/",
      "summary": "<p>The initiative could diversify crypto investment strategies, potentially increasing BNB's market influence and public company crypto adoption.</p> <p>"
    },
    {
      "title": "Fintech giant Fiserv to launch FIUSD stablecoin and digital asset platform with Circle, Paxos, and Solana",
      "link": "https://cryptobriefing.com/fiusd-stablecoin-platform-launch/",
      "summary": "<p>Fiserv's FIUSD launch could revolutionize digital payments, enhancing real-time transactions and expanding blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Michael Saylor’s Strategy makes smallest Bitcoin purchase since mid-March",
      "link": "https://cryptobriefing.com/strategy-bitcoin-acquisition-record/",
      "summary": "<p>Saylor's ongoing Bitcoin acquisitions highlight a strategic commitment to digital assets, potentially influencing market dynamics and investor sentiment.</p> <p>"
    },
    {
      "title": "Hackers exploit Trezor’s website to send phishing emails",
      "link": "https://cryptobriefing.com/trezor-security-alert-phishing-warning/",
      "summary": "<p>This incident highlights the growing sophistication of phishing attacks, underscoring the need for enhanced cybersecurity measures in crypto platforms.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Mapping Bitcoin’s next move: Rally or reversal – Here are 4 possible outcomes",
      "link": "https://ambcrypto.com/examining-bitcoins-next-chapter-rally-or-reversal-here-are-4-possible-outcomes/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250623_094322_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BTC shows both price possibilities; a fall or a rally."
    },
    {
      "title": "TRON – How long before TRX’s price follows network’s falling usage?",
      "link": "https://ambcrypto.com/tron-how-long-before-trxs-price-follows-networks-falling-usage/",
      "summary": "<img alt=\"TRON - How long before TRX&#039;s price follows network&#039;s falling usage?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-23T121351.354-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TRX's price and investor confidence have refused to break."
    },
    {
      "title": "Why is crypto down today? – Iran’s threats shake BTC, inflation fears & more",
      "link": "https://ambcrypto.com/why-is-crypto-down-today-irans-threats-shake-btc-inflation-fears-more/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/WhyiscryptodowntodayBitcoin-1.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Experts downplay market fears on Iran's chokepoint on Strait of Hormuz"
    },
    {
      "title": "XRP’s price to $30? ETF odds hitting 95% means it’s possible!",
      "link": "https://ambcrypto.com/xrps-price-to-30-etf-odds-hitting-95-means-its-possible/",
      "summary": "<img alt=\"XRP&#039;s price to $30? ETF odds hitting 95% means it&#039;s possible!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika4.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP charts say caution, ETF odds say opportunity."
    },
    {
      "title": "Bitcoin’s price is slipping, and big money’s not buying it – What’s next?",
      "link": "https://ambcrypto.com/bitcoins-price-is-slipping-and-big-moneys-not-buying-it-whats-next/",
      "summary": "<img alt=\"Bitcoin&#039;s price is slipping, and big money&#039;s not buying it - What&#039;s next?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-1-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Short-term holders are feeling the heat as whale wallets go radio silent."
    }
  ]
}