{
  "CoinDesk": [
    {
      "title": "Ex-Blackstone, Tether Execs Seek $1B to Build Multitoken Crypto Treasury: Bloomberg",
      "link": "https://www.coindesk.com/business/2025/06/26/ex-blackstone-tether-execs-seek-1b-to-build-multitoken-crypto-treasury-bloomberg",
      "summary": ""
    },
    {
      "title": "For Altcoin Whales Trading May be Easier on Bitget Than Binance, CoinGecko Research Finds",
      "link": "https://www.coindesk.com/markets/2025/06/26/for-crypto-whales-trading-may-be-easier-on-bitget-than-binance-coingecko-research-finds",
      "summary": ""
    },
    {
      "title": "Crypto Custodian Taurus Launches First Stablecoin Contract With Privacy Features",
      "link": "https://www.coindesk.com/business/2025/06/26/crypto-custodian-taurus-launches-first-stablecoin-contract-with-privacy-features",
      "summary": ""
    },
    {
      "title": "Rain, Toku Debut Stablecoin Payrolls for Workers in Over 100 Countries",
      "link": "https://www.coindesk.com/tech/2025/06/26/rain-toku-debut-stablecoin-payrolls-for-workers-in-over-100-countries",
      "summary": ""
    },
    {
      "title": "Crypto Daybook Americas: Bitcoin Retreats From $108K, But Bulls Aren’t Done",
      "link": "https://www.coindesk.com/daybook-us/2025/06/26/crypto-daybook-americas-bitcoin-retreats-from-108k-but-bulls-arent-done",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Indian politician calls for Bitcoin reserve pilot as US embraces BTC",
      "link": "https://cointelegraph.com/news/india-bitcoin-reserve-pilot-bjp-bhandari?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FjMmQtNzQ1Ny03YzkyLTliM2YtZThmYzI5NjA5YmFk.jpg\" /></p><p>Pradeep Bhandari, spokesperson for India’s ruling BJP party, called for a Bitcoin reserve pilot and clarity on the country’s “taxed but unregulated” approach to crypto.</p>"
    },
    {
      "title": "New Billions app offers secure ID checks without invasive biometrics",
      "link": "https://cointelegraph.com/news/billions-network-ai-proof-identity-app-launch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzljMDAtYzE4MS03NjhlLTk4MTUtMDY3NWNiODk5ZjI0.jpg\" /></p><p>Billions Network has launched its mobile identity app for Android and iOS, offering AI-resistant, privacy-preserving verification using NFC-based document checks and zero-knowledge proofs.</p>"
    },
    {
      "title": "Wall Street buys over $1B in Bitcoin amid dollar&#039;s ‘do or die’ moment",
      "link": "https://cointelegraph.com/news/wall-street-buys-1-5b-in-bitcoin-amid-dollar-s-do-or-die-moment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzIwNGYtYWIzYS03YjZiLWI3N2ItYWUwYjNlNWE3ODFl.jpg\" /></p><p>Trump’s early Fed replacement plans rattled markets, accelerating dollar losses and sending DXY to its lowest level since April 2022.</p>"
    },
    {
      "title": "How to read a stablecoin attestation report and why it matters",
      "link": "https://cointelegraph.com/news/how-to-read-a-stablecoin-attestation-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjM0MWMtNWYwYi03MWE0LTg4NzAtMzlmYjEwNWM4MzU1.jpg\" /></p><p>Knowing how to read a stablecoin attestation report isn’t just a skill; it’s your first line of defense when verifying what’s backing your stablecoins.</p>"
    },
    {
      "title": "DeFAI layer Edwin blends wallets and AI chatbot with terminal launch",
      "link": "https://cointelegraph.com/news/defai-layer-edwin-crypto-wallet-ai-chatbot-terminal-launch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FiNTQtNjMwYy03ZWNjLWE0ZjUtODk0OWUzNTk2OWIx.jpg\" /></p><p>The concept of integrating crypto wallets into chatbots for DeFi access and AI-driven trade execution is relatively new, industry observers say.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Hong Kong expands digital asset agenda with unified rules, tokenization push",
      "link": "https://cryptoslate.com/hong-kong-expands-digital-asset-agenda-with-unified-rules-tokenization-push/",
      "summary": "<p>Hong Kong released a second policy statement to accelerate its digital asset (DA) development and reinforce its ambition to become a global leader in financial innovation. The latest statement, dated June 26 and dubbed &#8220;Policy Statement 2.0,&#8221; expands on the framework laid out in its initial release from October 2022. According to the Hong Kong [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin miners hold firm as daily revenues hit multi-month lows of $34 million",
      "link": "https://cryptoslate.com/bitcoin-miners-hold-firm-as-daily-revenues-hit-multi-month-lows-of-34-million/",
      "summary": "<p>Bitcoin miners are holding onto their assets even as mining profitability dips to multi-month lows, a new CryptoQuant report shared with shows. The data reveals that miner revenues dropped to $34 million on June 22, marking their weakest earnings since April 20. &#160; This comes amid a broader market pullback and a drop in [&#8230;]</p> <p>"
    },
    {
      "title": "Kraken secures MiCA license via Central Bank of Ireland to ensure EU operations continue",
      "link": "https://cryptoslate.com/kraken-secures-mica-license-via-central-bank-of-ireland-to-ensure-eu-operations-continue/",
      "summary": "<p>Kraken has become the first major global crypto exchange to secure a full Markets in Crypto-Assets (MiCA) license through the Central Bank of Ireland, enabling the company to offer regulated digital asset services across all 30 European Economic Area (EEA) countries. The license, granted June 26, positions Kraken ahead of the European Union’s year-end MiCA [&#8230;]</p> <p>"
    },
    {
      "title": "World Liberty Financial readying to enable WLFI token transfers amid institutional interest",
      "link": "https://cryptoslate.com/world-liberty-financial-advances-wlfi-plans-amid-public-interest/",
      "summary": "<p>World Liberty Financial, the DeFi project part-owned by US President Donald Trump, has announced plans to enable transfers of its WLFI token. In a June 25 post on X, the team stated: &#8220;You asked to make WLFI transferable — we heard you. The team is working behind the scenes to make it happen.&#8221; The team [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet shares slide 5% as new buy flips Tesla in Bitcoin holdings",
      "link": "https://cryptoslate.com/new-metaplanet-buy-flips-tesla-in-bitcoin-holdings-as-shares-slide-5/",
      "summary": "<p>Japan-based Metaplanet has overtaken Tesla among corporate Bitcoin holders following its largest single purchase to date. On June 26, the firm confirmed that it acquired 1,234 BTC for approximately $132.7 million, paying an average of $107,557 per coin. This brings Metaplanet&#8217;s total Bitcoin holdings to 12,345 BTC, now worth about $1.33 billion based on current [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "$179,000 Or $79,000? Bitcoin Faces Critical Cycle Pivot, Says Analyst",
      "link": "https://www.newsbtc.com/bitcoin-news/179000-or-79000-bitcoin-critical-cycle-pivot/",
      "summary": "A popular crypto analyst has issued a stark cyclical warning that could define Bitcoin’s trajectory for the rest of the summer. Dr. Cat, known for his integrated use of Ichimoku Cloud analysis, Elliott Wave Theory, and proprietary time-cycle forecasting, posted an intricate scenario on X suggesting Bitcoin now stands at a pivotal inflection point—one that may ultimately determine whether the next major move is to $179,000 or back down to $79,000. Bitcoin Faces Make-or-Break Moment “If we set a daily high between the 25th and 27th of June,” Dr. Cat began, referencing the window derived from his Time Theory model, “and it turns out to be a lower high per the Wave Theory, then a lower low should follow.” The implications, however, go far beyond near-term downside. “If a lower low comes, we invalidate the weekly cycle which implies no bottom before mid-July to mid-August.” According to the forecast timeline, the earliest potential bottom would fall between July 14 and August 17, with a primary target range from July 28 to August 3, incorporating a ±2 week deviation. That timing model dovetails with the chart’s behavior around critical Ichimoku levels. Dr. Cat emphasized that Bitcoin is currently “making a bearish retest of the weekly Tenkan Sen,” adding that yesterday&#8217;s attempt to reclaim that level failed: “Price touched Tenkan Sen yesterday but I saw that it would open below it today.” Related Reading: Trump’s Truth Social Officialy Files For Bitcoin And Ethereum ETFs With NYSE The Tenkan Sen and Kijun Sen—two key lines in the Ichimoku system—are not just flat; they are structurally unconvincing despite a nominal 10% price advance. “This isn’t a real uptrend,” noted one user, to which Dr. Cat replied: “This is simply a neutral chart trying to flip bullish.” He elaborated that this neutrality means neither bullish nor bearish continuation is guaranteed, but warned that inaction or false optimism at this stage could expose traders to a cascading downside. One of the most significant technical levels lies just beneath current price. “The super key support of 93.2K (weekly Kijun Sen) is relatively close—and too close to hold if the time cycles play out,” Dr. Cat stated. A failure of that level would likely trigger a deeper reversion to the 3-week Kijun Sen, which remains unvisited and is currently positioned near $75K but rising. The entire bearish cascade remains “completely valid and with a very real chance of playing out,” unless Bitcoin manages to break above $110.6K after June 27. Such a move would invalidate both the time and wave-based lower-high structure and neutralize the scenario before it unfolds. But until then, Dr. Cat is urging traders to look beyond surface-level price movements. “Most people look at whether price goes up or down but don’t look at how it does it,” he said. Recalling his accurate bullish stance in April and May—when others were waiting for retracement—and his caution in early June, he emphasized the importance of reading the structure, not just the candles. Related Reading: Bitcoin Repeats Its 2021 Pattern—Analyst Warns Final Crash Still Ahead “The weekly chart was one candle away from a bullish TK cross, which would’ve implied big bullish continuation. But I waited. Then the market dumped,” he reminded followers. “Now it is relatively similar… dramatic reversals happen as close to invalidation as possible so everyone is tested and trapped to the limit.” In summary, Dr. Cat’s outlook remains balanced—but volatile. “I’m not telling you I can read the future,” he said. “I’m telling you that you need to distinguish neutral from bullish charts, which many people can’t—and suffer the consequences.” With time cycles converging and Ichimoku structures flashing indecision, Bitcoin now stands at a binary junction. The next high or low could lock in a multi-week trend, with targets as distant as $179K—or as painful as $79K—hanging in the balance. “This is simply a neutral chart trying to flip bullish. Which can certainly flip bullish pretty soon but until that happens I discuss whether first comes 179K or 79K with pretty much equal probability and I&#8217;m warning about an absolutely valid scenario which is on the table unless the chart flips bullish,” Dr. Cat concludes. At press time, BTC traded at $107,356. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Crypto ETF Race Heats Up, More Solana ETFs Planned as Snorter Bot Corners Market for Solana Memes",
      "link": "https://www.newsbtc.com/news/crypto-etf-race-heats-up-more-solana-etfs-planned-as-snorter-bot-corners-market/",
      "summary": "The SEC’s filing cabinet has to be pretty full these days, and their ‘paperwork pending’ stack is getting perilously high. Invesco Ltd and Galaxy Digital LP combined forces to offer another Solana-based exchange-traded fund (ETF). They filed the appropriate paperwork with the SEC and joined at least 12 other potential spot and future ETFs on the SEC to rule on their status. The competition for the leading $SOL ETF takes place at the most visible end of the crypto ecosystem. Far lower down, there’s a different race on, with Snorter poised to corner the market in the fast-paced world of Solana meme coins on Telegram. It’s two ends of the same spectrum and speaks to the growing strength and versatility of the Solana ecosystem. Invesco Galaxy Solana ETF Ready to List Why the race for a Solana ETF? Partly because of the tremendous success of Bitcoin and Ethereum ETFs: $IBIT: iShares Bitcoin Trust, $70.6B Assets Under Management (AUM) $FBTC: Fidelity Wise Origin Bitcoin Fund, $20.4B AUM $GBTC: Grayscale Bitcoin Trust, $19.6B AUM $ETHA: iShares Ethereum Trust, $3.9B AUM $ETHE: Grayscale Ethereum Trust, $2.8B AUM It’s no surprise that more players are ready to enter the game, particularly as the realms of traditional finance (TradFi) and decentralized finance (DeFi) move ever-closer together. Only $BTC and $ETH currently have single-asset crypto ETFs, but the pile of pending filings includes everything from $XRP to $SOL to the first-ever NFT ETF, with Pudgy Penguins ($PENGU). And with single-asset crypto ETFs rolling along, institutions aren’t waiting around for the SEC. They’ve already started to move towards multi-asset ETFs. Converting Existing Funds to Multi-Asset ETFs One of the holdups so far has been that the SEC lacks a clear set of rules around crypto ETFs, even after the $BTC and $ETH approvals went ahead. The question now is, will the SEC hold approvals until they draw up new rules? Or will they approve first and develop the rule set as they go? There is some time pressure at work here. Grayscale wants to convert its Digital Large Cap Fund (GDLC) to an ETF, and the deadline for that is July 2. That fund already holds a number of crypto assets, including $XRP, $SOL, and $ADA. If the conversion is approved, look for others to follow. Investment managers from Bitwise to Hasdex have plans to convert other funds to multi-asset ETFs that include cryptos. The funds sit at the top of the financial and investment world, and every one that gets approved boosts Solana’s long-term outlook just slightly. But much, much farther down, there’s another reason to be excited for Solana. The frenetic, fast-paced world of Solana meme coin trading just got a tool that could bring much-needed clarity and make finding those 10x or 100x opportunities much easier. Snorter Token ($SNORT) – One Bot to Rule Them All for Meme Coin Trading on Telegram What do you need to find and trade memes on Telegram? You need: Lightning-fast transactions and swaps Automated sniping, to get in and out at the right time Protection from rug pulls, honeypots, and front-running trades Thankfully, traders now have Snorter Bot, the meme coin-styled trading bot designed specifically for trading low-cap Solana memes on Telegram. The $SNORT token powers the bot, providing for rapid trade execution and the lowest fees possible. The project’s presale has already raised nearly $1.3M in a few weeks, indicating broad support. The roadmap includes launching the bot on Solana but expanding to EVM-compatible chains post-launch. In the meantime, the plans feature a token bridge and a built-in Telegram dashboard. No more avoiding Telegram tokens; traders can dive in with confidence with Snorter. Visit the Snorter website to learn more. Solana ETFs Mark the Next Stage of Crypto Adoption As plans proceed, even the rate of ETF filings indicates just how fast crypto adoption is moving. From Wall Street boardrooms to Telegram chats, Solana is becoming increasingly accessible to investors of every stripe. Keep an eye on Snorter, and another on the broader Solana ecosystem. But remember – always do your own research. This isn’t financial advice."
    },
    {
      "title": "XRP Bulls On Alert—’This Trendline Is Everything,’ Says Analyst",
      "link": "https://www.newsbtc.com/xrp-news/xrp-this-trendline-is-everything-analyst/",
      "summary": "XRP spent the past forty-eight hours coiling into a textbook inflection zone, and the 15-minute chart published by independent analyst Casi makes it hard to miss where the battle lines now stand. Price is hovering at $2.18, clinging to a steeply rising trendline that has underpinned every impulsive thrust since the local swing low near the 0.618 retracement at $1.9824 on 23 June. That trendline intersects a horizontal shelf of former resistance-turned-support at the 1.618 extension measured from the same base move, labelled on the chart at $2.186. The confluence forms the geometric “apex of consolidation” Casi has been highlighting on X. XRP Price At Breaking Point “This trendline is everything right now,” Casi wrote. “We just got a clean reaction off it. This correction already reached the .382 retracement at $2.145, which also happens to be the apex of consolidation… that’s the most critical level on the chart, short-term.” The most recent corrective pullback already tagged the 0.382 Fibonacci retracement of the advance, exactly at $2.145, before bulls forced a reaction. As long as candles continue to close above that retracement—effectively the floor of the micro-range—Casi argues that the underlying market structure remains constructive. A decisive break beneath $2.145, by contrast, would represent both a loss of the diagonal trendline and a surrender of the consolidation base, signalling short-term weakness and, in his words, “opening the door to a deeper flush.” Related Reading: XRP Pullback Nearly Complete—Next Stop: $8 To $12, Says Analyst Overhead, XRP must still reckon with layered resistance. The first ceiling sits at $2.20, but the level called out as “the next big test” is the thicker pink band at $2.25. That mark capped price repeatedly during yesterday’s U.S. session and coincides with a prior 1.272 extension of the late-May corrective leg. “If we can flip that level, we’ll likely open the path toward the $2.69 retrace test,” Casi noted, “and from there, the breakout potential increases dramatically!” If price can reclaim $2.25 on expanding volume and then retest it as support, the chart leaves an unobstructed lane toward the 2.618 extension at $2.296—effectively $2.30—and, by projection, the $2.69 Fibonacci target that would complete the measured-move roadmap Casi is tracking. Related Reading: XRP To $30 Beyond 2026? Analyst Reveals Key BTC Ratio To Watch Momentum, however, is not yet offering a clean green light. The lower pane shows a 14-period RSI capped by its own descending trendline that has compressed every rally since 24 June. With the oscillator printing 46.24 (signal) versus 43.59 (base line) at the time of the screenshot, the gauge is climbing but still mid-range. A marginal higher high in price paired with a lower high in RSI would etch a textbook bearish divergence—an outcome Casi told one follower he is “expecting to set up” if XRP pierces $2.25 before consolidating anew. “I think this next high will form a bearish div,” he added. “The RSI is telling me it’s about to set that up.” In short, the token is balanced on a knife-edge: the bull case hinges on the integrity of the $2.145–$2.186 support complex and a breakout through $2.25, while the bear case rests on trendline failure and an RSI divergence confirming upside exhaustion. With liquidity thinning into the weekend, the resolution of this narrow consolidation could shape the next wave—whether that proves to be the ignition of a larger third impulse or the start of a deeper corrective detour. As Casi put it, “This is the kind of price action you want to see if XRP is serious about continuing this new trend to the upside.” At press time, XRP traded at $2.19. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "The Ethereum Waiting Game: Breakout To $2,800 Or Crash To $2,000?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-breakout-to-2800/",
      "summary": "After suffering a major price crash back during the weekend, the Ethereum price has enjoyed an over 10% bounce that has put it back above major support levels. However, even with the recovery, the altcoin sits on shaky ground with geopolitical and macroeconomic factors still unstable. On the charts, there is also uncertainty as the second-largest cryptocurrency by market cap has failed to make any definitive moves from here, showing inconsistencies in movement. Ethereum Price Struggling At EMA Crypto analyst Swallow Academy noted that the Ethereum price has returned to trading at its Exponential Moving Average (EMA) earlier in the week after bouncing from its weekend lows. This has been referred to as the level of interest and sits around the $2,400 level, which has served as major support in the past. Related Reading: Analyst Says XRP Is Moving According To Plan, Here’s Why $1.90 Is Important The harsh drop from the weekend that pushed ETH from $2,500 to $2,150 has no doubt dented sentiment and sparked caution among investors. But the retest of the EMA at $2,400 suggests that buyers are still exerting their force and have been pushing up the price. Given these recent developments, the crypto analyst explains that it is currently a waiting game for the Ethereum price. From here, it could go either way, as confirmation is needed for which direction it is headed next. A breakout from here could move it back above the $2,800 resistance. However, a crash could be confirmation of rejection, sending Ethereum spiraling back toward lows at $2,000. Mapping Out Next Steps As the Ethereum price continues to show signs of continuation, crypto analysts have begun to map out where the altcoin might be headed next. Mister Spread pointed to the fact that Ethereum had actually shown a bullish Power of 3 (PO3), consisting of accumulation, deviation, and expansion. Related Reading: Ethereum Price Crash To $2,100 Triggers Fear, But Why Are Analysts Predicting A Rally To $6,000? The accumulation phase has been completed, and is now in the phase of deviation, explaining the price crash. Now, the price seems to already be breaking out of the deviation box, suggesting that the expansion phase will be coming sooner than expected. Once the expansion phase is in motion, the crypto analyst expects the Ethereum price to move back into the supply area of $2,800-$3,000. However, if the price fails to climb and falls back below $2,100, then this bullish thesis would be invalidated. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana Price At ‘A Very Delicate Level’ – Analyst Says $148 Reclaim Is Key",
      "link": "https://www.newsbtc.com/news/solana-price-at-a-very-delicate-level-analyst-says-148-reclaim-is-key/",
      "summary": "Despite recovering from the weekend retrace, Solana (SOL) is trading between two levels that could make or break the altcoin’s rally. Nonetheless, some analysts suggest that the cryptocurrency could be gearing up for a massive breakout beyond the local highs. Related Reading: Injective Prepares For Bullish Reversal Amid 25% Recovery – Analyst Forecasts Massive Breakout Solana Sits At Decisive Level On Wednesday, Solana fell to the $143 mark after failing to reclaim a crucial area lost over a week ago. Following the May breakout, the cryptocurrency hovered between the $148-$184 price range, hitting a four-month high of $187 at the end of last month. However, the June market pullback saw SOL lose its range and move toward the $144-$148 levels. This area was briefly lost during the weekend retrace, with Solana falling to the $125 support level before recovering. Over the past three days, the altcoin has surged nearly 15%, touching the $148 barrier on Wednesday morning, which has been one of the key levels since May. After recovering from the recent drop, SOL has attempted to reclaim this level, but was rejected once again. Analyst Sjuul from AltCryptoGems highlighted that Solana “just completed a very nice V-shaped recovery from the low,” but noted that the cryptocurrency is at a “very delicate level” as it trades within the $144-$148 zone. He suggested that investors should pay attention to this area, as a reclaim of the $148 resistance could propel the price to a “quick move to the upside.” On the contrary, rejection from this level and losing the $144 range low could signal that the recent price action was a bearish retest. Analyst Man of Bitcoin affirmed that a “sustained break above the resistance zone would be the first signal that the chart has formed a low. He detailed that a confirmed break above the $148 resistance would support the case for a reversal. Nonetheless, he warned that a potential scenario “with one more low in wave-5.” SOL Ready For A Rally Continuation? As price hovers between the $143-$144 levels, market watcher Altcoin Hunter considers that SOL is “dancing with the devil.” He pointed out that the cryptocurrency has been trading within a one-month falling wedge, with the $148-$150 rejection zone “coming in HOT.” Per"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "FHFA Orders to Recognize Bitcoin And Other Cryptos in Mortgage Assessments",
      "link": "https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FHFA-Orders-to-Recognize-Bitcoin-And-Other-Cryptos-in-Mortgage-Assessments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments\" rel=\"nofollow\"> </a></p> <p>Fannie Mae and Freddie Mac are now directed to treat properly documented Bitcoin and other crypto assets as part of borrower reserves for mortgages.</p> <p>"
    },
    {
      "title": "Kraken Secures MiCA License To Offer Bitcoin And Crypto In Europe",
      "link": "https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Becomes-First-Global-Bitcoin-Crypto-Platform-to-Secure-MiCA-License.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe\" rel=\"nofollow\"> </a></p> <p>The license allows Kraken to offer regulated bitcoin and crypto services across all 30 EEA countries.</p> <p>"
    },
    {
      "title": "GameStop Raising $450 Million From Convertible Senior Notes To Make Investments",
      "link": "https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/GameStop-Raising-450-Million-From-Convertible-Senior-Notes-To-Make-Investments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments\" rel=\"nofollow\"> </a></p> <p>GameStop boosts its convertible note offering to $2.7 billion, potentially for a Bitcoin allocation under its updated investment policy.</p> <p>"
    },
    {
      "title": "Mega Matrix Announces First Purchase Of 12 BTC For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Mega-Matrix-Announces-First-Purchase-of-12-BTC-for-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Mega Matrix Inc., a Singapore based holding company that operates the FlexTV streaming platform, announced today its first Bitcoin purchase as part of a new treasury strategy. The company acquired 12 Bitcoin at an average price of approximately $105,554 per coin, including all fees and expenses.&#160; The purchase, completed at the end of May 2025, [&#8230;]</p> <p>"
    },
    {
      "title": "Digital Commodities Secures $3 Million to Expand Bitcoin Holdings",
      "link": "https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Digital-Commodities-Secures-3-Million-to-Expand-Bitcoin-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings\" rel=\"nofollow\"> </a></p> <p>The company now holds two Bitcoin and is raising $3 million through a private placement to accelerate its Bitcoin treasury strategy.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Telegram Users Can Now Earn 'Institutional-Grade' Financial Rewards on Staked TON",
      "link": "https://decrypt.co/327081/telegram-users-earn-institutional-grade-financial-rewards-staked-ton",
      "summary": "A new collaboration between P2P.org and Ton Whales will allow Telegram users to earn rewards, starting with less than $30 worth of TON."
    },
    {
      "title": "Meta and OpenAI Use of Copyrighted Books for Training AI Was Fair Use: Federal Judge",
      "link": "https://decrypt.co/327137/meta-openai-copyrighted-books-ai-fair-use",
      "summary": "“These plaintiffs made the wrong arguments,” Judge Chhabria wrote, as he ruled Meta’s AI training on their copyrighted books was fair use."
    },
    {
      "title": "Kraken Becomes Latest to Win a License Under Europe's New Rules",
      "link": "https://decrypt.co/327112/kraken-license-europes-new-rules",
      "summary": "Approval from Ireland's central bank gives Kraken the ability to operate across 27 EU states as it races to catch up to rival Coinbase."
    },
    {
      "title": "ASIC Appoints Panel to Probe ASX Following Failed Blockchain Project",
      "link": "https://decrypt.co/327103/asic-appoints-panel-to-probe-asx-following-failed-blockchain-project",
      "summary": "The inquiry will assess the ASX’s governance, capability, and risk management frameworks across its group operations."
    },
    {
      "title": "ASX-Listed Biotech Firm Latest to Adopt a Bitcoin Strategy to Stay Afloat",
      "link": "https://decrypt.co/327099/asx-listed-biotech-firm-bitcoin-strategy",
      "summary": "Opyl is betting on the so-called Bitcoin treasury strategy to navigate its financial chop and follow recent examples set by others."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Galaxy Digital secures $175 million for first venture fund to back early-stage crypto startups",
      "link": "https://cryptobriefing.com/early-stage-crypto-startups-fund/",
      "summary": "<p>Galaxy Digital's venture fund expansion could accelerate innovation in crypto, bridging traditional finance and blockchain, impacting global markets.</p> <p>"
    },
    {
      "title": "Jumper Exchange integrates Etherlink for cross-chain access to Tezos L2",
      "link": "https://cryptobriefing.com/etherlink-integration-jumper-exchange/",
      "summary": "<p>The integration enhances cross-chain liquidity and accessibility, potentially accelerating adoption and innovation within the Tezos ecosystem.</p> <p>"
    },
    {
      "title": "Mortgage giants Fannie Mae, Freddie Mac directed to consider crypto as valid assets for home loan eligibility",
      "link": "https://cryptobriefing.com/fannie-mae-freddie-mac-crypto-mortgage-underwriting/",
      "summary": "<p>Integrating crypto assets into mortgage finance could broaden access to home loans, potentially reshaping financial inclusion and asset evaluation.</p> <p>"
    },
    {
      "title": "Fed’s Powell says Bitcoin and crypto have matured and become more mainstream",
      "link": "https://cryptobriefing.com/crypto-mainstream-adoption-fed/",
      "summary": "<p>The mainstreaming of crypto prompts regulatory reassessment, potentially reshaping financial policies and banking practices globally.</p> <p>"
    },
    {
      "title": "Starknet-based zkLend shuts down following exploit and ZEND token delisting from major exchanges",
      "link": "https://cryptobriefing.com/zklend-shutdown-zend-delisting/",
      "summary": "<p>The shutdown highlights the vulnerabilities in DeFi protocols and may deter investor confidence, impacting future decentralized finance projects.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Will crypto bills be delayed until 2026? – Senator Lummis shares insight",
      "link": "https://ambcrypto.com/will-crypto-bills-be-delayed-until-2026-senator-lummis-gives-insight/",
      "summary": "<img alt=\"Lummis on CLARITY &amp; GENIUS Act\" class=\"attachment-full size-full wp-post-image\" height=\"583\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lummis-on-CLARITY-GENIUS-Act.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1036\" />Political chess continues in D.C. as crypto bills inch closer. When will they be approved?"
    },
    {
      "title": "FUNToken’s Telegram Bot Gets a Major Upgrade With High-Stakes Spins",
      "link": "https://ambcrypto.com/funtokens-telegram-bot-gets-a-major-upgrade-with-high-stakes-spins/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"628\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/FUN-WOF-PR.jpeg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1200\" />FUNToken is taking its community experience to the next level with a massive upgrade to [&#8230;]"
    },
    {
      "title": "PEPE dips 30%, whale dumps 531B tokens – Can retail turn the tide?",
      "link": "https://ambcrypto.com/pepe-dips-30-whale-dumps-531b-tokens-can-retail-turn-the-tide/",
      "summary": "<img alt=\"Pepe\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-14-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Who’s right about PEPE’s next move? - Whales or retail traders."
    },
    {
      "title": "Bitcoin for home loans? FHFA approves crypto for mortgage reserves",
      "link": "https://ambcrypto.com/bitcoin-for-home-loans-fhfa-approves-crypto-for-mortgage-reserves/",
      "summary": "<img alt=\"Crypto loans Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/cryptohomeloansFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Market pundits viewed crypto reserves in home applications as a tailwind for BTC."
    },
    {
      "title": "What Alaskans Need to Know about Crypto Casinos",
      "link": "https://ambcrypto.com/what-alaskans-need-to-know-about-crypto-casinos/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"514\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-26-155751.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"779\" />Alaska finds itself in a peculiar position. You can invest in cryptocurrency here and pay [&#8230;]"
    }
  ]
}