{
  "CoinDesk": [
    {
      "title": "Bit Digital Exits BTC Mining to Focus Solely on ETH Staking Strategy",
      "link": "https://www.coindesk.com/markets/2025/06/25/bit-digital-exits-btc-mining-to-focus-solely-on-eth-staking-strategy",
      "summary": ""
    },
    {
      "title": "Bitcoin Rises Past $107K as FHFA's Pulte Orders Crypto Consideration in Mortgage Applications",
      "link": "https://www.coindesk.com/markets/2025/06/25/bitcoin-rises-past-107k-as-fhfas-pulte-orders-crypto-consideration-in-mortgage-applications",
      "summary": ""
    },
    {
      "title": "SoFi to Launch Blockchain Remittances With Stablecoins as Crypto Returns to Platform",
      "link": "https://www.coindesk.com/business/2025/06/25/sofi-to-launch-blockchain-remittances-with-stablecoins-as-crypto-returns-to-platform",
      "summary": ""
    },
    {
      "title": "Kalshi Joins Polymarket in Unicorn Club With Latest Fundraise: Report",
      "link": "https://www.coindesk.com/markets/2025/06/25/kalshi-joins-polymarket-in-unicorn-club-with-latest-fundraise-report",
      "summary": ""
    },
    {
      "title": "Bitdeer Raises $330M Via Convertible Note Sale",
      "link": "https://www.coindesk.com/markets/2025/06/25/bitdeer-raises-330m-via-convertible-note-sale",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Invesco Galaxy files for Solana ETF, 9 issuers now in the race",
      "link": "https://cointelegraph.com/news/invesco-galaxy-files-solana-etf-making-nine-bidders?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzMwZWYtYTE1Yy03MzA5LWJkZDYtOWRlZWEwOWIwYTVk.jpg\" /></p><p>Invesco and Galaxy Digital have filed the initial documents to launch a spot Solana ETF, making the ninth similar entry to be put before US regulators.</p>"
    },
    {
      "title": "ETH ETF flows impress, but Ether futures data suggest traders exercise caution",
      "link": "https://cointelegraph.com/news/eth-etf-flows-impress-but-ether-futures-data-suggest-traders-exercise-caution?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E5MDItNTA5Ny03MmE3LTkxYTYtMzNhZWQxZDVlYzNi.jpg\" /></p><p>Analysts are bullish on ETH’s long-term prospects and ETF inflows, but futures data paints a different picture.</p>"
    },
    {
      "title": "Prediction market Kalshi raises $185M at $2B valuation — Report",
      "link": "https://cointelegraph.com/news/prediction-market-kalshi-raises-185m-2b-valuation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5MzhkZDktMjE0MC03MzIwLTk3Y2YtNzgyNTkyMzMzYjFj.jpg\" /></p><p>Kalshi plans to use a portion of the funding to scale its technology team, CEO Tarek Mansour said.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Crypto exchange Kraken secures MiCA license in Ireland",
      "link": "https://cointelegraph.com/news/kraken-mica-license-ireland?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E4YWUtNTkwMC03MzU0LWFhNmQtOTkwOTRkOTIxN2Jh.jpg\" /></p><p>Several exchanges have announced MiCA licenses this year, following requirements being enforced in 2024 to offer digital asset services in the EU.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Iran and Israel spent over $25B during the ’12-day war,’ equivalent to 1% of total Bitcoin supply",
      "link": "https://cryptoslate.com/insights/iran-and-israel-spent-over-25b-during-the-12-day-war-equivalent-to-1-of-total-bitcoin-supply/",
      "summary": "<p>The Iran-Israel conflict reportedly cost the two nations roughly $25.5 billion, worth over 240,837 BTC at current prices, according to a report by Opportunity Cost, a digital tool that translates global spending into Bitcoin and Satoshi equivalents. According to the platform, Israel fired Arrow interceptor missiles, each costing around $3 million or 28.3 BTC, to counter Iranian missiles [&#8230;]</p> <p>"
    },
    {
      "title": "Binance Bitcoin inflows plunge to 5,700 BTC, less than 50% of the monthly average since 2020",
      "link": "https://cryptoslate.com/binance-bitcoin-inflows-plunge-to-5700-btc-less-than-50-of-the-monthly-average-since-2020/",
      "summary": "<p>Binance’s monthly Bitcoin (BTC) inflows have fallen to 5,700 BTC, less than half the 12,000 BTC average recorded since 2020 and 25% of the 24,000 BTC that hit the exchange during the FTX panic of late 2022, CryptoQuant analyst Darkfost shared in a June 24 note. Darkfost’s data showed that every material deposit surge of [&#8230;]</p> <p>"
    },
    {
      "title": "European Commission to ease rules on foreign stablecoins despite ECB opposition",
      "link": "https://cryptoslate.com/european-commission-to-ease-rules-on-foreign-stablecoins-despite-ecb-opposition/",
      "summary": "<p>The European Union is preparing to relax its stance on foreign-issued stablecoins, potentially allowing U.S. dollar-backed tokens like USDC and USDT to circulate freely within the bloc, the Financial Times reported on June 25. According to the report, the European Commission will soon issue formal guidance enabling stablecoins issued outside the EU to be treated [&#8230;]</p> <p>"
    },
    {
      "title": "US adopts crypto in mortgage risks as Fannie Mae and Freddie Mac update asset models",
      "link": "https://cryptoslate.com/us-adopts-crypto-in-mortgage-risks-as-fannie-mae-and-freddie-mac-update-asset-models/",
      "summary": "<p>US Federal Housing Finance Agency (FHFA) Director Willian J. Pulte ordered on June 25 that Fannie Mae and Freddie Mac treat cryptocurrency reserves as eligible assets when they measure risk on single-family mortgage loans, effective immediately. The two government-sponsored enterprises must draft plans that show how they will recognize borrower crypto holdings without first converting [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase launches Cardano and Litecoin wrapped tokens cbADA, cbLTC on Base",
      "link": "https://cryptoslate.com/coinbase-launches-cardano-and-litecoin-wrapped-tokens-cbada-cbltc-on-base/",
      "summary": "<p>Coinbase launched wrapped tokens for Cardano (cbADA) and Litecoin (cbLTC) on its Base layer-2 network, the exchange said in a June 25 post. Each synthetic token is backed 1:1 by the underlying asset held in Coinbase custody, and proof-of-reserves pages list the on-chain addresses securing the collateral. The transparency pages already show 11,364 LTC and [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Double Win: Dogwifhat Jumps 24% Alongside Bitcoin’s $107K Push",
      "link": "https://www.newsbtc.com/altcoin/double-win-dogwifhat-jumps-24-alongside-bitcoins-107k-push/",
      "summary": "In accordance with recent statistics, Dogwifhat (WIF) jumped 24% in the past 24 hours, moving above $0.85 as Bitcoin broke above $107,000. Traders observed a quick turnaround from levels below $0.72. Active wallets handling WIF jumped by 20%, and daily volume hit over $70 million. All those actions brought the Solana meme coin to within range of the $1.00 mark. Related Reading: Bitcoin Paces $15 Billion YTD Influx Amid 10-Week Fund Flow Streak Network Activity Shoots Up Based on reports, the Dogwifhat network saw a jump in trading volume to over $700 million in the past two days. That level of activity is rare for a token ranked 45th by market cap at about $1.75 billion. It now sits behind Dogecoin and Shiba Inu but outpaces fellow Solana names like FLOKI, PEPE and BONK. A sharp reversal off the $0.70 low got traders’ attention before the current uptick. wif just woke up from hibernation +up 24.1% today mcap: $865M 24h volume: $719M still the dog with the hat still barkin’ louder than the rest pic.twitter.com/RGJzSIJRBO — madmix 👻 (@madmixnum) June 24, 2025 Community Funds Billboards And Merch As per community posts, Dogwifhat holders have contributed funds for attention-grabbing billboards and special merchandise drops. Grassroots campaigns rolled out on social media channels, fueling renewed interest. That momentum helped to maintain volume levels over $70 million a day and continued to keep wallet counts rising. Support at $0.81 held firm when the rally began, giving buyers confidence. Technical Breakout Hints At More Gains Based on chart analysis, WIF broke out of a descending wedge on the 4-hour chart. That pattern formed over the past week before prices cleared the $0.83 level on higher trading volume. The Relative Strength Index sits near 60, below overbought territory, suggesting there’s still room to run. Traders now eye a move to $0.90, the next Fibonacci retracement. A push past $1.00 would be the strongest signal yet. Related Reading: Bunker Buster: Ethereum Titans Stake $100 Million Amid US-Iran Hostilities Bitcoin And Solana Link Remains Strong According to market watchers, WIF’s fate is tied to Bitcoin and the wider Solana ecosystem. Maintaining Bitcoin above $105,000 will be crucial for keeping momentum. Any pullback could force WIF back toward support at $0.77 or even the recent floor at $0.71. At the same time, new exchange listings or partnership news could stoke another leg higher. Risk Management Key For Traders According to trading guides, meme coins such as WIF bear large swings. Smart traders are encouraged to place tight stops and control position sizes. A retreat below $0.80 would be a call to exercise caution. In case support fails, prices can test the lower bands once again. But if the coin holds ground, a run at $1.00 could spark fresh buying. Featured image from Pexels, chart from TradingView"
    },
    {
      "title": "Bitcoin To Surge To $130,000 Next? What The Wave Count Says",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-to-surge-to-130000/",
      "summary": "After a week of volatile price action, Bitcoin has once again returned to familiar territory around the $106,000 price level. However, on-chain data shows that investors are still cautious, with the crypto Fear &#38; Greed Index now in the neutral zone. On the other hand, technical analysis of Bitcoin&#8217;s price action on the 4-hour candlestick timeframe chart shows that its price behavior has completed a significant correction, one that&#8217;s paving the way for a major rally to $130,000. Bitcoin’s Wave 2 Correction Might Be Complete According to XForceGlobal, a crypto analyst who posted a detailed Elliott Wave chart on the social platform X, Bitcoin’s recent correction fits neatly within a completed WXY pattern. The second wave, which started following the all-time high of $111,814 on May 22 and formed the corrective structure, has now retraced into the expected Fibonacci range between the 23.6% and 38.2% levels. Notably, the ideal minimum target for this correction move was in the $90,000 region, and Bitcoin fulfilled that condition with the pullback to just under $98,200 over the weekend. Related Reading: Bitcoin Elliott Wave Count Predicts Further Crash To $94,000, But What Next? The most important thing was in preserving the macro wave structure. Instead of drawing out a deeper pullback into the 0.618 to 0.886 Fibonacci levels, which is often characteristic of bear market retracements, the analysis maintains the idea that this was a wave 2 correction within a larger bullish impulse. This distinction is important. If the WXY correction is indeed complete and wave 2 has concluded, the next logical move in the Elliott Wave sequence is a third wave advance. According to Elliott Wave analysis, the third wave is often the most explosive in terms of price expansion. Its outcome could therefore push the price of Bitcoin to new heights that are significantly higher than its most recent all-time high. Why $130,000 Is A Realistic Target For Bitcoin The analyst&#8217;s technical projection on Bitcoin&#8217;s 4-hour candlestick timeframe chart shows an expected wave 3 trajectory extending beyond $111,800, with an expansion arrow reaching up above $130,000. This is the expansion move and is based on a similar projection of Wave 1. Related Reading: Bitcoin Bearish Move Is Over? Higher Lows Chart A Course To $115,482 In the accompanying chart, the analyst marks the key pivot zone between $98,000 and $102,000 as the Wave C termination area. If this zone indeed marks the completion of the second wave, the next movement would require validation through the formation of a clear 1-2 structure within Wave 3. This means that confirmation of the bullish count also depends on the price making a new local high above the current range and then pulling back without breaching the recent lows. If that structure plays out, then the market would likely be in the early stages of a powerful third wave. Bitcoin has already made an 8% price gain after it dropped to a low of $98,200 following U.S. airstrikes on Iranian nuclear sites. The most significant upward move came on Tuesday, June 24, when reports of a Middle East cease-fire pushed Bitcoin up roughly 4%. At the time of writing, Bitcoin is trading at $106,330. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Global M2 Can’t Predict Bitcoin Price, Says Quant Analyst",
      "link": "https://www.newsbtc.com/bitcoin-news/global-m2-cant-predict-bitcoin-price/",
      "summary": "Sina—co-founder of the hedge fund 21st Capital—publicly dismantled a popular Bitcoin price model promoted by Real Vision CEO Raoul Pal, calling it a textbook case of data illiteracy and overfitting. The model in question draws a close correlation between Bitcoin and Global M2—a measure of global money supply—by shifting M2 data forward by a set number of weeks, typically 10 to 12, to supposedly “predict” Bitcoin’s future price moves. Raoul Pal has used this chart to argue that macro liquidity conditions drive crypto cycles, and that the current market behavior can be forecast using monetary expansion. Expert Torches M2-Bitcoin Correlation But Sina, a trained data scientist who teaches data analytics at the undergraduate and graduate level, says this model collapses under scrutiny. “This is a terrible failure of not understanding overfitting,” he said in a June 24 video posted to X. “What I’m seeing doesn’t even pass the first month of a first-year data analytics course.” Related Reading: Bitcoin Poised For Rally As Geopolitical Tensions Ease And Inflation Expectations Fall Sina points out that the apparent correlation between Bitcoin and Global M2 only exists because the data has been “tortured” to fit historical patterns. “If I’m allowed to play with the data and arbitrarily move things around, I can definitely find great matches between pockets of data,” he said, warning that this flexibility is exactly what allows analysts to create the illusion of predictive accuracy. The primary issue, he explained, is that the Global M2 data itself is inherently flawed. It’s compiled by multiplying various central banks’ M2 figures by exchange rates—mixing fast-reporting economies like the US with countries that have data delays of weeks or even months. This creates a misleading impression of daily fluctuations in global liquidity. “It seems to be moving on a daily basis, but it’s actually mixing frequent and infrequent updates,” Sina said. “It’s not a true signal.” More importantly, Sina argues that the model fails the moment one zooms out from selective chart slices. While Raoul Pal and others have showcased examples of tightly aligned tops and bottoms between Bitcoin and Global M2, Sina demonstrated how minor tweaks in lead time or scale can yield dramatically different outcomes. “Let’s try a lead of 80 days. That doesn’t look good. What about 108? Ah, now the tops align—so let’s zoom in again and pretend it works,” he said sarcastically. “This is not modeling. This is playing.” Related Reading: Bitcoin Repeats Its 2021 Pattern—Analyst Warns Final Crash Still Ahead He highlighted how each adjustment to the model—shifting from a 12-week lead to 10 weeks, to 108 days—exposes its lack of systematic foundation. “If you don’t have a proper model, you fail to predict the future,” Sina said. “This is classic overfitting. You force the data to match historical behavior, but you lose any generalizability.” To illustrate the concept, Sina compared it to fitting a curve through a noisy sine wave. A well-structured model captures the core pattern and ignores noise. An overfit model, by contrast, attempts to match every small fluctuation—resulting in poor predictive performance when new data arrives. “Overfitting looks better, but it models noise. And noise doesn’t repeat,” he said. Sina also questioned whether Bitcoin might actually lead liquidity, not follow it. “If you look at the last cycle, Bitcoin topped first. Liquidity topped 145 days later,” he said. This reverses the causality implied by the Global M2 model and calls into question its entire premise as a forward-looking tool. His conclusion was blunt: “You have to be very careful with overfitting. It looks matching, but it’s forcibly fit on historical data. You have no idea about the predictive accuracy of this thing.” At press time, Bitcoin traded at $106,952. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Chainlink Reclaims Key Structure – Quiet Accumulation Could Fuel $25–$30 Surge",
      "link": "https://www.newsbtc.com/chainlink-news/chainlink-reclaims-key-structure-quiet-accumulation-could-fuel-25-30-surge/",
      "summary": "Chainlink (LINK) is up 21% from its Sunday lows, gaining momentum in an otherwise uncertain macro and geopolitical environment. While global tensions continue to spark volatility across markets, Chainlink has stood out for its resilience, supported by a series of strong partnerships and growing on-chain fundamentals. The recent price action signals a potential shift in trend, but analysts warn that a confirmed breakout is still needed before bulls can fully take over. Related Reading: Bitcoin Buy-Side Pressure Surges: Taker Buy Volume Spikes Sharply Top analyst Henry Lord of Alts highlighted that LINK has endured months of persistent downtrend and unusually quiet price behavior. However, recent moves suggest that something is changing beneath the surface. Volume is increasing, volatility is picking up, and LINK is forming a base structure that could mark the end of its accumulation phase. Despite this strength, Chainlink remains technically locked within a consolidation range. A clean breakout above key resistance levels will be critical to trigger the next phase of upward momentum. Until then, traders are cautiously optimistic as LINK teases a larger move. Chainlink Prepares For A Decisive Move Chainlink is currently trading over 25% below its May high, reflecting the broader market impact of rising macroeconomic uncertainty and geopolitical tensions, especially the recent Middle East conflicts. Despite these pressures, LINK has managed to hold within a steady consolidation range, signaling resilience as the crypto market awaits its next decisive move. Maintaining prices above current levels is crucial. A breakdown here could open the door for deeper corrections. However, analyst Henry believes the tides may be turning. According to Henry, Chainlink has endured months of downtrend and silence, but a structural shift is now underway. His analysis highlights that the long-standing downtrend has been broken, and LINK has entered a clear accumulation and consolidation phase. “These zones often come before the loudest moves,” Henry notes. Historically, such phases have preceded explosive rallies, and this time may be no different. If momentum picks up, a breakout toward the $25–$30 range wouldn’t be surprising. Henry also points out that periods of inactivity often mask the actions of smart money—buying quietly before the broader market catches on. While it’s easy to overlook assets during calm phases, that’s often when the groundwork for major moves is laid. For now, Chainlink remains on watch. Related Reading: Ethereum Whale Loads Up: $422M In ETH Bought In Under a Month LINK Price Analysis: Signs of Reversal Emerge Chainlink is showing early signs of a trend reversal after months of consistent decline. As seen in the 12-hour chart, LINK recently rebounded from the $11.50 level and is now trading above $13.20. This recovery follows a steep drop that marked a new local low, but the bounce has pushed the price above the 50-day simple moving average (SMA), now acting as short-term support at $13.50. Importantly, LINK is now testing the 100-day SMA (around $14.65), which previously served as resistance in late May and early June. If bulls manage to break and consolidate above this level, the next target lies near the 200-day SMA at $14.16—a confluence zone that may act as a critical decision point for trend continuation or rejection. Related Reading: Ethereum Holds Critical Support – $2,350 Level Could Define The Next Move While the macro structure remains bearish, this short-term accumulation range suggests growing demand, especially as the price begins to form higher lows. A clear break above $14.65 with volume could confirm the breakout and signal the start of a larger move toward the $17–$18 range. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Could Rally To $110,000 ATH As These Macroeconomic Factors Align",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-could-rally-to-110000/",
      "summary": "The Bitcoin price surge above $106,000 this week has reignited bullish sentiment across the market, with analysts suggesting that the stars are aligning for a rally to a new all-time high. From shifting geopolitical tensions to a major regulatory pivot in the United States (US), multiple macroeconomic factors appear to be setting the stage for Bitcoin’s next explosive move. Ceasefire And Rate Cut Buzz Fuel Bitcoin Price Optimism Over the weekend, the Bitcoin price briefly slipped, triggering over $200 million in leveraged long liquidations. However, this dip proved short-lived as the flagship cryptocurrency rebounded swiftly above $100,000 following US President Donald Trump’s announcement of a total ceasefire between Israel and Iran. This sudden de-escalation helped ease global market anxiety, pushing Bitcoin past $106,000 and oil prices sharply down from $77 to under $70. Related Reading: Crypto Pundit Reveals Why This Bitcoin Bull Market Feels Different As Crypto Enters ‘New Era’ Simultaneously, Optimism is building that the US Federal Reserve (FED) could begin cutting interest rates sooner than expected. Sharing new data by CME Group’s FedWatch Tool, crypto analyst CW disclosed that the odds of a FED rate cut have increased to 18.6% by July 30 during the scheduled FOMC meeting. The report reveals that 81.4% of market participants believe the FED to keep rates unchanged at their current level. However, FedWatch’s data indicates growing expectations for a rate cut by the September FOMC meeting, with 79% betting on a reduction and only 21.3% anticipating no change. Notably, lower interest rates generally benefit risk assets like Bitcoin by increasing liquidity and boosting investor sentiment. With geopolitical tensions easing and a possibly looser monetary policy on the horizon, Bitcoin could gain further momentum, potentially climbing to $110,000. Supporting this bullish forecast, crypto analyst Justin Bennett suggests that Bitcoin is gearing up for a rally toward a new ATH of $110,000 following its recent reclaim of the key $103,500 level. Although a retracement to around $102,500 remains possible, Bennett believes that once BTC cleans up support around $103,400, formed during Monday’s expansion, the next move could be parabolic. Regulatory Win Solidify Bitcoin’s Position In TradFi Beyond anticipated rate cuts and ceasefire announcements, the US FED recently made a landmark policy shift that could have profound long-term implications for Bitcoin and the broader crypto market. By removing “reputational risk” as a factor in evaluating crypto firms’ access to bank servicing, the FED is effectively ending a key pillar of Operation Checkpoint 2.0—a campaign that restricted over 30 crypto and fintech companies from traditional financial infrastructure. Related Reading: Bitcoin Price Deviates From Global M2 Money Supply, Is The Bull Run Over? This recent change clears the way for greater institutional involvement in crypto. The Office of the Comptroller of the Currency (OCC) and Federal Deposit Insurance Corporation (FDIC) have also followed suit, green-lighting crypto activities for banks and allowing them to participate in the digital assets market without prior approval. Together, these moves mark a regulatory pivot that not only legitimizes the crypto industry but could also accelerate demand and capital inflows into Bitcoin, potentially boosting its already significant valuation. Featured image from Pixabay, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "FHFA Orders to Recognize Bitcoin And Other Cryptos in Mortgage Assessments",
      "link": "https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FHFA-Orders-to-Recognize-Bitcoin-And-Other-Cryptos-in-Mortgage-Assessments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments\" rel=\"nofollow\"> </a></p> <p>Fannie Mae and Freddie Mac are now directed to treat properly documented Bitcoin and other crypto assets as part of borrower reserves for mortgages.</p> <p>"
    },
    {
      "title": "Kraken Secures MiCA License To Offer Bitcoin And Crypto In Europe",
      "link": "https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Becomes-First-Global-Bitcoin-Crypto-Platform-to-Secure-MiCA-License.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe\" rel=\"nofollow\"> </a></p> <p>The license allows Kraken to offer regulated bitcoin and crypto services across all 30 EEA countries.</p> <p>"
    },
    {
      "title": "GameStop Raising $450 Million From Convertible Senior Notes To Make Investments",
      "link": "https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/GameStop-Raising-450-Million-From-Convertible-Senior-Notes-To-Make-Investments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments\" rel=\"nofollow\"> </a></p> <p>GameStop boosts its convertible note offering to $2.7 billion, potentially for a Bitcoin allocation under its updated investment policy.</p> <p>"
    },
    {
      "title": "Mega Matrix Announces First Purchase Of 12 BTC For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Mega-Matrix-Announces-First-Purchase-of-12-BTC-for-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Mega Matrix Inc., a Singapore based holding company that operates the FlexTV streaming platform, announced today its first Bitcoin purchase as part of a new treasury strategy. The company acquired 12 Bitcoin at an average price of approximately $105,554 per coin, including all fees and expenses.&#160; The purchase, completed at the end of May 2025, [&#8230;]</p> <p>"
    },
    {
      "title": "Digital Commodities Secures $3 Million to Expand Bitcoin Holdings",
      "link": "https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Digital-Commodities-Secures-3-Million-to-Expand-Bitcoin-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings\" rel=\"nofollow\"> </a></p> <p>The company now holds two Bitcoin and is raising $3 million through a private placement to accelerate its Bitcoin treasury strategy.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "US Housing Chief Orders Fannie Mae, Freddie Mac to Prepare for Crypto Assessment in Mortgages",
      "link": "https://decrypt.co/327087/us-housing-head-orders-fannie-mae-freddie-mac-accept-crypto",
      "summary": "Under a directive from the FHFA, Fannie Mae and Freddie Mac were ordered to prepare for crypto mortgage payments."
    },
    {
      "title": "Solana, Pudgy Penguins ETF Filings Added to SEC's Crypto To-Do List",
      "link": "https://decrypt.co/327076/solana-pudgy-penguins-etf-filings-sec-crypto",
      "summary": "A proposal for a Solana ETF and a new fund tied to Pudgy Penguins tokens have joined a growing list of products offering crypto exposure."
    },
    {
      "title": "Google's AlphaGenome AI Makes DNA Readable—And It's on GitHub",
      "link": "https://decrypt.co/327050/google-alphagenome-makes-dna-readable-github",
      "summary": "AlphaGenome, accessible via API, cracks the “junk DNA” code, outperforms top rivals in key tests, and puts advanced genomics tools within reach of labs around the world."
    },
    {
      "title": "Prediction Market Kalshi Notches $2 Billion Valuation With $185 Million Raise",
      "link": "https://decrypt.co/327074/prediction-market-kalshi-2-billion-valuation-185-million-raise",
      "summary": "Kalshi achieved unicorn status following its latest Series C funding round, amid the prediction markets platform's growing crypto embrace."
    },
    {
      "title": "Will GameStop Buy More Bitcoin? GME Boosts Latest Fundraise to $2.7 Billion",
      "link": "https://decrypt.co/327068/will-gamestop-buy-more-bitcoin-gme-boosts-latest-fundraise",
      "summary": "GameStop raised another $450 million that it can use to buy Bitcoin, boosting its latest raise to $2.7 billion. Will it grab more BTC?"
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Mortgage giants Fannie Mae, Freddie Mac directed to consider crypto as valid assets for home loan eligibility",
      "link": "https://cryptobriefing.com/fannie-mae-freddie-mac-crypto-mortgage-underwriting/",
      "summary": "<p>Integrating crypto assets into mortgage finance could broaden access to home loans, potentially reshaping financial inclusion and asset evaluation.</p> <p>"
    },
    {
      "title": "Fed’s Powell says Bitcoin and crypto have matured and become more mainstream",
      "link": "https://cryptobriefing.com/crypto-mainstream-adoption-fed/",
      "summary": "<p>The mainstreaming of crypto prompts regulatory reassessment, potentially reshaping financial policies and banking practices globally.</p> <p>"
    },
    {
      "title": "Starknet-based zkLend shuts down following exploit and ZEND token delisting from major exchanges",
      "link": "https://cryptobriefing.com/zklend-shutdown-zend-delisting/",
      "summary": "<p>The shutdown highlights the vulnerabilities in DeFi protocols and may deter investor confidence, impacting future decentralized finance projects.</p> <p>"
    },
    {
      "title": "Banking giant Barclays to block all crypto transactions on credit cards over debt and fraud concerns",
      "link": "https://cryptobriefing.com/barclays-crypto-ban-cards/",
      "summary": "<p>Barclays' crypto credit card ban highlights growing financial institutions' caution, potentially influencing global regulatory approaches.</p> <p>"
    },
    {
      "title": "Blockchain venture Republic to offer digital tokens tracking shares of Elon Musk’s SpaceX",
      "link": "https://cryptobriefing.com/tokenized-private-shares-spacex/",
      "summary": "<p>Republic's token initiative could democratize access to high-value private firms, but regulatory hurdles may challenge its long-term viability.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "BNB daily activity drops off a cliff – How long before the price follows?",
      "link": "https://ambcrypto.com/bnb-daily-activity-drops-off-a-cliff-how-long-before-the-price-follows/",
      "summary": "<img alt=\"BNB daily activity drops off a cliff - How long before the price follows?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250625_123611_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB is facing downward pressure as on-chain sentiment deteriorates."
    },
    {
      "title": "Circle’s 620% rally snaps as Wall Street warns of stablecoin showdown",
      "link": "https://ambcrypto.com/circles-620-rally-snaps-as-wall-street-warns-of-stablecoin-showdown/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Circle-CRCL.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is Circle overvalued? Here's what sparked its recent cool-off."
    },
    {
      "title": "XRP ETF backed by VanEck soon? Sudden exchange outflows signal…",
      "link": "https://ambcrypto.com/xrp-etf-backed-by-vaneck-soon-sudden-exchange-outflows-signal/",
      "summary": "<img alt=\"XRP ETF backed by VanEck soon? Sudden exchange outflows signal...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-10.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Multiple exchanges see massive outflows, hinting at XRP accumulation by institutions."
    },
    {
      "title": "$250B in stablecoins: The untold altseason story behind this capital shift!",
      "link": "https://ambcrypto.com/250b-in-stablecoins-the-untold-altseason-story-behind-this-capital-shift/",
      "summary": "<img alt=\"Stablecoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-9-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Stablecoins swell to $250B as BTC dominance rises. When does the capital start moving?"
    },
    {
      "title": "Aptos spikes 15% – This ONE move could decide if APT hits $5.50",
      "link": "https://ambcrypto.com/aptos-spikes-15-this-one-move-could-decide-if-apt-hits-5-50/",
      "summary": "<img alt=\"Aptos [APT]\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-12-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With leverage stacking and $5 under siege, is this breakout real or a bull trap in disguise?"
    }
  ]
}