{
  "CoinDesk": [
    {
      "title": "ETH Holds Strong; Is It the ‘Digital Oil’ Powering the Global Digital Economy?",
      "link": "https://www.coindesk.com/markets/2025/06/15/eth-holds-strong-is-it-the-digital-oil-powering-the-global-digital-economy",
      "summary": ""
    },
    {
      "title": "Chart of the Week: Bitcoin's Summer Lull Still Offers 'Inexpensive' Trading Opportunity",
      "link": "https://www.coindesk.com/markets/2025/06/15/chart-of-the-week-bitcoin-s-summer-lull-still-offers-inexpensive-trading-opportunity",
      "summary": ""
    },
    {
      "title": "Shiba Inu Price Sell-Off Continues as SHIB Burn Rate Skyrockets to 112,000%",
      "link": "https://www.coindesk.com/markets/2025/06/15/shiba-inu-price-sell-off-continues-as-shib-burn-rate-skyrockets-to-112-000",
      "summary": ""
    },
    {
      "title": "Owning One Bitcoin Is the New American Dream, Says Bitwise Portfolio Manager",
      "link": "https://www.coindesk.com/markets/2025/06/15/owning-one-bitcoin-is-the-new-american-dream-says-bitwise-portfolio-manager",
      "summary": ""
    },
    {
      "title": "ADA Hovers Around $0.62 as New Enterprise Product Launch Offsets Whale-Driven Pressure",
      "link": "https://www.coindesk.com/markets/2025/06/14/ada-holds-usd0-62-as-new-enterprise-product-launch-offsets-whale-driven-pressure",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "AI race between US and China resembles Cold War — Marc Andreessen",
      "link": "https://cointelegraph.com/news/ai-race-between-us-china-cold-war-andreessen?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzc1NWYtMmFhNS03YzFlLTgxNDAtMzk5MTI1MDA4Y2Y5.jpg\" /></p><p>The venture capitalist warned that virtually all artificial intelligence platforms are being developed in either China or the United States.</p>"
    },
    {
      "title": "Bitcoin mining difficulty falls slightly from recent all-time high",
      "link": "https://cointelegraph.com/news/btc-mining-difficulty-falls-slightly-all-time-high?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmFmYzgtNTljMC03YmJiLWJmMjItYmFmYWQ0OTJjNGNh.jpg\" /></p><p>BTC miners continue to face economic headwinds and challenges, including gradually rising computational requirements to mine blocks.</p>"
    },
    {
      "title": "Bitcoin holds $105K as HYPE, AAVE, BCH, OKB aim to lead altcoins higher",
      "link": "https://cointelegraph.com/news/bitcoin-holds-105k-as-hype-aave-bch-okb-aim-to-lead-altcoins-higher?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzc0OGEtNDFmNi03YjU3LTgxMTctYWIzMjIzNjdmOTky.jpg\" /></p><p>Bitcoin trades above $105,000 even as the threat of war looms in the Middle East. HYPE, BCH, AAVE and OKB could also catch a bid if BTC holds its current range.</p>"
    },
    {
      "title": "Saylor signals impending Bitcoin purchase amid Israel-Iran conflict",
      "link": "https://cointelegraph.com/news/saylor-impending-bitcoin-purchase-israel-iran-conflict?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2YxMTItZjRkYS03NmYzLWFiMzctZjcxNmMwZDM3MjEz.jpg\" /></p><p>Strategy co-founder Michael Saylor hinted the company would purchase more Bitcoin on Monday when traditional financial markets open.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Ethereum at a crossroads: SSV founder Alon Muroch on the ‘dangerous’ divergence affecting crypto’s number 2 coin",
      "link": "https://cryptoslate.com/ethereum-at-a-crossroads-ssv-founder-alon-muroch-on-the-dangerous-divergence-affecting-cryptos-number-2-coin/",
      "summary": "<p>Welcome to Slate Sundays, ’s new weekly feature showcasing in-depth interviews, expert analysis, and thought-provoking op-eds that go beyond the headlines to explore the ideas and voices shaping the future of crypto. Alon Muroch is a man on a mission. As the founder of SSV Labs, which contributes to the second-largest Ethereum staking infra provider, SSV [&#8230;]</p> <p>"
    },
    {
      "title": "Data sovereignty can redefine the global economic markets",
      "link": "https://cryptoslate.com/data-sovereignty-can-redefine-the-global-economic-markets/",
      "summary": "<p>The following is a guest post and analysis from Trevor Koverko, Co-Founder at Sapien. The emergence of internet-enabled tech has transformed global trade and economics, as citizens, governments, and companies participate in borderless exchanges. Subsequently, data has become the lifeblood and primary fuel of businesses and societies worldwide, driving economic growth through shared values. In [&#8230;]</p> <p>"
    },
    {
      "title": "Taiwan tightens semiconductor export controls on Huawei and SMIC amid US-China tech rivalry",
      "link": "https://cryptoslate.com/taiwan-tightens-semiconductor-export-controls-on-huawei-and-smic-amid-us-china-tech-rivalry/",
      "summary": "<p>Taiwan has intensified its technology export controls by blacklisting two of China’s foremost semiconductor companies, Huawei Technologies and Semiconductor Manufacturing International Corp (SMIC), amid escalating tensions in the global tech sector. The updated Strategic High-Tech Commodities Entity List, released by Taiwan’s Ministry of Economic Affairs, now includes both firms along with several of their subsidiaries, [&#8230;]</p> <p>"
    },
    {
      "title": "AI is reinventing reality. Who is keeping it honest?",
      "link": "https://cryptoslate.com/ai-is-reinventing-reality-who-is-keeping-it-honest/",
      "summary": "<p>The following is a guest post and opinion from J.D. Seraphine, Founder and CEO of Raiinmaker. X’s Grok AI cannot seem to stop talking about “white genocide” in South Africa; ChatGPT has become a sycophant. We have entered an era where AI isn&#8217;t just repeating human knowledge that already exists—it seems to be rewriting it. [&#8230;]</p> <p>"
    },
    {
      "title": "Why I left Web2 for Web3 – and why you might, too",
      "link": "https://cryptoslate.com/why-i-left-web2-for-web3-and-why-you-might-too/",
      "summary": "<p>The following article is a guest post and opinion of Yurii Kovalchuk, Senior Blockchain Engineer at Forte Group. Three and a half years ago, I made a decision that completely changed the trajectory of my career. I left the familiar world of Web2 and stepped into the deep, chaotic, and exhilarating space of blockchain development. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Shiba Inu Burn Explodes 3,194%: Can It Change The SHIB Price Trajectory?",
      "link": "https://www.newsbtc.com/altcoin/shiba-inu-burn-explodes-3194-can-it-change-the-shib-price-trajectory/",
      "summary": "Shiba Inu has seen a surge in burn activity, with the burn rate climbing by 3,194% in the last 24 hours. According to data from burn tracker Shibburn, over 521.6 million SHIB tokens were permanently removed from circulation during this period. This sudden and sharp rise in burn rate has raised optimism within the SHIB community, although the token&#8217;s price action is struggling with bullish sentiment. Large Transactions Dominate SHIB Burn Activity As shown by data from Shiba Inu&#8217;s burn tracking website Shibburn.com, the latest burn wave was dominated by a few large transactions. A notable contributor was the wallet address beginning with &#8220;0xdb6,&#8221; which alone facilitated burns totaling over 500 million SHIB across multiple transactions to the BA-1 burn address. One of its largest single burns reached 310,744,788 SHIB, followed closely by another 107,333,061 SHIB, and then another 103,276,575 SHIB. Related Reading: Billionaire Snaps Up $100 Million Of Trump Coin – Details Other wallets also participated, including &#8220;0x28be&#8221; and &#8220;0x6176,&#8221; with each sending SHIB tokens into various burn addresses such as CA and BA-2. These contributions, although not on the same scale as the primary whale wallet, collectively helped elevate the day’s total burn count to over 521 million SHIB. Together, these burn events reflect a push within the Shiba Inu community to increase SHIB burns, which had otherwise been short of noteworthy burns in recent weeks. Despite Burn Efforts, SHIB Supply Still Faces Uphill Battle Although 521 million SHIB tokens is a significant figure for a single day, it barely makes a dent in the meme token’s vast circulating supply, which currently sits above 589 trillion SHIB tokens. This context relays the challenge faced by the current Shiba Inu tokenomics. Despite periods of aggressive burns like the one witnessed in the past 24 hours, the token’s massive supply continues to weigh on its long-term price appreciation goals. However, the spike in burn rate is still a positive signal, particularly from a sentiment standpoint, especially now that the Shiba Inu price is struggling with sentiment. With SHIB currently trading within a tight range between $0.00001225 and $0.0000119, more Shib burns in the rest of the new week could bode well for its price action moving forward. As of the time of writing, Shiba Inu is trading at $0.00001192, down by 1.7% in the last 24 hours. Despite the massive uptick in burn activity, market response is somewhat muted. However, there may be more happening behind the scenes. Related Reading: $57 Million In Crypto And Counting: Trump’s World Liberty Connection A Shiba Inu community member recently posted on the social media platform X, hinting that the project’s lead developer, Shytoshi Kusama, still has “several aces up his sleeve” for the Shiba Inu community. Although no further details were shared, past developments like the launch of Shibarium have influenced price trends. Hopefully, any new announcements could reignite interest and drive the Shiba Inu price token to new highs. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Amid Bitcoin Hype, Seasoned Trader Predicts Sudden Drop To This Level",
      "link": "https://www.newsbtc.com/news/bitcoin/amid-bitcoin-hype-seasoned-trader-predicts-sudden-drop-to-this-level/",
      "summary": "Bitcoin is at a crossroads again. Prices have been bouncing between $61,000 and $104,000 for about seven months. That range looks a lot like the $31,000–$64,000 sideways move before the sharp drop in early 2022. Traders and analysts are split over whether history is about to repeat itself or if fresh demand will keep Bitcoin aloft. Related Reading: Crypto Bloodbath: Over $1 Billion Liquidated As Iran-Israel Tensions Erupt Price Stuck In Familiar Range According to reports, Bitcoin’s stretch from $61k to $104k mirrors the 2020–2021 “distribution zone” when it traded between $31,000 and $64,000 for nearly a year. Back then, the slide came fast: Bitcoin peaked around $69,000 in November 2021, then sank to roughly $15,600 by November 2022. That was a nearly 78% plunge. Breakouts Keep Falling Flat Based on analysis from Michaël van de Poppe, Bitcoin tried and failed to stay above the $106k level this month. His chart showed a quick rejection at that barrier, triggering long‑side liquidations. The price slipped back to the $104k–$105k zone after the failed push higher. Traders see each unsuccessful breakout as a warning sign of distribution. November 2021 all over again? pic.twitter.com/lIA6QFhD9S — Peter Brandt (@PeterLBrandt) June 14, 2025 Risk Of Steep Slide According to veteran trader Peter Brandt, strong fundamentals often shine brightest right before a market top. He pointed out that if today’s setup leads to a similar 78% drop from the $105k band, Bitcoin could fall toward $23,600. His simple math recalls last cycle’s move from around $69k down to $15,500. Growing Demand Meets Technical Barriers Based on reports of spot ETFs and growing buys by institutions and governments, some believe the floor is firmer now. Huge investment flows into Bitcoin have never been higher. Yet technical hurdles remain. The inability to clear $105k makes some analysts cautious. Related Reading: $57 Million In Crypto And Counting: Trump’s World Liberty Connection Long Term Signals Still Bullish Trader Tardigrade noted that Bitcoin’s 50‑day and 200‑day simple moving averages recently formed a golden cross. In past cycles, that pattern led to gains of 50%, 125%, and 65%. It points to a possible rally if buyers step in around current levels. What It Means For Investors Bitcoin’s tug‑of‑war between caution and optimism is clear. On one side, pattern watchers warn of a big drop if support breaks. On the other, strong hands from big players may cushion any slide and spark a rally. Investors should keep an eye on $104k–$105k for signs of weakness or strength. A break below could open the door to a move toward $23,500. Conversely, a clean break above $106k might signal the next leg up. Regardless, volatility looks set to stay high, so risk management remains key. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Dormant Ethereum Wallet Awakens After 10 Years With Millions Worth Of ETH",
      "link": "https://www.newsbtc.com/altcoin/dormant-ethereum-wallet-awakens-after-10-years-with-millions-worth-of-eth/",
      "summary": "Ethereum has been consolidating around the $2,500 price level over the past few days, showing little momentum in either direction. The second-largest cryptocurrency by market cap has struggled to sustain a breakout above the $2,600 resistance zone, despite the inflows into Ethereum Spot ETFs last week. Related Reading: $57 Million In Crypto And Counting: Trump’s World Liberty Connection One event that has sparked interest, and possibly concern, among Ethereum holders is the reactivation of a dormant whale wallet holding millions worth of ETH. The sudden awakening of this long-inactive address raises questions about a potential selling pressure and its market impact. First Transaction From Dormant ETH Address Since 2015 On-chain tracker Whale Alerts was the first to report the reawakening of a pre-mined Ethereum address that had been inactive for nearly a decade. According to the large on-chain transaction tracker, the wallet, which held 2,000 ETH, initiated its last transaction 9.9 years ago. When the wallet last moved any funds in 2015, the entire stash was worth just $620. Today, that same amount is valued at over $5 million, making the owner’s profit roughly 820x based on current prices. At Ethereum&#8217;s all-time high price of $4,878 in 2021, the cryptocurrencies reached an unrealized gain of 1573x. 💤 A dormant pre-mine address containing 2,000 #ETH (5,063,918 USD) has just been activated after 9.9 years (worth 620 USD in 2015)!https://t.co/G0i8Rif0XX — Whale Alert (@whale_alert) June 14, 2025 The alert by Whale Alerts, which noted the first transaction after 9.9 years, involved the transfer of 0.0001 ETH from the whale address &#8220;0xcF26&#8221; to address &#8220;0x2C12,&#8221; which is a newly created ETH address. However, Etherscan&#8217;s on-chain transaction data reveals that the whale address sent 500 ETH into the newly created address shortly afterward. Following the string of transaction data from Etherscan shows that these 500 ETH eventually made their way into address &#8220;0x28C6,&#8221; which is known to be owned and controlled by crypto exchange Binance. This means that the 500 ETH may have already been sold through the exchange or are currently being prepared for liquidation. Brace For Impact: Will The Remaining 1,500 ETH Be Sold? As of now, the original whale address still holds approximately 1,500 ETH, currently valued at $3.796 million. However, it opens up the question of whether the rest of the funds will also be sold. Although we cannot be sure of a planned full liquidation, the pattern of the 500 ETH transfer and the involvement of an exchange address indicate that the possibility cannot be dismissed. Right now, Ethereum is in a fragile price action around the $2,500 price level. If more ETH is offloaded by the whale, the added selling pressure could make it even harder for Ethereum to break out of its current consolidation phase, especially if there isn&#8217;t enough buying pressure to absorb the ETH sold off. Related Reading: Billionaire Snaps Up $100 Million Of Trump Coin – Details At the time of writing, Ethereum is trading at $2,525. The past 24 hours were spent by Ethereum trading between $2,549 and $2,495. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "If Patience Had Value, XRP Holders Would Own The Market—Expert",
      "link": "https://www.newsbtc.com/altcoin/if-patience-had-value-xrp-holders-would-own-the-market-expert/",
      "summary": "In a recent market twist, XRP surged almost 600% between November 2024 and January 2025. Based on latest data, that rally made it the top performer among major cryptocurrencies during the US President Donald Trump-led market-wide upswing. Related Reading: Crypto Bloodbath: Over $1 Billion Liquidated As Iran-Israel Tensions Erupt According to market commentator John Squire, the real story is the seven years of setbacks that preceded this jump. “If patience was a crypto token, XRP holders would already be billionaires,” he said, pointing to the years of holding through crashes and legal fights. If patience was a token, $XRP holders would be billionaires already. 🧘‍♂️ — John Squire (@TheCryptoSquire) June 8, 2025 XRP Rallies As Markets Turn After a rough patch, XRP’s jump has caught many off guard. The coin rocketed from roughly $0.11 at the start of November 2024 to near $0.75 by the end of January 2025. Volume ticked up on most trading platforms, suggesting fresh money is pushing the price higher. Traders who stuck it out through years of mild gains and deep dips finally saw a payoff. Seven Years Of Price Struggles From March 2017 to January 2018, XRP shot up more than 68,000%, peaking at $3.84. Based on on‑chain data, that blistering run led to a brutal 97% slide by March 2020, when prices hit $0.1140. In November 2020, another bounce nearly doubled the price—but the US Securities and Exchange Commission lawsuit undercut that move, sending XRP down 67% in December 2020, its largest monthly loss ever. Holder Numbers Climb Amid Lawsuit Despite all that, the number of XRP holders kept growing. According to Santiment, about 986,000 wallets held XRP in January 2018. By December 2022, over 3.53 million new addresses had joined the network, pushing the total past 4.5 million. That surge of interest came even as many US and Canadian exchanges paused trading. It shows that newcomers and long‑time believers piled in while regulators and markets wrestled with the fallout. Recovery Faces Headwinds From Market Cycles While the latest rally is impressive, it comes against a mixed crypto backdrop. Bitcoin and Ethereum have shown uneven strength, and overall sentiment is cautious. Some traders warn that sharp gains can trigger profit‑taking events, especially if the wider market cools or if the SEC lawsuit sees new twists. Related Reading: $57 Million In Crypto And Counting: Trump’s World Liberty Connection Analysts Eye Bigger Gains Some voices in the space are setting high bars. Analyst BarriC recently said he isn’t satisfied selling at $2 after years of holding. His target? A lofty $100 for XRP. That would mean a market cap rivaling the biggest tokens today. Whether that happens depends on fresh adoption, legal clarity and broader crypto health. Featured image from inkl, chart from TradingView"
    },
    {
      "title": "Solaxy Presale Burns Red Hot as Whales Snatch $495K in Two Days: Best Presale Ends Tomorrow",
      "link": "https://www.newsbtc.com/news/solaxy-presale-burns-red-hot-as-whales-snatch-495k-in-two-days-best-presale-ends-tomorrow/",
      "summary": "With Solaxy ($SOLX) nearing the end of its presale stage, both anticipation for its listing and urgency among investors to grab the best altcoin at its lowest-ever price are higher than ever. Whale investors have gobbled up more than $500K worth of $SOLX tokens over the past 24 hours, taking Solaxy&#8217;s total presale raise to over $51M. Some of these include transactions worth $113K, $59K, and $58K. Keep reading to find out why the industry can&#8217;t keep their hands off Solana&#8217;s best crypto project yet and why buying the $SOLX presale now could be one of the smartest moves you make as a crypto investor. What&#8217;s the Hype About Solaxy? Solaxy is a new meme coin currently on presale, but it&#8217;s different from other meme cryptos in that it has a real-world application. It&#8217;s what the industry calls a utility token. $SOLX&#8217;s selling point is that it plans to restore Solana&#8217;s efficiency and performance by building the first-ever Layer 2 solution on the network. Despite its otherwise meme coin-tailored infrastructure, Solana was never designed to service a truckload of transaction requests at once. However, this is exactly what it has been asked to do ever since the launch of $TRUMP and $MELANIA, as well as other top trending cryptos. They flooded Solana with new investors. Thanks to Solaxy&#8217;s new L2, though, Solana&#8217;s mainnet will finally be able to breathe a sigh of relief. It will reduce the burden on the mainnet by offloading transactions onto a sidechain. As for the sidechain, think of it as an express lane on a busy highway (the L1), helping it service the extra traffic during peak hours. Optimizing Solana: Lower Fees Without Sacrificing Security In addition to creating a more scalable and efficient blockchain environment, Solaxy will also contribute to lowering investor costs on Solana. It will do so by bundling transactions into single, optimized batches. Essentially, this means that it will process multiple transactions in bulk rather than one by one, thereby lowering the cost per transaction. It&#8217;s also worth noting that Solaxy will revitalize Solana without compromising security. Its cutting-edge roll-up technology will validate the transactions on the network&#8217;s Layer 1. Solaxy&#8217;s Hyperlane Collaboration In its quest to ensure Solana occupies the center stage of the rapidly growing DeFi and Web3 space, Solaxy has joined hands with Hyperlane. Hyperlane, in case you didn&#8217;t know, is a Web3 infrastructure project that will help $SOLX make bridging (which means transferring tokens from one blockchain to another) between Solana and Ethereum easier, quicker, and more seamless. Developers, investors, and traders on Solana will, therefore, be able to transfer cryptos between Solana and Ethereum with as much ease as though they were using an everyday mobile app. And consider the enrichment this will bring to Solana and its users. Not only does Ethereum have a lot more liquidity than Solana, but it also has a huge network (over 10x that of Solana) of decentralized applications, with over 5K dApps live right now. Solaxy Presale: Your Last Chance at 11,200% Gains As mentioned earlier, Solaxy&#8217;s presale, which is currently ongoing (over $51M in funding as of now), has generated a lot of buzz among both crypto whales and retail investors alike. Solaxy&#8217;s presale officially kicked off in December 2024, with an initial per-token price of just $0.001. Through multiple presale rounds, however, one $SOLX currently stands at $0.00176. So, had you joined the best crypto presale while it was brand-new, you&#8217;d have already seen a nifty 76% increase in your investment. However, you can let bygones be bygones and make it up to your crypto portfolio by buying into the Solaxy presale now. According to our $SOLX price prediction, the token can reach a whopping $0.20 by 2030. This means you can eke out a brain-melting 11,200% return (calculated from current prices) on your investment. Here&#8217;s the most important piece of information, though: Solaxy&#8217;s presale ends in less than 24 hours from now, so this is really your last chance to grab potentially the next crypto to explode before&#8230;it explodes. Real Utility, Big Ambitions, and a Limited-Time Offer Backed by real utility, a Hyperlane partnership that promises to make it more than just a scaling tool, and bold price forecasts, Solaxy ($SOLX) could be crypto&#8217;s next big thing. Don’t sit this one out; invest in Solaxy before the presale ends tomorrow. One token is currently selling for just $0.00176. However, bear in mind that investments in crypto are highly risky. This article isn&#8217;t financial advice, and we urge you to do your own research before investing."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Layer 2: Statechains",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Statechains-fotor-20250613161023.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains\" rel=\"nofollow\"> </a></p> <p>The second article in the Bitcoin Layer 2 series. This article covers Statechains, originally designed by Ruben Somsen, and implemented by CommerceBlock.</p> <p>"
    },
    {
      "title": "Pakistan’s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?",
      "link": "https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Pakistan-Bitcoin-Reserve.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation\" rel=\"nofollow\">Pakistan&#8217;s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?</a></p> <p>A strategic Bitcoin reserve is a step in the right direction for Pakistan, but only mass adoption will truly unlock the immense potential Bitcoin can offer.</p> <p>"
    },
    {
      "title": "The 30,000-Foot View of the Oslo Freedom Forum",
      "link": "https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Oslo-Freedom-Forum.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum\" rel=\"nofollow\"> </a></p> <p>Stories of courage and repression, and the tools defending civil liberties at the 17th Annual Oslo Freedom Forum in Norway.</p> <p>"
    },
    {
      "title": "UK Gold Mining Company Bluebird to Convert Gold Revenues into Bitcoin",
      "link": "https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/UK-Gold-Mining-Company-Bluebird-to-Convert-Gold-Revenues-into-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bluebird Mining Ventures Ltd. will adopt bitcoin as a treasury reserve asset and convert future gold revenues into Bitcoin.</p> <p>"
    },
    {
      "title": "JPMorgan Reports Record Profits for Bitcoin Miners in Q1",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-MORGAN.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1\" rel=\"nofollow\"> </a></p> <p>Bitcoin mining companies in the U.S. have kicked off 2025 with record performance, according to a recent report. The first quarter of the year was “one of Bitcoin miners&#8217; best quarters to date,” analysts Reginald Smith and Charles Pearce stated.&#160; &#8220;Four of the five operators in our coverage reported record revenue and profits,&#8221; the report [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "This Week in Crypto Games: Dogecoin Got Game, FIFA Rivals Launches",
      "link": "https://decrypt.co/325277/this-week-crypto-games-dogecoin-gaming-fifa-rivals",
      "summary": "Dogecoin is about to get a slew of games via DogeOS and PlaysOut, FIFA Rivals is live on mobile, and more from the crypto gaming world."
    },
    {
      "title": "Bitcoin DeFi Is Taking Root on Sui—Here’s How It Works",
      "link": "https://decrypt.co/325274/bitcoin-defi-taking-root-sui-heres-how-works",
      "summary": "Bitcoin integrations are growing across the Sui network, providing more use cases for BTC holders. Here's how BTCfi works on Sui."
    },
    {
      "title": "5 Prompts That Make Anthropic's Claude AI Better Than a Crypto Analyst, Broker or Doctor",
      "link": "https://decrypt.co/324265/5-prompts-make-anthropic-claude-ai-better-crypto-analyst-broker-doctor",
      "summary": "Think Anthropic’s Claude AI isn’t worth the subscription? These five advanced prompts unlock its power—delivering expert-grade investment reports, lab result analysis, travel plans, and more."
    },
    {
      "title": "AI Deepfakes Drove 40% of High-Value Crypto Fraud Last Year: Report",
      "link": "https://decrypt.co/325152/ai-deepfakes-drove-high-value-frauds-report",
      "summary": "Bitget says that $4.6 billion in crypto was lost to scams in 2024, with much of that attributed to AI-generated deepfakes."
    },
    {
      "title": "Trump Strategist Outlines How Bitcoin Helped Republicans Win the 2024 Election",
      "link": "https://decrypt.co/325187/trump-strategist-how-bitcoin-helped-republicans-win-2024-election",
      "summary": "Trump ally Chris LaCivita said at Coinbase’s Crypto Summit that the Republican Party recognized the importance of the crypto community."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Polyhedra Network’s ZKJ token crashes over 80% after Binance Alpha LPs reportedly pull liquidity",
      "link": "https://cryptobriefing.com/zkj-token-crash-after-liquidity-withdrawals/",
      "summary": "<p>The ZKJ token's crash highlights the vulnerability of crypto markets to liquidity shifts, impacting investor confidence and market stability.</p> <p>"
    },
    {
      "title": "Bybit to launch Byreal, its first onchain DEX on Solana, on June 30",
      "link": "https://cryptobriefing.com/byreal-on-solana-dex/",
      "summary": "<p>Bybit's launch of Byreal on Solana signifies a strategic shift towards hybrid finance, potentially reshaping the DeFi landscape.</p> <p>"
    },
    {
      "title": "Invesco, Galaxy Digital file to launch Solana ETF in Delaware amid SEC approval buzz",
      "link": "https://cryptobriefing.com/solana-etf-sec-approval/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional interest and investment in the Solana blockchain ecosystem.</p> <p>"
    },
    {
      "title": "Cardano founder Charles Hoskinson proposes converting $100M ADA to Bitcoin and stablecoins",
      "link": "https://cryptobriefing.com/cardano-treasury-conversion-proposal/",
      "summary": "<p>Hoskinson's proposal could enhance Cardano's DeFi competitiveness, potentially increasing its market share and attracting more developers.</p> <p>"
    },
    {
      "title": "Amazon, Walmart, and Expedia consider issuing stablecoins to sidestep costly card fees: WSJ",
      "link": "https://cryptobriefing.com/retailers-embrace-stablecoins/",
      "summary": "<p>Retailers' stablecoin adoption could revolutionize payment systems, enhance cash flow, and challenge traditional financial networks.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin’s tug of war: Whale bets $200M as shorts stack to $1B – What next?",
      "link": "https://ambcrypto.com/bitcoins-tug-of-war-whale-bets-200m-as-shorts-stack-to-1b-what-next/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-8.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With a huge BTC long position from Bybit's top trader, can BTC see a new ATH?"
    },
    {
      "title": "Ethereum bears lose ground, but ETH bulls may not be safe just yet!",
      "link": "https://ambcrypto.com/ethereum-bears-lose-ground-but-eth-bulls-may-not-be-safe-just-yet/",
      "summary": "<img alt=\"ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-22.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum rebounds with a $500 million short squeeze, as rising exchange inflows and leverage hint at more turbulence."
    },
    {
      "title": "Crypto market’s weekly winners and losers – AB, AERO, DEXE, KAS",
      "link": "https://ambcrypto.com/crypto-market-weekly-review-14-june/",
      "summary": "<img alt=\"Crypto weekly winners and losers\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-8.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" /> Here's how some of your favorites wrapped up the week."
    },
    {
      "title": "BNB defends $640 – With active users at an ATH, is $674 in sight?",
      "link": "https://ambcrypto.com/bnb-defends-640-as-active-users-hit-ath-is-674-within-reach/",
      "summary": "<img alt=\"BNB: Bots vs. genuine growth – How Binance coin defied geopolitical woes\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-22.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB adoption surges as non-sybil users hit a new all-time high of 1.7 million."
    },
    {
      "title": "Leverage, liquidity & longs: The altcoin rally setup no one sees coming",
      "link": "https://ambcrypto.com/leverage-liquidity-longs-the-altcoin-rally-setup-no-one-sees-coming/",
      "summary": "<img alt=\"Altcoins\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-7.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Altcoin optimism returns - But is it too soon?"
    }
  ]
}