{
  "CoinDesk": [
    {
      "title": "What's Driving SEI Prices as Token Soars 50% in a Week",
      "link": "https://www.coindesk.com/markets/2025/06/26/whats-driving-sei-prices-as-token-soars-50-in-a-week",
      "summary": ""
    },
    {
      "title": "Semler Scientific Trades at Premium to Bitcoin Holdings for First Time in Three Weeks",
      "link": "https://www.coindesk.com/markets/2025/06/26/semler-scientific-trades-at-premium-to-bitcoin-holdings-for-first-time-in-three-weeks",
      "summary": ""
    },
    {
      "title": "Australia’s Securities Regulator to Probe ASX After Collapsed Blockchain Project",
      "link": "https://www.coindesk.com/policy/2025/06/26/australias-securities-regulator-to-probe-asx-after-collapsed-blockchain-project",
      "summary": ""
    },
    {
      "title": "Crypto Exchange Kraken Wins MiCA License in Ireland",
      "link": "https://www.coindesk.com/policy/2025/06/26/crypto-exchange-kraken-wins-mica-license-in-ireland",
      "summary": ""
    },
    {
      "title": "Coinbase Brings Wrapped Cardano, Litecoin to Base With cbADA, cbLTC",
      "link": "https://www.coindesk.com/markets/2025/06/26/coinbase-brings-wrapped-cardano-litecoin-to-base-with-cbada-cbltc",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Galaxy Digital raises $175M in first fund to expand crypto investments",
      "link": "https://cointelegraph.com/news/galaxy-digital-closes-175m-crypto-venture-fund?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWNjZjMtOTdkMC03N2E3LTljZjUtNWU5YThlYzQ5YjQ2.jpg\" /></p><p>Galaxy Digital raises $175 million for its first externally backed venture fund, targeting early-stage crypto startups.</p>"
    },
    {
      "title": "Hong Kong reveals new stablecoin rules and tokenized bond plans",
      "link": "https://cointelegraph.com/news/stablecoin-licensing-tokenization-hong-kong-crypto-policy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2EwNjYtODg3Ni03YjkzLTlmYTktMzcyOWM3YWJkZjUz.jpg\" /></p><p>Hong Kong updated its digital asset strategy regarding stablecoin licensing and tokenization of real-world assets by introducing its LEAP framework for market growth.</p>"
    },
    {
      "title": "Pi Network token spikes 38% on AI plans, Google partnership rumors",
      "link": "https://cointelegraph.com/news/pi-network-google-ai-rumors-pi2day-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FiMzYtODM1Ny03MDQ3LWJmZjUtMmE1MDMwNTI5YzY3.jpg\" /></p><p>Pi Network’s token surged 38% as talk of an AI partnership with Google spread ahead of the project’s upcoming Pi2Day event announcement on Saturday.</p>"
    },
    {
      "title": "Japan’s Metaplanet buys 1,234 BTC, now holds more than Tesla",
      "link": "https://cointelegraph.com/news/metaplanet-bitcoin-holdings-overtakes-tesla-after-latest-1-234-btc-buy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FiMmMtYmQ3MC03ZGI1LWFhMjQtZDY2MmZmNWJjMjIx.jpg\" /></p><p>Metaplanet has overtaken Tesla in corporate Bitcoin holdings, buying 1,234 BTC and bringing its total to 12,345 BTC as it eyes more expansion.</p>"
    },
    {
      "title": "Trump-backed World Liberty to release stablecoin audit, make WLFI transferable",
      "link": "https://cointelegraph.com/news/trump-crypto-platform-wlfi-transferable-stablecoin-audit?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FiMjQtN2RiYi03ZmIxLWI4ZTktOThjOWExZGNiMDA5.jpg\" /></p><p>World Liberty Financial, the Trump-backed crypto venture, is preparing to publish its first stablecoin audit and may enable WLFI token transfers.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "World Liberty Financial readying to enable WLFI token transfers amid institutional interest",
      "link": "https://cryptoslate.com/world-liberty-financial-advances-wlfi-plans-amid-public-interest/",
      "summary": "<p>World Liberty Financial, the DeFi project part-owned by US President Donald Trump, has announced plans to enable transfers of its WLFI token. In a June 25 post on X, the team stated: &#8220;You asked to make WLFI transferable — we heard you. The team is working behind the scenes to make it happen.&#8221; The team [&#8230;]</p> <p>"
    },
    {
      "title": "New Metaplanet buy flips Tesla in Bitcoin holdings as shares slide 5%",
      "link": "https://cryptoslate.com/new-metaplanet-buy-flips-tesla-in-bitcoin-holdings-as-shares-slide-5/",
      "summary": "<p>Japan-based Metaplanet has overtaken Tesla among corporate Bitcoin holders following its largest single purchase to date. On June 26, the firm confirmed that it acquired 1,234 BTC for approximately $132.7 million, paying an average of $107,557 per coin. This brings Metaplanet&#8217;s total Bitcoin holdings to 12,345 BTC, now worth about $1.33 billion based on current [&#8230;]</p> <p>"
    },
    {
      "title": "Iran and Israel spent over $25B during the ’12-day war,’ equivalent to 1% of total Bitcoin supply",
      "link": "https://cryptoslate.com/insights/iran-and-israel-spent-over-25b-during-the-12-day-war-equivalent-to-1-of-total-bitcoin-supply/",
      "summary": "<p>The Iran-Israel conflict reportedly cost the two nations roughly $25.5 billion, worth over 240,837 BTC at current prices, according to a report by Opportunity Cost, a digital tool that translates global spending into Bitcoin and Satoshi equivalents. According to the platform, Israel fired Arrow interceptor missiles, each costing around $3 million or 28.3 BTC, to counter Iranian missiles [&#8230;]</p> <p>"
    },
    {
      "title": "Binance Bitcoin inflows plunge to 5,700 BTC, less than 50% of the monthly average since 2020",
      "link": "https://cryptoslate.com/binance-bitcoin-inflows-plunge-to-5700-btc-less-than-50-of-the-monthly-average-since-2020/",
      "summary": "<p>Binance’s monthly Bitcoin (BTC) inflows have fallen to 5,700 BTC, less than half the 12,000 BTC average recorded since 2020 and 25% of the 24,000 BTC that hit the exchange during the FTX panic of late 2022, CryptoQuant analyst Darkfost shared in a June 24 note. Darkfost’s data showed that every material deposit surge of [&#8230;]</p> <p>"
    },
    {
      "title": "European Commission to ease rules on foreign stablecoins despite ECB opposition",
      "link": "https://cryptoslate.com/european-commission-to-ease-rules-on-foreign-stablecoins-despite-ecb-opposition/",
      "summary": "<p>The European Union is preparing to relax its stance on foreign-issued stablecoins, potentially allowing U.S. dollar-backed tokens like USDC and USDT to circulate freely within the bloc, the Financial Times reported on June 25. According to the report, the European Commission will soon issue formal guidance enabling stablecoins issued outside the EU to be treated [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Crypto ETF Race Heats Up, More Solana ETFs Planned as Snorter Bot Corners Market for Solana Memes",
      "link": "https://www.newsbtc.com/news/crypto-etf-race-heats-up-more-solana-etfs-planned-as-snorter-bot-corners-market/",
      "summary": "The SEC’s filing cabinet has to be pretty full these days, and their ‘paperwork pending’ stack is getting perilously high. Invesco Ltd and Galaxy Digital LP combined forces to offer another Solana-based exchange-traded fund (ETF). They filed the appropriate paperwork with the SEC and joined at least 12 other potential spot and future ETFs on the SEC to rule on their status. The competition for the leading $SOL ETF takes place at the most visible end of the crypto ecosystem. Far lower down, there’s a different race on, with Snorter poised to corner the market in the fast-paced world of Solana meme coins on Telegram. It’s two ends of the same spectrum and speaks to the growing strength and versatility of the Solana ecosystem. Invesco Galaxy Solana ETF Ready to List Why the race for a Solana ETF? Partly because of the tremendous success of Bitcoin and Ethereum ETFs: $IBIT: iShares Bitcoin Trust, $70.6B Assets Under Management (AUM) $FBTC: Fidelity Wise Origin Bitcoin Fund, $20.4B AUM $GBTC: Grayscale Bitcoin Trust, $19.6B AUM $ETHA: iShares Ethereum Trust, $3.9B AUM $ETHE: Grayscale Ethereum Trust, $2.8B AUM It’s no surprise that more players are ready to enter the game, particularly as the realms of traditional finance (TradFi) and decentralized finance (DeFi) move ever-closer together. Only $BTC and $ETH currently have single-asset crypto ETFs, but the pile of pending filings includes everything from $XRP to $SOL to the first-ever NFT ETF, with Pudgy Penguins ($PENGU). And with single-asset crypto ETFs rolling along, institutions aren’t waiting around for the SEC. They’ve already started to move towards multi-asset ETFs. Converting Existing Funds to Multi-Asset ETFs One of the holdups so far has been that the SEC lacks a clear set of rules around crypto ETFs, even after the $BTC and $ETH approvals went ahead. The question now is, will the SEC hold approvals until they draw up new rules? Or will they approve first and develop the rule set as they go? There is some time pressure at work here. Grayscale wants to convert its Digital Large Cap Fund (GDLC) to an ETF, and the deadline for that is July 2. That fund already holds a number of crypto assets, including $XRP, $SOL, and $ADA. If the conversion is approved, look for others to follow. Investment managers from Bitwise to Hasdex have plans to convert other funds to multi-asset ETFs that include cryptos. The funds sit at the top of the financial and investment world, and every one that gets approved boosts Solana’s long-term outlook just slightly. But much, much farther down, there’s another reason to be excited for Solana. The frenetic, fast-paced world of Solana meme coin trading just got a tool that could bring much-needed clarity and make finding those 10x or 100x opportunities much easier. Snorter Token ($SNORT) – One Bot to Rule Them All for Meme Coin Trading on Telegram What do you need to find and trade memes on Telegram? You need: Lightning-fast transactions and swaps Automated sniping, to get in and out at the right time Protection from rug pulls, honeypots, and front-running trades Thankfully, traders now have Snorter Bot, the meme coin-styled trading bot designed specifically for trading low-cap Solana memes on Telegram. The $SNORT token powers the bot, providing for rapid trade execution and the lowest fees possible. The project’s presale has already raised nearly $1.3M in a few weeks, indicating broad support. The roadmap includes launching the bot on Solana but expanding to EVM-compatible chains post-launch. In the meantime, the plans feature a token bridge and a built-in Telegram dashboard. No more avoiding Telegram tokens; traders can dive in with confidence with Snorter. Visit the Snorter website to learn more. Solana ETFs Mark the Next Stage of Crypto Adoption As plans proceed, even the rate of ETF filings indicates just how fast crypto adoption is moving. From Wall Street boardrooms to Telegram chats, Solana is becoming increasingly accessible to investors of every stripe. Keep an eye on Snorter, and another on the broader Solana ecosystem. But remember – always do your own research. This isn’t financial advice."
    },
    {
      "title": "XRP Bulls On Alert—’This Trendline Is Everything,’ Says Analyst",
      "link": "https://www.newsbtc.com/xrp-news/xrp-this-trendline-is-everything-analyst/",
      "summary": "XRP spent the past forty-eight hours coiling into a textbook inflection zone, and the 15-minute chart published by independent analyst Casi makes it hard to miss where the battle lines now stand. Price is hovering at $2.18, clinging to a steeply rising trendline that has underpinned every impulsive thrust since the local swing low near the 0.618 retracement at $1.9824 on 23 June. That trendline intersects a horizontal shelf of former resistance-turned-support at the 1.618 extension measured from the same base move, labelled on the chart at $2.186. The confluence forms the geometric “apex of consolidation” Casi has been highlighting on X. XRP Price At Breaking Point “This trendline is everything right now,” Casi wrote. “We just got a clean reaction off it. This correction already reached the .382 retracement at $2.145, which also happens to be the apex of consolidation… that’s the most critical level on the chart, short-term.” The most recent corrective pullback already tagged the 0.382 Fibonacci retracement of the advance, exactly at $2.145, before bulls forced a reaction. As long as candles continue to close above that retracement—effectively the floor of the micro-range—Casi argues that the underlying market structure remains constructive. A decisive break beneath $2.145, by contrast, would represent both a loss of the diagonal trendline and a surrender of the consolidation base, signalling short-term weakness and, in his words, “opening the door to a deeper flush.” Related Reading: XRP Pullback Nearly Complete—Next Stop: $8 To $12, Says Analyst Overhead, XRP must still reckon with layered resistance. The first ceiling sits at $2.20, but the level called out as “the next big test” is the thicker pink band at $2.25. That mark capped price repeatedly during yesterday’s U.S. session and coincides with a prior 1.272 extension of the late-May corrective leg. “If we can flip that level, we’ll likely open the path toward the $2.69 retrace test,” Casi noted, “and from there, the breakout potential increases dramatically!” If price can reclaim $2.25 on expanding volume and then retest it as support, the chart leaves an unobstructed lane toward the 2.618 extension at $2.296—effectively $2.30—and, by projection, the $2.69 Fibonacci target that would complete the measured-move roadmap Casi is tracking. Related Reading: XRP To $30 Beyond 2026? Analyst Reveals Key BTC Ratio To Watch Momentum, however, is not yet offering a clean green light. The lower pane shows a 14-period RSI capped by its own descending trendline that has compressed every rally since 24 June. With the oscillator printing 46.24 (signal) versus 43.59 (base line) at the time of the screenshot, the gauge is climbing but still mid-range. A marginal higher high in price paired with a lower high in RSI would etch a textbook bearish divergence—an outcome Casi told one follower he is “expecting to set up” if XRP pierces $2.25 before consolidating anew. “I think this next high will form a bearish div,” he added. “The RSI is telling me it’s about to set that up.” In short, the token is balanced on a knife-edge: the bull case hinges on the integrity of the $2.145–$2.186 support complex and a breakout through $2.25, while the bear case rests on trendline failure and an RSI divergence confirming upside exhaustion. With liquidity thinning into the weekend, the resolution of this narrow consolidation could shape the next wave—whether that proves to be the ignition of a larger third impulse or the start of a deeper corrective detour. As Casi put it, “This is the kind of price action you want to see if XRP is serious about continuing this new trend to the upside.” At press time, XRP traded at $2.19. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "The Ethereum Waiting Game: Breakout To $2,800 Or Crash To $2,000?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-breakout-to-2800/",
      "summary": "After suffering a major price crash back during the weekend, the Ethereum price has enjoyed an over 10% bounce that has put it back above major support levels. However, even with the recovery, the altcoin sits on shaky ground with geopolitical and macroeconomic factors still unstable. On the charts, there is also uncertainty as the second-largest cryptocurrency by market cap has failed to make any definitive moves from here, showing inconsistencies in movement. Ethereum Price Struggling At EMA Crypto analyst Swallow Academy noted that the Ethereum price has returned to trading at its Exponential Moving Average (EMA) earlier in the week after bouncing from its weekend lows. This has been referred to as the level of interest and sits around the $2,400 level, which has served as major support in the past. Related Reading: Analyst Says XRP Is Moving According To Plan, Here’s Why $1.90 Is Important The harsh drop from the weekend that pushed ETH from $2,500 to $2,150 has no doubt dented sentiment and sparked caution among investors. But the retest of the EMA at $2,400 suggests that buyers are still exerting their force and have been pushing up the price. Given these recent developments, the crypto analyst explains that it is currently a waiting game for the Ethereum price. From here, it could go either way, as confirmation is needed for which direction it is headed next. A breakout from here could move it back above the $2,800 resistance. However, a crash could be confirmation of rejection, sending Ethereum spiraling back toward lows at $2,000. Mapping Out Next Steps As the Ethereum price continues to show signs of continuation, crypto analysts have begun to map out where the altcoin might be headed next. Mister Spread pointed to the fact that Ethereum had actually shown a bullish Power of 3 (PO3), consisting of accumulation, deviation, and expansion. Related Reading: Ethereum Price Crash To $2,100 Triggers Fear, But Why Are Analysts Predicting A Rally To $6,000? The accumulation phase has been completed, and is now in the phase of deviation, explaining the price crash. Now, the price seems to already be breaking out of the deviation box, suggesting that the expansion phase will be coming sooner than expected. Once the expansion phase is in motion, the crypto analyst expects the Ethereum price to move back into the supply area of $2,800-$3,000. However, if the price fails to climb and falls back below $2,100, then this bullish thesis would be invalidated. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana Price At ‘A Very Delicate Level’ – Analyst Says $148 Reclaim Is Key",
      "link": "https://www.newsbtc.com/news/solana-price-at-a-very-delicate-level-analyst-says-148-reclaim-is-key/",
      "summary": "Despite recovering from the weekend retrace, Solana (SOL) is trading between two levels that could make or break the altcoin’s rally. Nonetheless, some analysts suggest that the cryptocurrency could be gearing up for a massive breakout beyond the local highs. Related Reading: Injective Prepares For Bullish Reversal Amid 25% Recovery – Analyst Forecasts Massive Breakout Solana Sits At Decisive Level On Wednesday, Solana fell to the $143 mark after failing to reclaim a crucial area lost over a week ago. Following the May breakout, the cryptocurrency hovered between the $148-$184 price range, hitting a four-month high of $187 at the end of last month. However, the June market pullback saw SOL lose its range and move toward the $144-$148 levels. This area was briefly lost during the weekend retrace, with Solana falling to the $125 support level before recovering. Over the past three days, the altcoin has surged nearly 15%, touching the $148 barrier on Wednesday morning, which has been one of the key levels since May. After recovering from the recent drop, SOL has attempted to reclaim this level, but was rejected once again. Analyst Sjuul from AltCryptoGems highlighted that Solana “just completed a very nice V-shaped recovery from the low,” but noted that the cryptocurrency is at a “very delicate level” as it trades within the $144-$148 zone. He suggested that investors should pay attention to this area, as a reclaim of the $148 resistance could propel the price to a “quick move to the upside.” On the contrary, rejection from this level and losing the $144 range low could signal that the recent price action was a bearish retest. Analyst Man of Bitcoin affirmed that a “sustained break above the resistance zone would be the first signal that the chart has formed a low. He detailed that a confirmed break above the $148 resistance would support the case for a reversal. Nonetheless, he warned that a potential scenario “with one more low in wave-5.” SOL Ready For A Rally Continuation? As price hovers between the $143-$144 levels, market watcher Altcoin Hunter considers that SOL is “dancing with the devil.” He pointed out that the cryptocurrency has been trading within a one-month falling wedge, with the $148-$150 rejection zone “coming in HOT.” Per"
    },
    {
      "title": "Chainlink Holders Set Record As 1-Yr MVRV Signals ‘Opportunity’",
      "link": "https://www.newsbtc.com/news/chainlink/chainlink-holders-set-record-1-yr-mvrv-opportunity/",
      "summary": "On-chain data shows new investors have been coming into Chainlink (LINK) as the MVRV Ratio signals a potential long-term opportunity for the asset. Chainlink Has Seen Its Total Holder Count Reach A New High In a new post on X, the analytics firm Santiment has discussed about the latest trend in the Total Amount of Holders metric for Chainlink. This indicator measures, as its name suggests, the total number of addresses on the LINK network that are carrying some non-zero balance. Related Reading: Tron’s 374% Profit-Taking Spree Uncovered—Here’s Who Was Behind It Below is the chart shared by Santiment that shows how the value of the metric has changed during the past year. As displayed in the graph, the Total Amount of Holders observed an inflection point earlier this year and has since been climbing up at a notable rate. This suggests that new non-empty wallets are popping up on the network. This kind of trend can arise due to a number of reasons. Fresh investors coming into the space or old ones who sold before making a return naturally contribute to an increase in the indicator. Another factor could be existing users creating new wallets to distribute their holdings or for privacy purposes. In general, all of these could be assumed to be occurring simultaneously to a degree whenever the Total Amount of Holders goes up. As such, the recent uptrend in the metric could indicate that some net adoption (that is, the influx of new investors) has steadily been taking place for Chainlink. Over the past month, 7,903 new non-zero balance addresses have joined the chain, bringing the Total Amount of Holders to a fresh all-time high (ATH) of 769,380. In the same chart, the analytics firm has also attached the data of another indicator: the Market Value to Realized Value (MVRV) Ratio. This metric basically compares how the value held by the BTC investors (the market cap) compares against the value put in by them (the realized cap). In other words, the indicator tells us about the profit-loss balance of the holders. Here, the version of the MVRV Ratio that&#8217;s relevant is the 365-day version, capturing the situation of the investors who bought their coins within the past year. Related Reading: Crypto Bears Rekt: $359M Gone As Bitcoin, Ethereum Rebound From the graph, it&#8217;s visible that the 1-year MVRV Ratio of Chainlink is currently sitting at a negative 17.3%, an indication that these traders are, on average, holding a loss of 17.3%. Generally, however, investors being underwater isn&#8217;t actually a bad thing for the cryptocurrency. This is because holders in profit are the ones more likely to participate in selling. As such, Santiment notes that the trend in the 365-day MVRV Ratio could suggest the asset&#8217;s &#8220;long-term investing timeframe is in an opportunity zone.&#8221; LINK Price At the time of writing, Chainlink is trading around $13.15, up more than 2% in the last seven days. Featured image from Dall-E, Santiment.net, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "FHFA Orders to Recognize Bitcoin And Other Cryptos in Mortgage Assessments",
      "link": "https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FHFA-Orders-to-Recognize-Bitcoin-And-Other-Cryptos-in-Mortgage-Assessments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments\" rel=\"nofollow\"> </a></p> <p>Fannie Mae and Freddie Mac are now directed to treat properly documented Bitcoin and other crypto assets as part of borrower reserves for mortgages.</p> <p>"
    },
    {
      "title": "Kraken Secures MiCA License To Offer Bitcoin And Crypto In Europe",
      "link": "https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Becomes-First-Global-Bitcoin-Crypto-Platform-to-Secure-MiCA-License.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe\" rel=\"nofollow\"> </a></p> <p>The license allows Kraken to offer regulated bitcoin and crypto services across all 30 EEA countries.</p> <p>"
    },
    {
      "title": "GameStop Raising $450 Million From Convertible Senior Notes To Make Investments",
      "link": "https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/GameStop-Raising-450-Million-From-Convertible-Senior-Notes-To-Make-Investments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments\" rel=\"nofollow\"> </a></p> <p>GameStop boosts its convertible note offering to $2.7 billion, potentially for a Bitcoin allocation under its updated investment policy.</p> <p>"
    },
    {
      "title": "Mega Matrix Announces First Purchase Of 12 BTC For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Mega-Matrix-Announces-First-Purchase-of-12-BTC-for-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Mega Matrix Inc., a Singapore based holding company that operates the FlexTV streaming platform, announced today its first Bitcoin purchase as part of a new treasury strategy. The company acquired 12 Bitcoin at an average price of approximately $105,554 per coin, including all fees and expenses.&#160; The purchase, completed at the end of May 2025, [&#8230;]</p> <p>"
    },
    {
      "title": "Digital Commodities Secures $3 Million to Expand Bitcoin Holdings",
      "link": "https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Digital-Commodities-Secures-3-Million-to-Expand-Bitcoin-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings\" rel=\"nofollow\"> </a></p> <p>The company now holds two Bitcoin and is raising $3 million through a private placement to accelerate its Bitcoin treasury strategy.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Kraken Becomes Latest to Win a License Under Europe's New Rules",
      "link": "https://decrypt.co/327112/kraken-license-europes-new-rules",
      "summary": "Approval from Ireland's central bank gives Kraken the ability to operate across 27 EU states as it races to catch up to rival Coinbase."
    },
    {
      "title": "ASIC Appoints Panel to Probe ASX Following Failed Blockchain Project",
      "link": "https://decrypt.co/327103/asic-appoints-panel-to-probe-asx-following-failed-blockchain-project",
      "summary": "The inquiry will assess the ASX’s governance, capability, and risk management frameworks across its group operations."
    },
    {
      "title": "ASX-Listed Biotech Firm Latest to Adopt a Bitcoin Strategy to Stay Afloat",
      "link": "https://decrypt.co/327099/asx-listed-biotech-firm-bitcoin-strategy",
      "summary": "Opyl is betting on the so-called Bitcoin treasury strategy to navigate its financial chop and follow recent examples set by others."
    },
    {
      "title": "US Housing Chief Orders Fannie Mae, Freddie Mac to Prepare for Crypto Assessment in Mortgages",
      "link": "https://decrypt.co/327087/us-housing-head-orders-fannie-mae-freddie-mac-accept-crypto",
      "summary": "Under a directive from the FHFA, Fannie Mae and Freddie Mac were ordered to prepare for crypto mortgage payments."
    },
    {
      "title": "Solana, Pudgy Penguins ETF Filings Added to SEC's Crypto To-Do List",
      "link": "https://decrypt.co/327076/solana-pudgy-penguins-etf-filings-sec-crypto",
      "summary": "A proposal for a Solana ETF and a new fund tied to Pudgy Penguins tokens have joined a growing list of products offering crypto exposure."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Mortgage giants Fannie Mae, Freddie Mac directed to consider crypto as valid assets for home loan eligibility",
      "link": "https://cryptobriefing.com/fannie-mae-freddie-mac-crypto-mortgage-underwriting/",
      "summary": "<p>Integrating crypto assets into mortgage finance could broaden access to home loans, potentially reshaping financial inclusion and asset evaluation.</p> <p>"
    },
    {
      "title": "Fed’s Powell says Bitcoin and crypto have matured and become more mainstream",
      "link": "https://cryptobriefing.com/crypto-mainstream-adoption-fed/",
      "summary": "<p>The mainstreaming of crypto prompts regulatory reassessment, potentially reshaping financial policies and banking practices globally.</p> <p>"
    },
    {
      "title": "Starknet-based zkLend shuts down following exploit and ZEND token delisting from major exchanges",
      "link": "https://cryptobriefing.com/zklend-shutdown-zend-delisting/",
      "summary": "<p>The shutdown highlights the vulnerabilities in DeFi protocols and may deter investor confidence, impacting future decentralized finance projects.</p> <p>"
    },
    {
      "title": "Banking giant Barclays to block all crypto transactions on credit cards over debt and fraud concerns",
      "link": "https://cryptobriefing.com/barclays-crypto-ban-cards/",
      "summary": "<p>Barclays' crypto credit card ban highlights growing financial institutions' caution, potentially influencing global regulatory approaches.</p> <p>"
    },
    {
      "title": "Blockchain venture Republic to offer digital tokens tracking shares of Elon Musk’s SpaceX",
      "link": "https://cryptobriefing.com/tokenized-private-shares-spacex/",
      "summary": "<p>Republic's token initiative could democratize access to high-value private firms, but regulatory hurdles may challenge its long-term viability.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Whales add $915M in XRP – Can retail catch up, if so, prices will…",
      "link": "https://ambcrypto.com/whales-add-915m-in-xrp-can-retail-catch-up-if-so-what-next/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-11-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP whales accumulated $915M in a week, but retail fatigue could prevent sustained bullish momentum."
    },
    {
      "title": "WIF bulls defend the $0.7 support – Can they drive a rally beyond $1?",
      "link": "https://ambcrypto.com/wif-bulls-defend-the-0-7-support-can-they-drive-a-rally-beyond-1/",
      "summary": "<img alt=\"WIF bulls defend the $0.7 support - Can they drive a rally beyond $1?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/WIF-Featured-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A lack of demand and dwindling trading volume showed that dogwifhat was not yet ready to rally."
    },
    {
      "title": "BTC Whales Offload Bitcoin Profits Into Pepe Dollar, The Federal Reserve Parody",
      "link": "https://ambcrypto.com/btc-whales-offload-bitcoin-profits-into-pepe-dollar-the-federal-reserve-parody/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"448\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-26-123243.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"773\" />Recent geopolitical tensions between Iran and the United States have introduced volatility to the cryptocurrency [&#8230;]"
    },
    {
      "title": "SEI crypto hits 5-month high, but this 10% dip could signal trouble – Why?",
      "link": "https://ambcrypto.com/sei-crypto-hits-5-month-high-but-this-10-dip-could-signal-trouble-why/",
      "summary": "<img alt=\"Sei [SEI]\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-13.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will the whales re-enter and continue to push SEI higher? Assessing..."
    },
    {
      "title": "Bow Miner test: BTC earns $20,000 a day, ETH earns $30,000 a day, and DOGE earns $15,000 a day!",
      "link": "https://ambcrypto.com/bow-miner-test-btc-earns-20000-a-day-eth-earns-30000-a-day-and-doge-earns-15000-a-day/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"421\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-26-125127.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"745\" />Against the backdrop of rising global inflation and greater volatility in financial markets, the value [&#8230;]"
    }
  ]
}