{
  "CoinDesk": [
    {
      "title": "XRP Clears $2.28 on Breakout Volume, Eyes $2.30 on Ripple's Banking Charter Push",
      "link": "https://www.coindesk.com/markets/2025/07/09/xrp-clears-228-on-breakout-volume-eyes-230-on-ripples-banking-charter-push",
      "summary": ""
    },
    {
      "title": "Dogecoin Flashes Bullish Continuation After Bounce at 16-Cents on Six Times Higher Volume",
      "link": "https://www.coindesk.com/markets/2025/07/09/dogecoin-flashes-bullish-continuation-after-bounce-at-16-cents-on-six-times-higher-volume",
      "summary": ""
    },
    {
      "title": "Bitcoin, Ether, Solana, XRP ETFs See Record AUM as Traders Warn of ‘Summer Lull’",
      "link": "https://www.coindesk.com/markets/2025/07/09/bitcoin-ether-solana-xrp-etfs-see-record-aum-as-traders-warn-of-summer-lull",
      "summary": ""
    },
    {
      "title": "Asia Morning Briefing: Bitcoin Stalls Near $109K as Market Waits for a Catalyst",
      "link": "https://www.coindesk.com/markets/2025/07/09/asia-morning-briefing-bitcoin-stalls-near-109k-as-market-waits-for-a-catalyst",
      "summary": ""
    },
    {
      "title": "OFAC’s Dropped Sanctions Against Tornado Cash Can’t Come Up at Trial, Judge Says",
      "link": "https://www.coindesk.com/policy/2025/07/08/ofacs-dropped-sanctions-against-tornado-cash-cant-come-up-at-trial-judge-says",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin lacked mass media coverage in Q2: Report",
      "link": "https://cointelegraph.com/news/bitcoin-lacked-coverage-mass-media-q2-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VjZmYtMGM4Mi03ODgzLWIyNjEtNWEyMTc2ZDIyZGJi.jpg\" /></p><p>Major news outlets The Wall Street Journal, the Financial Times and The New York Times published just 13 articles on Bitcoin in Q2, according to research from Perception.</p>"
    },
    {
      "title": "Crypto traders ‘starting to salivate’ as Bitcoin inches back toward $110K",
      "link": "https://cointelegraph.com/news/crypto-traders-bitcoin-bullish-comments-surge-hopes-110k-btc-price?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VjN2UtMDYyOC03ZDcwLWE2NWItYTdjOWJiYWFlYzUx.jpg\" /></p><p>Santiment says the ratio of bullish to bearish Bitcoin comments on social media has hit a three-week high as traders grow more optimistic about Bitcoin breaking above $110,000.</p>"
    },
    {
      "title": "US sanctions North Korean tech worker crew over crypto thefts",
      "link": "https://cointelegraph.com/news/us-treasury-sanctions-north-korea-it-worker-crypto-fraud?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzBjYmEtMWU0Mi03NmRmLWI5YTktZWNiNmI1ZmNiYjhi.jpg\" /></p><p>TRM Labs said North Korea is moving away from hacks to focus more on deception-based revenue generation, such as planting IT workers in US companies.</p>"
    },
    {
      "title": "Bitcoin metric says $100K BTC was the bottom: When will a rally to new highs start?",
      "link": "https://cointelegraph.com/news/bitcoin-metric-says-100k-btc-was-the-bottom?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ViNzQtNGRlOS03MGMzLTlkOWUtNTM5NmM5NGVkMmUy.jpg\" /></p><p>Bitcoin’s inflow/outflow ratio fell to 2022 lows, and the cumulative volume delta shows short-selling pressure failing to push prices lower. Time for a rally?</p>"
    },
    {
      "title": "$31B stablecoin surge at Binance revives traders’ altseason hopes",
      "link": "https://cointelegraph.com/news/dollar31b-stablecoin-surge-at-binance-revives-traders-altseason-hopes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VhNDYtY2Q1NC03NjQxLWE1YmQtM2FiODAxMjI4MmYz.jpg\" /></p><p>Soaring stablecoin reserves at Binance, falling Bitcoin dominance and a bullish chart pattern point to a possible altseason starting in the bottom half of 2025.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Survey finds gaps in mainstream Bitcoin coverage, leaving institutional investors exposed",
      "link": "https://cryptoslate.com/survey-finds-gaps-in-mainstream-bitcoin-coverage-leaving-institutional-investors-exposed/",
      "summary": "<p>A second-quarter survey of 18 mainstream news outlets logged 1,116 Bitcoin (BTC) stories and measured sentiment at 31% positive, 41% neutral, and 28% negative, according to Bitcoin analysis firm Perception. The data reveal a significant gap between finance-focused media that cover the market extensively and legacy publications that rarely address it. Sparse coverage Perception counted [&#8230;]</p> <p>"
    },
    {
      "title": "Joe Lubin forecasts Ethereum treasury strategies will reshape Wall Street perception",
      "link": "https://cryptoslate.com/joe-lubin-forecasts-ethereum-treasury-strategies-will-reshape-wall-street-perception/",
      "summary": "<p>Ethereum and Consensys co-founder Joe Lubin said companies adopting ETH treasury strategies will play a critical role in communicating the second-largest digital asset&#8217;s value to Wall Street, as major financial institutions ramp up blockchain use and process around 24 million transactions daily. Lubin made the statement during an interview with CNBC on July 8 in [&#8230;]</p> <p>"
    },
    {
      "title": "Stablecoin issuers’ $182 billion US Treasury hoard ranks 17th among countries, beating UAE and South Korea",
      "link": "https://cryptoslate.com/stablecoin-issuers-182-billion-us-treasury-hoard-ranks-17th-among-countries-beating-uae-and-south-korea/",
      "summary": "<p>Four US-dollar stablecoin issuers hold roughly $182 billion in US Treasury bills, an amount that would slot them 17th on the Treasury Department’s country-by-country league table. The amount in overnight Treasury-collateralized repos and Treasury-heavy money market funds would put the group between Norway’s $195.9 billion and Saudi Arabia’s $133.8 billion. Tether&#8217;s USDT tops the cohort. [&#8230;]</p> <p>"
    },
    {
      "title": "Volkswagen ADMT chooses Solana-based Hivemapper to power Robotaxi test fleet",
      "link": "https://cryptoslate.com/volkswagen-admt-chooses-solana-based-hivemapper-to-power-robotaxi-test-fleet/",
      "summary": "<p>Volkswagen ADMT, the automaker’s autonomous-driving subsidiary, will source real-time street-level data from Bee Maps, a spatial intelligence service that runs on Hivemapper’s Solana-based mapping network. According to Hivemapper CEO Ariel Seidman, the partnership “shifts mapping from static to living,” and that robotaxi fleets require data “that evolves as fast as the streets do.” Bee Maps [&#8230;]</p> <p>"
    },
    {
      "title": "SharpLink stock continues surging as treasury tops 200k Ethereum",
      "link": "https://cryptoslate.com/sharplink-stock-continues-surging-as-treasury-tops-200k-ethereum/",
      "summary": "<p>SharpLink Gaming shares surged nearly 26% on July 8 after the Minneapolis-based online gaming company revealed a major expansion of its crypto treasury, bringing its total Ethereum (ETH) holdings to over 200,000 coins. The company announced it had purchased an additional 7,689 ETH for approximately $19.2 million at an average price of $2,501 per coin. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Dogecoin (DOGE) Eyes Breakout — Can Bulls Unleash the Next Surge?",
      "link": "https://www.newsbtc.com/analysis/doge/dogecoin-doge-eyes-breakout-0-1650-2/",
      "summary": "Dogecoin started a fresh increase above the $0.1680 zone against the US Dollar. DOGE is now consolidating and might aim for a move above $0.1720. DOGE price started a fresh increase above the $0.1650 and $0.1680 levels. The price is trading above the $0.1680 level and the 100-hourly simple moving average. There is a bullish trend line forming with support at $0.1680 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could start a fresh rally if it clears the $0.1720 and $0.1750 resistance levels. Dogecoin Price Eyes More Gains Dogecoin price started a fresh increase from the $0.1650 zone, like Bitcoin and Ethereum. DOGE was able to climb above the $0.1665 and $0.1680 resistance levels. The bulls even pushed the price above the $0.170 resistance. There was a steady increase and the price even spiked above the 50% Fib retracement level of the downward move from the $0.1722 swing high to the $0.1657 low. Dogecoin price is now trading above the $0.1680 level and the 100-hourly simple moving average. Besides, there is a bullish trend line forming with support at $0.1680 on the hourly chart of the DOGE/USD pair. Immediate resistance on the upside is near the $0.1720 level. The first major resistance for the bulls could be near the $0.1730 level or the 61.8% Fib retracement level of the downward move from the $0.1722 swing high to the $0.1657 low. The next major resistance is near the $0.1750 level. A close above the $0.1750 resistance might send the price toward the $0.180 resistance. Any more gains might send the price toward the $0.200 level. The next major stop for the bulls might be $0.2120. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.1750 level, it could start another decline. Initial support on the downside is near the $0.1680 level or the trend line zone. The next major support is near the $0.1650 level. The main support sits at $0.1610. If there is a downside break below the $0.1610 support, the price could decline further. In the stated case, the price might decline toward the $0.1550 level or even $0.1520 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1680 and $0.1650. Major Resistance Levels – $0.1720 and $0.1750."
    },
    {
      "title": "Bitcoin Absorbs Strong Selling Pressure On Binance Derivatives – Breakout Ahead?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-absorbs-strong-selling-pressure-on-binance-derivatives-breakout-ahead/",
      "summary": "Bitcoin (BTC) has remained range-bound between $100,000 and $110,000 since May 7, aside from a few dips to as low as $98,000 in June, which were quickly followed by daily candle closes above the $100,000 level. Recent analysis reveals that BTC has withstood sustained selling pressure on Binance Derivatives throughout this period. Bitcoin Withstands Binance Derivatives Sell-Off According to a CryptoQuant Quicktake post by contributor BorisVest, taker users on Binance Derivatives have consistently engaged in sell-side activity for at least the past 45 days. Notably, the Cumulative Volume Delta (CVD) has remained negative throughout this time. For the uninitiated, the CVD measures the net difference between market buy &#8211; aggressive buying &#8211; and market sell &#8211; aggressive selling &#8211; orders over time. It helps traders identify whether buying or selling pressure is dominating, even if price remains stable. Related Reading: Bitcoin Short-Term Holder Floor Rises Toward $100,000, Reinforcing Bullish Sentiment BorisVest noted that Binance Derivatives traders are treating each BTC bounce or rally as a selling opportunity, opening aggressive short positions via market sell orders. However, this strong sell pressure has failed to push prices lower, as BTC continues to absorb the selling activity and maintain support above $100,000. The analyst added that as long as BTC remains within its current range &#8211; between $100,000 and $110,000 &#8211; while absorbing sell pressure, the potential for upside remains intact. He explained: The CVD metric plays a crucial role here. It aggregates both taker and maker activity to provide a real-time picture of net buy/sell pressure. The fact that CVD remains in decline confirms the dominance of sell-side flow. Yet, the inability of price to drop further despite this pressure may signal that Bitcoin is being absorbed by institutional or large players in the background. That said, other analysts interpret the persistent selling pressure differently. For example, fellow CryptoQuant analyst Crazzyblockk recently observed that new buyer demand is struggling to keep pace with the combined supply pressure from newly mined BTC and selling by long-term holders. BTC Eyeing A Breakout Ahead? Bitcoin’s resilience in the face of heavy selling on Binance Derivatives has once again sparked speculation about a potential breakout. Several additional data points suggest that BTC may be poised to move into a higher price range soon. Related Reading: Bitcoin Forming Inverse Head And Shoulders Pattern – Is $150,000 The Next Target? For instance, recent on-chain data shows that &#8220;weak hands&#8221; are offloading their BTC holdings to larger, more established investors &#8211; indicating a broader shift in sentiment favoring Bitcoin. Meanwhile, institutional interest in the asset continues to grow. Additionally, the Bitcoin Yearly Percentage Trend suggests that BTC could top out around $205,000 by the end of 2025. At press time, BTC trades at $108,589, up 0.4% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "XRP Price Regains Traction — Is a Powerful Upside Break Brewing?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-regains-traction-2-32/",
      "summary": "XRP price started a fresh increase above the $2.30 zone. The price is now showing positive signs and might climb above the $2.32 resistance. XRP price started a fresh increase above the $2.280 zone. The price is now trading above $2.280 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.280 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above the $2.250 zone. XRP Price Eyes Fresh Increase XRP price started a fresh increase after it settled above the $2.2620 level, beating Bitcoin and Ethereum. The price was able to climb above the $2.280 resistance level. The recent move was positive and the bulls pushed the price above the 50% Fib retracement level of the downward move from the $2.353 swing high to the $2.251 low, and tested the $2.32 zone. Besides, there is also a key bullish trend line forming with support at $2.280 on the hourly chart of the XRP/USD pair. The price is now trading above $2.280 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.320 level. The first major resistance is near the $2.330 level or the 76.4% Fib retracement level of the downward move from the $2.353 swing high to the $2.251 low. A clear move above the $2.330 resistance might send the price toward the $2.350 resistance. Any more gains might send the price toward the $2.40 resistance or even $2.420 in the near term. The next major hurdle for the bulls might be near the $2.50 zone. Another Decline? If XRP fails to clear the $2.320 resistance zone, it could start another decline. Initial support on the downside is near the $2.280 level and the trend line zone. The next major support is near the $2.250 level. If there is a downside break and a close below the $2.250 level, the price might continue to decline toward the $2.220 support. The next major support sits near the $2.20 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.280 and $2.250. Major Resistance Levels – $2.330 and $2.350."
    },
    {
      "title": "Ethereum Price Turns Positive — More Upside Likely if Momentum Holds",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-turns-positive-2620/",
      "summary": "Ethereum price started a fresh increase above the $2,550 zone. ETH is now consolidating gains and might aim for a fresh move above $2,620. Ethereum started a fresh increase above the $2,550 level. The price is trading above $2,580 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,550 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it remains supported above the $2,550 zone in the near term. Ethereum Price Gains Pace Ethereum price started a fresh increase above the $2,560 zone, beating Bitcoin. ETH price gained pace for a move above the $2,600 resistance zone and entered a positive zone. The price even tested the $2,620 resistance. A high was formed at $2,627 and the price is now consolidating gains. It is stable above the 23.6% Fib retracement level of the upward move from the $2,515 swing low to the $2,627 high. Ethereum price is now trading above $2,580 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2,550 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,620 level. The next key resistance is near the $2,650 level. The first major resistance is near the $2,680 level. A clear move above the $2,680 resistance might send the price toward the $2,780 resistance. An upside break above the $2,780 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,880 resistance zone or even $2,920 in the near term. Are Downsides Limited In ETH? If Ethereum fails to clear the $2,620 resistance, it could start a fresh decline. Initial support on the downside is near the $2,570 level. The first major support sits near the $2,520 zone and the trend line. A clear move below the $2,520 support might push the price toward the $2,450 support. Any more losses might send the price toward the $2,350 support level in the near term. The next key support sits at $2,320. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,520 Major Resistance Level – $2,620"
    },
    {
      "title": "Bitcoin Bull Flag Breakout Confirmed — What Happens Next?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-bull-flag-breakout-confirmed-what-happens-next/",
      "summary": "Bitcoin has broken out of the orange bull flag on the 1-hour chart. After consolidating within a tight range, the breakout suggests that momentum is shifting back in favor of the bulls, and potentially setting the stage for a rapid push toward higher resistance levels. Pullback Or Launchpad? What Bitcoin&#8217;s Next Move Could Look Like According to MaxFINEancial&#8217;s latest analysis on X, he highlighted that a large green double bottom is forming within an orange bull flag on the 1-hour chart, which is a bullish continuation setup. Related Reading: Bitcoin Heating Up? NVT Golden Cross Hints At Potential Local Top The local high was a test of the trigger line of the double bottom, which signaled intent from the bulls. BTC is retesting the upper edge of the bull flag, aligning with the 1-hour 200-day MA, a critical dynamic support level that often dictates short-term momentum. MaxFINEancial projects a small pink bullish pennant forming and setting up for a continuation move higher. However, a rare diamond top pattern could also be taking shape, a bearish reversal formation that, if validated, may trigger a sharp downside move. If BTC loses the 1-hour 200-day MA, he advises shifting focus to the 4-hour 200-day MA, which is the line of defense. The important bullish area targets are $113,700, $115,867, $117,030, and $122,143, while the bearish diamond top target is $103,079. Market analyst A_y has also highlighted that Bitcoin is consolidating below the $110,000 resistance on the 4-hour chart, with the structure forming a textbook ascending triangle. This setup is the rising higher lows against horizontal resistance that precedes a strong breakout. If BTC manages to break above $110,000, the move could accelerate toward the $112,000 to $114,000 range, marking a bullish trend. However, failure to breach this ceiling may lead to a pullback toward $104,000, where previous demand has stepped in. The Relative Strength Index (RSI) is neutral, suggesting that there is room for momentum to build, while the Moving Average Convergence Divergence (MACD) shows a bullish crossover, that is hinting at potential upward momentum, BTC is still trading below the EMA, which means bulls need to prove strength for a confirmed breakout. Bitcoin Stable At $108,000 — Market Cooling, Not Crashing In an update on X, Chad_TattoosMD also emphasized that Bitcoin is showing resilience and holding strong around the $108,000 level despite the recent dip. BTC is maintaining its structure and refusing to break lower, which is a sign of underlying buyer confidence. Related Reading: Bitcoin Traders Are Betting Against the Rally, Will It Backfire? The Relative Strength Index (RSI) sits at neutral 54, indicating no extreme momentum in either direction. Meanwhile, the Stochastic (RSI) has entered overbought territory and is now cooling off, hinting at a potential short-term pullback. However, nothing on the chart suggests a breakdown is imminent. Chad_TattoosMD also points to $106,000 as the key support, and $112,000 as the resistance, which remains in a tight zone on the chart. Featured image from iStock images, chart from tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Showed Up in DC — And Washington Took Notice",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Showed-Up-in-DC-—-And-Washington-Took-Notice-fotor-2025070812361.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice\" rel=\"nofollow\"> </a></p> <p>Reflections on the Bitcoin Policy Summit in Washington DC during May 2025. </p> <p>"
    },
    {
      "title": "Bow Valley Credit Union in Canada turns on Bitcoin purchases for Albertans",
      "link": "https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_an_orange_bull_running_through_an_Alberta_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans\" rel=\"nofollow\"> </a></p> <p>BVCU’s Bitcoin Gateway, with Balance Custody and Bull Bitcoin API, simplifies buying bitcoin. “Facilitates institutional adoption,” says Francis Pouliot. </p> <p>"
    },
    {
      "title": "KULR Secures $20M Bitcoin-Backed Credit Facility from Coinbase Credit",
      "link": "https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Secures-20M-Bitcoin-Backed-Credit-Facility-from-Coinbase-Credit.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit\" rel=\"nofollow\"> </a></p> <p>The deal sets up a multi-draw loan facility worth up to $20 million to expand its Bitcoin holdings.</p> <p>"
    },
    {
      "title": "Sequans Closes $384 Million Investment To Launch Bitcoin Treasury Initiative",
      "link": "https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Sequans-Closes-384-Million-Investment-To-Launch-Bitcoin-Treasury-Initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a fabless semiconductor company focusing on 5G/4G IoT semiconductor technology, has officially closed a $384 million strategic investment to kick off its Bitcoin treasury initiative. The deal combines $195 million in equity financing and $189 million in secured convertible debentures, reflecting growing institutional appetite for Bitcoin. The Offering included the sale of over [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet Enters ‘Bitcoin Gold Rush’ with Plans to Buy 210,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Metaplanet-Enters-Bitcoin-Gold-Rush-with-Plans-to-Buy-210000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027\" rel=\"nofollow\">Metaplanet Enters &#8216;Bitcoin Gold Rush&#8217; with Plans to Buy 210,000 BTC by 2027</a></p> <p>Japan’s top bitcoin treasury firm aims to grow its holdings to 210,000 BTC by 2027 and wants to use its growing reserves to buy cash-generating businesses.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Inside North Korea's Hiring Scams Targeting Crypto Firms",
      "link": "https://decrypt.co/329225/inside-north-korea-hiring-scams-crypto-firms",
      "summary": "Companies and recruiters are warning that North Korea is hiring Europeans as fronts for job interviews, and the problem is only getting worse."
    },
    {
      "title": "Grok Glitch Inspires Wave of ‘MechaHitler’ Meme Coins",
      "link": "https://decrypt.co/329219/grok-glitch-inspires-mechahitler-meme-coins",
      "summary": "Rogue AI hallucinations by Grok have given rise to new crypto memes as well as associated tokens on Solana and Ethereum."
    },
    {
      "title": "Goblintown Heads to the Trenches With Solana Meme Coin Launch",
      "link": "https://decrypt.co/329100/goblintown-heads-trenches-solana-meme-coin-launch",
      "summary": "The creator of Ethereum NFT collection Goblintown thinks there's a better way to launch meme coins—and it just did so with GOB on Solana."
    },
    {
      "title": "Polymarket Rules 'No' on $237M Controversial Bet Over Zelenskyy's Suit",
      "link": "https://decrypt.co/329210/polymarket-rules-no-237m-bet-zelenskyys",
      "summary": "Discontent over the market’s resolution has reignited scrutiny of UMA’s dispute system and the influence of large Polymarket stakeholders."
    },
    {
      "title": "Meet 'MechaHitler:' Grok’s New Disturbing Persona",
      "link": "https://decrypt.co/329182/mechahitler-grok-disturbing-persona",
      "summary": "Grok maker xAI quietly updated its chatbot to assume all media is biased, relying on X, a platform known for misinformation."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trillion-dollar bank clears Bitwise crypto ETF for advisor-managed accounts",
      "link": "https://cryptobriefing.com/crypto-etf-approval-bitwise-bank/",
      "summary": "<p>Institutional adoption of crypto ETFs signals a shift towards mainstream acceptance, potentially increasing crypto's role in diversified portfolios.</p> <p>"
    },
    {
      "title": "Phantom introduces in-wallet perps trading powered by Hyperliquid",
      "link": "https://cryptobriefing.com/in-wallet-perps-trading-phantom/",
      "summary": "<p>Phantom's integration of perpetual futures trading could significantly enhance user engagement and broaden crypto market accessibility.</p> <p>"
    },
    {
      "title": "ProShares’ XRP futures ETF listed on DTCC under ticker UXRP",
      "link": "https://cryptobriefing.com/proshares-xrp-etf-dtcc-listing/",
      "summary": "<p>The listing of ProShares' XRP futures ETF on DTCC suggests growing institutional interest and potential market expansion for crypto ETFs.</p> <p>"
    },
    {
      "title": "Amplifi partners with AIAPE to expand AI agent capabilities",
      "link": "https://cryptobriefing.com/amplifi-aiape-ai-agent-partnership-crypto-trading/",
      "summary": "<p>This partnership could enhance AI-driven trading efficiency, potentially reshaping digital asset markets and influencing future AI integrations.</p> <p>"
    },
    {
      "title": "Cardano Foundation unveils blockchain-based tool to simplify audit compliance and enhance financial reporting",
      "link": "https://cryptobriefing.com/blockchain-esg-compliance-cardano-reeve/",
      "summary": "<p>Cardano's blockchain tool could revolutionize audit compliance, boosting transparency and trust across various sectors and enhancing ESG efforts.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Circle’s CRCL bounces back by 14% – What’s driving the recovery?",
      "link": "https://ambcrypto.com/circles-crcl-bounces-back-by-14-whats-driving-the-recovery/",
      "summary": "<img alt=\"Circle’s CRCL bounces back by 14% - What’s driving the recovery? \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/CRCL-stock-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Wall Street analysts may be bullish on CRCL, but JP Morgan has other ideas."
    },
    {
      "title": "$1 mln flows into Hyperliquid even as HYPE slips: What can bulls do?",
      "link": "https://ambcrypto.com/1-mln-flows-into-hyperliquid-even-as-hype-slips-what-can-bulls-do/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-08T162734.767-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE faces breakdown risks and potential short squeeze setups around the critical $40 zone."
    },
    {
      "title": "Pump.fun’s token sale page vanishes, $600M on the line – What next?",
      "link": "https://ambcrypto.com/pump-funs-deleted-token-sale-600m-on-the-line-what-next/",
      "summary": "<img alt=\"PumpFun PUMP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/PumpFunPUMP.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PUMP token debut could be the most 'controversial' but crucial to track, says crypto VC."
    },
    {
      "title": "Will Chainlink drop 17% amid tariff tensions? Mapping the road ahead",
      "link": "https://ambcrypto.com/chainlink-may-drop-17-amid-tariff-tensions-mapping-the-road-ahead/",
      "summary": "<img alt=\"Chainlink may drop 17% amid tariff tensions: Mapping the road ahead\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-08T172643.819_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The recent tariff tension coincided with Chainlink's price struggles, further weakening investor sentiment."
    },
    {
      "title": "XRP breaks out! – But will $2.33 hold, if so, what next?",
      "link": "https://ambcrypto.com/xrp-breaks-out-but-will-2-33-hold-if-so-what-next/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-08T142007.587-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP broke out, but its pullback and sentiment metrics raise questions about sustainability."
    }
  ]
}