{
  "CoinDesk": [
    {
      "title": "ATOM Surges 3.6% Amid Strong Volume Swings at Key Support Levels",
      "link": "https://www.coindesk.com/markets/2025/06/25/atom-surges-3-6-amid-strong-volume-swings-at-key-support-levels",
      "summary": ""
    },
    {
      "title": "NEAR Protocol Plunges 4% Before Staging Recovery Amid Market Volatility",
      "link": "https://www.coindesk.com/markets/2025/06/25/near-protocol-plunges-4-before-staging-recovery-amid-market-volatility",
      "summary": ""
    },
    {
      "title": "The Next Frontier in Finance: Tokenized Access to Private Markets",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/24/the-next-frontier-in-finance-tokenized-access-to-private-markets",
      "summary": ""
    },
    {
      "title": "What’s Next for Real-World Asset Tokenization",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/24/what-s-next-for-real-world-asset-tokenization",
      "summary": ""
    },
    {
      "title": "Leading Crypto Senator Sees End of Year as U.S. Legislation Target",
      "link": "https://www.coindesk.com/policy/2025/06/25/leading-crypto-senator-sees-end-of-year-as-u-s-legislation-target",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "US home mortgage regulator considers Bitcoin amid housing crisis",
      "link": "https://cointelegraph.com/news/us-home-mortgage-regulator-bitcoin-amid-housing-crisis?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E3NjYtZDk0Mi03NDZiLWEyMmItYTUzNDhiOWQ3YWJl.jpg\" /></p><p>The head of the FHFA said his agency is considering how Bitcoin is counted in qualifying for a mortgage.</p>"
    },
    {
      "title": "Bitcoin’s ‘bull pennant’ targets $165K as BTC exchange flows hit 10-year lows",
      "link": "https://cointelegraph.com/news/bitcoin-s-bull-pennant-targets-165k-as-btc-exchange-flows-hit-10-year-lows?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E3YWYtYzQyZi03YzMyLThiMDAtZTliNzU4NmZiYTQz.jpg\" /></p><p>Bitcoin’s price moves closer to its all-time high, but liquidity shortage could trigger a breakout toward $165,000.</p>"
    },
    {
      "title": "Bitcoin vs. sovereign bonds: Why are some investors making the shift?",
      "link": "https://cointelegraph.com/explained/bitcoin-vs-sovereign-bonds-why-are-some-investors-making-the-shift?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9mOGE2ZjE5YzA4NjM5YjIzZjA1ODNiZWE1YTdiNmEyNS5qcGc=.jpg\" /></p><p> Bitcoin is creating a new paradigm as an emerging financial asset; several investors are contemplating a shift to adopting the asset for higher returns. </p>"
    },
    {
      "title": "Ethereum ‘death cross’ flashes for the first time since 2022 ETH price crash",
      "link": "https://cointelegraph.com/news/ethereum-flashes-death-cross-for-the-first-since-2022-selloff?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E2ZTctYjkzMS03NmY4LWEwMDctNmFjZTE1NDY5ZjFj.jpg\" /></p><p>ETH’s two-week chart signals a bearish crossover, resembling a 2022 setup that preceded a 40% decline in the price of Ethereum.</p>"
    },
    {
      "title": "Bitcoin-stocks correlation signals USD fragility and not risk-on fervor",
      "link": "https://cointelegraph.com/news/bitcoin-stocksusd-fragility-and-not-risk-on-fervor?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM1YjAtN2Q3Yi03YjNjLWI3ZjAtMTdmYTc0NzhkYzA1.jpg\" /></p><p>Bitcoin’s rising correlation with stocks is less about investor exuberance and more about eroding trust in the dollar. The real story is not a newfound appetite for risk — it’s a flight from the perceived fragility of the US dollar.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Designing for the Real World: Reflections on building with the Finternet",
      "link": "https://cryptoslate.com/designing-for-the-real-world-reflections-on-building-with-the-finternet/",
      "summary": "<p>The following is a guest post and opinion from Anurag Arjun, Co-Founder of Avail. The next financial architecture won’t just move money faster — it will make value, identity, and rights verifiable and enforceable across fragmented systems and real-world institutions. Every time we build a new payment system, we rebuild the rails. Every new identity [&#8230;]</p> <p>"
    },
    {
      "title": "Barclaycard ‘Makes Money Work For You’ unless you want to buy crypto – because its banned",
      "link": "https://cryptoslate.com/barclaycard-makes-make-money-work-for-you-unless-you-want-to-buy-crypto/",
      "summary": "<p>Barclays bank has announced it will block customers from using Barclaycard credit cards to buy crypto starting June 27 The move was quietly confirmed in a newly updated FAQ section on the bank’s official website. According to Barclays, the decision stems from concerns over consumer protection and repayment risks. The bank warned that crypto price [&#8230;]</p> <p>"
    },
    {
      "title": "From FBI raids to unicorn status: Inside Polymarket’s explosive new $1 billion valuation",
      "link": "https://cryptoslate.com/from-fbi-raids-to-unicorn-status-inside-polymarkets-explosive-new-1-billion-valuation/",
      "summary": "<p>Peter Thiel’s venture firm is leading a nine‑figure Series C that values the on‑chain prediction market at $1 billion, even as U.S. regulators still block the platform from its largest potential audience. Polymarket, the blockchain‑based prediction platform that lets traders bet on everything from the U.S. presidential race to Taylor Swift’s tour dates, is poised to raise [&#8230;]</p> <p>"
    },
    {
      "title": "K-Won is coming: South Korea’s 8 mega-banks to unleash world’s newest stablecoin shockwave",
      "link": "https://cryptoslate.com/south-koreas-biggest-banks-unite-for-won-backed-stablecoin-to-reclaim-monetary-sovereignty/",
      "summary": "<p>South Korea’s eight largest commercial banks have joined forces to launch a Korean-won-pegged stablecoin, forming the country’s first unified financial consortium dedicated to this purpose. The initiative, quietly coordinated by the Open Blockchain &#38; DID Association and overseen by the Financial Supervisory Service (FSS), aims to pilot issuance by early 2026 The participating banks, KB [&#8230;]</p> <p>"
    },
    {
      "title": "Near Protocol faces pivotal vote to slash token inflation by half",
      "link": "https://cryptoslate.com/near-protocol-faces-pivotal-vote-to-slash-token-inflation-by-half/",
      "summary": "<p>A new proposal from HOT Protocol, a decentralized group operating on the NEAR Protocol, has called for a significant reduction in the AI crypto project&#8216;s token inflation rate. On June 24, the decentralized organization submitted a plan to slash NEAR&#8217;s annual inflation rate from 5% to 2.5%. The proposal aims to enhance the long-term sustainability [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "GoldenMining Investors Earn Average Profit of $9,800 on Bitcoin Surge Day Stable Daily Income Model Attracts Thousands to Join Global Cloud Mining Platform",
      "link": "https://www.newsbtc.com/news/goldenmining-investors-earn-average-profit-of-9800-on-bitcoin-surge-day-stable-daily-income-model-attracts-thousands-to-join-global-cloud-mining-platform/",
      "summary": "As geopolitical developments continue to impact global markets, the cryptocurrency space remains highly reactive. Earlier this week, Bitcoin (BTC) dipped below the $100,000 mark amid heightened tensions in the Middle East. However, with tensions easing, market optimism rebounded swiftly, propelling BTC through multiple technical resistance levels. The rally underscored Bitcoin’s strength as “digital gold.” Amid this volatile market, GoldenMining, a leading global intelligent cloud mining platform, reported that its investors earned an average of $9,800 per person in daily profits during the surge, demonstrating the platform’s ability to capitalize on market swings. GoldenMining Cloud Mining: Simplifying Profitability for Everyday Traders GoldenMining has optimized its AI-driven cloud mining services under a ‘Hash Power as a Service’ (HaaS) model. Backed by 13+ data centers and multi-currency support, it currently supports BTC, Litecoin (LTC), and Dogecoin (DOGE)—among the most active and profitable mining options on the platform. Technology, Security, and Performance at the Core GoldenMining’s continued success lies in its technology and commitment to user performance: AI Intelligent Computing Engine The proprietary ‘Smart Computing Chain’ analyzes 100,000+ market data points hourly using deep learning and parallel computing. Hash power is dynamically allocated to the most profitable assets in real time. AI Hash Rate Scheduling Adjusts for BTC network difficulty and mining pool fees to optimize hash power usage and maximize returns. Fully Automated Income System Once contracts are active, earnings are automatically deposited into users’ wallets—no manual action required. Flexible Contracts for All Investors Contract durations include 5-day, 12-day, 25-day, 30-day, and 45-day terms. Profit Reinvestment Option Users can enable automatic reinvestment of daily earnings for compounding growth. Multi-Currency Support BTC contracts can be funded using USDT, DOGE, ETH, and BNB with real-time exchange and transparent settlement. How to Get Started GoldenMining makes it simple to begin earning: Register an Account Sign up at GoldenMining.com and claim a $15 new user bonus. Choose a Mining Plan Select from a variety of contract terms based on your budget and goals. Activate and Start Mining The system begins mining automatically using optimized hash power. Receive Daily Payouts Profits are settled and distributed daily, with funds available for withdrawal or reinvestment. Sample Contracts &#38; Estimated Profits Contract Price Estimated Profit Total Return Elphapex DG1+ $100 $6 $106 Bitmain Antminer S23 Hyd $650 $41.27 $691.27 Antminer L9 17GH $1,800 $280.8 $2,080.8 Antminer L9 16GH $4,500 $1,518.75 $6,018.75 ElphaPex DG Hydro 1 $7,800 $3,276 $11,076 Elphapex DG2 $12,000 $8,100 $20,100 Elphapex DG2+ $28,000 $22,680 $50,680 Profits are credited the next day. Users can withdraw once their balance reaches $100 or reinvest for increased earnings. CEO Statement A GoldenMining spokesperson noted that thanks to the platform’s proprietary AI engine, early adopters have seen annualized net returns exceeding 500%, underscoring both the profitability and resilience of the system. About GoldenMining Headquartered in London, UK, GoldenMining serves over 1.5 million users globally, with daily contract settlements surpassing $100 million. As the digital economy matures, GoldenMining stands out as a key driver of sustainable and intelligent crypto investment. Join GoldenMining Toda Unlock smarter, more stable returns from cryptocurrency. Visit GoldenMining.com Contact: info@GoldenMining.com Disclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of . does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
      "title": "Dogecoin Price Closes Daily Candle With A Doji, What This Means",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-daily-candle-with-doji/",
      "summary": "The Dogecoin price is in focus, having closed the daily candle with a Doji. Crypto analyst Trader Tardigrade commented on this development and revealed what it could mean for the foremost meme coin. What’s Next For Dogecoin Price Following Doji Daily Close In an X post, Trader Tardigrade highlighted the fact that the Dogecoin price daily candle closed with a Doji. He remarked that a new sign of a breakout has emerged following a Doji at the end of a downtrend. The analyst noted that this indicates a high possibility of a trend reversal from downtrend to uptrend. Related Reading: Dogecoin Price Enters Historical Bounce Zone, But Will This Time Be Different? The Dogecoin price has witnessed a massive decline over the last month, down over 27% during this period, according to CoinMarketCap data. DOGE has dropped way below the psychological $0.2 price level, providing a bearish outlook for the meme coin. However, Trader Tardigrade’s analysis suggested that the meme coin could soon record another massive rally to the upside. The analyst’s accompanying chart showed that the Dogecoin price could reclaim the $0.2 level on this projected trend reversal to the upside. Fundamentals also support a DOGE rally, seeing as tensions in the Middle East have cooled off, with Israel and Iran agreeing to a ceasefire. Meanwhile, the Bitcoin price has again rallied and reclaimed the $106,000 level. This is bullish for the meme coin given its correlation with the flagship crypto. In another X post, Trader Tardigrade provided a bullish outlook for the Dogecoin price, stating that DOGE season could be approaching soon. He revealed that the DOGE/BTC pair has experienced the last shakeout, signaling the start of the meme coin’s season. His accompanying chart showed that Dogecoin could rally above $2 once this DOGE season begins. Key Levels To Watch For DOGE In a YouTube video, crypto analyst Kevin Capital highlighted the range between $0.12 and $0.142 as the key level to watch for the Dogecoin price. The analyst also alluded to DOGE’s weekly Relative Strength Index (RSI), stating that the meme coin cannot afford to drop below 38. He claimed that a drop could lead to the meme coin falling into a bear market structure. Related Reading: Dogecoin Price Crash Below $0.2: 4H Order Block Shows Exactly What’s Happening Kevin Capital then highlighted the DOGE/BTC pair, noting that the meme coin is at a critical level that it needs to hold above if it is to outperform Bitcoin later in the year. The analyst expects the meme coin to make a significant run and outperform the flagship crypto when the Fed begins to ease monetary policies. The analyst remarked that a positive for DOGE is that there are bullish indicators flashing for the meme coin on the daily timeframe. At the time of writing, the Dogecoin price is trading at around $0.16, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "Best Crypto to Buy as Polymarket Nears $1B Valuation & BitGo Hits $100B in Crypto Custody",
      "link": "https://www.newsbtc.com/news/best-crypto-to-buy-as-polymarket-nears-1b-valuation-bitgo-hits-100b/",
      "summary": "In a sign of crypto’s accelerating maturation, two major developments reinforce how institutional adoption and investor confidence are surging in tandem. BitGo, one of the largest crypto custodians, has seen its assets under custody balloon to $100B in 2025. Polymarket – a decentralized prediction market – is set to raise $200M at a $1B valuation, riding the wave of surging interest in crypto-native applications. The stories showcase how demand for both regulated, institutional-grade services and platforms is growing rapidly. Safety Plus Speculation BitGo’s rise underscores the growing institutional hunger for secure, compliant infrastructure. The California-based firm now holds $100B in digital assets, a 66% increase from $60B at the start of the year. Much of that growth comes from increased demand for staking services (which now account for half of its holdings) and from a rising tide of institutional adoption. BitGo also expanded into South Korea in 2024 and Dubai in 2025, further building on an already powerful foundation in its aim to become more competitive in the industry. In contrast, Polymarket’s trajectory highlights the viral growth of speculative, user-driven DeFi applications. The platform, known for letting users bet on everything from elections to sports outcomes, surged in popularity during the 2024 U.S. presidential cycle, processing over $3.3B in bets. Now, Peter Thiel’s Founders Fund is reportedly leading a $200M funding round, positioning Polymarket to become a unicorn asset And this immediately after Polymarket announced a partnership with X. The timing is perfect: there&#8217;s a strong appetite for decentralized markets offering high-risk, high-reward plays. Confidence on Two Fronts These contrasting success stories reveal a broader truth: crypto is no longer a monolith. Institutional players are flocking to battle-tested custodians like BitGo, who offer the compliance and security infrastructure needed to satisfy regulators (so far, at least: BitGo remains banned in the US). Meanwhile, crypto-native projects like Polymarket are pulling a different kind of capital – Venture Capitals betting on engaging decentralized apps that leverage core blockchain values of trustless systems and open markets. Both Bitgo and Polymarket demonstrate the growing confidence in the crypto economy, and the potential lying in wait. Confidence from institutions, who now see crypto as a serious asset class, and from venture backers, who see new economic behaviors forming around blockchain-native markets. BitGo’s next chapter could include a public listing by late 2025. And Polymarket is reportedly exploring a token launch – a move that could further incentivize users and decentralize governance. Interested in tapping into that same retail interest? Here are three of the best crypto to buy now. 1. Snorter Token ($SNORT) – Find and Snipe Best Solana Meme Coins Want to know a meme coin trading secret? Some of the best Solana meme coins never make it to major platforms. They trade ‘underground,’ on platforms like Telegram. Trading them isn’t just about getting the right insider info; it’s about finding them and executing razor-sharp, perfectly timed trades. That’s precisely where Snorter Token ($SNORT) comes in. It’s the newest and best Solana meme crypto trading bot. Snorter provides a suite of advanced algorithmic trading tools, including automated sniping and fast swaps with built-in front-running protection. Snorter isn’t just about being fast – it emphasizes staying safe as well, with honeypot detection and rugpull protection. The $SNORT token powers the ecosystem, and with plans to expand to EVM chains and launch a dedicated user dashboard, Snorter could rapidly become the go-to meme coin trading bot. Visit the Snorter Token presale page today. 2. Best Wallet Token ($BEST) – The Web3 Wallet for a New Crypto Economy Polymarket expansion, BitGo staking – it’s all part of an increasingly integrated Web3 world. Best Wallet Token ($BEST) is your best tool for navigating that world, based on core Web3 principles: Decentralized – you control your own crypto keys Secure – with MPC and advanced biometrics, you can trade and swap safely The wallet offers an exclusive ‘Upcoming Tokens’ section with information and in-wallet purchases for the best crypto presales, giving you access to tomorrow’s 100x tokens today. The $BEST token piles on more benefits, including reduced transaction fees and better staking rewards. The Best Wallet app forms the linchpin of the growing Best Wallet ecosystem, which also includes free airdrops and the upcoming Best Card. Learn how to buy Best Wallet token with our guide. Visit the Best Wallet Token website. 3. Tron ($TRX) – Altcoin Chain with 125% Gains Over Past Year Even with a $25B market cap, Tron ($TRX) somehow often gets overlooked. That’s a bit unfair to the ecosystem itself, but presents a golden opportunity for savvy investors. In fact, over the past year $TRX has posted 123% gains. Those gains are fueled not only by $TRX, but by broader activity on the Tron network, including $USDT. The world’s leading stablecoin ($156B market cap) is heavily traded on Tron. The demand led to a recent minting of another $2B on the network. With stablecoins increasingly in the public eye – see the recent GENIUS Act – that demand is likely to only increase. BitGo and Polymarket Demonstrate Bullish Market Corporate success with BitGo and Polymarket shows just how broad the interest in crypto actually is – from retail investors to venture capitalists. And it makes these tokens some of the best crypto to buy right now. As always, do your own research – this isn’t financial advice."
    },
    {
      "title": "XRP Whales Go All-In On Altcoin Dip, Calling Sub-$2 Prices A ‘Gift’",
      "link": "https://www.newsbtc.com/altcoin/xrp-whales-go-all-in-on-altcoin-dip-calling-sub-2-prices-a-gift/",
      "summary": "XRP climbed more than 7% in a single day, jumping from about $1.92 over the weekend to $2.20 today. Traders say Bitcoin’s move back above $106K gave altcoins a breather after a rough patch. That lift sent XRP bulls into a frenzy and set off fresh chatter about how high the coin could go. Related Reading: Bunker Buster: Ethereum Titans Stake $100 Million Amid US-Iran Hostilities XRP Whales Loading Up Under $2 According to Crypto Bitlord, big players made their move when XRP dipped below $2. He called those dips a “gift” for anyone who believes in a $7 target. That kind of confident talk can spark FOMO fast. When whales buy millions of dollars’ worth of XRP, smaller investors want in, too. Monster whales are loading the $XRP dip. Anything under $2 is a gift. When you know it’s going to $7 it’s no longer gambling. It’s pure belief. — Crypto Bitlord (@crypto_bitlord7) June 23, 2025 Bullish Targets In Sight Based on reports from social channels, Crypto Bitlord reckons XRP’s next stop is $7—and he doesn’t expect the price to fall below $2 again. In his words, “Not in this lifetime.” To reach $7 from today’s level, XRP needs to climb about 210%. That jump would lift its market cap above $410 billion and push its fully diluted cap near $700 billion. $XRP will never be under $2 again. Not in this lifetime. — Crypto Bitlord (@crypto_bitlord7) June 23, 2025 ETF And Institutional Buzz A growing number of spot XRP ETF applications has fed more optimism. Bitcoin analyst George Tung put an $8 price tag on XRP for year-end, calling that a safe estimate. Crypto analyst Bearable Bull agreed on $8, saying it’d mark the start of a new chapter. Some even think $10 is too low. All this buzz is a sign that institutions are eyeing XRP hard. $8 XRP Is Next 😈 The Generational Wealth Journey For XRP Is About To Come To An End.. So It’s Time For A Brand New Beginning 🤙 The Man Behind The Bull Has Arrived 😤🐂 My Privacy Has Been Key For The Past 7 Years As I’ve Built Numerous Successful Businesses In Crypto… pic.twitter.com/g0EOyr6bBp — The Bearable Bull (@thebearablebull) May 22, 2025 Legal Clarity And Market Moves Meanwhile, regulatory decisions will play a big part in whether belief turns into reality. XRP’s long fight with regulators has hung over it for years. If courts give a clear green light, we could see similar jumps in other tokens. If not, bulls may have to wait even longer. Investors shouldn’t count on instant fireworks just because someone yells “$7.” It takes real-world adoption, legal wins, and big-money backing to push prices that high. Markets have surprised us before. This time, though, faith will only go so far without solid proof. Related Reading: Bitcoin Paces $15 Billion YTD Influx Amid 10-Week Fund Flow Streak Overall, today’s rally shows how much belief drives crypto moves. People buy with their guts as much as their brains. XRP’s next chapters will depend on both confidence and concrete wins. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Crypto Rally Or Crash? Powell Just Made July The Market’s Make-Or-Break",
      "link": "https://www.newsbtc.com/news/crypto-rally-or-crash-powell-july-make-or-break/",
      "summary": "Federal Reserve Chair Jerome Powell’s appearance on Capitol Hill Tuesday left risk-asset traders with a single, binary question: does the most interest-sensitive summer in years end with a crypto breakout or a macro-driven crash? In a prepared statement, Powell stressed that “inflation has eased significantly from its highs in mid-2022 but remains somewhat elevated,” adding that the Federal Open Market Committee is “well-positioned to wait to learn more about the likely course of the economy before considering any adjustments to our policy stance.” Crypto’s Fate May Be Sealed In July For crypto markets already oscillating on every nuance of policy guidance, the message was clear: the next four weeks—anchored by the 12 July CPI release and the 19 July payrolls report—will decide whether July’s FOMC delivers relief or a reality check. POWELL: WE WOULD EXPECT TO SEE MEANINGFUL TARIFF INFLATION EFFECTS JUNE, JULY AUGUST POWELL: IF WE DON&#8217;T SEE THAT, THAT WOULD LEAD TO CUTTING EARLIER — *Walter Bloomberg (@DeItaone) June 24, 2025 Powell’s caution sits atop a rare public split inside the Board itself. Governors Michelle Bowman and Christopher Waller, both Trump appointees, have openly argued that tariff-related price spikes are likely to be “one-time shifts” and therefore should not stand in the way of an early cut—potentially as soon as the 30 July meeting. Seven of their colleagues disagree, laying out projections that keep policy unchanged through December. Powell, for his part, told lawmakers: “I don’t think we need to be in any rush, because the economy is still strong.” Related Reading: Crypto Bull Run Over? Here’s What A Top Trader Just Said Markets reacted by flattening the front end of the curve. Two-year Treasury yields fell to 3.806 percent, while the benchmark 10-year dipped to 4.285 percent—both lows not seen since early May—after the testimony and a surprise cease-fire in the Middle East turbo-charged a global “risk-on” bid. Yet expectations for July remain finely balanced: CME FedWatch shows that traders have whittled the probability of a first 25-basis-point cut to roughly 19%. Crypto traded the cross-currents rather than the headline. Bitcoin, which had cratered to $99,000 on Monday, reclaimed $106,000 by Wednesday morning, mirroring the rebound in equities and high-beta currencies as the dollar slumped on falling yields. Ethereum, meanwhile, held above $2,400—even as Powell’s tone was widely described as hawkish. The broader crypto complex moved in sympathy, with BNB punching through $644 and Solana stabilising near $146. Related Reading: Crypto Gets A Green Light From Spanish Banking Giant Veteran traders on X distilled the stakes. Pseudonymous analyst Byzantine General wrote, “We got a lot of clarity now. All eyes on the July CPI print.” Nic from CoinBureau added that July “is in play—maybe—but nothing’s locked in,” as Powell’s testimony brought no big surprises. Meanwhile, Jim Bianco commented: “Trump appointees Waller and Bowman are suggesting a July cut. Powell is reiterating ‘no.’ Will the July FOMC meeting see at least two dissenters?” For now, Powell’s “watch and wait” stance has bought the FOMC four more weeks of optionality. If July inflation confirms the down-trend, the policy door swings open, and the next rally for crypto could morph into a full-blown melt-up. If it doesn’t, the crash could come just as fast. As Byzantine General put it, the market “got clarity.” What it did not get is comfort. At press time, Bitcoin traded at $106,892. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [],
  "Decrypt": [
    {
      "title": "Spoils of $1.5 Billion Bybit Hack Traced to Greek Crypto Exchange: Report",
      "link": "https://decrypt.co/326900/spoils-1-5-billion-bybit-hack-traced-greek-crypto-exchange-report",
      "summary": "An unidentified individual received a large sum of Ethereum into a wallet on a Greek exchange, prompting local authorities to investigate."
    },
    {
      "title": "Kraken Embed is a 'One-Stop Shop' for TradFi Crypto Integrations",
      "link": "https://decrypt.co/videos/interviews/iLTFesTy/kraken-embed-is-a-one-stop-shop-for-tradfi-crypto-integrations",
      "summary": "is joined by Brett McLean, Head of Payments and Blockchain Business Unit at Kraken, to discuss why liquidity matters more to traders than trading volume, and how its new Kraken Embed service for fintechs reflects the evolving role of centralized exchanges in the crypto ecosystem."
    },
    {
      "title": "Can AI Crack the Cat Code? Baidu Thinks So",
      "link": "https://decrypt.co/326907/ai-translate-cat-meows-baidu",
      "summary": "A new patent proposes translating cat “meows” and body language into plain speech, but scientists say the technology may still be chasing its tail."
    },
    {
      "title": "Polymarket Nails NYC Democratic Mayoral Primary Upset, Nears $1B Unicorn Valuation",
      "link": "https://decrypt.co/326892/polymarket-nails-nyc-democratic-mayoral-primary-upset-nears-1b-unicorn-valuation",
      "summary": "Blockchain-based prediction markets correctly forecast Zohran Mamdani's Democratic NYC mayoral primary victory."
    },
    {
      "title": "Anthropic Scores Partial Victory in Copyright Case Over AI Training Data",
      "link": "https://decrypt.co/326890/anthropic-gains-partial-victory-in-copyright-case-over-ai-training-data",
      "summary": "The AI firm downloaded over seven million pirated books to assemble its research library, internal emails revealed."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Fed’s Powell says Bitcoin and crypto have matured and become more mainstream",
      "link": "https://cryptobriefing.com/crypto-mainstream-adoption-fed/",
      "summary": "<p>The mainstreaming of crypto prompts regulatory reassessment, potentially reshaping financial policies and banking practices globally.</p> <p>"
    },
    {
      "title": "Starknet-based zkLend shuts down following exploit and ZEND token delisting from major exchanges",
      "link": "https://cryptobriefing.com/zklend-shutdown-zend-delisting/",
      "summary": "<p>The shutdown highlights the vulnerabilities in DeFi protocols and may deter investor confidence, impacting future decentralized finance projects.</p> <p>"
    },
    {
      "title": "Banking giant Barclays to block all crypto transactions on credit cards over debt and fraud concerns",
      "link": "https://cryptobriefing.com/barclays-crypto-ban-cards/",
      "summary": "<p>Barclays' crypto credit card ban highlights growing financial institutions' caution, potentially influencing global regulatory approaches.</p> <p>"
    },
    {
      "title": "Blockchain venture Republic to offer digital tokens tracking shares of Elon Musk’s SpaceX",
      "link": "https://cryptobriefing.com/tokenized-private-shares-spacex/",
      "summary": "<p>Republic's token initiative could democratize access to high-value private firms, but regulatory hurdles may challenge its long-term viability.</p> <p>"
    },
    {
      "title": "Arizona Bitcoin Reserve bill HB2324 passes House, heads to Governor Hobbs for signature",
      "link": "https://cryptobriefing.com/arizona-bitcoin-reserve-hb2324/",
      "summary": "<p>Arizona's move to establish a state-managed crypto reserve could set a precedent for integrating digital assets into public financial systems.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Is this the end of easy crypto in Turkey? Here’s what’s changing",
      "link": "https://ambcrypto.com/is-this-the-end-of-easy-crypto-in-turkey-heres-whats-changing/",
      "summary": "<img alt=\"Is this the end of easy crypto in Turkey? Here&#039;s what&#039;s changing\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-8-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As Turkey introduces its most ambitious crypto rules yet, exchanges face higher compliance and capital demands."
    },
    {
      "title": "Bitcoin: THIS group refuses to sell – Are more gains on the way?",
      "link": "https://ambcrypto.com/bitcoin-this-group-refuses-to-sell-are-more-gains-on-the-way/",
      "summary": "<img alt=\"Bitcoin: THIS group refuses to sell - Are more gains on the way?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-11-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin's long-term holders refuse to sell, with LTH spending hitting a two-week low."
    },
    {
      "title": "Pepe Dollar’s Federal Reserve parody gains major attraction amongst Bitcoin investors, BTC whales load up on PEPD",
      "link": "https://ambcrypto.com/pepe-dollars-federal-reserve-parody-gains-major-attraction-amongst-bitcoin-investors-btc-whales-load-up-on-pepd/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"547\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-25-191713.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"933\" />Bitcoin (BTC) investors are increasingly drawn to Pepe Dollar (PEPD), captivated by its clever Federal [&#8230;]"
    },
    {
      "title": "Trump’s executive order – Will it end crypto firms’ banking struggles?",
      "link": "https://ambcrypto.com/trumps-executive-order-will-it-end-crypto-firms-banking-struggles/",
      "summary": "<img alt=\"Trump to “debank” key sectors.\" class=\"attachment-full size-full wp-post-image\" height=\"896\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Trump-to-debank-key-sectors.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1593\" />Trump's crypto protection order may dismantle Operation Chokepoint 2.0, restoring fair banking for blockchain firms."
    },
    {
      "title": "TRON – Retail vs. whales: TRX’s next move hinges on THIS…",
      "link": "https://ambcrypto.com/tron-retail-vs-whales-trxs-next-move-hinges-on-this/",
      "summary": "<img alt=\"TRX\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-25T114403.297-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Old wallets woke up and they brought billions with them."
    }
  ]
}