{
  "CoinDesk": [
    {
      "title": "DOGE Surges 9% Before Sharp Reversal as $0.213 Resistance Halts Rally",
      "link": "https://www.coindesk.com/markets/2025/07/12/doge-surges-9-before-sharp-reversal-as-0213-resistance-halts-rally",
      "summary": ""
    },
    {
      "title": "Why is XRP Up Today? Whale-Driven Rally Sends Ripple to Nearly $3",
      "link": "https://www.coindesk.com/markets/2025/07/12/why-is-xrp-up-today-whale-driven-rally-sends-ripple-to-nearly-3",
      "summary": ""
    },
    {
      "title": "Ethereum ETFs See Inflow Surge as BlackRock’s ETHA Draws in Record $300M in a Day",
      "link": "https://www.coindesk.com/markets/2025/07/11/ethereum-etfs-see-inflow-surge-as-blackrocks-etha-draws-in-record-300m-in-a-day",
      "summary": ""
    },
    {
      "title": "State of Crypto: Previewing Congress' 'Crypto Week'",
      "link": "https://www.coindesk.com/policy/2025/07/11/state-of-crypto-previewing-congress-crypto-week",
      "summary": ""
    },
    {
      "title": "Strategy, Metaplanet and Others Sit on Billions in Bitcoin Gains — and They’re Not Selling",
      "link": "https://www.coindesk.com/markets/2025/07/11/strategy-metaplanet-and-others-sit-on-billions-in-bitcoin-gains-and-they-re-not-selling",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "US Bitcoin ETFs record first back-to-back $1B inflows",
      "link": "https://cointelegraph.com/news/bitcoin-etf-1b-inflows-btc-price-surge-blackrock-ibit?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzAzZTEtZWJhZS03Yzg2LTk1NTMtMTA3YzA3MGQzZWM3.jpg\" /></p><p>US-based spot Bitcoin ETFs saw over $1 billion in inflows on two straight days for the first time ever, as Bitcoin hit new all-time highs this week.</p>"
    },
    {
      "title": "Altcoins are rocketing, Bitcoin dominance hasn’t ‘even sneezed’: Analyst",
      "link": "https://cointelegraph.com/news/altcoin-crypto-market-surging-bitcoin-dominance-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ZjOTYtNjg4Ni03YTZjLTkwZGItMzM0ZjcxOWU4MWMx.jpg\" /></p><p>Crypto analyst Matthew Hyland suggests altcoins will be “ripping” much more when Bitcoin Dominance drops to 45%.</p>"
    },
    {
      "title": "XRP’s &#039;very positive sign’ — Whales soar to new highs as price jumps 10%",
      "link": "https://cointelegraph.com/news/xrp-whales-new-highs-price-surge-crypto-rally?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ZiYWYtZmY5My03NjFiLWI2MDUtYWUxNTc3YWZlOTlk.jpg\" /></p><p>Santiment data shows the number of XRP whales has just hit an all-time high as the price of XRP continues to rally.</p>"
    },
    {
      "title": "Bitcoin Christmas rally to $200K or $300K possible based on ‘power law’ model",
      "link": "https://cointelegraph.com/news/bitcoin-christmas-rally-to-dollar200k-or-dollar300k-possible-based-on-power-law-model?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDZmNmEtOTJiNy03MGU5LThlYTAtYjI1OGQxNDA0MGUx.jpg\" /></p><p>Bitcoin’s parabolic rally could last until Christmas with a cycle top near $300,000, according to one analyst.</p>"
    },
    {
      "title": "Bitzlato co-founder requests US pardon after guilty plea — Report",
      "link": "https://cointelegraph.com/news/bitzlato-founder-anatoly-legkodymov-pardon-trump?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTU3ODItNDJjNS03YTU3LTk4OTAtNjE3OGQzNjhiYWFl.jpg\" /></p><p>US President Donald Trump has issued five pardons for figures in the crypto and blockchain industries, and may have received requests from Changpeng Zhao and Sam Bankman-Fried.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Tether to sunset USDT redemptions on 5 ‘legacy’ networks including Bitcoin Cash, Algorand",
      "link": "https://cryptoslate.com/tether-to-sunset-usdt-redemptions-on-5-legacy-networks-including-bitcoin-cash-algorand/",
      "summary": "<p>Tether announced it will discontinue support for its USDT stablecoin on five &#8220;legacy&#8221; blockchains, including Omni Layer, Bitcoin Cash SLP, Kusama, EOS, and Algorand. According to the July 11 announcement, the move will become effective Sept. 1, ending redemptions and freezing remaining tokens on those networks. The decision comes as part of what the company [&#8230;]</p> <p>"
    },
    {
      "title": "NFT-related tokens soar in Q2, with PENGU leading despite decline in trading volumes",
      "link": "https://cryptoslate.com/nft-related-tokens-soar-in-q2-with-pengu-leading-despite-decline-in-trading-volumes/",
      "summary": "<p>NFT-related tokens delivered the strongest sector performance in the second quarter, gaining an average of 55.4% even as dollar-denominated NFT trading volume fell to multi-year lows. Artemis data shows that the average gains from NFT-related tokens surpassed the second-best performance, which was Ethereum’s (ETH) 37.2%, by nearly 50%. Pudgy Penguins’ PENGU token accounted for much [&#8230;]</p> <p>"
    },
    {
      "title": "Binance allegedly wrote the code for WLFI’s stablecoin USD1",
      "link": "https://cryptoslate.com/binance-allegedly-wrote-the-code-for-wlfis-stablecoin-usd1/",
      "summary": "<p>Former Binance CEO Changpeng Zhao allegedly supported crypto projects tied to the Trump family while privately seeking a presidential pardon, according to a July 11 Bloomberg News report. The report claimed that Binance wrote the foundational smart contract code for USD1, a stablecoin issued by World Liberty Financial, a company affiliated with President Donald Trump. [&#8230;]</p> <p>"
    },
    {
      "title": "BlackRock’s IBIT vaults over $80B in assets, breaks ETF speed record",
      "link": "https://cryptoslate.com/blackrocks-ibit-vaults-over-80b-in-assets-breaks-etf-speed-record/",
      "summary": "<p>BlackRock’s iShares Bitcoin Trust (IBIT) crossed $80 billion in assets under management on July 10, becoming the fastest exchange-traded fund (ETF) to reach the threshold in 374 trading days. Bloomberg senior ETF analyst Eric Balchunas noted on X that IBIT outperformed the Vanguard S&#38;P 500 ETF (VOO), which took 1,814 days to accumulate the same [&#8230;]</p> <p>"
    },
    {
      "title": "Altcoins roar as Bitcoin hits new all-time highs, Cardano and XRP surge over 10%",
      "link": "https://cryptoslate.com/altcoins-roar-as-bitcoin-hits-new-all-time-highs-cardano-and-xrp-surge-over-10/",
      "summary": "<p>Bitcoin (BTC) registered a new all-time high of $118,287.46 on July 11 and is up 3.3% in the past 24 hours, but major altcoins are leading the gains during the same period. Ethereum (ETH) breached the $3,000 threshold for the first time since Feb. 2, and is currently trading at $2,987.55 as of press time, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Why The Solana Price Could Crash To $95 Before Reaching $200",
      "link": "https://www.newsbtc.com/news/solana/solana-price-crash-to-95-200/",
      "summary": "The Solana price has fallen by a considerable amount after hitting an all-time high of almost $300 back in January 2025. Even with the recent market recovery, the price is still sitting over 45% below its all-time high price, highlighting the struggles that the altcoin has faced in recent times. Amid this, a crypto analyst has suggested that the Solana price could crash even further from here, predicting a 40% crash could be in the cards once more. Why Solana Could See A Price Crash Crypto analyst The Alchemist Trader has highlighted the development of a rare bullish harmonic pattern on the Solana price chart. Now, while this pattern formation is inherently bullish for any digital asset, the shorter term does come with some hurdles for the altcoin to surmount first. Related Reading: Bitcoin Open Interest Climbs Above December 2024 Levels, Here’s What Happened Last Time The main thing to focus on here is that this bullish pattern does initially trigger a liquidity sweep of previous lows. In this case, the recent Solana price low lies at the $95 level, which is a 40% decrease from its current price, trending above $150. The possibility of this low sweep is made even more prominent by a couple of technical developments on the chart. The first technical point the analyst shows is the Point of Control (POC) Battle. According to the analysis, the Solana price is now testing this POC level with low momentum, shown by the slow climb over the last few days. Additionally, there is also mounting resistance at the Value Area High and the 0.618 Fibonacci level, which lies just above $163. Then, there is the completion of the C-leg of the wave, putting it as low as $95. A crash to this level becomes more likely if the Solana price fails to break through the resistance with conviction. If the price is rejected and the C-leg does play out, then this correction is expected to trigger the 40% crash to the $95 level. It’s Not All Bearish News As already mentioned above, the bearish leg of the rare bullish harmonic pattern is only temporary and often gives way to an even stronger impulse move. As the crypto analyst explains, the crash to $95 will only happen in the immediate short term, but it does not actually invalidate the overall bullish trend. Related Reading: Market Expert Says It’s Now ‘Illegal’ To Short Bitcoin, Here’s Why Once the D-leg is over and the crash is completed, the crypto analyst predicts that the Solana price will start to rally again. From the predicted $05 lows, an over 100% move is expected to take it back to $200 and beyond before the rally is over. The analyst explains that &#8220;Until this scenario is confirmed or invalidated, Solana remains range-bound between major high time frame levels.” Therefore, “Traders should stay alert for signs of rejection at current resistance — or, conversely, a volume-backed breakout above the value area high that would negate the harmonic setup.” Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Happy Ending: Crypto Hacker Returns Funds From $42 Million GMX Exploit",
      "link": "https://www.newsbtc.com/news/happy-ending-crypto-hacker-returns-funds-from-42-million-gmx-exploit/",
      "summary": "In a positive development for the crypto community, the individual responsible for the GMX exploit accepted the platform’s bounty and returned over $40 million worth of assets stolen from the project. Related Reading: Drop NFTs Like It’s Hot: Snoop Dogg’s Telegram Collection Raises $12M In 30 Minutes Crypto Hacker Takes $42 Million From GMX On Friday, the recent GMX V1 exploit ended on a happy note after the individual responsible for the incident turned into a white-hat hacker. Perpetual and spot crypto exchange GMX lost over $40 million on Wednesday when an attacker exploited a vulnerability in the protocol’s first version on Arbitrum. According to online reports, GMX V1’s vault contract had a vulnerability that allowed the attacker to manipulate the GLP token price through the system’s calculations. Blockchain security firm SlowMist explained that “The root cause of this attack stems from GMX v1&#8217;s design flaw, where short position operations immediately update the global short average prices (globalShortAveragePrices), which directly impacts the calculation of Assets Under Management (AUM), thereby allowing manipulation of GLP token pricing.” Through a reentrancy attack, they successfully established massive short positions to manipulate the global average prices, artificially inflating GLP prices within a single transaction and profiting through redemption operations. As a result, approximately $42 million worth of assets, including Legacy Frax Dollar (FRAX), wrapped bitcoin (WBTC), wrapped ETH (WETH), and other tokens, were transferred from the GLP pool to an unknown wallet. The perpetual crypto exchange halted GMX V1’s trading and GLP’s minting and redeeming on both Arbitrum and Avalanche to prevent another attack and protect users’ funds. However, they clarified that the exploit was limited to GMX’s V1 and its GLP pool. GMX V2, its markets, or liquidity pools, and the GMX token were not affected and remained safe. White-Hat Claims $5 Million Bounty Following the incident, GMX sent a message on-chain and on X offering a $5 million white-hat bounty to the attacker, claiming that their abilities were “evident to anyone looking into the exploit transactions.” GMX’s team noted that returning the funds within the next 48 hours and accepting the bounty would allow the hacker to “spend the funds freely,” instead of taking additional risks to access them. They also vowed not to pursue any legal action and to assist the exploiter in providing proof of source for the funds if it is ever required. Today, the exploiter responded in an on-chain message, accepting the bounty and starting the return process. As Lookonchain reported, they initially returned $10.49 million worth of FRAX on Friday morning. Meanwhile, another $32 million worth of assets had been swapped into 11,700 ETH, which are now valued at $35 million after the King of Altcoins’ price jumped to the $2,990 mark. In the following hours, the hacker returned 10,000 ETH, worth $30 million, keeping only 1,700 ETH, valued at $5.2 million, as the bounty. Related Reading: Solana Ready For $160 Reclaim? Analysts Say Breakout Is A Matter Of Time GMX later confirmed that the funds have now been safely returned and thanked the white-hat hacker for their actions, ultimately giving a positive turn to the incident. Lastly, they informed users that “contributors are working on a proposed distribution plan for presentation to the GMX DAO and will share more information shortly.” Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Bitcoin Breaks Records: What Miners and Leverage Traders Are Doing Behind the Scenes",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-breaks-records-what-miners-and-leverage-traders-are-doing-behind-the-scenes/",
      "summary": "Bitcoin has surpassed its previous all-time high, reaching $118,254 and marking a notable milestone in its price trajectory. This latest milestone comes after BTC&#8217;s former high at $111,000 levels in May, representing a 10% gain over the past week and roughly 5.9% in the last 24 hours. At the time of writing, Bitcoin is trading at approximately $117,584. The sharp price increase appears to be giving strength to activity among both miners and leveraged traders, prompting a closer examination of current market behavior. Analysts monitoring on-chain activity have flagged a resurgence of miner activity alongside a rise in derivative positions, suggesting multiple forces may now be contributing to price movements. Related Reading: Research Predicts $160,000 Bitcoin By EOY—If Treasury Firms Hold As these two segments of the market engage more actively, questions are emerging around the sustainability of this rally and whether these behaviors signal confidence or caution. The current on-chain environment shows both selling pressure from miners and increased exposure from long-positioned traders. Bitcoin Miner Activity Rises Alongside Price Surge One of CryptoQuant’s QuickTake contributors, Arab Chain, observed a marked increase in miner activity as Bitcoin crossed the $118,000 level. According to the analyst, this uptick in activity is tied to miner transfers to exchanges, marking the first such increase since May 23. This trend suggests miners could be taking advantage of recent price gains to realize profits. As Arab Chain explained, “The continued activity of miners, coupled with Bitcoin&#8217;s price rising to new highs, clearly indicates that they are selling Bitcoin.” Despite this renewed transfer volume, miner behavior has not yet reached the scale of over-the-counter (OTC) selling seen in previous months. Historically, large-scale selling by miners has introduced notable volatility into the market, particularly when sustained across a broader period. The analyst also pointed out the economic leverage miners hold in decision-making, owing to their ability to manage operational costs and balance between holding and selling mined Bitcoin. Whether this increase in exchange flows will develop into heavier selling remains to be seen. Derivatives Market Shows Renewed Leverage Exposure In a separate analysis, CryptoQuant contributor Enigma Trader focused on derivatives market activity, highlighting a 24% surge in open interest from approximately $33 billion on July 1 to over $41 billion by July 11. The timing of this increase coincides with Bitcoin’s breakout above $118,000, and reflects renewed leveraged interest following a reset late last month. This level of open interest suggests that traders are positioning more aggressively, potentially anticipating continued upside. The analyst also noted a shift in funding rates from negative to their highest positive reading in a month, around 0.012% per eight hours. Positive funding indicates that long-positioned traders are paying to maintain their positions, a sign of bullish sentiment. Related Reading: Bitcoin Uptrend Intact, But Binance Activity Warns Of Short-Term Pullback However, Enigma Trader cautioned that such positioning can become precarious if momentum slows. “This setup often fuels upside continuation if spot demand backs it, but also increases the risk of a long squeeze should momentum stall,” the analyst wrote. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "No Mania Yet: Bitcoin ATH Lacks Hype, Suggesting Further Upside Potential",
      "link": "https://www.newsbtc.com/bitcoin-news/no-mania-yet-bitcoin-ath-lacks-hype-suggesting-further-upside-potential/",
      "summary": "As Bitcoin (BTC) continues to post new all-time highs (ATH), reaching as much as $118,869 on Binance, market indicators show little sign of overheating. The lack of retail-driven hype amid BTC&#8217;s record-breaking run suggests there may still be room for further growth in the flagship cryptocurrency. Bitcoin ATH Sees Absence Of Hype According to a recent CryptoQuant Quicktake post by contributor burakkemeci, Bitcoin’s current rally is notably characterized by the absence of retail investors. The contributor argues that this lack of retail participation implies BTC may still have significant upside potential. Related Reading: Bitcoin Rally Ahead? DXY Breakdown Suggests Capital Shift To Risk-On Assets The analysis centers on the Spot Retail Activity Through Trading Frequency Surge metric, which tracks the frequency of retail trading activity in the Bitcoin spot market. The analyst shared the following chart to illustrate the trend. When retail trading activity rises significantly compared to the one-year moving average (MA), the chart forms bubbles. Green bubbles indicate that there are very few retail investors currently in the market. Orange bubbles show that trading activity among retail investors is picking up. Similarly, red bubbles indicate caution, hinting that there are too many retail investors in the market and that it may be a good time to consider exit strategies. As the below chart shows, retail activity remains subdued &#8211; even as BTC continues to reach new ATHs. In fact, the metric has stayed within the gray zone since March 2024, reflecting a lack of mass retail entry. Historically, retail trading tends to surge as BTC approaches or exceeds ATH levels. The analyst notes that this absence may indicate the cycle top is still ahead: The bull market is still largely driven by institutions and exchange-traded funds (ETFs). When retail finally enters the scene, that might mark the beginning of the final phase. BTC Witnessing Subdued Selling Pressure In addition to the low retail presence, other on-chain indicators suggest that Bitcoin&#8217;s current rally is not overheating. For example, the Miner Position Index has been declining since November 2024, implying reduced selling pressure from miners. Another key metric, the Market Value to Realized Value (MVRV) ratio, is holding steady around 2.2 &#8211; below the 2.7 levels observed during ATHs in March and December 2024. Recent analysis predicts the next significant resistance may emerge at around $130,900. Related Reading: Bitcoin Heating Up? NVT Golden Cross Hints At Potential Local Top Despite weak selling pressure and limited retail activity, some recent exchange trends hint at the possibility of a short-term pullback. At the time of writing, BTC is trading at $117,746, up an impressive 6% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Bitcoin Soars Past $118,800—Breakout Or Brutal Bull Trap?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-soars-118800-breakout-or-bull-trap/",
      "summary": "Bitcoin’s summer rally accelerated in the early hours of 11 July, when the benchmark cryptocurrency sliced through $118,000 and printed exchange highs that peaked above $118,800, depending on venue data. The spike wiped out an estimated $1.25 billion in short positions within a single trading day, according to CoinGlass figures. Bitcoin Bull Trap Or Breakout? Capriole Investments founder Charles Edwards took to X as the breakout unfolded. “New all-time highs beget new ATHs. It’s usually unwise to ignore a major breakout like this, until invalidated,” he wrote, adding that corporate treasury demand has “grown exponentially, with dozens of new companies popping up in recent months.” Edwards’ base-case projection calls for a further 50–70 percent advance over the next six months—roughly $170,000–$196,000. Related Reading: Research Predicts $160,000 Bitcoin By EOY—If Treasury Firms Hold His focus on treasuries is backed by hard data. Public companies added a record 159,107 BTC in Q2—pushing aggregate corporate holdings above 847,000 BTC, or about four percent of max supply. Corporate Bitcoin acquisitions have even outpaced ETF net inflows. Matthew Sigel, head of digital-asset research at VanEck, framed Bitcoin’s trajectory within a broader macro and policy backdrop. “The natural course for Bitcoin remains higher, driven by persistent US debt and deficit problems, demographic tailwinds, a weakening dollar, growing momentum around Fed rate cuts, and the potential for a new Fed chair next year,” he wrote on X. Sigel also highlighted Capitol Hill’s looming “Crypto Week,” where stablecoin legislation is widely viewed as the most passable of several digital-asset bills. Those developments, he argues, make $180,000 “very much in play for 2025.” Law-makers appear to share the sense of urgency. A press statement from the House Financial Services Committee confirms that the week of 14 July will be dedicated to advancing the CLARITY Act, the Anti-CBDC Surveillance State Act and the GENIUS Act. Passage would establish the first comprehensive federal framework for stablecoins and market structure, a change Sigel says could “unlock wide-open capital markets” for the sector. Related Reading: Bitcoin Is One Candle Away From $141,300 Breakout, Chart Master Warns Spot Bitcoin ETFs are hardly idle: net inflows into BlackRock’s iShares fund alone have pushed its holdings past 700,000 BTC in the 18 months since launch. Yet Edwards and Sigel both note that treasury companies have become the marginal buyer in 2025. The dynamic creates what Edwards calls a “cap-raising flywheel,” as firms showcase outperforming share prices—up nearly 60 percent year-to-date for the treasury cohort—when courting investors. Notably, the rally is unfolding against a supportive macro backdrop. Federal Reserve Governor Christopher Waller told a Dallas Fed audience he is “open to cutting the policy rate in July,” arguing current settings are “too tight” given waning inflation pressures. Meanwhile, US President Donald Trump continued his attacks on Fed chair Jerome Powell over the past weeks, demanding immediate rate cuts. Trump’s tariff escalation also seems to fade out, supporting the Bitcoin rally. Notwithstanding euphoric headlines, technicians warn that momentum must sustain above $110,000 to avoid a failed-breakout pattern. “This theory would be weakened with closes below $110K and invalidated below $105K,” Edwards concludes. At press time, BTC traded at $117,854. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Takeaways from the Final Tornado Cash Status Conference Hearing",
      "link": "https://bitcoinmagazine.com/news/takeaways-from-the-final-tornado-cash-status-conference-hearing",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Southern-District-of-New-York.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/takeaways-from-the-final-tornado-cash-status-conference-hearing\" rel=\"nofollow\"> </a></p> <p>In a virtual hearing, the judge presiding over the Tornado Cash case didn't mince words as she highlighted what she plans to focus on as trial begins next week. </p> <p>"
    },
    {
      "title": "The Smarter Web Company Adds 275 BTC to Its Strategic Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-adds-275-btc-to-its-strategic-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/The-Smarter-Web-Company-Adds-275-BTC-to-Its-Strategic-Bitcoin-Treasury.png\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-adds-275-btc-to-its-strategic-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>The UK tech firm now holds 1,275 Bitcoin worth over £100 million, with the £21.88 million bitcoin purchase.</p> <p>"
    },
    {
      "title": "Bitcoin Breaks Records with 100% Profitable Days and Unmatched Returns",
      "link": "https://bitcoinmagazine.com/news/bitcoin-breaks-records-with-100-profitable-days-and-unmatched-returns",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Breaks-Records-with-100-Profitable-Days-and-Unmatched-Returns.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-breaks-records-with-100-profitable-days-and-unmatched-returns\" rel=\"nofollow\"> </a></p> <p>Bitcoin’s explosive growth continues to outshine gold, stocks, and the dollar, with 100% of trading days profitable resulting in unmatched long term returns.</p> <p>"
    },
    {
      "title": "How CoinJoin Anonymity Can Be Undermined Using Clustering",
      "link": "https://bitcoinmagazine.com/bigread/how-coinjoins-achieve-anonymity",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/BM-Big-Read-07-12-25.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bigread/how-coinjoins-achieve-anonymity\" rel=\"nofollow\"> </a></p> <p>BM Big Read: CoinJoins, Bitcoin's most established anonymity feature, leaks more information than people think.</p> <p>"
    },
    {
      "title": "Bitcoin Hits New All Time High as IBIT Breaks ETF Records",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-as-ibit-breaks-etf-records",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-as-IBIT-Breaks-ETF-Records.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-as-ibit-breaks-etf-records\" rel=\"nofollow\"> </a></p> <p>IBIT sits at $83 billion and holds over 706,000 BTC, making it the 21st largest ETF in the US market.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "House Democrats Struggle to Approach 'Crypto Week' With Unified Front",
      "link": "https://decrypt.co/329850/house-democrats-struggle-approach-crypto-week-unified-front",
      "summary": "Some Democrats are pledging to punish other party members who support what they see as “Trump’s crypto corruption.” Leadership has largely stayed out of the fight."
    },
    {
      "title": "Coinbase, Strategy, Other Bitcoin and Crypto Stocks Soar in Record-Setting Week",
      "link": "https://decrypt.co/329740/coinbase-strategy-bitcoin-and-crypto-stocks-soar-record-week",
      "summary": "Crypto-focused companies benefited from the surge in crypto markets this week."
    },
    {
      "title": "Tether to End USDT Redemptions on Bitcoin Cash, Algorand and Beyond",
      "link": "https://decrypt.co/329857/tether-to-end-usdt-redemptions-on-bitcoin-cash-algorand-and-beyond",
      "summary": "Stablecoin issuer Tether is ending support for USDT on five \"legacy\" blockchains after previously halting minting on those networks."
    },
    {
      "title": "Solana Treasury Firm Upexi Raises $200 Million to Boost SOL Stash",
      "link": "https://decrypt.co/329838/solana-treasury-firm-upexi-raises-200-million-boost-sol-stash",
      "summary": "Publicly traded Upexi is poised to boast the largest Solana treasury stash once its latest funding round is completed."
    },
    {
      "title": "Public Keys: CoreWeave Fusion Dance, $1 Billion Day for Bitcoin ETFs and Strategy's Bye Week",
      "link": "https://decrypt.co/329825/public-keys-coreweave-1-billion-bitcoin-etfs-strategy-week-off",
      "summary": "Core Scientific and CoreWeave announce a massive $9B merger while Bitcoin ETFs see their second-biggest day ever with $1.17B in inflows."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Tether to end USDT support for Omni, Bitcoin Cash SLP, Kusama, EOS, and Algorand in September",
      "link": "https://cryptobriefing.com/tether-blockchain-support-changes/",
      "summary": "<p>Tether's shift to focus on scalable, high-utility networks may drive innovation and efficiency, impacting blockchain adoption and ecosystem growth.</p> <p>"
    },
    {
      "title": "PENGU token pumps after Coinbase updates X profile with Pudgy Penguins’ NFT",
      "link": "https://cryptobriefing.com/coinbase-profile-pengu-nft/",
      "summary": "<p>Coinbase's strategic social media engagement could enhance crypto market dynamics, influencing token valuations and investor sentiment.</p> <p>"
    },
    {
      "title": "Grayscale challenges SEC stay on approval of BTC, ETH, XRP, ADA large-cap fund",
      "link": "https://cryptobriefing.com/sec-grayscale-approval-large-cap-fund/",
      "summary": "<p>Grayscale's challenge to the SEC's stay highlights ongoing regulatory tensions, potentially impacting future crypto fund approvals and market dynamics.</p> <p>"
    },
    {
      "title": "Bitcoin creator Satoshi Nakamoto may now be richer than Dell CEO Michael Dell",
      "link": "https://cryptobriefing.com/satoshi-nakamoto-wealth-bitcoin/",
      "summary": "<p>Satoshi Nakamoto's rising wealth underscores Bitcoin's potential to disrupt traditional wealth hierarchies and influence global financial systems.</p> <p>"
    },
    {
      "title": "REX Shares files for 2X leveraged TRON ETF",
      "link": "https://cryptobriefing.com/2x-tron-etf-launch/",
      "summary": "<p>The filing highlights the increasing diversification in crypto investment products, potentially broadening market participation and innovation.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "PENGU crypto jumps 50% – Traders, here’s the real support you should watch!",
      "link": "https://ambcrypto.com/pengu-crypto-jumps-50-traders-heres-the-real-support-you-should-watch/",
      "summary": "<img alt=\"PENGU crypto Bullish Momentum Faces Short-Term Resistance: What Traders Should Know\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/PENGU-crypto-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The spot taker CVD data of the past three months showed that selling pressure from profit-taking activity was increasing in July."
    },
    {
      "title": "BNB crypto soars: How $1B burn and record DEX volume impact prices",
      "link": "https://ambcrypto.com/bnb-crypto-soars-how-1b-burn-and-record-dex-volume-impact-prices/",
      "summary": "<img alt=\"BNB crypto burn rate\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/BNB-crypto-burn-rate-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB chain has removed about 30% of its token supply in the past three years."
    },
    {
      "title": "Hyperlane crypto’s 490% surge in 48 hours – Exchange listings, new highs, and more…",
      "link": "https://ambcrypto.com/hyperlane-cryptos-490-surge-in-48-hours-exchange-listings-new-highs-and-more/",
      "summary": "<img alt=\"Hyperlane crypto Soars 490% in 48 Hours: What’s Next After the Explosive Rally?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Hyperlane-crypto-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPER's recovery from the downtrend in April and May began more than two weeks ago."
    },
    {
      "title": "Can Solana (SOL) hit $184 after FTX, Alameda unstake $31 million?",
      "link": "https://ambcrypto.com/can-solana-sol-hit-184-after-ftx-alameda-unstake-31-million/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-11T185616.278_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />It's been a busy few days for Solana, and that is unlikely to change anytime soon."
    },
    {
      "title": "Decoding Injective’s breakout: Can INJ bulls target $14 and beyond?",
      "link": "https://ambcrypto.com/decoding-injectives-breakout-can-inj-bulls-target-14-and-beyond/",
      "summary": "<img alt=\"INJ\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-11T152615.839-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />INJ’s breakout triggers bullish momentum, backed by whales, rising funding, and heating futures."
    }
  ]
}