{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: GENIUS Act Positions ETH at the Center of Tokenized Finance, Says Wall Street Veteran",
      "link": "https://www.coindesk.com/markets/2025/06/17/asia-morning-briefing-genius-act-positions-eth-at-the-center-of-tokenized-finance-says-wall-street-veteran",
      "summary": ""
    },
    {
      "title": "Tron Inc. Deal Gives Justin Sun’s Father Control of Public Firm Via $100M Token Deal",
      "link": "https://www.coindesk.com/markets/2025/06/17/tron-inc-deal-gives-justin-suns-father-control-of-public-firm-via-100m-token-deal",
      "summary": ""
    },
    {
      "title": "U.S. Senate Passes GENIUS Act to Regulate Stablecoins, Marking Crypto Industry Win",
      "link": "https://www.coindesk.com/policy/2025/06/17/u-s-senate-passes-genius-act-to-regulate-stablecoins-marking-crypto-industry-win",
      "summary": ""
    },
    {
      "title": "JPMorgan Introduces USD Deposit Token on Coinbase’s Base Blockchain",
      "link": "https://www.coindesk.com/business/2025/06/17/jpmorgan-introduces-usd-deposit-token-on-coinbase-s-base-blockchain",
      "summary": ""
    },
    {
      "title": "Coinbase Seeks SEC Approval to Offer Tokenized Stock Trading",
      "link": "https://www.coindesk.com/business/2025/06/17/coinbase-seeks-sec-approval-to-offer-tokenized-stock-trading",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Spanish bank BBVA suggests clients make 7% crypto allocation",
      "link": "https://cointelegraph.com/news/major-spanish-bank-bbva-tells-clients-to-buy-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgwZDEtN2VlNy03YmI0LWFhZDItYzY3MDYwZGQzMDJj.jpg\" /></p><p>BBVA is advising affluent clients to allocate up to 7% of their portfolios to crypto just months after it received permission to offer crypto trading.</p>"
    },
    {
      "title": "Bitcoin downside risk lingers, upside hinges on holding above $102K",
      "link": "https://cointelegraph.com/news/bitcoin-price-downside-risks-102k-level-vital-crypto-analysts-forecast?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MmZmYTYtOWZiMC03ZWI1LTgzYWItMDcxNzk3ZDc4OWE1.jpg\" /></p><p>Bitfinex analysts say Bitcoin’s current market conditions signal the asset “reversing course shortly after aggressive selling.”</p>"
    },
    {
      "title": "Meta Pool hit with $27M exploit, but attacker flees with only $132K",
      "link": "https://cointelegraph.com/news/meta-pool-exploiter-flees-132k-in-27-million-hack?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgwMzAtNDQ4Ni03ZjlhLTg3MDQtNzVlNWJlODNhOTlm.jpg\" /></p><p>Meta Pool says an early detection system discovered the exploit, allowing it to pause the affected smart contract and prevent further losses.</p>"
    },
    {
      "title": "How to legally stake crypto in 2025: What is now allowed after the SEC’s latest move",
      "link": "https://cointelegraph.com/news/how-to-legally-stake-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY5ZjQtODVhYi03MmU0LThlZDEtN2M4MTU3YWMzNzRj.jpg\" /></p><p>The SEC’s 2025 guideline clarifies the regulatory stance regarding crypto staking. It states what is and isn’t allowed and how you can stake lawfully.</p>"
    },
    {
      "title": "JPMorgan, SEC meet to discuss capital markets moving onchain",
      "link": "https://cointelegraph.com/news/jpmorgan-sec-discuss-traditional-capital-markets-moving-onchain?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdmZDktNDdlMC03MDRjLWE4MGQtZjQ2NDRkNTU5MTU1.jpg\" /></p><p>Three JPMorgan executives met with the SEC’s Crypto Task Force to discuss which capital markets instruments could move onchain and how to best navigate the change.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US DOJ, Europol seize world’s largest dark web drug market operating via Monero",
      "link": "https://cryptoslate.com/us-doj-europol-seize-worlds-largest-dark-web-drug-market-operating-via-monero/",
      "summary": "<p>An international law enforcement effort has dismantled one of the world’s largest and longest-running criminal marketplaces on the darknet, arresting its suspected German operator in Spain and seizing millions in illicit assets, according to a June 16 press release. The takedown, coordinated by the Frankfurt Public Prosecutor’s Office, Germany’s Federal Criminal Police Office (BKA), the [&#8230;]</p> <p>"
    },
    {
      "title": "LatAm energy giant executes landmark $75M oil and gas deal via blockchain tokenization",
      "link": "https://cryptoslate.com/latam-energy-giant-executes-landmark-75m-oil-and-gas-deal-via-blockchain-tokenization/",
      "summary": "<p>Feniix Energy, an energy firm based in Latin America, has completed a $75 million acquisition of a live oil and gas operation using blockchain tokenization, according to a statement shared with on June 17. Global Settlement, a blockchain firm specializing in real-world assets (RWAs), executed the deal through its GSX Protocol. The protocol enabled [&#8230;]</p> <p>"
    },
    {
      "title": "DAMA 2: Deutsche Bank unveils institutional tokenization stack to fast-track regulated funds",
      "link": "https://cryptoslate.com/dama-2-deutsche-bank-unveils-institutional-tokenization-stack-to-fast-track-regulated-funds/",
      "summary": "<p>Deutsche Bank, Memento Blockchain, and Interop Labs published a litepaper on June 17 outlining plans for Digital Asset Management Access 2 (DAMA 2), a tokenization platform intended to operate on public blockchains and facilitate the issuance of regulated funds. According to the paper, DAMA 2 would link three layers: Ethereum (ETH) would act as the [&#8230;]</p> <p>"
    },
    {
      "title": "VanEck’s Solana ETF moves closer to market entry with DTCC listing",
      "link": "https://cryptoslate.com/vanecks-solana-etf-moves-closer-to-market-entry-with-dtcc-listing/",
      "summary": "<p>VanEck’s planned Solana (SOL) exchange-traded fund has been listed with the Depository Trust &#38; Clearing Corporation (DTCC) under the ticker symbol VSOL, signaling another step in mainstreaming Solana exposure for traditional investors. According to DTCC records, the fund is labeled “VANECK SOLANA TR COM SHS BEN INT” and falls under the ‘D’ settlement category, an [&#8230;]</p> <p>"
    },
    {
      "title": "US Senate approves landmark GENIUS Act for stablecoin regulation",
      "link": "https://cryptoslate.com/us-senate-approves-landmark-genius-act-for-stablecoin-regulation/",
      "summary": "<p>The Senate approved the Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act in a 51-23 vote on June 17, sending the measure to the House for consideration. The vote followed a 68-30 cloture decision on June 11 that cut off debate and started the mandatory 30-hour countdown to the final roll call. Senator [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Slides Under Support Level, Selling Pressure Intensifies",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-slides-2-220/",
      "summary": "XRP price started a fresh decline below the $2.20 zone. The price is now consolidating losses and might decline further below the $2.150 zone. XRP price started a fresh decline below the $2.20 zone. The price is now trading below $2.20 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $2.180 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start another decline if it trades below the $2.120 support zone. XRP Price Dips Again XRP price failed to continue higher above the $2.280 level and reacted to the downside, like Bitcoin and Ethereum. The price declined below the $2.250 and $2.220 support levels. Besides, there was a break below a key bullish trend line with support at $2.180 on the hourly chart of the XRP/USD pair. The pair tested the $2.150 support A low was formed at $2.1425 and the price is now consolidating losses below the 23.6% Fib retracement level of the recent decline from the $2.335 swing high to the $2.145 low. The price is now trading below $2.220 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.1880 level. The first major resistance is near the $2.20 level. The next resistance is $2.240 or the 50% Fib retracement level of the recent decline from the $2.335 swing high to the $2.145 low. A clear move above the $2.240 resistance might send the price toward the $2.280 resistance. Any more gains might send the price toward the $2.320 resistance or even $2.350 in the near term. The next major hurdle for the bulls might be $2.40. More Losses? If XRP fails to clear the $2.220 resistance zone, it could start another decline. Initial support on the downside is near the $2.150 level. The next major support is near the $2.120 level. If there is a downside break and a close below the $2.120 level, the price might continue to decline toward the $2.050 support. The next major support sits near the $2.020 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.150 and $2.120. Major Resistance Levels – $2.20 and $2.220."
    },
    {
      "title": "Tether Enforces Freeze On $12 Million In Tron Funds Over Illicit Activity",
      "link": "https://www.newsbtc.com/altcoin/tether-enforces-freeze-on-12-million-in-tron-funds-over-illicit-activity/",
      "summary": "Tether acted swiftly Sunday when it froze $12.3 million worth of USDT on the Tron blockchain. Based on reports from Tronscan, this step targets wallets allegedly linked to money laundering and sanctions evasion. The company has not issued a public statement yet, but on‑chain data left little room for doubt. Related Reading: Amid Bitcoin Hype, Seasoned Trader Predicts Sudden Drop To This Level T3 Financial Crime Unit Shows Muscle According to Tether, its T3 Financial Crime Unit (FCU) partners with Tron and TRM Labs to track suspect transactions in real time. Since late 2024, the FCU has frozen over $126 million in questionable assets. In the last quarter of that year alone, $100 million was blocked. This suggests a sharp uptick in enforcement efforts just as regulators worldwide tighten the screws. LATEST: Tether freezes $12.3M in $USDT tied to suspicious TRON addresses. pic.twitter.com/WJr2ApEfyp — MrRebel.eth (@rebelethpromos) June 16, 2025 Targeting High‑Risk Entities On Sanctions List Following regulatory synchronization with the US Treasury&#8217;s Office of Foreign Assets Control (OFAC), Tether regularly blacklists wallets associated with sanctioned entities. Individuals on the Specially Designated Nationals (SDN) list are the natural targets. In March 2025, for example, Tether froze $27 million worth of USDT on the Russian-linked exchange Garantex following the EU&#8217;s 16th package of sanctions. Garantex later suspended services and claimed that over 2.5 billion rubles of user funds were held up. Lazarus Group Faces $374K Blacklist Reports show that North Korea’s Lazarus Group has moved more than $3 billion in stolen crypto since 2009. In November 2023, Tether blacklisted $374,000 in USDT tied to Lazarus‑associated addresses. Other stablecoin companies joined together to lock up $3.4 million in identical wallets. These numbers highlight how large issuers can upset state-sponsored hacking groups. Diversifying With Gold Royalties Tether diversified beyond digital currency on June 12, 2025, by buying a 32% equity stake in Elemental Altus Royalties. The deal involved the purchase of over 78 million shares at CAD1.55 per share, valued around $89 million. Related Reading: Record‑High Ethereum Open Interest Signals Institutional Confidence This move to become a public gold royalty company shows Tether&#8217;s commitment to backing its stablecoin with real assets. It also shows an effort to appease risk-averse regulators that demand strong reserves. A Dual Approach To Stablecoin Governance As per Tether executives, this combination of tough enforcement and asset diversification can become a new benchmark. By freezing criminal funds and backing USDT with real-world value, Tether aims to strengthen confidence in its stablecoin. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Ethereum Price at Risk of Downside Break as Bears Test Key Support",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-at-risk-2450/",
      "summary": "Ethereum price failed to clear the $2,680 zone and declined. ETH is now consolidating losses and remains at risk of more losses below $2,500. Ethereum started a fresh decline below the $2,620 level. The price is trading below $2,550 and the 100-hourly Simple Moving Average. There was a break below a bullish trend line with support at $2,540 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $2,500 zone in the near term. Ethereum Price Dips Again Ethereum price failed to gain pace for a move above $2,680 and started a fresh decline, like Bitcoin. ETH price declined below the $2,620 and $2,600 levels. The bears even pushed the price below the $2,600 level. Besides, there was a break below a bullish trend line with support at $2,540 on the hourly chart of ETH/USD. The pair tested the $2,450 zone and started a consolidation phase. There was a minor increase above the 23.6% Fib retracement level of the downward move from the $2,679 swing high to the $2,455 low. Ethereum price is now trading below $2,550 and the 100-hourly Simple Moving Average. On the upside, the price could face resistance near the $2,540 level. The next key resistance is near the $2,565 level. It is close to the 50% Fib retracement level of the downward move from the $2,679 swing high to the $2,455 low. The first major resistance is near the $2,620 level. A clear move above the $2,620 resistance might send the price toward the $2,680 resistance. An upside break above the $2,680 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,800 resistance zone or even $2,880 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,540 resistance, it could start a fresh decline. Initial support on the downside is near the $2,500 level. The first major support sits near the $2,450 zone. A clear move below the $2,450 support might push the price toward the $2,320 support. Any more losses might send the price toward the $2,240 support level in the near term. The next key support sits at $2,150. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,450 Major Resistance Level – $2,540"
    },
    {
      "title": "Bitcoin Whales Pull 4,500 BTC From Binance, Hinting At Incoming Rally",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-whales-pull-4500-btc-from-binance-hinting-at-incoming-rally/",
      "summary": "Recent on-chain data suggests that Bitcoin (BTC) whales may be preparing for a potential rally, as Binance BTC withdrawals have seen a notable spike. Additionally, rising stablecoin inflows to exchanges indicate growing buy-side liquidity, reinforcing the market’s bullish sentiment. Bitcoin Whales Foreseeing Major Rally Ahead? According to a recent CryptoQuant Quicktake post by contributor Amr Taha, Bitcoin whales recorded one of the largest BTC outflows from Binance this month. The chart below shows that nearly 4,500 BTC were withdrawn on June 16. Bitcoin whales are defined as wallet addresses with significant BTC holdings. Past data suggests that such large withdrawals from whales have typically preceded price rallies, as they reflect a reduction in BTC exchange reserves, leaving fewer coins readily available for trading. Related Reading: Bitcoin Hash Ribbons Indicating Prime Buying Opportunity, Analyst Says Beyond this large-scale withdrawal, on-chain data also reveals dwindling BTC inflows to exchanges from both whales and retail investors. This combination of major outflows and low deposits could be laying the groundwork for a Bitcoin “supply crunch.&#8221; For the uninitiated, a Bitcoin supply crunch occurs when the available BTC on exchanges declines sharply, reducing the immediate supply for buyers. This happens when long-term holders or whales withdraw BTC to cold storage, creating upward pressure on price as demand outpaces liquid supply. Stablecoin Inflows Witness Sharp Increase In parallel with Bitcoin’s exchange exodus, stablecoin inflows to Binance have surged in recent days. Notably, over $400 million in stablecoins flowed in on both June 13 and 15. Historically, such significant stablecoin inflows have been linked to buy-side liquidity preparation. In other words, large investors appear ready to deploy capital into crypto assets like BTC, reflecting renewed risk appetite. Taha concluded: The aggressive Bitcoin withdrawals and concurrent stablecoin deposits create a supply-demand asymmetry. With fewer BTC available on exchanges and growing liquidity to fuel buys, the stage is set for a potential price breakout. Meanwhile, additional exchange data supports the case for further upside in BTC. For example, the coin has been experiencing consistently negative funding rates on Binance &#8211; often a precursor to short squeezes. Related Reading: Bitcoin Following ABCD Pattern? Analyst Sees Path To $137,000 At the same time, Bitcoin’s long-term holder Realized Cap recently surpassed $20 billion, underscoring rising confidence among seasoned investors. In addition, despite the ongoing BTC rally, retail participation remains relatively low, suggesting further room for growth. However, short-term holders are showing signs of caution, increasing their selling amid recent price corrections. At the time of writing, BTC is trading at $105,575, down 1.0% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Bitcoin Price Stumbles at Resistance — Will the Dip Deepen?",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-stumbles-108k/",
      "summary": "Bitcoin price started a fresh decline below the $106,800 zone. BTC is now consolidating and facing resistance near the $106,200 zone. Bitcoin started a fresh decline below the $106,200 zone. The price is trading below $106,800 and the 100 hourly Simple moving average. There is a short-term triangle forming with support at $104,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $103,500 zone. Bitcoin Price Dips Again Bitcoin price started a fresh decline after it failed to clear the $108,800 resistance zone. BTC dipped below the $108,000 and $107,000 levels. There was a clear move below the $106,200 support level. Finally, the price tested the $103,500 zone. A low was formed at $103,400 and the price is now consolidating losses. There was a minor increase above the 23.6% Fib retracement level of the downward move from the $108,924 swing high to the $103,400 low. Bitcoin is now trading below $106,800 and the 100 hourly Simple moving average. Besides, there is a short-term triangle forming with support at $104,200 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $105,200 level. The first key resistance is near the $105,500 level. The next key resistance could be $106,200. It is near the 50% Fib retracement level of the downward move from the $108,924 swing high to the $103,400 low. A close above the $106,200 resistance might send the price further higher. In the stated case, the price could rise and test the $108,000 resistance level. Any more gains might send the price toward the $110,000 level. More Losses In BTC? If Bitcoin fails to rise above the $106,200 resistance zone, it could start another decline. Immediate support is near the $104,200 level. The first major support is near the $103,500 level. The next support is now near the $102,500 zone. Any more losses might send the price toward the $101,200 support in the near term. The main support sits at $100,000, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $104,200, followed by $103,500. Major Resistance Levels – $105,500 and $106,200."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "U.S. Senate Passes Stablecoin Bill The GENIUS Act",
      "link": "https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/USA-GENIUS-BILLpg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act\" rel=\"nofollow\"> </a></p> <p>The U.S. Senate has passed the Guiding and Establishing National Innovation for U.S. Stablecoins (GENIUS) Act (S. 394) by a vote of 68-30, establishing the first comprehensive federal framework for fiat-backed stablecoins. The bipartisan legislation was introduced by Senator Bill Hagerty and co-sponsored by Senators Tim Scott, Kirsten Gillibrand, and Cynthia Lummis. It passed under [&#8230;]</p> <p>"
    },
    {
      "title": "BBVA Tells Wealthy Clients to Invest Up to 7% in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BBVA.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Spanish bank BBVA is now advising its wealthy clients to invest up to 7% of their portfolios in crypto and Bitcoin, showing how traditional banks are starting to see the potential of Bitcoin.&#160; &#8220;With private customers, since September last year, we started advising on Bitcoin,&#8221; said Philippe Meyer, head of digital &#38; blockchain solutions at [&#8230;]</p> <p>"
    },
    {
      "title": "Ukraine Introduces Bill to Allow Bitcoin in National Reserves",
      "link": "https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Ukraine-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves\" rel=\"nofollow\"> </a></p> <p>Ukraine has introduced a bill that would give its central bank the legal right to hold Bitcoin and other assets as part of its national reserves. The draft law, submitted to the Verkhovna Rada on June 10, 2025, proposes updates to existing legislation to include “virtual assets” in the foreign exchange and gold reserves of [&#8230;]</p> <p>"
    },
    {
      "title": "Fold Holdings Secures $250 Million Equity Deal to Expand Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Fold-Holdings-Secures-250M-Equity-Deal-to-Expand-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>Fold aims to increase its bitcoin treasury through a $250M equity facility, giving the company flexibility to raise funds as needed.</p> <p>"
    },
    {
      "title": "Thailand Approves Five Year Bitcoin And Crypto Tax Break",
      "link": "https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Thailand-Approves-Tax-Exemption-on-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break\" rel=\"nofollow\"> </a></p> <p>Thailand has approved a five year tax exemption on capital gains from cryptocurrency trading made through licensed digital asset platforms. The exemption will be in effect from January 1, 2025, through December 31, 2029. Deputy Finance Minister Julapun Amornvivat announced the measure, calling it a move to increase investment, stimulate economic activity, and drive long [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "China’s JD Eyes Global Stablecoin Licenses to Slash Payment Costs",
      "link": "https://decrypt.co/325723/chinas-jd-eyes-global-stablecoin-licenses",
      "summary": "Chinese e-commerce giant JD.com says it could cut cross-border settlement costs as it plans to acquire stablecoin licenses"
    },
    {
      "title": "OpenAI Lands Pentagon Deal—Musk’s xAI Left Watching From Sidelines",
      "link": "https://decrypt.co/325716/openai-lands-pentagon-deal",
      "summary": "A new $200 million contract with the Department of Defense puts OpenAI ahead in the race to bring AI to government."
    },
    {
      "title": "How to Get Your Chatbot to Talk Dirty",
      "link": "https://decrypt.co/325680/how-get-your-chatbot-talk-dirty",
      "summary": "Users seeking steamy romance from their AI companions are getting yoga guides instead. Here’s how to stop your chatbot from pivoting from passion to wellness."
    },
    {
      "title": "Is Semler Scientific Flashing a Warning Sign for Bitcoin Treasury Firms?",
      "link": "https://decrypt.co/325674/is-semler-scientific-flashing-a-warning-sign-for-bitcoin-treasury-firms",
      "summary": "The company was valued at a razor-thin premium compared to its Bitcoin holdings, as of Tuesday."
    },
    {
      "title": "Bitcoin Miners Face More Trouble as Transaction Fee Share Hits 3-Year Low",
      "link": "https://decrypt.co/325671/bitcoin-miners-face-trouble-transaction-fees-3-year-low",
      "summary": "Bitcoin transaction fee rewards have dropped to their lowest level since 2022, making the already tough BTC mining industry even tougher."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "US Senate passes GENIUS stablecoin bill, advancing it to the House for final approval",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house/",
      "summary": "<p>US Senate passes the GENIUS stablecoin bill, advancing it to the House for a vote in 3 weeks with rules on backing, audits, and oversight.</p> <p>"
    },
    {
      "title": "JPMorgan Chase to pilot stablecoin-like JPMD for institutional clients on Base",
      "link": "https://cryptobriefing.com/jpmorgan-jpmd-deposit-token/",
      "summary": "<p>JPMorgan's pilot of JPMD tokens could accelerate institutional adoption of blockchain technology, influencing future financial systems.</p> <p>"
    },
    {
      "title": "How is technology redefining money and currency?",
      "link": "https://cryptobriefing.com/technology-redefining-money-currency/",
      "summary": "<p>Technology is redefining money with digital assets, smart contracts, and blockchain, shifting value exchange beyond traditional currency.</p> <p>"
    },
    {
      "title": "Kraken-backed layer 2 Ink to launch $INK token",
      "link": "https://cryptobriefing.com/kraken-ink-token-launch/",
      "summary": "<p>The launch of $INK could significantly enhance DeFi ecosystems by fostering user-driven governance and expanding on-chain capital markets.</p> <p>"
    },
    {
      "title": "Coinbase plans to offer tokenized equities to rival Robinhood, Charles Schwab",
      "link": "https://cryptobriefing.com/coinbase-tokenized-equities-sec-approval/",
      "summary": "<p>Coinbase's move into tokenized equities could reshape financial markets by increasing competition, innovation, and accessibility in trading.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum: Here’s why ETH could be set for a bullish move soon",
      "link": "https://ambcrypto.com/ethereum-heres-why-eth-could-be-set-for-a-bullish-move-soon/",
      "summary": "<img alt=\"ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-2-5.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Following major whale purchases last weekend, increased ETH ETF inflows and instituitonal adoption, ETH could be set for a major breakout."
    },
    {
      "title": "Will Chainlink bulls fall as selling pressure rises? Examining…",
      "link": "https://ambcrypto.com/will-chainlink-bulls-fall-as-selling-pressure-rises-examining/",
      "summary": "<img alt=\"Will Chainlink bulls fall as selling pressure rises? Examining...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chainlink-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The weakness of the Chainlink bulls and the fearful short-term market sentiment doesn't bode well for LINK."
    },
    {
      "title": "Bitcoin faces $904M profit-driven pullback – Can BTC’s rally survive?",
      "link": "https://ambcrypto.com/bitcoin-faces-904m-profit-driven-pullback-can-btcs-rally-sustain/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-26.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As the Bitcoin uptrend continues, newer coins are aggressively selling while older ones take a step back."
    },
    {
      "title": "Sonic DEX volume rises 17% – But THIS signals likely trend reversal",
      "link": "https://ambcrypto.com/sonic-dex-volume-rises-17-but-this-signals-likely-trend-reversal/",
      "summary": "<img alt=\"Sonic DEX volume rises 17% - But THIS signals likely trend reversal\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-17T132752.528-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whales accumulate as Sonic holds $0.316 support and TVL consolidates above $2B."
    },
    {
      "title": "Is BNB ready for a bullish breakout? 2 reasons why price shows strength",
      "link": "https://ambcrypto.com/is-bnb-ready-for-a-bullish-breakout-2-reasons-why-price-shows-strength/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-17T145155.651-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB Chain’s usage is soaring, but price action remains confined beneath key resistance."
    }
  ]
}