{
  "CoinDesk": [
    {
      "title": "SUI Drops 10% to $3.02, but Is a Turnaround Forming After Buyers Step In Near $3?",
      "link": "https://www.coindesk.com/markets/2025/06/13/sui-drops-10-to-usd3-02-but-is-a-turnaround-forming-after-buyers-step-in-near-usd3",
      "summary": ""
    },
    {
      "title": "Weekly Recap: Milestones Galore for Stablecoins",
      "link": "https://www.coindesk.com/news-analysis/2025/06/13/weekly-recap-milestones-galore-for-stablecoins",
      "summary": ""
    },
    {
      "title": "Solana's SOL Falls 8% to $147 Despite Standard Chartered’s $275 Year-End Target",
      "link": "https://www.coindesk.com/markets/2025/06/13/solana-s-sol-falls-8-to-usd147-despite-standard-chartered-s-usd275-year-end-target",
      "summary": ""
    },
    {
      "title": "ADA Drops 6% as Cardano Community Debates $100M Stablecoin Liquidity Proposal",
      "link": "https://www.coindesk.com/markets/2025/06/13/ada-drops-6-as-cardano-community-debates-usd100m-stablecoin-liquidity-proposal",
      "summary": ""
    },
    {
      "title": "NEAR Protocol Surges 4% After 12.8% Correction, User Growth Shines",
      "link": "https://www.coindesk.com/markets/2025/06/13/near-protocol-surges-4-after-12-8-correction-user-growth-shines",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Saylor says Bitcoin could fix Apple’s stock buybacks: Finance Redefined",
      "link": "https://cointelegraph.com/news/saylor-bitcoin-fix-apple-stock-buybacks-finance-redefined?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY4YmUtMGFhYi03MmFiLWI3NDctZjNiMTU5OGRkNzc2.jpg\" /></p><p>Bitcoin exposure may provide more shareholder value to Apple investors, as the tech firm’s stock is struggling to reverse a downtrend.</p>"
    },
    {
      "title": "Price predictions 6/13: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, HYPE, SUI, LINK",
      "link": "https://cointelegraph.com/news/price-predictions-6-13-btc-eth-xrp-bnb-sol-doge-ada-hype-sui-link?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzZhMjctZmI1YS03OGE2LTljMGQtOGFlMDliYzc2NzY5.jpg\" /></p><p>Dip buyers stepped in to absorb this week’s downside in Bitcoin and select altcoins.</p>"
    },
    {
      "title": "Closing Strait of Hormuz is biggest risk to BTC price this weekend — Analyst",
      "link": "https://cointelegraph.com/news/closing-strait-hormuz-biggest-risk-btc-price-weekend?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NGIwOGMtOGUwNy03NzU0LWI2MTEtMjJlMjZhZmNlOWU0.jpg\" /></p><p>Risk assets would take a significant hit if Iran closes the Strait of Hormuz, a narrow waterway supplying 20% of the global oil trade.</p>"
    },
    {
      "title": "How to legally stake crypto in 2025: What is now allowed after the SEC’s latest move",
      "link": "https://cointelegraph.com/news/how-to-legally-stake-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY5ZjQtODVhYi03MmU0LThlZDEtN2M4MTU3YWMzNzRj.jpg\" /></p><p>The SEC’s 2025 guideline clarifies the regulatory stance regarding crypto staking. It states what is and isn’t allowed and how you can stake lawfully.</p>"
    },
    {
      "title": "Crypto legislation in the US is at a ‘critical’ juncture, says industry exec",
      "link": "https://cointelegraph.com/news/crypto-legislation-deadline-2026-marta-belcher-warning?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWQ0MmItNWYzNi03YTMzLThlNTktZmFmMTY3MmY3YTE1.jpg\" /></p><p>The latest episode of Decentralize with unpacks why US crypto legislation must pass in 2025 or risk renewed crackdowns and political blowback.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Crypto market maker Gotbit and founder sentenced for fraud, manipulation",
      "link": "https://cryptoslate.com/crypto-market-maker-gotbit-and-founder-sentenced-for-fraud-manipulation/",
      "summary": "<p>Gotbit Consulting LLC, a prominent cryptocurrency market maker, was sentenced in federal court for criminal charges related to a multi-year scheme to manipulate digital asset trading volumes, according to a June 13 press release. Aleksei Andriunin, the firm’s 26-year-old founder and CEO, was sentenced to eight months in prison and one year of supervised release [&#8230;]</p> <p>"
    },
    {
      "title": "XYZVerse Gains Strong Momentum, Raising Over $14M in Stage 12",
      "link": "https://cryptoslate.com/xyzverse-gains-strong-momentum-raising-over-14m-in-stage-12/",
      "summary": "<p>XYZVerse is a new meme coin project that has garnered significant attention from the crypto community thanks to its unique concept. It is the fist all-sports meme coin that offers real utility to all sports fans and crypto enthusiasts by partnering with sportsbook platforms. Still in a presale phase, XYZVerse has already formed a strong [&#8230;]</p> <p>"
    },
    {
      "title": "Polkadot seeks stability with $2M Bitcoin reserve strategy amid DOT downturn",
      "link": "https://cryptoslate.com/polkadot-seeks-stability-with-2m-bitcoin-reserve-strategy-amid-dot-downturn/",
      "summary": "<p>A new proposal within the Polkadot ecosystem is pushing for the creation of a Strategic Bitcoin Reserve. According to the proposal, the plan involves converting 500,000 DOT, valued at around $2 million, into Threshold Bitcoin (tBTC), a wrapped version of Bitcoin secured through threshold cryptography, which ensures decentralization and non-custodial management. Polkadot&#8217;s Bitcoin proposal Before [&#8230;]</p> <p>"
    },
    {
      "title": "SharpLink’s record $463M Ethereum acquisition fails to prevent 67% decline in stock",
      "link": "https://cryptoslate.com/sharplinks-record-463m-ethereum-acquisition-fails-to-prevent-67-decline-in-stock/",
      "summary": "<p>SharpLink Gaming has established a significant Ethereum reserve, acquiring more than 176,000 ETH at an average price of $2,626 per token, according to a statement released on June 13. The $463 million investment marks the company as the first Nasdaq-listed firm to implement an Ethereum-focused treasury strategy. In addition, the company is the largest public [&#8230;]</p> <p>"
    },
    {
      "title": "Walmart & Amazon eye $14B in savings by launching corporate stablecoin",
      "link": "https://cryptoslate.com/walmart-amazon-eye-14b-in-savings-by-launching-corporate-stablecoin-as-us-genius-legislation-nears/",
      "summary": "<p>Walmart and Amazon are preparing to launch their own stablecoins as the U.S. Senate advances landmark legislation that would establish a federal regulatory framework for privately issued digital dollars for the first time. The legislation, known as the GENIUS Act (S.394), has passed committee and cleared cloture, with a final Senate vote scheduled for June [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Crypto Bloodbath: Over $1 Billion Liquidated As Iran-Israel Tensions Erupt",
      "link": "https://www.newsbtc.com/altcoin/crypto-bloodbath-over-1-billion-liquidated-as-iran-israel-tensions-erupt/",
      "summary": "A sudden wave of selling hit crypto markets in the early hours of Friday, as reports of an Israeli airstrike on Iran set off fresh jitters. Bitcoin sank 5%, slipping under the $104,000 mark. Altcoins fared worse, with losses ranging from 6% to 9%. Based on reports from Coinglass, more than $1 billion was wiped out in liquidations, over $1 billion of which were long positions. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Rising Tensions Shake Global Markets According to market watchers, the strike prompted a swift move into safe assets. S&#38;P 500 futures tumbled 1.9%, while oil and gold jumped sharply. WTI crude climbed more than 12%, reaching about $77 per barrel. Gold surged past $3,400 an ounce as investors sought shelter. Crypto Traders Feel The Heat Arthur Hayes, the ex-CEO of BitMEX, warned of rough waters ahead. “Hold on to your butts out there, degens,” he wrote after the crash. He also pointed to US President Donald Trump’s planned tariffs as an added layer of risk. Ethereum slid 8% down to $2,505, right at a key support level. Other coins fell up to 10% in just a few hours. BREAKING: S&#38;P 500 futures extend losses to -1.9% following Israel’s attack on Iran. pic.twitter.com/QaLtjbcii6 — The Kobeissi Letter (@KobeissiLetter) June 13, 2025 Safe Havens Caught In The Crossfire Based on reports, gold and oil didn’t hold back. Oil prices have climbed about 30% since May lows, analysts say. Anyone betting on lower inflation or early rate cuts may have to rethink things. Gold’s climb suggests that many feel uneasy about what comes next. Even so, some expect this spike to calm once tensions ease. What Comes Next For Crypto Short-term views remain mixed. Some traders see this as a knee-jerk reaction and expect a rebound once headlines fade. Others warn that the US CPI release later this week could add another twist. Inflation data could either fuel more selling or pave the way for relief if numbers come in cooler than expected. Related Reading: Bitcoin Is Just 0.2% Of Global Wealth — And That’s Why It’s Not Too Late: Analyst Volatility is back with a vengeance. Over the past weeks, markets were already on edge amid chatter of higher interest rates and global conflicts. Now, with the Middle East front in focus again, big swings may stay in place. Analysts even suggest Bitcoin could dip to $95,000 if selling continues to gather steam. A $1 billion wave of liquidations isn’t small. At the same time, the speed of the move may leave some traders hoping for a quick bounce. Watching safe-haven assets, US economic data, and any new developments in the Iran-Israel tensions will be key in the hours and days ahead. Featured image from Stratfor, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Crash To $94,000 Imminent As Fibonacci Resistance Is At Stake",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-crash-to-94000-imminent/",
      "summary": "Bitcoin&#8217;s recent price action has shown signs of fading momentum three weeks after reaching a new all-time high of $111,814. The leading cryptocurrency climbed back above $110,000 on Monday off the back of cooling U.S. inflation data and a temporarily weaker dollar. However, the rally was short-lived. Profit-taking, compounded by geopolitical tensions between Israel and Iran, has contributed to a risk-off environment that pushed Bitcoin down below $105,000 in the past 24 hours. This sharp reversal highlights a significant technical level that could decide whether Bitcoin sustains its uptrend or enters a crash towards $94,000. Final Fibonacci Resistance Holding The Line According to a new analysis shared by pseudonymous crypto analyst XForceGlobal on the social media platform X, Bitcoin’s current corrective structure could deepen if it fails to overcome the 88.6% Fibonacci resistance level. The analyst highlighted that the bullish impulse that carried Bitcoin now appears to be losing steam. Related Reading: Bitcoin Risks Pullback To $105,000 After Facing Rejection Above $110,000 The price zone around $110,500, which is marked by the 88.6% Fibonacci resistance, has not been convincingly breached, casting doubt on the strength of the current wave structure. Bitcoin tested this level twice earlier this week, and, as noted by the analyst, if this resistance level fails to break soon, there is a slight possibility of a deeper pullback. If this pullback does occur, this would lead to the formation of a corrective wave C, and with distinct symmetry in an ABC corrective pattern. In this case of the corrective Wave C playing out, the next central area of interest lies around the $94,000 level, an area that aligns with the completion of a larger impulse Wave 2. Wave 2 Dip To $96,000 Before Bullish Wave 3 Begins The rundown of a corrective Wave 2 and a bearish impulse Wave 2 is based on the outlook of Bitcoin failing to clear the 88.6% Fibonacci resistance at $110,000. Applying the Elliott wave count on the current price action shows that the recent push to $111,814 all-time high was a larger bullish impulse Wave 1. However, the ensuing correction since then has also played out in the form of a sub-wave 123 structure, and an ABC corrective pattern. Altogether, these are expected to make up a larger corrective impulse Wave 2. Related Reading: Bitcoin Price Risks Crash To $31,000 Amid 5-Wave Impulse Completion Nevertheless, XForceGlobal noted that Bitcoin is still in a highly bullish structure on the macro level. If the price action plays out this way, the next move after the impulse Wave 2 to $94,000 would be a reversal upwards with bullish impulse Wave 3. In this case, the analyst projected an expansion move that would send Bitcoin to another all-time high. Notably, the price target in this case would be a surge above $118,500. At the time of writing, Bitcoin is trading at $105,000, down by 2.5% in the past 24 hours. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Faces Stress As Israel-Iran Conflict Shakes Sentiment – ETH/BTC Support In Focus",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-faces-stress-as-israel-iran-conflict-shakes-sentiment-eth-btc-support-in-focus/",
      "summary": "Ethereum faced intense selling pressure earlier today as geopolitical tensions flared following Israel’s attack on Iran, shaking global markets and triggering risk-off behavior across crypto. The sudden spike in volatility pushed Ethereum away from its recent highs, as it retraced after failing to break above the critical $3,000 resistance level. This marks a pivotal moment for ETH, which had shown strong momentum in recent sessions before being hit by the broader market downturn. Related Reading: Ethereum Repeats History – Key Support Holds Again Ahead Of Potential Rally Despite the sharp correction, top analyst Quinten Francois remains optimistic. He pointed to the ETH/BTC pair, which continues to look strong relative to other assets. According to Francois, this pair is currently testing the support line of an ascending triangle—a pattern that often precedes a breakout to the upside if support holds. With Bitcoin holding near its range highs, Ethereum’s performance against BTC could serve as a leading indicator for the broader altcoin market. Now, Ethereum stands at a crossroads. A bounce from current levels could renew bullish momentum and re-establish the $2,800–$3,000 range as the launchpad for higher prices. But failure to hold support may trigger another wave of downside pressure. All eyes are on ETH/BTC as markets brace for what comes next. Ethereum Holds Key Level Against BTC Ethereum has been leading the crypto market with impressive strength since April, posting a remarkable surge of over 100% from its lows near $1,400. This steep recovery highlights Ethereum’s growing momentum, positioning it as a potential frontrunner in triggering the next altseason. The asset’s consistent performance above key support levels and its resilience during market dips have renewed bullish sentiment, with traders increasingly focusing on ETH as the key asset to watch. Many analysts believe Ethereum could be the spark that reignites capital rotation into altcoins. Its breakout from a month-long range, combined with increasing DeFi activity and improving on-chain metrics, has added to the bullish case. However, caution remains. Ongoing geopolitical tensions—particularly the recent escalation between Israel and Iran—are injecting volatility into global markets, including crypto. These developments have disrupted otherwise promising technical setups across the board, leading to uncertainty and risk-off sentiment. Quinten Francois commented on the current climate, noting that “some charts don’t look good, others are holding on by a thread.” However, he singled out the ETH/BTC pair as a relative strength signal, stating that it “still looks good.” This pair is currently testing the support line of an ascending triangle—a structure that, if defended, could pave the way for a continuation of ETH’s dominance over Bitcoin. In this environment, Ethereum’s performance—especially relative to BTC—could determine the broader market’s next phase. If ETH/BTC holds and breaks higher, the door opens for a full altseason run. But a failure to hold could reinforce caution and signal a pause across the crypto market. For now, Ethereum remains the most important chart to watch. Related Reading: Ethereum Tests Previous Resistance As Support – Can Bulls Defend This Level? ETH Faces Sharp Rejection After Tagging Range Highs Ethereum is facing a crucial technical test after a strong rejection near the $2,830 resistance level. The chart shows ETH failing to hold above the highlighted supply zone between $2,700 and $2,830, where sellers stepped in aggressively. This resulted in a sharp breakdown that sliced through the 50, 100, and 200 simple moving averages (SMAs) on the 4-hour timeframe, now positioning ETH around $2,512. What’s more concerning is the spike in volume during the breakdown. This confirms the strength behind the move, signaling panic among bulls and potential distribution by short-term holders. ETH is now holding just above a previous support zone from early June, but the current setup suggests uncertainty and risk of further downside. Related Reading: Ethereum Price Tests Ascending Channel Resistance – Breakout Or Breakdown? Unless Ethereum can reclaim the $2,600–$2,620 area soon, the next likely target could be the $2,400 level, where the next strong demand cluster sits. However, if bulls defend current prices and manage a quick recovery back above the SMAs, this recent move could be interpreted as a liquidity sweep before continuation. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Bitcoin At $1 Million? CEO Says It’s The Price To Beat Gold",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-at-1-million-novogratz-says-its-the-price-to-beat-gold/",
      "summary": "According to CNBC’s Power Lunch, Galaxy Digital CEO Mike Novogratz thinks Bitcoin could climb all the way to $1 million per coin if big institutions keep piling in. The cryptocurrency hit a weekly peak of $110,290 on Tuesday. It slipped 4.5% to $104,300 by Thursday, but it’s still climbed 1.75% over the past seven days. Novogratz says this isn’t just hype. He points to firms moving cash from dollars and gold into crypto. Related Reading: BTC Is Just 0.2% Of Global Wealth — And That’s Why It’s Not Too Late: Analyst Institutional Moves Up Demand BlackRock’s iShares Bitcoin Trust (IBIT) went live in January 2024 after SEC approval. Based on reports, that fund now gives big investors a straightforward path to own Bitcoin without buying coins directly. BlackRock manages about $11.6 trillion in assets. When a player that size steps in, others notice. Novogratz says wealth managers and pension funds have started treating Bitcoin like a macro asset, on par with gold and the S&#38;P 500. Growing Corporate Interest Treasury companies are adding Bitcoin to their balance sheets. Sovereign wealth funds have begun to follow suit. Retail investors keep buying, too, thanks to easier trading apps and ETFs like IBIT. A handful of public companies have raised millions to buy Bitcoin outright. Related Reading: TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin According to filings, Metaplanet, the Blockchain Group, GameStop, and US President Donald Trump’s Media arm all announced major purchases this year. Their moves chip away at the 21 million-coin supply, making each remaining Bitcoin scarcer. Bitcoin Versus Gold Bitcoin’s 21 million supply cap is hard-wired into its code. Gold, by comparison, has a market worth north of $12 trillion and sees about 1–2% new supply each year through mining. Novogratz argues that younger investors will choose a capped digital asset over a metal bar. That switch isn’t guaranteed, but once people see Bitcoin as a store of value, its appeal could grow. At today’s $2 trillion market cap, Bitcoin has room to expand many times over if it ever rivals gold. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Challenges Ahead Regulators remain a wildcard. The SEC green-lit IBIT, but future rules on taxes or derivatives could slow things down. Bitcoin’s price swings make it riskier than bonds or gold. Institutions often chase stable returns, and Bitcoin pays no dividends or interest. Finally, moving another $10 trillion into crypto would need a massive shift in asset allocations. That kind of inflow isn’t impossible, but it won’t happen overnight. Based on reports, Novogratz sees Bitcoin’s march toward gold’s market cap as a “ball rolling down a hill.” He predicts that, over time, Bitcoin will match gold and then outpace it. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Daily Timeframe Says XRP Price Is On The Verge Of Breakout",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-on-the-verge-of-breakout/",
      "summary": "The XRP price could be preparing for its biggest rally yet, as a crypto analyst now points to a potential breakout that could send this altcoin soaring. After weeks of stabilization and momentum building, XRP is now testing key resistance levels, with the daily timeframe hinting at a possible surge above $2.33. XRP Price Gears Up For Major Breakout Dark Defender, an X (formerly Twitter) crypto analyst, has revealed in a recent analysis that XRP appears to be setting the stage for a significant price shift, with its daily chart signaling a possible upward breakout. After weeks of consolidation below a descending trendline, the altcoin is now approaching a critical level that could become the trigger point for rapid momentum growth, if confirmed. Related Reading: XRP Price Could Hit $21 This Bull Cycle With 1.618 Fib Level As Next Target Currently, the daily timeframe shows XRP testing a long-term downtrend line that has consistently rejected upward movements since early 2025. This resistance level, marked clearly on the analyst’s chart, hovers just above $2.3. Dark Defender has indicated that a daily candle close above $2.33 could effectively invalidate the downtrend and signal a breakout that may lead to further upside. Notably, the analyst’s 1-day XRP price chart shows an explosive move toward a new high of $3.39—a level not seen since the 2018 bull cycle. With XRP currently trading at $2.1, a successful rally to this bullish target would represent an impressive 61.43% surge in value. Such a move would not only break XRP out of its current consolidation phase but also confirm the emergence of a sustained uptrend. Moreover, if momentum persists, it could set the stage for even higher price levels. RSI And EMA Signals Defend XRP’s Bullish Thesis Supporting Dark Defender’s technical analysis and bullish scenario for the XRP price is a rising Relative Strength Index (RSI), which has broken above a descending trendline and continues to trend upward. This shift suggests that XRP is building momentum as buyers finally regain control. Related Reading: Crypto Pundit Says XRP Is No Longer A Speculative Asset – Here’s What It Is Additionally, the analysis shows that price action remains above key Exponential Moving Averages (EMA), which are beginning to curl upward, signaling that the market trends could be turning in favor of the bulls. Although the Ichimoku Cloud technical indicator is not visible on the chart, Dark Defender notes that it is expected to flip bullish soon, further reinforcing XRP’s bullish thesis. Combined with the support held above the 200-day EMA, highlighted by the blue line on the chart, XRP appears to be entering a favorable technical zone. If price action aligns with the analyst’s projected setup and manages to hold candle closes above $2.33, it could mark the beginning of a stronger uptrend. Dark Defender also notes that “XRP’s slingshot pressure” is intensifying rapidly, further boosting the potential strength of the upcoming bullish wave. Featured image from Getty Images, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "The 30,000-Foot View of the Oslo Freedom Forum",
      "link": "https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Oslo-Freedom-Forum.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum\" rel=\"nofollow\"> </a></p> <p>Stories of courage and repression, and the tools defending civil liberties at the 17th Annual Oslo Freedom Forum in Norway.</p> <p>"
    },
    {
      "title": "UK Gold Mining Company Bluebird to Convert Gold Revenues into Bitcoin",
      "link": "https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/UK-Gold-Mining-Company-Bluebird-to-Convert-Gold-Revenues-into-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bluebird Mining Ventures Ltd. will adopt bitcoin as a treasury reserve asset and convert future gold revenues into Bitcoin.</p> <p>"
    },
    {
      "title": "JPMorgan Reports Record Profits for Bitcoin Miners in Q1",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-MORGAN.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1\" rel=\"nofollow\"> </a></p> <p>Bitcoin mining companies in the U.S. have kicked off 2025 with record performance, according to a recent report. The first quarter of the year was “one of Bitcoin miners&#8217; best quarters to date,” analysts Reginald Smith and Charles Pearce stated.&#160; &#8220;Four of the five operators in our coverage reported record revenue and profits,&#8221; the report [&#8230;]</p> <p>"
    },
    {
      "title": "Where Could Bitcoin Peak This Cycle?",
      "link": "https://bitcoinmagazine.com/markets/where-could-bitcoin-peak-this-cycle",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Where-Could-Bitcoin-Peak-This-Cycle.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/where-could-bitcoin-peak-this-cycle\" rel=\"nofollow\"> </a></p> <p>Exploring Bitcoin’s Potential Peak: Valuation Models and Cycle Timing </p> <p>"
    },
    {
      "title": "Bitcoin Will Replace Gold And Go To $1,000,000, Says Galaxy Digital CEO Mike Novogratz",
      "link": "https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Will-Replace-Gold-And-Go-To-1000000-Says-Galaxy-Digital-CEO-Mike-Novogratz.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz\" rel=\"nofollow\"> </a></p> <p>Mike Novogratz, in an interview with CNBC, said “there have been more Bitcoins lost than will be mined for the rest of eternity.\"</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Nobody Predicted Israel Would Strike Iran, But Bitcoin Is Still Not in Panic Mode: Analysis",
      "link": "https://decrypt.co/325114/nobody-predicted-israel-iran-strike-bitcoin-not-panic-mode",
      "summary": "Bitcoin dips below $106K but avoids full-blown panic as traders assess fallout from Israeli airstrikes on Iran."
    },
    {
      "title": "Weeks Before Trial, Tornado Cash’s Roman Storm Sounds Alarm: ‘If I Lose, DeFi Dies With Me’",
      "link": "https://decrypt.co/325095/weeks-before-trial-tornado-cashs-roman-storm-sounds-alarm-if-i-lose-defi-dies-with-me",
      "summary": "The software developer is set to go to trial next month over his operation of the popular coin mixer, despite recent moves by the Trump DOJ to back off such services."
    },
    {
      "title": "SEC Names Crypto Industry Veteran as Trading and Markets Director",
      "link": "https://decrypt.co/325083/sec-names-crypto-industry-veteran-trading-markets-director",
      "summary": "The SEC has named Jamie Selway, who has experience in the crypto industry, as its new director of the trading and markets division."
    },
    {
      "title": "SharpLink Gaming Buys $463 Million in Ethereum, Becomes Largest ETH Treasury Firm",
      "link": "https://decrypt.co/325084/sharplink-gaming-buys-463-million-ethereum-becomes-largest-eth-treasury-firm",
      "summary": "The company’s announcement follows confusion over a recent SEC filing and shares tumbling around 70% in after-hours trading on Thursday."
    },
    {
      "title": "Crypto Plunges, Israel strikes Iran, Gold & Oil Soar",
      "link": "https://decrypt.co/videos/interviews/rm2Jxxl2/crypto-plunges-israel-strikes-iran-gold-oil-soar",
      "summary": "FOMO HOUR EP378 Crypto plunges as Israel strikes Iran. $1.1bn liquidations, Wynn liquidated again. GameStop upsizes debt raise to $2.25bn, to buy BTC. 21 companies launched BTC reserve in last 30 days. Sharplink falls 70% after equity re-sale announced. Sharplink acquires $463m ETH. DFDV announces $5bn equity line to buy SOL. Tony G launches HYPE treasury with $400k HYPE. DOT community proposes BTC treasury. Phantom allows USDC payments to Shopify. Walmart & Amazon consider issuing stablecoins. USDC natively launched on XRP ledger . Trident Digital to raise $500m to buy XRP. DTCC exploring stablecoin usage. Coinbase collabs with AmEx on BTC cashback card. Coinbase to allow DEX & perp trading in US. SEC delays decision on several altcoin ETFs. Tether acquires 32% in Elemental Altus for $92m. Tokenised gold goes live on Hyperliquid. FOMO HOUR brings you the biggest daily news, updates and events from inside and outside of the crypto and macro spheres! Join hosts Farokh, Mando and Tyler as they cover some of the biggest topics at present with some of the biggest names in the ecosystem. Streaming live 5 days per week, Monday to Friday 10:00 AM EST to 11:00 AM EST on YouTube and X. JOIN YEET = https://yeet.com/register?aff=fomohour PLAYLIST = https://www.youtube.com/playlist?list=PLGSgoImPFTiVpkHhLXF78cE_Z3uG7VNGL PODCAST = https://x.com/i/spaces/1kvKpydgqMQGE LIVE SPACE = https://x.com/i/spaces/1OwGWXOYWkmJQ Links: https://linktr.ee/fomohour https://twitter.com/fomohour https://www.rug.fm/ https://x.com/rugradio Hosts: https://twitter.com/farokh https://twitter.com/rektmando https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets #bitcoin #crypto #podcast"
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Invesco, Galaxy Digital file to launch Solana ETF in Delaware amid SEC approval buzz",
      "link": "https://cryptobriefing.com/solana-etf-sec-approval/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional interest and investment in the Solana blockchain ecosystem.</p> <p>"
    },
    {
      "title": "Cardano founder Charles Hoskinson proposes converting $100M ADA to Bitcoin and stablecoins",
      "link": "https://cryptobriefing.com/cardano-treasury-conversion-proposal/",
      "summary": "<p>Hoskinson's proposal could enhance Cardano's DeFi competitiveness, potentially increasing its market share and attracting more developers.</p> <p>"
    },
    {
      "title": "Amazon, Walmart, and Expedia consider issuing stablecoins to sidestep costly card fees: WSJ",
      "link": "https://cryptobriefing.com/retailers-embrace-stablecoins/",
      "summary": "<p>Retailers' stablecoin adoption could revolutionize payment systems, enhance cash flow, and challenge traditional financial networks.</p> <p>"
    },
    {
      "title": "Bitcoin slides, gold spikes after Israel strikes Iran, Israeli PM warns campaign will last as many days as needed",
      "link": "https://cryptobriefing.com/crypto-market-volatility-israel-iran/",
      "summary": "<p>Geopolitical tensions may drive investors to traditional safe-haven assets, impacting cryptocurrency markets and regional economic stability.</p> <p>"
    },
    {
      "title": "$USD1 stablecoin begins minting on TRON",
      "link": "https://cryptobriefing.com/usd1-stablecoin-minting-on-tron/",
      "summary": "<p>The minting of USD1 on TRON could enhance institutional trust and adoption, bolstering TRON's position in the global blockchain market.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "How Blockchain Tokenization Lowers Barriers to Real Estate Investing",
      "link": "https://ambcrypto.com/how-blockchain-tokenization-lowers-barriers-to-real-estate-investing/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"571\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-13-233657.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"763\" />Real estate investing is moving into a new age. Tokenization converts high-value properties into digital, [&#8230;]"
    },
    {
      "title": "Sharplink stock crashes 66% – But $1B Ethereum bet could flip the script",
      "link": "https://ambcrypto.com/sharplink-stock-crashes-66-but-1b-ethereum-bet-could-flip-the-script/",
      "summary": "<img alt=\"Sharplink stock crashes 73% - But $1B Ethereum bet could flip the script\" class=\"attachment-full size-full wp-post-image\" height=\"896\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Sharplink-stock-crashes-73.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1593\" />Can Ethereum become the new go-to treasury asset for public companies, replacing Bitcoin?"
    },
    {
      "title": "Peter Schiff claims Bitcoin has hit a ‘major top,’ but is it too soon?",
      "link": "https://ambcrypto.com/peter-schiff-claims-bitcoin-has-hit-a-major-top-but-is-it-too-soon/",
      "summary": "<img alt=\"Peter Schiff claims Bitcoin has hit a &#039;major top,&#039; but is it too soon?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-FI-.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here's why Peter Schiff's BTC 'major top' call may be premature."
    },
    {
      "title": "The $500 mln XRP treasury bet: Will Ripple’s long-term bet pay off?",
      "link": "https://ambcrypto.com/the-500-mln-xrp-treasury-bet-will-ripples-long-term-bet-pay-off/",
      "summary": "<img alt=\"The $500 mln XRP treasury bet: Will Ripple&#039;s long-term bet pay off?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-11.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ripple’s long-term play is all about utility over hype, and it's finally starting to show."
    },
    {
      "title": "Ethereum: Smart money buys the dip as ETH dives 9% – What’s next?",
      "link": "https://ambcrypto.com/ethereum-smart-money-buys-the-dip-as-eth-dives-9-whats-next/",
      "summary": "<img alt=\"Ethereum: Smart money buys the dip as ETH dives 9% - What&#039;s next?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-13T160813.902_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can ETH hold above $2.4K with $2.64B in shorts stacked overhead?"
    }
  ]
}