{
  "CoinDesk": [
    {
      "title": "Bitdeer Ramps Up Self-Mining Capacity, Ships 1.6 EH/s of SEALMINER A2s in May",
      "link": "https://www.coindesk.com/markets/2025/06/11/bitdeer-ramps-up-self-mining-capacity-ships-16-ehs-of-sealminer-a2s-in-may",
      "summary": ""
    },
    {
      "title": "Filecoin Rises 3.6% After Establishing Support Zone Around $2.68",
      "link": "https://www.coindesk.com/markets/2025/06/11/filecoin-rises-36-after-establishing-support-zone-around-268",
      "summary": ""
    },
    {
      "title": "TON Slides as Sell-Off Triggers Spike in Volume With Potential Bearish Pressure Signal",
      "link": "https://www.coindesk.com/markets/2025/06/11/ton-slides-as-selloff-triggers-spike-in-volume-with-potential-bearish-pressure-signal",
      "summary": ""
    },
    {
      "title": "BNB Pushes Higher Despite Market Turbulence, Testing Resistance Near $674",
      "link": "https://www.coindesk.com/markets/2025/06/11/bnb-pushes-higher-despite-market-turbulence-testing-resistance-near-674",
      "summary": ""
    },
    {
      "title": "Why the Market Needs a Rules-Based Benchmark for Centralised Exchanges",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/10/why-the-market-needs-a-rules-based-benchmark-for-centralised-exchanges",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "After stablecoin push, Stripe acquires crypto wallet developer Privy",
      "link": "https://cointelegraph.com/news/stripe-acquires-privy-crypto-wallet-infrastructure?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzRmNGYtMTBkZS03ZjQzLWE2OWItYTQ0NDg4YmI1YTVl.jpg\" /></p><p>The acquisition of Privy follows Stripe’s entry into the stablecoin market in 2024.</p>"
    },
    {
      "title": "Ethereum whale opens $11M leveraged bet amid ETH price’s 30% rise potential",
      "link": "https://cointelegraph.com/news/ethereum-whale-opens-11m-leveraged-bet-eth-price-30-rise-potential?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVmNGYtYWJiOS03NjZiLTk4MjAtNDRjZmI2Njg0Yjlm.jpg\" /></p><p>ETH price rising to around $2,850 drove the whale’s $11 million leveraged long into $366,000 paper profit.</p>"
    },
    {
      "title": "OneBalance lands $20M to simplify crypto for developers",
      "link": "https://cointelegraph.com/news/onebalance-raises-20m-for-dev-tools?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVmMTQtYTJjOC03OWMxLWEwNDAtM2E2MjZkMDc3MTAx.jpg\" /></p><p>OneBalance raised $20 million to launch a developer toolkit enabling one-click crosschain crypto transactions, aiming to fix fragmented UX and boost app conversions.</p>"
    },
    {
      "title": "When an AI says, ‘No, I don’t want to power off’: Inside the o3 refusal",
      "link": "https://cointelegraph.com/explained/when-an-ai-says-no-i-dont-want-to-power-off-inside-the-o3-refusal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9hMDJmZjlhN2E4YjE4NzQ0Y2U1MzM5Y2ZiYzgyZmI4NS5qcGc=.jpg\" /></p><p> OpenAI’s o3 model resisted shutdown in safety tests, raising concerns about AI alignment and control. </p>"
    },
    {
      "title": "Trump’s consumer protection reforms could leave crypto users in a lurch",
      "link": "https://cointelegraph.com/news/trump-s-consumer-protection-reforms-could-leave-crypto-users-in-a-lurch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVmODQtY2ExZS03OTQ2LWI5ZGItZGRjNWY1NDg4NDE0.jpg\" /></p><p>The Trump administration, supported by major US crypto firms, has largely dismantled the Consumer Financial Protection Bureau, leaving consumers vulnerable.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Polygon’s governance revamp to focus on stablecoin payments and AggLayer",
      "link": "https://cryptoslate.com/polygons-governance-revamp-to-focus-on-stablecoin-payments-and-agglayer/",
      "summary": "<p>Polygon&#8217;s governance is undergoing a significant transformation, with co-founder Sandeep Nailwal stepping in as the Foundation&#8217;s first CEO. In a June 11 post on X, Nailwal said: &#8220;As the largest holder of POL and someone who dedicated his life to development and success of Polygon from the very beginning, I have decided to take full [&#8230;]</p> <p>"
    },
    {
      "title": "XRP derivatives traders boost leverage as funding costs jump",
      "link": "https://cryptoslate.com/xrp-derivatives-traders-boost-leverage-as-funding-costs-jump/",
      "summary": "<p>A slow but clear divergence is emerging in XRP&#8217;s derivatives market: open interest has eased modestly over the past month, but the amount of leverage employed by traders is steadily rising. With spot demand softening and funding rates climbing to near their monthly highs, XRP appears to be entering a phase of elevated positioning risk, [&#8230;]</p> <p>"
    },
    {
      "title": "VivoPower commits $100 million in XRP for Flare Network to earn yield on treasury",
      "link": "https://cryptoslate.com/vivopower-commits-100-million-in-xrp-to-flare-network-to-earn-yield-on-treasury/",
      "summary": "<p>VivoPower has committed $100 million in XRP to Flare Network&#8217;s ecosystem in a bid to boost returns on its digital asset holdings, according to a June 11 statement. Through this move, VivoPower intends to leverage Flare&#8217;s on-chain protocols, including Firelight, to generate sustainable yield from its XRP reserves. The company plans to channel all earned [&#8230;]</p> <p>"
    },
    {
      "title": "Ukraine opens door to Bitcoin reserves as experts warn of key risks",
      "link": "https://cryptoslate.com/ukraine-opens-door-to-bitcoin-reserves-as-experts-warn-of-key-risks/",
      "summary": "<p>Ukraine is taking a significant step toward adding Bitcoin to its national reserves. On June 10, the Ukrainian parliament received a draft bill proposing an amendment to the National Bank of Ukraine&#8217;s (NBU) asset reserve policy. This change would allow the central bank to add cryptocurrencies alongside gold and foreign currencies to its reserves. Ukrainian [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin jumps near $110k after US inflation data shows signs of cooling",
      "link": "https://cryptoslate.com/insights/bitcoin-jumps-near-110k-after-us-inflation-data-shows-signs-of-cooling/",
      "summary": "<p>Bitcoin&#8217;s price increased 0.5% to $109,600 on Wednesday after United States inflation data for May came in below market expectations. The asset’s move comes after a period of sustained strength, where it has held a range between $109,000 and $110,000 over the last three days. The latest Consumer Price Index report showed year-over-year inflation of [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Is Wildly Undervalued, Says Bitwise: ‘Fair Price’ Today Is $230,000",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-undervalued-bitwise-fair-price-today-230000/",
      "summary": "Bitcoin is once again knocking on the door of price discovery, but researchers at Bitwise Asset Management argue that spot quotations still understate what the network is worth. In their Week 24 Crypto Market Compass circulated late Tuesday, Dr. André Dragosch, Bitwise’s Head of Research for Europe, and analyst Ayush Tripathi calculate that “quantitative models estimate Bitcoin’s hypothetical ‘fair value’ amid the current sovereign default probabilities at around $230,000 today.” The figure implies a premium of just over 110 percent to the market price, which was hovering near $109,600 at press time on 11 June 2025. Bitcoin’s ‘True Worth’ Is Explosive Dragosch ties that assessment to the rally in sovereign-risk hedges. United-States one-year credit-default-swap spreads are trading near half-percentage-point territory—levels last seen during the 2023 debt-ceiling scare—reflecting “broader concerns over the US fiscal deficit,” Reuters reported last week. “Bitcoin can provide an alternative ‘portfolio insurance’ against widespread sovereign defaults as a scarce, decentralised asset which is free of counterparty risks,” the note argues, adding that net interest outlays projected by the Congressional Budget Office point to a tripling of US debt-service costs to roughly $3 trillion by 2030. Related Reading: Bitcoin Skyrockets Past $108,000 Amid US-China Tariff Discussions The macro backdrop, however, is not the only pillar supporting Bitwise’s fair-value call. The firm’s in-house Cryptoasset Sentiment Index shows twelve of fifteen market-breadth gauges trending higher, while the cross-asset risk-appetite index (CARA) compiled from equities, credit, rates and commodities has surged to a five-year high. “Both cryptoasset and cross-asset sentiment are now decisively bullish,” Dragosch writes, noting that Bitcoin’s climb back above $110,000 places it within two percent of the all-time high near $112,000 set in May. On-chain data remain constructive. Exchange reserves have slipped to 2.91 million BTC—about 14.6 percent of the circulating supply—after whales withdrew an estimated 390,632 BTC last week. At the same time, net exchange-spot outflows slowed to roughly $0.53 billion from $1.78 billion the previous week, suggesting lighter profit-taking pressure. Derivative positioning echoes the spot-market resilience. Aggregate Bitcoin futures open interest added 2,200 BTC across venues, while the CME leg gained 6.4 k BTC. Funding rates on perpetual swaps stayed positive overall despite flipping negative for parts of the weekend, and the three-month annualised basis held around 6.3 percent. In options, open interest expanded by 27,300 BTC, with the put-to-call ratio settling at 0.55; one-month 25-delta skew remained modestly negative, implying continued demand for downside hedges even as realised volatility slipped to 28.2 percent. Institutional flows are reinforcing the bullish tone. Global crypto ETPs absorbed $488.5 million last week, of which $254.9 million went into Bitcoin products. US spot Bitcoin ETFs led the charge with $525 million of inflows, counterbalanced by a $24.1 million weekly leak from the Grayscale Bitcoin Trust. Bitwise’s own BITB vehicle attracted $78.1 million, while its European physical Bitcoin ETP (BTCE) saw only marginal outflows. Ethereum products also enjoyed $260.9 million in net inflows, maintaining the broad-based risk bid. Related Reading: Bitcoin &#38; Ethereum Diverge—ETF Flows Just Flipped The Narrative Bitwise concedes that headline risk can still provoke sharp, short-lived drawdowns—last week’s spat between Elon Musk and President Donald Trump briefly drove BTC back to $100,000—but sees structural forces firmly tilted to the upside. “US economic policy uncertainty has most likely passed its zenith already and continues to decline at the margin,” Dragosch writes, pointing to May non-farm-payroll growth of 139,000 and a moderation in recession odds. With Bitcoin already outperforming traditional assets year-to-date and cross-asset sentiment now confirmed by Bitwise’s indicators, the analysts argue that the market is beginning to price the asset less as a speculative vehicle and more as a macro hedge. Whether traders embrace the $230,000 fair-value marker hinges on the same variables underscored in the note—sovereign-risk premiums, policy uncertainty and the pace of institutional adoption—but the groundwork, they say, is visible on-chain, on desks and in the flow data. “Bitcoin also reclaimed 110k USD and is close to its previous all-time high,” the report reminds readers. For Bitwise, that proximity is not an end point but a staging area: the monetary asset’s intrinsic value, they conclude, resides “considerably further north.” At press time, BTC traded at $109,617. &#160; Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Break Above $107,000 Triggers Bullishness, These Factors Will Drive A Faster Rise",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-107000-triggers-bulls/",
      "summary": "After days of testing a resistance zone at $106,000, Bitcoin has finally broken above the $107,000 mark to confirm a strong bullish momentum that has been building since early June. The breakout, which has seen Bitcoin reclaim $110,000 briefly in the past 24 hours, follows several failed attempts to close above this pivotal level. Technical analysis of the Bitcoin price indicates that the breakout above $107,000 has given bulls back control. Particularly, technical analysis from crypto analyst Michaël van de Poppe suggests that Bitcoin&#8217;s price will accelerate for the rest of the week. $106,500 Confirms Strength, Analyst Eye Accelerated Move Over the past few days, Bitcoin’s price structure has been forming a rounded base with higher lows, gradually coiling under a support turned resistance. Now that the breakout has occurred, bulls seem to be back in control. Related Reading: Why The Bitcoin Price Could See Another 70%-170% Jump From Here According to Michaël van de Poppe, a widely-followed crypto analyst on the social media platform X, the decisive moment came after Bitcoin cleared the $106,500 resistance, a level he previously mentioned he&#8217;s looking at. In his post, he noted that as long as Bitcoin maintains support above this zone, momentum will continue to shift in favor of buyers. Specifically, he pointed out that day traders are likely to pile in with new long positions, while short sellers are either closing their positions or getting squeezed out entirely. Both of these actions will continue to generate buying pressure, at least in the short term. This shift in market structure has already begun to play out. As the chart below shows, the previous resistance zone around $107,000, which was a strong support during the earlier ATH moves in May, has now flipped. This zone had repeatedly rejected price advances, acting as a price ceiling since May 30. Now, with the breakout confirmed and volume increasing, the analyst expects a swift rally toward $108,900 and beyond for the rest of the week. Bulls Prepare For New Bitcoin All-Time High The timing of this breakout also coincides with the start of the trading week, which Van de Poppe describes as a great start to the week and a continued upside for the remainder of the week. More often than not in this cycle, Bitcoin has exhibited sentiment surges early in the week that persisted throughout the week. If Bitcoin can consolidate above the $107,000 to $108,000 range without falling back into the previous structure, it could enter a new price zone as soon as the $111,000 barrier is breached. Related Reading: Bitcoin Diamond Hands Are Buying Again, Here’s Why It’s Bullish For The Market With increasing interest due to ETF inflows, it could serve as the launchpad for Bitcoin’s next major leg up, carrying it toward new all-time highs before the end of June. At the time of writing, Bitcoin is trading at $109,455, having recently reached an intraday high of $110,237. The leading cryptocurrency is currently only about 2.5% away from setting a new all-time high. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-to-1-million-michael-saylor-laughs-off-crypto-winter-fears/",
      "summary": "Bitcoin’s price outlook remains sky-high after Strategy founder Michael Saylor told Bloomberg on Tuesday that a market freeze won’t come back. He argued that growing demand and limited daily supply point straight to a rally toward $1 million. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Supply And Demand Pressure According to Saylor, miners release only about 450 BTC each day. That adds up to roughly $50 million at today’s price of around $109,859. He said once that $50 million is snapped up by buyers, there’s no choice but for the price to climb. His view rests on the idea that active demand now matches or exceeds what miners sell. High Price Targets Based on reports, asset manager ARK Invest recently boosted its bull case for Bitcoin from $1.5 million to $2.4 million by the end of 2030. Saylor went even further. He said that as long as Bitcoin doesn’t head to zero, it’s bound for $1 million. His own firm has picked up 582,000 BTC since 2020. That stash is worth nearly $64 billion, according to Saylor Tracker data. Institutional And Political Support Saylor pointed to big names backing Bitcoin. He mentioned US President Donald Trump, US Treasury Secretary Scott Bessent and SEC chair Paul Atkins as signs that the asset has won its toughest battles. He also noted that banks are lining up to offer custody services. And he praised Bitcoin ETFs from BlackRock and others for buying coins daily. Volatility Warning Saylor didn’t shy away from a cautionary note. He suggested that if Bitcoin hits $500,000 or $1 million, a fall to about $200,000 could follow. That’s almost a 60% drop from the peak. His point was that big price swings are part of Bitcoin’s history—and likely its future. Beyond miner sales and whale wallets, analysts say wider market moves matter too. Spot and futures trading often top $10 billion a day, so $50 million of fresh buys might only nudge the price. Regulation could swing the other way if concerns over energy use or consumer protection grow. And rival cryptocurrencies keep popping up with new features. Related Reading: Owning 10,000 XRP? You’re Among Crypto’s Elite, Expert Claims What Comes Next Reports disclose the real test will be whether steady new buyers can outpace both miner supply and selling by holders looking to bank profits. Saylor’s figures make a strong case for continued upside. But investors who build a plan around a $1 million Bitcoin should brace for big dips along the way. In the end, daily demand, political moves and how the rest of the financial world reacts will decide if those eye-popping targets really come to pass. Featured image from Getty Images, chart from TradingView"
    },
    {
      "title": "Dogecoin Faces Make-Or-Break Moment This Month, Predicts Analyst",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-make-or-break-moment-this-month/",
      "summary": "Dogecoin is changing hands near $0.198 on Wednesday afternoon in Europe, almost 20 % below its late-March high yet still clinging to an eleven-month up-trend that now converges with a formidable technical inflection, according to independent analyst “VisionPulsed.” Is This Dogecoin’s Summer Liftoff? Speaking in a 10 June video, the analyst told viewers he had been “making the case that the first two weeks of June should be when we start moving up—if we’re bullish. He conceded that “there is a chance the move has started” after Dogecoin closed a two-day candle back above the 0.618 Fibonacci retracement drawn from the December 2024 swing high. The backdrop VisionPulsed describes is notably risk-on. Bitcoin is hovering around $109,500, roughly 3% shy of its all-time high, while Ethereum has punched out a fresh twelve-month high above $2,790. In equities, the S&#38;P Small-Cap 600—an index the analyst referenced when he quipped that “the S&#38;P broke 600 yesterday”—posted its strongest five-day advance since March, a move the analyst interprets as validation of a global-liquidity gauge Global M2. Related Reading: Dogecoin Primed For Liftoff If It Can Break This Barrier: Key Price Targets Hash-ribbon signals on Bitcoin flipped positive two weeks ago, the analyst noted, historically an early marker of revived demand for risk assets. “Bitcoin at 110K says we should go up. Ethereum breaking out says we should go up. If we still don’t go up… just pick a different investment choice.” Central to VisionPulsed’s thesis is a 70-day cyclical window counted from Dogecoin’s April 1 local low. “We’re approaching that 70-day mark.… It is now the time for it to be bullish,” he said, warning that failure to rally before mid-June would all but invalidate the setup. Yet the analyst concedes that Dogecoin’s fate is tethered to the ETH/BTC pair and to Bitcoin dominance, which has remained stubbornly elevated: “When the ETH-BTC move does occur, that’s going to be when the dominance falls and we need the dominance to fall because that’s when Dogecoin goes to the moon.” Until that rotation happens, any up-ticks in DOGE may remain prone to stalling beneath long-term resistance. Related Reading: Bloodbath Incoming? Dogecoin Must Hold This Level To Survive VisionPulsed identifies three price milestones that will decide sentiment. A daily close above $0.23 would constitute the first clear break of the descending trend-line in place since December, while $0.30—the 0.618 retracement of the entire 2021–2024 bear market—marks the level at which, he says, “people will start talking about Dogecoin at your summer camp… it’s going to be euphoric.” Should time drag on, he allows that the trigger could slide to $0.27, but the message is stark: “If we just shoot up, it’s still $0.30. If we take longer, it could be lower, but it’s the same concept.” With Bitcoin firm above six figures, Ethereum printing new local highs, and global liquidity gauges flashing green, the stage is set for an upside resolution. Whether Dogecoin can convert that macro tail-wind into a decisive break above $0.23—and ignite the $0.30 euphoria line—will become evident within the next fortnight. At press time, DOGE traded at $0.197. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Solaxy Coming to Ethereum with Hyperlane, Soon to Reach $48M in Presale",
      "link": "https://www.newsbtc.com/news/solaxy-coming-to-ethereum-with-hyperlane-soon-to-reach-48m-in-presale/",
      "summary": "Solaxy ($SOLX), Solana&#8217;s newest and most faithful project yet, has come out with its latest update that could change the way Web3 apps and tokens interact across blockchains. The project announced its collaboration with Hyperlane, a Web3 infrastructure project, to make bridging faster, easier, and more seamless than it&#8217;s ever been. Keep reading to learn more about Solaxy&#8217;s Hyperlane announcement, what it means for Solana and altcoin enthusiasts, and why it could benefit the Solaxy presale and help it achieve the magical $50M mark. Solaxy Revolutionizes Cross-Chain Support with New Hyperlane Integration It&#8217;s worth noting that traditional bridging, which means transferring tokens from one blockchain to another, is a slow and complex process. That&#8217;s where Solaxy begs to differ, though. With Hyperlane&#8217;s cutting-edge modular and permissionless architecture, Solaxy will build an entirely new type of bridge that connects Solana, Solaxy, and Ethereum flawlessly. This will be a first-of-its-kind Layer 2 bridge experience for Solana users, providing low latency (better speeds), improved affordability, and enhanced user experience. For developers and users on Solana, transferring tokens between the two blockchains would be as easy as using a regular app. Solaxy Aims to Help Solana Grow Bigger and Better Solana&#8217;s development is Solaxy&#8217;s core mission. That&#8217;s what this new crypto with an Einstein-ified Pepe the Frog as its face card is all about, in fact. $SOLX&#8217;s Hyperlane integration will help Solana plug directly into Ethereum, a blockchain with deep liquidity and a vast dApp ecosystem, helping it grow beyond its limitations (solving issues like limited scalability and network congestion). The launch of the $TRUMP and $MELANIA tokens earlier this year brought in a flurry of new investors to Solana. But, despite being a meme coin-friendly blockchain, it wasn&#8217;t prepared for the sudden spike in transaction requests. Which led to numerous failed transactions and massive congestion. Solaxy plans to remedy that, however, by building the first-ever Layer 2 scaling protocol on Solana. It will bring back the network&#8217;s glory days by increasing its efficiency and scaling it to higher levels. The project will offload a significant number of transactions onto a sidechain (L2) through its roll-up technology, easing the pressure off Solana&#8217;s L1. The L2 will also implement batch processing, executing transactions in bulk, instead of one by one. This will reduce the cost per transaction, making Solana an ever more affordable blockchain for crypto and meme coin degens. By bridging to Ethereum and Solana using Hyperlane, Solaxy becomes more than just a scaling tool. It&#8217;s a full-blown interoperable hub, allowing seamless crypto transfers between the most popular blockchains in the world. One Multi-Chain Token, Several Use Cases Thanks to its compatibility with multiple chains (Solana and Ethereum), Solaxy&#8217;s scalability and speed can be used to power high-frequency dApps, too. These include: Gaming ecosystems looking for real-time interactions Meme coin and microtransaction platforms Custom-built financial applications that need low latency and improved affordability And consider the fact that Ethereum is the second-most popular blockchain for dApps after BNB, with over 5K dApps live right now (10x more than Solana). Which brings us to the kicker: Solaxy&#8217;s Hyperlane bridging between its blockchain, Solana, and Ethereum, could be much more impactful than at first glance. $SOLX, as Solaxy&#8217;s token, should receive much much of this boost and keep growing at an accelerated rate as a result. Solaxy&#8217;s Record-Breaking Presale Performance As Solaxy&#8217;s real-world application keeps growing, $SOLX investors should receive the lion&#8217;s share of the benefits. $SOLX is currently in presale, having already raised an eye-watering $47.1M in early investor funding. Each token is currently priced at just $0.001752, and given Solaxy&#8217;s wild future potential – it could explode 11,300% and reach $0.20 by 2026 – this is an almost unbelievably good deal you&#8217;re getting on Solaxy right now. If you&#8217;re interested in supporting the next big thing in DeFi, visit the official Solaxy website, connect your crypto wallet, punch in the number of tokens you want to buy, and confirm the transaction from your wallet. It&#8217;s all so simple! For further help, check out our full explainer on how to buy Solaxy. Disclaimer: A crypto token&#8217;s potential notwithstanding, kindly bear in mind that the market doesn&#8217;t guarantee any returns. This article isn&#8217;t financial advice, and we urge you to do your own research before investing."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Paul Tudor Jones: Bitcoin, Gold, Stocks Are The Best Portfolio To Fight Inflation",
      "link": "https://bitcoinmagazine.com/news/paul-tudor-jones-bitcoin-gold-stocks-are-the-best-portfolio-to-fight-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Paul-Tudor-Jones-Bitcoin-Gold-Stocks-Are-The-Best-Portfolio-To-Fight-Inflation.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/paul-tudor-jones-bitcoin-gold-stocks-are-the-best-portfolio-to-fight-inflation\" rel=\"nofollow\"> </a></p> <p>Billionaire Paul Tudor Jones said that bitcoin, gold, stocks would be the best portfolio to have to fight against inflation in an interview with Bloomberg.</p> <p>"
    },
    {
      "title": "Evertz Pharma Becomes First German Company With Strategic Bitcoin Reserve, Adds 100 BTC to Treasury",
      "link": "https://bitcoinmagazine.com/news/evertz-pharma-becomes-first-german-company-with-strategic-bitcoin-reserve-adds-100-btc-to-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Evertz-Pharma-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/evertz-pharma-becomes-first-german-company-with-strategic-bitcoin-reserve-adds-100-btc-to-treasury\" rel=\"nofollow\"> </a></p> <p>Evertz Pharma GmbH, a company focusing on premium natural cosmetics, has become Germany’s first company to adopt a strategic Bitcoin reserve model by purchasing an additional 100 BTC in May 2025—valued at approximately €10 million (~$10.8 million USD), according to a press release.&#160; The adoption marks a continued expansion of the company’s BTC treasury, which [&#8230;]</p> <p>"
    },
    {
      "title": "Michael Saylor: The Bear Market Is Not Coming Back And Bitcoin Is Going To $1 Million",
      "link": "https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Michael-Saylor-The-Bear-Market-Is-Not-Coming-Back-And-Bitcoin-Is-Going-To-1-Million.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million\" rel=\"nofollow\"> </a></p> <p>In a Bloomberg interview, Strategy CEO Michael Saylor announces that Bitcoin is not going to zero, it is going to $1 million.</p> <p>"
    },
    {
      "title": "Bitwise Debuts First Ever GameStop Covered Call ETF",
      "link": "https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitwise.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf\" rel=\"nofollow\"> </a></p> <p>Today, Bitwise Asset Management announced the launch of the Bitwise GME Option Income Strategy ETF (IGME), the first-ever covered call ETF centered around GameStop (GME). The fund arrives at a moment where GameStop recently made headlines for its $500 million Bitcoin treasury strategy. Led by Bitwise’s Head of Alpha Strategies Jeff Park, IGME is the [&#8230;]</p> <p>"
    },
    {
      "title": "Economic Bitcoin Nodes: Why You Need To Use Your Node For It To Matter",
      "link": "https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BitcoinEconomicNOdes.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter\" rel=\"nofollow\"> </a></p> <p>Bitcoin nodes are what makes up the Bitcoin network, but without using them to verify your economic activity, they don't impact consensus. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "PayPal Expands PYUSD Stablecoin to Stellar, Joining Ethereum and Solana",
      "link": "https://decrypt.co/324642/paypal-pyusd-stablecoin-stellar-ethereum-solana",
      "summary": "The payment giant's stablecoin product will soon be available on the blockchain network behind XLM."
    },
    {
      "title": "Ethereum ETFs Record Best Day in 4 Months With $125 Million in Investments",
      "link": "https://decrypt.co/324639/ethereum-etfs-record-best-day-4-months-125-million",
      "summary": "Spot Ethereum ETFs generated $125 million in inflows on Tuesday, representing their best daily performance since early February."
    },
    {
      "title": "BTC stable ahead of CPI, SOL ETFs coming soon, SPX hits ATH",
      "link": "https://decrypt.co/videos/interviews/PTkIaZyj/btc-stable-ahead-of-cpi-sol-etfs-coming-soon-spx-hits-ath",
      "summary": "FOMO HOUR EP376 BTC steady ahead of CPI today. SOL outperforms, SEC may approve staking ETFs. HYPE hits another ATH as DeFi coins surge. ETH perp volume surpasses BTC over 24hrs. ETH back above its 200 DMA. Metalpha buys $48.5m ETH. Bear market not coming back: Saylor. $200k BTC prediction conservative: Bernstein. Lummis calls to revise crypto tax laws. SEC initiates reviews of 21Shares SUI ETF. 60% of Fortune 500 working on crypto projects. Synaptogenix to acquire $10m TAO. Bullish files for IPO. xAI to integrate Polymarket with X data, Grok. FOMO HOUR brings you the biggest daily news, updates and events from inside and outside of the crypto and macro spheres! Join hosts Farokh, Mando and Tyler as they cover some of the biggest topics at present with some of the biggest names in the ecosystem. Streaming live 5 days per week, Monday to Friday 10:00 AM EST to 11:00 AM EST on YouTube and X. JOIN YEET = https://yeet.com/register?aff=fomohour PLAYLIST = https://www.youtube.com/playlist?list=PLGSgoImPFTiVpkHhLXF78cE_Z3uG7VNGL PODCAST = https://x.com/i/spaces/1kvKpydgqMQGE LIVE SPACE = https://x.com/Tyler_Did_It/status/1932800703862292867 Links: https://linktr.ee/fomohour https://twitter.com/fomohour https://www.rug.fm/ https://x.com/rugradio Hosts: https://twitter.com/farokh https://twitter.com/rektmando https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets #bitcoin #crypto #podcast"
    },
    {
      "title": "Hyperliquid Token Leads Altcoin Rebound as Bitcoin Price Steadies",
      "link": "https://decrypt.co/324614/hype-leads-altcoin-recovery-bitcoin-price-steadies",
      "summary": "HYPE token outperforms major cryptos with 12.4% weekly gains as Hyperliquid's DEX gains traction in perpetual futures trading."
    },
    {
      "title": "Bitcoin Climbs Slightly as US Reports Inflation Slowed in May",
      "link": "https://decrypt.co/324375/bitcoin-after-cpi",
      "summary": "Bitcoin climbs toward $110K as May inflation comes in lower than expected, boosting hopes for Fed rate cuts and crypto momentum."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin rally could resume as tariff fears ease and CPI cools, says analyst",
      "link": "https://cryptobriefing.com/bitcoin-rally-potential-inflation-tariff-ease/",
      "summary": "<p>Eased tariff tensions and cooling inflation may boost Bitcoin, potentially prompting Fed rate cuts and renewed retail crypto interest.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Interactive Strength plans to invest $500M in Fetch.ai’s FET token to build an AI-focused crypto treasury",
      "link": "https://cryptobriefing.com/ai-focused-crypto-treasury-investment/",
      "summary": "<p>This move highlights a growing trend of public companies investing in AI-driven digital assets, potentially reshaping corporate finance.</p> <p>"
    },
    {
      "title": "Pro-Bitcoin Scott Bessent emerges as candidate for next Fed chair",
      "link": "https://cryptobriefing.com/fed-chair-successor-bessent-powell/",
      "summary": "<p>Bessent's potential Fed chair candidacy highlights a shift towards integrating cryptocurrency perspectives in U.S. monetary policy.</p> <p>"
    },
    {
      "title": "Solana ETFs could be approved in 3-5 weeks, SEC signals openness to staking",
      "link": "https://cryptobriefing.com/solana-etf-approval-potential-signals/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional investment in crypto, enhancing market legitimacy and innovation.</p> <p>"
    },
    {
      "title": "Wall Street’s Guggenheim Treasury brings its flagship tokenized debt instrument to XRP Ledger",
      "link": "https://cryptobriefing.com/guggenheim-treasury-launches-tokenized-commercial-paper-xrp-ledger/",
      "summary": "<p>The integration of tokenized debt on the XRP Ledger could accelerate blockchain adoption in traditional finance, enhancing liquidity and efficiency.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Avalanche adoption surges 275% – Can it help AVAX break above $24?",
      "link": "https://ambcrypto.com/avalanche-adoption-surges-275-can-it-help-avax-break-above-24/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-95-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />AVAX’s network activity is booming, but major resistance still threatens its short-term upside momentum."
    },
    {
      "title": "Ethena’s short-term direction hinges on $0.37 resistance – Will bulls prevail?",
      "link": "https://ambcrypto.com/ethenas-short-term-direction-hinges-on-0-37-resistance-will-bulls-prevail/",
      "summary": "<img alt=\"Ethena&#039;s short-term direction hinges on $0.37 resistance - Will bulls prevail?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-11T115334.177-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ENA faces breakout pressure as bulls confront trapped holders and rising volatility signals."
    },
    {
      "title": "SPX6900’s gains look strong, but THESE red flags could surprise you!",
      "link": "https://ambcrypto.com/spx6900s-gains-look-strong-but-these-red-flags-could-surprise-you/",
      "summary": "<img alt=\"Is SPX6900 unstoppable? Traders, wait, THESE 2 red flags suggest a rude wake-up!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250611_114632_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SPX has led the market with significant gains, but the sustainability of this rally is now in question."
    },
    {
      "title": "Why SEC delayed its Polkadot, Hedera ETF decisions, and what’s next",
      "link": "https://ambcrypto.com/why-sec-delayed-its-polkadot-hedera-etf-decisions-and-whats-next/",
      "summary": "<img alt=\"Why SEC delayed its Polkadot, Hedera ETF decisions, and what&#039;s next\" class=\"attachment-full size-full wp-post-image\" height=\"669\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/SEC-delays-polkadot-and-hedera-etf.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1190\" />Is the SEC's caution a permanent hurdle or just a phase?"
    },
    {
      "title": "Bitcoin fails to break $111K – Is this the end of BTC’s uptrend?",
      "link": "https://ambcrypto.com/bitcoin-fails-to-break-111k-is-this-the-end-of-btcs-uptrend/",
      "summary": "<img alt=\"Bitcoin fails to break $111K - Is this the end of BTC&#039;s uptrend?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-11T110155.178-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin nears critical resistance as whales hold back, leaving room for a breakout or pullback."
    }
  ]
}