{
  "CoinDesk": [
    {
      "title": "Dogecoin Surges 7% as Bulls Break Key Resistance",
      "link": "https://www.coindesk.com/markets/2025/06/24/dogecoin-surges-7-as-bulls-break-key-resistance",
      "summary": ""
    },
    {
      "title": "Ether, Solana, Cardano Spike 7% as Trump Claims to Broker Israel-Iran Ceasefire",
      "link": "https://www.coindesk.com/markets/2025/06/24/ether-solana-cardano-spike-7-as-trump-claims-to-broker-israel-iran-ceasefire",
      "summary": ""
    },
    {
      "title": "XRP Jumps 11% With Eyes on $2.20, Analysts Split on What’s Next",
      "link": "https://www.coindesk.com/markets/2025/06/24/xrp-jumps-11-with-eyes-on-220-analysts-split-on-whats-next",
      "summary": ""
    },
    {
      "title": "Ark Invest Continues to Dump Circle Shares, Buys Robinhood and Coinbase",
      "link": "https://www.coindesk.com/markets/2025/06/24/ark-invest-continues-to-dump-circle-shares-buys-robinhood-and-coinbase",
      "summary": ""
    },
    {
      "title": "ETH Surges 9% as Crypto Market Celebrates Trump's Ceasefire Announcement",
      "link": "https://www.coindesk.com/markets/2025/06/24/eth-surges-9-as-crypto-market-celebrates-trump-s-peace-deal-announcement",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "$4B family office VMS Group to begin investing in crypto: Report",
      "link": "https://cointelegraph.com/news/hong-kong-family-office-vms-group-begin-investing-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2U5YWQtZDdjZi03ZWIzLWIyOWQtM2ZkMzI2MTA1MmFi.jpg\" /></p><p>VMS Group is looking to invest up to $10 million with Re7 Capital strategies, as it hopes to diversify into more liquid investments, according to managing partner Elton Cheung.</p>"
    },
    {
      "title": "Beware: SparkKitty malware wants your seed phrase screenshots",
      "link": "https://cointelegraph.com/news/crypto-seed-phrase-stealing-malware-on-major-app-stores?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWE3NDAtMzY2Ny03YzU1LWFhZGQtYmU2YjFjZmY0ZDNl.jpg\" /></p><p>Kaspersky says the malware SparkKitty has been around since at least early 2024, and is likely connected to a similar type of malicious software dubbed SparkCat.</p>"
    },
    {
      "title": "Panther Metals up 21% after $5.4M Bitcoin play to buy minerals and gold",
      "link": "https://cointelegraph.com/news/panther-metals-shares-soar-bitcoin-treasury-plan-buy-minerals-and-gold?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2EwM2QtZmMxZC03N2YwLTgwMGQtNTc0YmYyYWQzYjg1.jpg\" /></p><p>Panther Metals is planning a $5.4 million Bitcoin treasury and will use it as collateral to buy a mineral mining deposit in Canada and other commodities in the future.</p>"
    },
    {
      "title": "Fed cuts ‘reputational risk’ scrutiny used to ‘assassinate’ crypto firms",
      "link": "https://cointelegraph.com/news/fed-removes-reputational-risk-boon-crypto-debanking?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NGIzY2UtMTQ3Yi03OThjLTgyNDYtNTJjZGM4YjFjYjUx.jpg\" /></p><p>Under Operation Chokepoint 2.0, more than 30 technology and crypto companies were denied banking services in the US after the collapse of crypto-friendly banks in 2023.</p>"
    },
    {
      "title": "Ethereum dev floats halving slot times to 6 secs, doubling blocks",
      "link": "https://cointelegraph.com/news/ethereum-dev-proposes-halving-slot-times-6-secs-doubling-blocks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2M5NDUtMTM4NS03YTYzLWJlOGQtNjcxMWVhODE4ZTBi.jpg\" /></p><p>Core developer Barnabé Monnot says six-second block times would slash confirmation delays, boost DeFi efficiency and create smoother user experiences across the Ethereum network.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Dark market activity on Telegram persists despite $27B Huione ban – Elliptic",
      "link": "https://cryptoslate.com/dark-market-activity-on-telegram-persists-despite-27b-huione-ban-elliptic/",
      "summary": "<p>Telegram-based dark markets rapidly filled the gap left by Huione Guarantee after the $27 billion marketplace disappeared on May 13, according to a June 23 Elliptic report. Elliptic noted that Telegram banned thousands of Huione Guarantee channels and usernames once researchers traced billions of USDT-denominated sales to pig-butchering scams. However, data shows that merchants immediately [&#8230;]</p> <p>"
    },
    {
      "title": "FTX fights back against 3AC’s ‘unreasonable and unsupportable’ $1.53B claim",
      "link": "https://cryptoslate.com/ftx-fights-back-against-3acs-unreasonable-and-unsupportable-1-53b-claim/",
      "summary": "<p>FTX’s bankruptcy lawyers have pushed back forcefully against a $1.53 billion claim filed by failed crypto hedge fund Three Arrows Capital (3AC), calling the demand “illogical” and warning that it would unfairly drain funds from FTX’s legitimate creditors. In new court documents submitted on June 20, FTX’s legal team asked a Delaware bankruptcy judge to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin whipsaws back to $104k after losing six-figures as Iran’s failed attack signals end of tensions",
      "link": "https://cryptoslate.com/bitcoin-whipsaws-back-to-104k-after-losing-six-figures-as-irans-failed-attack-signals-end-of-tensions/",
      "summary": "<p>Bitcoin (BTC) whipsawed below $100,000 at about 4 p.m. UTC on June 23 and reclaimed nearly $104,000 three hours later as traders processed news of an Iranian missile strike on a US air base in Qatar that caused no casualties. As of press time, Bitcoin was trading at $103,801.74, up 4.5% over the past 24 [&#8230;]</p> <p>"
    },
    {
      "title": "Survey: 82% of US wealthy investors favor advisers who can deliver informed crypto strategies",
      "link": "https://cryptoslate.com/survey-82-of-us-wealthy-investors-favor-advisers-who-can-deliver-informed-crypto-strategies/",
      "summary": "<p>Wealthy US investors say they are more likely to hire financial advisers who provide crypto guidance, according to a June 2025 CoinShares survey of 500 individuals with at least $500,000 in investable assets. A vast majority (88%) of investors already work with an adviser, and 58% rank advisers as their most trusted source for digital [&#8230;]</p> <p>"
    },
    {
      "title": "Fed joins regulators dropping reputational risk factor, clearing banks to serve crypto firms",
      "link": "https://cryptoslate.com/fed-joins-regulators-dropping-reputational-risk-factor-clearing-banks-to-serve-crypto-firms/",
      "summary": "<p>The Federal Reserve Board on June 23 removed reputational risk from its bank supervision program, ordering staff to strike the term from examination manuals and to concentrate on measurable financial exposures. The Fed move positions the central bank alongside the Federal Deposit Insurance Corporation (FDIC) and the Office of the Comptroller of the Currency, which [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "This Bitcoin Zone Could Be Market’s Next True ‘Pivot,’ Says Glassnode",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-zone-markets-next-true-pivot-glassnode/",
      "summary": "The on-chain analytics firm Glassnode has highlighted the $97,000 to $98,000 zone as an important one for Bitcoin. Here&#8217;s why. Bitcoin CBD Suggests Build Up Of Supply In This Range In a new post on X, Glassnode has discussed about a potentially significant zone for Bitcoin based on the Cost Basis Distribution. The Cost Basis Distribution (CBD) is an indicator that measures the amount of the BTC supply that investors last purchased or transferred at the various price levels. As is visible in the above graph, there is a dense supply zone located between $97,000 to $98,000. Generally, investors are quite sensitive to retests of their cost basis, so a large amount of them (or alternatively, a few large holders) having their acquisition level inside a narrow range could make retests of it significant for Bitcoin. Related Reading: Bitcoin STHs Capitulate: 14,700 BTC Moved To Exchanges At Loss When the mood in the market is bullish, holders can react to retests of their cost basis from above by buying more. They may do so believing that the same level would end up proving profitable again in the future and the retrace is just a &#8216;dip.&#8217; The cryptocurrency suffered a plunge yesterday and nearly touched this region. Since then, however, things have turned around for the asset and it has gained some distance over it once more. In the event that the decline does continue, which may not be too unexpected given the volatile geopolitical situation at the moment, the zone could end up acting as the next true pivot for Bitcoin, according to the analytics firm. While the CBD tells us where the cryptocurrency&#8217;s supply is concentrated, it doesn&#8217;t contain any information about who bought or sold at those price levels. Glassnode&#8217;s behavioral cohorts, investor groups divided on the basis of their behavior, solve this problem. Here is a chart that shows the trend in the Bitcoin supply held by these holder cohorts over the past few years: There are five of these behavior groups. First Buyers (green) include the investors who are buying Bitcoin for the very first time. As displayed in the chart, the supply of this group has been on the rise, indicating fresh demand has been coming in. Momentum Buyers (blue) are those that capitalize on market momentum by buying during uptrends. On the opposite spectrum are the Conviction Buyers (purple), who buy despite falling prices. Finally, there are the Loss Sellers (red) and Profit Takers (yellow), who correspond to investors exiting at a loss and profit, respectively. During the past couple of weeks, the former cohort has seen an increase of 29%, a sign that weak hands have been capitulating. Related Reading: Consolidation Takes Its Toll: Bitcoin Investors No Longer Greedy That said, the analytics firm has noted, &#8220;Conviction Buyers also increased, suggesting sentiment isn’t collapsing. Some are cutting losses &#8211; others are actively lowering their cost basis.&#8221; BTC Price At the time of writing, Bitcoin is floating around $103,900, down more than 4% in the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "BNB Price Gathers Strength — Upside Potential Looms",
      "link": "https://www.newsbtc.com/analysis/bnb/bnb-price-gathers-strength-625/",
      "summary": "BNB price is gaining pace above the $632 support zone. The price is now showing positive signs and might aim for more gains in the near term. BNB price is attempting to recover from the $600 support zone. The price is now trading below $632 and the 100-hourly simple moving average. There was a break above a bearish trend line with resistance at $625 on the hourly chart of the BNB/USD pair (data source from Binance). The pair must stay above the $632 level to start another increase in the near term. BNB Price Eyes More Gains After forming a base above the $600 level, BNB price started a fresh increase. There was a move above the $620 and $625 resistance levels, like Ethereum and Bitcoin. There was a decent move above the 50% Fib retracement level of the recent decline from the $651 swing high to the $602 low. Besides, there was a break above a bearish trend line with resistance at $625 on the hourly chart of the BNB/USD pair. The price is now trading below $632 and the 100-hourly simple moving average. It is also consolidating near the 76.4% Fib retracement level of the recent decline from the $651 swing high to the $602 low. On the upside, the price could face resistance near the $644 level. The next resistance sits near the $650 level. A clear move above the $650 zone could send the price higher. In the stated case, BNB price could test $665. A close above the $665 resistance might set the pace for a larger move toward the $680 resistance. Any more gains might call for a test of the $700 level in the near term. Another Decline? If BNB fails to clear the $644 resistance, it could start another decline. Initial support on the downside is near the $635 level. The next major support is near the $632 level. The main support sits at $625. If there is a downside break below the $625 support, the price could drop toward the $612 support. Any more losses could initiate a larger decline toward the $600 level. Technical Indicators Hourly MACD – The MACD for BNB/USD is gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BNB/USD is currently above the 50 level. Major Support Levels – $632 and $625. Major Resistance Levels – $644 and $650."
    },
    {
      "title": "Cardano Headed For $0.32 If This Level Isn’t Reclaimed – Is ADA’s Rally Over?",
      "link": "https://www.newsbtc.com/news/cardano-headed-for-0-32-if-this-level-isnt-reclaimed-is-adas-rally-over/",
      "summary": "Cardano (ADA) has been struggling to hold some crucial levels over the month, falling to multi-month lows over the weekend. As the cryptocurrency attempts to hold a key support area, some analysts believe this make-or-break retest will determine its next big move. Related Reading: Bitcoin Wobbles? Metaplanet Buys Big, Breaks $1 Billion Mark Cardano To See More Bleeding Cardano is recording a 4.5% daily increase after bouncing from the $0.51 area on Sunday. Notably, ADA was in a downtrend following its 3-year high of $1.32 in December 2024, which ended after the late April breakout and May bullish rally. However, the cryptocurrency has struggled to hold its April-May range amid the June market pullback, losing the key $0.66 area ten days ago. Since then, Cardano has recorded seven consecutive red daily candles and fallen below the $0.60 support. Sjuul from AltCryptoGems suggested that Cardano’s rally will be halted unless some ground is recovered. According to the analyst, the cryptocurrency’s multi-month price action “ended up being a classic distribution schematic” after losing the $0.66 support. This would signal that ADA’s uptrend has ended and a potential downtrend is ahead. “As long as we don&#8217;t reclaim $0.66, just expect further downtrend from now on,” he asserted. Meanwhile, market watcher Man of Bitcoin highlighted the cryptocurrency’s June downtrend, affirming that if the price remains below the descending trendline, downward pressure will persist. He added that “One more low in wave iv is still possible,” hinting that a drop below the $0.50 could be on the horizon before the next wave up. Nonetheless, the analyst noted that “it should be a brief wick to the downside” as a “sustained break lower would weaken the bullish outlook.” ADA Retest To Trigger Rally To $1? Amid the ongoing global war tensions, ADA’s price retested the crucial $0.52 support on Sunday, hitting a four-month low of $0.51, before recovering and closing the week around the $0.54 mark. Market watcher Rose Premium Signals noted that a weekly close around the crucial $0.56 level would continue the possible double-bottom setup forming on ADA’s chart. The analyst added that a confirmed rebound from the $0.54-$0-56 area could send the price to the initial $0.99 target and set the stage for a climb toward the $1.20 and $1.50 resistances. On the contrary, failing to hold this area could see Cardano lose its six-month price range and retrace to the $0.32 level. Meanwhile, Crypto Billion affirmed that Cardano appears to be forming a potential triple bottom structure, which could lead to a bullish reversal. Related Reading: Ethereum Holds Critical Support – $2,350 Level Could Define The Next Move As the cryptocurrency retested the $0.50-$0.52 area over the weekend, the analyst highlighted that this key range had been held twice before since the November breakout. Additionally, he pointed out that ADA’s price appears to be trading within a multi-month falling wedge pattern, which suggests a breakout toward the $1 mark if the price climbs toward the upper boundary. As of this writing, Cardano is trading at $0.54, a 15.6% decline in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "XRP Price Reclaims Key Resistance — Are More Gains on the Horizon?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-reclaims-2-10/",
      "summary": "XRP price started a fresh increase from the $1.920 zone. The price is back above $2.10 and might struggle to continue higher above the $2.20 zone. XRP price started a fresh increase above the $2.050 zone. The price is now trading above $2.10 and the 100-hourly Simple Moving Average. There was a break above a key bearish trend line with resistance at $2.00 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start a fresh increase if there is a close above the $2.180 resistance zone. XRP Price Eyes More Gains XRP price remained supported above the $1.920 zone and started a fresh increase, like Bitcoin and Ethereum. The price recovered above the $2.00 and $2.020 resistance levels. Besides, there was a break above a key bearish trend line with resistance at $2.00 on the hourly chart of the XRP/USD pair. The pair even cleared the $2.10 resistance and $2.150 hurdle. However, the bears were active below $2.20. A high was formed at $2.170 and the price is now consolidating above the 23.6% Fib retracement level of the upward move from the $1.910 swing low to the $2.170 high. The price is now trading above $2.10 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.1650 level. The first major resistance is near the $2.180 level. The next resistance is $2.20. A clear move above the $2.20 resistance might send the price toward the $2.250 resistance. Any more gains might send the price toward the $2.300 resistance or even $2.320 in the near term. The next major hurdle for the bulls might be $2.50. Another Drop? If XRP fails to clear the $2.180 resistance zone, it could start another decline. Initial support on the downside is near the $2.0880 level. The next major support is near the $2.050 level or the 50% Fib retracement level of the upward move from the $1.910 swing low to the $2.170 high. If there is a downside break and a close below the $2.050 level, the price might continue to decline toward the $2.00 support. The next major support sits near the $1.920 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.050 and $2.00. Major Resistance Levels – $2.180 and $2.20."
    },
    {
      "title": "Bitcoin’s Drop Below $100k Sparks Bearish Chatter, But Data Says Something Else",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoins-drop-below-100k-sparks-bearish-chatter-but-data-says-something-else/",
      "summary": "Bitcoin has rebounded slightly after dropping below the $100,000 mark, a decline attributed to escalating geopolitical tensions. The digital asset reached lows of approximately $98,974 following reports of US military strikes on Iran. At the time of writing, Bitcoin has regained some ground and is trading at $102,1010, representing a 2.4% increase over the past 24 hours and a 5.82% decrease over the last week. Amid this price performance, recent on-chain analysis points to a phase of consolidation rather than a structural breakdown. CryptoQuant analyst Darkfost shared in a QuickTake post that long-term Bitcoin holders appear to be maintaining their positions rather than exiting, indicating continued conviction despite short-term volatility. Related Reading: Bitcoin Crashed Below $100,000 Amid US Airstrikes On Iran And Market Sell-Off Bitcoin On-Chain Indicators Signal Consolidation, Not Capitulation According to Darkfost, the current market behavior is reflective of a quiet consolidation period, with long-term holders showing little inclination to sell. Based on the 30-day moving average of Binary Coin Days Destroyed (CDD), his analysis shows that the metric has stayed below the 0.8 threshold typically associated with major corrections. The value recently peaked at 0.6 before trending downward, suggesting limited market overheating at present levels. Darkfost emphasized that this moderation could precede a continuation of the broader bull cycle, mirroring past market structures where consolidation phases led to further price advances. He noted that past bull runs have often been characterized by a “staircase” trajectory, periods of sideways or modest downward movement followed by renewed upward momentum. In this context, subdued sentiment may indicate that the market is preparing for a potential next leg higher. The analyst wrote: Importantly, this does not signal the end of the bull cycle. Instead, similar to the past two phases, we may once again see a staircase-like movement where consolidation is followed by another leg up. Historically, Bitcoin’s explosive rallies tend to occur when market attention fades and sentiment is quiet, making the current silence potentially a precursor to the next big move. Whale Behavior Remains Steady Amid Market Tensions Complementing this outlook, another CryptoQuant contributor, Mignolet, provided insight into whale activity during the current consolidation phase. He noted that while the market setup resembles the double-top formation seen in 2021, key on-chain signals from whales have not aligned with those seen during that previous peak. Specifically, Ethereum transaction outflows, often used as a proxy for large investor exits, have not shown the kind of spikes observed during the 2021 market top. Related Reading: Bears Will Be Washed Out Of Bitcoin If This Happens Mignolet pointed out that although Ethereum has seen a gradual decline in market share relative to other layer-1 and layer-2 chains since 2020, its transactional data still maintains a strong correlation with Bitcoin price movements. The absence of aggressive exit activity among large holders suggests that major market participants are not rushing for the exits, despite heightened geopolitical uncertainty and short-term price volatility. Featured image created with DALL-E, Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Sequans Launches $384M Bitcoin Treasury Initiative with Swan Bitcoin Partnership",
      "link": "https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Sequans-Launches-384M-Bitcoin-Treasury-Initiative-with-Swan-Bitcoin-Partnership.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a France-based developer of 5G and IoT semiconductor technology, has announced a move into Bitcoin with a new treasury initiative backed by a $384 million private placement.&#160;&#160; The funding includes $195 million in equity securities and $189 million in convertible secured notes. Sequans plans to allocate this capital toward building a Bitcoin position [&#8230;]</p> <p>"
    },
    {
      "title": "The Blockchain Group Acquires 75 BTC After €7.2M Raise",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/10.4B-Bitcoin-Firm-Unchained-Announces-First-Regulated-Bitcoin-Native-Trust-Company-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise\" rel=\"nofollow\"> </a></p> <p>Total holdings reach 1,728 BTC as YTD yield climbs to 1,231.7%, reinforcing its Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Fintech Company DigiAsia Corp to Launch Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Southeast-Asian-fintech-company-aims-to-raise-100-million-for-long-term-Bitcoin-holdings-as-part-of-their-corporate-treasury-initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DigiAsia Corp, a leading Southeast Asian Fintech-as-a-Service platform, has signed an indicative term sheet for up to $3 million in non-recourse debt financing to kickstart its Bitcoin treasury acquisition strategy. The funding comes from High West Capital Partners and is expected to close within 45 days.&#160; The $3 million facility represents the first phase of [&#8230;]</p> <p>"
    },
    {
      "title": "ECD Automotive Design Secures $500M Facility to Acquire Bitcoin",
      "link": "https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ECD-Automotive-Design-Secures-500M-Facility-to-Acquire-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin\" rel=\"nofollow\"> </a></p> <p>Luxury auto builder will grow its Bitcoin treasury, expand operations, and offer $21,000 in upgrades to early customers who pay with Bitcoin and other crypto.</p> <p>"
    },
    {
      "title": "Anthony Pompliano Announces $1 Billion Merger in Record Bitcoin Treasury Company Fundraise",
      "link": "https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ProCap-Financial-has-raised-over-750-million-in-the-largest-initial-funding-round-for-a-public-Bitcoin-treasury-company.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise\" rel=\"nofollow\"> </a></p> <p>Anthony Pompliano announced a $1 billion merger creating ProCap Financial through a Special Purpose Acquisition Company (SPAC) transaction with Columbus Circle Capital Corp. (CCCM). The deal represents the largest initial fundraise in history for a public Bitcoin treasury company, raising $516.5 million in equity and $235 million in convertible notes.&#160;&#160; ProCap Financial will operate with [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Crypto Scam Markets Thrive Again After Telegram’s Cleanup Attempt: Report",
      "link": "https://decrypt.co/326653/crypto-scam-markets-thrive-telegram",
      "summary": "Platforms such as Shuangying and Fully Light have surged after the Huione ban, with transactions increasing three to fourfold."
    },
    {
      "title": "Israeli Man Accused of Spying for Iran in Exchange for Crypto",
      "link": "https://decrypt.co/326647/israeli-man-spying-iran-for-crypto",
      "summary": "A Tel Aviv resident allegedly photographed sensitive sites and received thousands in crypto, authorities say."
    },
    {
      "title": "Tech That Could Prove Whether Iran’s Uranium Was Destroyed",
      "link": "https://decrypt.co/326588/tech-irans-uranium-destroyed",
      "summary": "Satellite images reveal damage, but experts suggest that new technology may be able to verify what actually happened underground."
    },
    {
      "title": "How AI Is Has Turned Propaganda Into a Potent Weapon",
      "link": "https://decrypt.co/326589/ai-propaganda-potent-weapon",
      "summary": "AI-generated videos and fake personas are flooding social media from Tel Aviv to Tehran, turning it into a digital battlefield of deception."
    },
    {
      "title": "Senator Introduces Bill to Halt Trump’s Crypto Activity—But Voted to Allow It Last Week",
      "link": "https://decrypt.co/326576/senator-introduces-bill-halt-trump-crypto-activity-voted-allow",
      "summary": "Adam Schiff (D-CA) is the latest Democrat to propose a bill banning President Trump from engaging in crypto activity. Like the others, it's unlikely to pass anytime soon."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin drops below $100K, then rebounds after Iran reportedly fires missiles toward US military targets in Qatar and Iraq",
      "link": "https://cryptobriefing.com/bitcoin-price-drop-mideast-tensions/",
      "summary": "<p>Geopolitical tensions can significantly impact cryptocurrency markets, highlighting their volatility and sensitivity to global events.</p> <p>"
    },
    {
      "title": "Crypto fund veterans to raise $100M to build BNB strategic reserve",
      "link": "https://cryptobriefing.com/bnb-treasury-strategy-listed-company/",
      "summary": "<p>The initiative could diversify crypto investment strategies, potentially increasing BNB's market influence and public company crypto adoption.</p> <p>"
    },
    {
      "title": "Fintech giant Fiserv to launch FIUSD stablecoin and digital asset platform with Circle, Paxos, and Solana",
      "link": "https://cryptobriefing.com/fiusd-stablecoin-platform-launch/",
      "summary": "<p>Fiserv's FIUSD launch could revolutionize digital payments, enhancing real-time transactions and expanding blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Michael Saylor’s Strategy makes smallest Bitcoin purchase since mid-March",
      "link": "https://cryptobriefing.com/strategy-bitcoin-acquisition-record/",
      "summary": "<p>Saylor's ongoing Bitcoin acquisitions highlight a strategic commitment to digital assets, potentially influencing market dynamics and investor sentiment.</p> <p>"
    },
    {
      "title": "Hackers exploit Trezor’s website to send phishing emails",
      "link": "https://cryptobriefing.com/trezor-security-alert-phishing-warning/",
      "summary": "<p>This incident highlights the growing sophistication of phishing attacks, underscoring the need for enhanced cybersecurity measures in crypto platforms.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Tether’s $2 billion liquidity bet – Is Bitcoin ready to rip right now?",
      "link": "https://ambcrypto.com/tethers-2-billion-liquidity-bet-is-bitcoin-ready-to-rip-right-now/",
      "summary": "<img alt=\"Tether’s $2 billion liquidity bet - Is Bitcoin ready to rip right now?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika6.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The $2B mint looks defensive, yet it also signals a bullish rotation loading."
    },
    {
      "title": "Dogecoin price prediction – Why the $0.21-level may be key for a reversal",
      "link": "https://ambcrypto.com/dogecoin-price-prediction-why-the-0-21-level-may-be-key-for-a-reversal/",
      "summary": "<img alt=\"Dogecoin price prediction - Why the $0.21-level may be key for a reversal\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Dogecoin-Featured-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The $0.21-level is a critical resistance for long-term DOGE bulls."
    },
    {
      "title": "How low will the Crypto Fear & Greed Index go before Bitcoin recovers?",
      "link": "https://ambcrypto.com/how-low-will-the-crypto-fear-greed-index-go-before-bitcoin-recovers/",
      "summary": "<img alt=\"How low will the Crypto Fear &amp; Greed Index go before Bitcoin recovers?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Fear-and-Greed-Index-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Sentiment is neutral now, and extreme fear levels might be necessary for a Bitcoin reset."
    },
    {
      "title": "Cardone Capital buys $101M in Bitcoin, with plans to add 3000 BTC more!",
      "link": "https://ambcrypto.com/cardone-capital-buys-101m-in-bitcoin-with-plans-to-add-3000-btc-more/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-3-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />From luxury apartments to digital assets, the firm’s strategy marks a shift in long-term value bets."
    },
    {
      "title": "Story [IP] price prediction – Traders, look out for this key divergence!",
      "link": "https://ambcrypto.com/story-ip-price-prediction-traders-look-out-for-this-key-divergence/",
      "summary": "<img alt=\"Story [IP] price prediction - Traders, look out for this key divergence!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Story-IP-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />IP saw some demand over the past few days that resulted in a price bounce."
    }
  ]
}