{
  "CoinDesk": [
    {
      "title": "Circle Hits New Record With Market Cap Nearing That of Coinbase",
      "link": "https://www.coindesk.com/markets/2025/06/23/circle-hits-new-record-with-market-cap-nearing-that-of-coinbase",
      "summary": ""
    },
    {
      "title": "Stablecoins Are a Monetary Revolution in the Making",
      "link": "https://www.coindesk.com/opinion/2025/06/23/stablecoins-are-a-monetary-revolution-in-the-making",
      "summary": ""
    },
    {
      "title": "Cipher Mining Begins Bitcoin Production at 300 MW Black Pearl Data Center",
      "link": "https://www.coindesk.com/markets/2025/06/23/cipher-mining-begins-bitcoin-production-at-300-mw-black-pearl-data-center",
      "summary": ""
    },
    {
      "title": "As Trump Calls for Rapid Stablecoin Bill Passage, Key Lawmaker Hints at More Talks",
      "link": "https://www.coindesk.com/policy/2025/06/23/as-trump-calls-for-rapid-stablecoin-bill-passage-key-lawmaker-hints-at-more-talks",
      "summary": ""
    },
    {
      "title": "Aptos' APT Gains 6% With High-Volume Buying Amidst Wider Crypto Market Bounce",
      "link": "https://www.coindesk.com/markets/2025/06/23/aptos-apt-gains-6-with-high-volume-buying-amidst-wider-crypto-market-bounce",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Anchorage adds DeFi capability for institutions with Uniswap wallet integration",
      "link": "https://cointelegraph.com/news/anchorage-adds-defi-capability-institutions-uniswap-wallet-integration?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzllODktZjllZC03YzQ5LWE5M2EtYmQxZDQ4ZGY2OGI2.jpg\" /></p><p>Anchorage Digital is expanding its Porto wallet with Uniswap integration, giving institutions direct access to DeFi swaps and liquidity.</p>"
    },
    {
      "title": "Trump Media says $400M stock buyback won’t affect BTC treasury plans",
      "link": "https://cointelegraph.com/news/trump-media-share-buyback-bitcoin-treasury?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzQ2NjYtY2NhZi03Yzk5LTk3NGYtYjdlMTczYzEwZWI4.jpg\" /></p><p>Trump Media’s recently announced $400-million buyback plan will not alter its strategy of using $2.3 billion to invest in Bitcoin, according to the company.</p>"
    },
    {
      "title": "Circle stock becomes largest component of VanEck’s digital asset index",
      "link": "https://cointelegraph.com/news/circle-stock-becomes-largest-vaneck-digital-asset-index?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjZjNGYtODdhMi03NjhjLWExYzMtMjZhMjk0ZDBiNTI5.jpg\" /></p><p>Shares of the stablecoin issuer account for roughly 13% of the MVDAPP, said VanEck’s Mathew Sigel.</p>"
    },
    {
      "title": "Democratic senator introduces bill to address Trump’s crypto ties",
      "link": "https://cointelegraph.com/news/adam-schiff-bill-donald-trump-crypto-corruption?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWIwMWUtNDI3Mi03ZjEzLWJjNzQtMGE2ZDA4ZWMzNjlm.jpg\" /></p><p>The proposed bill from Senator Adam Schiff followed similar legislation in the House of Representatives from Maxine Waters in response to the president's memecoin dinner.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "FTX fights back against 3AC’s ‘unreasonable and unsupportable’ $1.53B claim",
      "link": "https://cryptoslate.com/ftx-fights-back-against-3acs-unreasonable-and-unsupportable-1-53b-claim/",
      "summary": "<p>FTX’s bankruptcy lawyers have pushed back forcefully against a $1.53 billion claim filed by failed crypto hedge fund Three Arrows Capital (3AC), calling the demand “illogical” and warning that it would unfairly drain funds from FTX’s legitimate creditors. In new court documents submitted on June 20, FTX’s legal team asked a Delaware bankruptcy judge to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin whipsaws back to $104k after losing six-figures as Iran’s failed attack signals end of tensions",
      "link": "https://cryptoslate.com/bitcoin-whipsaws-back-to-104k-after-losing-six-figures-as-irans-failed-attack-signals-end-of-tensions/",
      "summary": "<p>Bitcoin (BTC) whipsawed below $100,000 at about 4 p.m. UTC on June 23 and reclaimed nearly $104,000 three hours later as traders processed news of an Iranian missile strike on a US air base in Qatar that caused no casualties. As of press time, Bitcoin was trading at $103,801.74, up 4.5% over the past 24 [&#8230;]</p> <p>"
    },
    {
      "title": "Survey: 82% of US wealthy investors favor advisers who can deliver informed crypto strategies",
      "link": "https://cryptoslate.com/survey-82-of-us-wealthy-investors-favor-advisers-who-can-deliver-informed-crypto-strategies/",
      "summary": "<p>Wealthy US investors say they are more likely to hire financial advisers who provide crypto guidance, according to a June 2025 CoinShares survey of 500 individuals with at least $500,000 in investable assets. A vast majority (88%) of investors already work with an adviser, and 58% rank advisers as their most trusted source for digital [&#8230;]</p> <p>"
    },
    {
      "title": "Fed joins regulators dropping reputational risk factor, clearing banks to serve crypto firms",
      "link": "https://cryptoslate.com/fed-joins-regulators-dropping-reputational-risk-factor-clearing-banks-to-serve-crypto-firms/",
      "summary": "<p>The Federal Reserve Board on June 23 removed reputational risk from its bank supervision program, ordering staff to strike the term from examination manuals and to concentrate on measurable financial exposures. The Fed move positions the central bank alongside the Federal Deposit Insurance Corporation (FDIC) and the Office of the Comptroller of the Currency, which [&#8230;]</p> <p>"
    },
    {
      "title": "TMTG reaffirms Bitcoin commitment amid $400M share buyback plan",
      "link": "https://cryptoslate.com/tmtg-reaffirms-bitcoin-commitment-amid-400m-share-buyback-plan/",
      "summary": "<p>Trump Media and Technology Group announced plans to repurchase up to $400 million worth of its own shares while leaving intact the $2.3 billion it has earmarked for building a substantial Bitcoin (BTC) reserve. The board of directors authorized the buyback plan as a show of confidence in the company’s stock and future growth strategy, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Dogecoin Crash Far From Over? Analyst Reveals The Target",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-crash-far-from-over-analyst/",
      "summary": "The price of Dogecoin continues to bleed, and crypto analyst Kevin (@Kev_Capital_TA) warns that the worst may still lie ahead. Citing an earlier bearish pattern, Kevin emphasized over the weekend that Dogecoin’s Head and Shoulders formation—identified nearly two weeks ago—is rapidly approaching its technical “measured move” target. But he also made it clear that the full downside potential has not yet played out. Dogecoin Collapse Far From Over? “I didn’t say we are there now,” Kevin clarified in a follow-up post, “the orange circle represents a zone of where the measured move could go, with a precise measured move target of the .786 fib at .119.” This $0.119 level aligns with a broader confluence of technical supports that are quickly becoming critical for DOGE’s structure. “The Head n Shoulders I pointed out on Dogecoin almost a couple of weeks ago is almost at its measured move target range. Certain daily indicators are also starting to enter inciting levels. Watching closely along with BTC and USDT Dominance for further confirmations,” he wrote. Kevin also highlighted the importance of the weekly 200 Simple Moving Average (SMA) and Exponential Moving Average (EMA), along with the macro .382 Fibonacci retracement and a long-term descending trendline. Related Reading: Crypto Analyst Predicts $4 Dogecoin After Exhausted Selling Phase Together, these levels form what he described as the “must-hold” zone, specifically between $0.1434 and $0.1265. A sustained breakdown below that region would likely confirm a macro bearish shift for the meme asset. What To Monitor Now Zooming out, Kevin sees Dogecoin’s fate as inseparably tied to Bitcoin and the wider altcoin market, which he describes as being in its weakest state in years. “So far 2025 has been more bearish for altcoins than 2024 and 2023,” he noted. “Worst year for Alts since the bear market in 2022.” The overwhelming strength of Bitcoin’s dominance has been a key factor in that trend. That dominance, Kevin argues, is not a temporary spike. “Fresh highs for BTC Dominance on the back of restrictive monetary policy and an uncertain geopolitical environment,” he wrote, referring to global macro conditions including persistent quantitative tightening (QT). He has long warned that without a pivot in central bank policy, any talk of a true “altseason” is premature. Related Reading: Dogecoin Looks Like ‘It Wants To Play Dead’—Again “Been saying since late 2023, early 2024—when AI coins were running crazy and people were saying it was #Altseason—that until QT ends and the terminal rate comes down, you will not see real sustainable altcoin outperformance. That continues to hold true.” His caution extends well beyond Dogecoin. In previous posts, Kevin identified key danger zones for Bitcoin and Ethereum, which he argues must be reclaimed to prevent broader market deterioration. “As long as BTC cannot break the $106.8K level and show real follow-through on 3D-1W time frames, then the market is in real danger,” he wrote. “Same for ETH not being able to break the $2700-2800 level.” For Dogecoin traders, the message is clear. The meme coin’s fate rests not just on its own technical health, but on a wider macro and intermarket structure that remains fragile. As long as Bitcoin struggles to hold above key breakout levels and US monetary conditions remain tight, the probability of a deeper Dogecoin correction remains high. Whether DOGE can stabilize above the $0.1265 level will be closely watched by traders in the days and weeks ahead. A loss of that zone, especially in conjunction with renewed Bitcoin weakness, could mark the beginning of a deeper and more painful phase for the once-beloved meme coin. At press time, DOGE traded at $0.152. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Battles Key Support: Daily EMA-100 Must Hold to Prevent Deep Correction",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-battles-key-support-daily-ema-100-must-hold-to-prevent-deep-correction/",
      "summary": "Bitcoin briefly fell below the critical $100,000 level over the weekend, reaching a low of approximately $98,200 and triggering a wave of panic selling across crypto markets. The sharp drop came after news broke of US military strikes on Iranian nuclear facilities, a move that significantly escalated the already volatile conflict between Israel and Iran. The geopolitical shock sent global markets into risk-off mode, with Bitcoin reacting quickly to the growing uncertainty. Related Reading: Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106 Despite the weekend dip, BTC has since reclaimed the $100K mark, but sentiment remains fragile. Investors are now watching key technical levels closely to determine the next move. According to top analyst Ted Pillows, Bitcoin must hold the daily EMA-100 to avoid further downside pressure. A decisive close below this level could open the door for a deeper correction, especially if macroeconomic and geopolitical risks persist. As volatility spikes and fear grows, Bitcoin’s ability to maintain support at these levels may define whether the bull cycle continues or enters a prolonged consolidation phase. All eyes are now on the $100K zone, which has become a critical battleground for bulls and bears in a market driven by both technicals and global tension. Bulls Defend $100K As Dominance Rises and Market Faces Crucial Test Bitcoin is once again at a pivotal moment. After dipping below the psychological $100,000 level over the weekend amid growing geopolitical tensions, BTC quickly reclaimed this critical threshold, offering a glimmer of hope to market participants. Although bulls managed to push the price back up, the overall structure remains fragile, and technical indicators now carry more weight than ever. Ted Pillows noted in a recent update that Bitcoin must hold its daily EMA-100 to preserve bullish momentum. A daily close below $99,000 would confirm a break below this key support zone, likely triggering a retest of the $92,000–$94,000 region. Such a move could create significant downside pressure, particularly on altcoins, which are already lagging behind in performance. In Pillows&#8217; words, “If Bitcoin loses this level, alts will be annihilated.” Despite the looming risks, fundamentals remain solid. Bitcoin dominance continues to hover near its highest levels of the year, reflecting growing investor preference for BTC over high-beta assets during uncertain times. On-chain metrics still indicate strong holder conviction, and macro narratives continue to favor Bitcoin as a hedge amid fiat instability and rising geopolitical uncertainty. If Bitcoin can hold the $100K level and reclaim momentum, it could lead to renewed strength and eventually a push toward the $109K resistance zone. For now, however, bulls are on the defensive. Price action over the next few days will likely define the trajectory for the remainder of Q3, with a close watch on EMA support, macro headlines, and risk sentiment across global markets. Related Reading: Ethereum Weekly Chart Nears Tower Top Formation As US Launches Attack On Iran – Details Bitcoin Struggles Below Resistance Amid Bearish Price Structure The 12-hour chart for Bitcoin reveals a bearish structure following the breakdown below the $103,600 support zone. After forming a symmetrical triangle throughout mid-June, BTC failed to break upward and instead reversed direction, confirming a downward breakout. This move triggered a sharp decline to $98,200 over the weekend, followed by a modest recovery to the current $101,250 level. The price is now trading below both the 50 and 100-period simple moving averages, which are beginning to curl downward, signaling a shift in momentum away from bulls. The 200-period SMA, currently near $95,600, stands as the next major support if downside pressure continues. Volume has picked up notably on the red candles, adding weight to the bearish case and confirming active selling during the recent drop. Related Reading: Ethereum Charts Signal Potential Bottom – All Eyes On Next Move Bitcoin must reclaim the $103,600 zone and hold above it to invalidate the bearish pattern and regain control. Failure to do so could result in further downside toward $95,000 and possibly even $92,000. As long as BTC remains below the broken triangle support and the $103K resistance, the path of least resistance remains downward. Bulls face an uphill battle, and confidence may erode quickly if the $100K psychological level is breached again. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Bitcoin Dominance Hits New Cycle High Above 66% – How This 4-Year ATH Affects Altcoin SeasonBitcoin Dominance Hits New Cycle High Above 66% – How This 4-Year ATH Affects Altcoin Season",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-dominance-new-high/",
      "summary": "The Bitcoin dominance has hit a new cycle high, providing a bearish outlook for altcoins and any potential altcoin season. Crypto analyst Finsends has commented on this development and how it could affect the altcoin season moving forward. What’s Next As Bitcoin Dominance Hits New High? In an X post, Finsends stated that the Bitcoin dominance has made a new high and that it feels like it can never go down again. However, he opined that there should be a bigger correction starting somewhere around the current levels. The analyst added that the potential target area for a top in this scenario goes up to 68.56%. Related Reading: Rising Bitcoin Dominance Above 64% Dashes Hopes Of Altcoin Season, Here’s Why His accompanying chart showed that the Bitcoin dominance could hit this projected top of 68.56% in July, after which a decline would begin. Based on the chart, the BTC.D could drop to as low as 48% on this decline, paving the way for a potential altcoin season. If so, then altcoins could witness significant gains in the second half of the year and outperform BTC in the process. In an X post, crypto analyst Michaël van de Poppe also commented on the rising Bitcoin dominance and a potential altcoin season. He noted that the altcoin season indicator has hit its lowest number in two years. The analyst added that the lows of this indicator over the last six years were in June or July. Based on this, he remarked that there seems to be a pattern since the indicator has hit a low again this June. Michaël van de Poppe didn’t predict when exactly altcoin season could begin or if the Bitcoin dominance would top anytime soon. However, before now, he had expressed confidence that the alt season would still happen. The analyst noted that the last cycle was also called a Bitcoin cycle until altcoins started to run and heavily outperformed. What Needs To Happen For Altcoins To Take Off In another X post, Michaël van de Poppe stated that altcoins are in need of an upward push from Ethereum, and that this needs to happen through a push of Bitcoin. He further remarked that once the BTC price bottoms out, that is a very likely moment for Ethereum to continue outperforming the flagship crypto, with the Bitcoin dominance declining. Related Reading: Analyst Calls Start Of Altcoin Season Amid Deviation Of Cyclical Lows – Details The analyst believes that altcoins would start “shining” when the next leg upwards for Ethereum takes place, possibly ushering in altcoin season. He declared that once altcoins start to shine, market participants can expect them to heavily outperform the markets. However, for now, Michaël van de Poppe believes investors need to have some more patience. At the time of writing, the Bitcoin price is trading at around $101,700, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Wobbles? Metaplanet Buys Big, Breaks $1 Billion Mark",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-wobbles-metaplanet-buys-big-breaks-1-billion-mark/",
      "summary": "Metaplanet has again beefed up its Bitcoin holdings. According to the Tokyo-listed investment firm, it bought 1,111 BTC on Monday for about $118.2 million. The average price paid was roughly $106,408 per coin. Bitcoin has fallen more than 5% over the last week, trading just above $101,000. Related Reading: Dogecoin Breaks Free—Could Soar 60%, Analyst Says Performance Metrics Climb Higher Metaplanet’s own numbers show a quarter-to-date BTC yield of 108%, up from 96% in Q1 and a hefty 310% in Q4 2024. That metric tracks Bitcoin per fully diluted share, so it puts the firm’s strategy under a clear spotlight. Based on reports, the company gained 4,367 BTC valued at $451 million in this period, using prices from Bitflyer. *Metaplanet Acquires Additional 1,111 $BTC, Total Holdings Reach 11,111 BTC* pic.twitter.com/7ceEeSh1X4 — Metaplanet Inc. (@Metaplanet_JP) June 23, 2025 Balance Sheet Swells to 11,111 BTC With the new purchase, Metaplanet’s total stash now stands at 11,111 BTC, worth just over $1.07 billion. Its cost basis for those coins sits at about $95,869 each. Metaplanet’s shares dipped 3.5% on the day of the announcement, a sign that investors may be worried about how the firm is funding its buy-ups. Source: Metaplanet Funding Through Bonds And Shares Based on reports, the company has raised cash via zero-coupon bonds and equity rights since January. It issued over 210 million shares under a program it calls the “210 Million Plan.” Evo Fund has snapped up many of those bonds and rights. Between May and June 2025, Metaplanet pulled in over $300 million, earmarking every dollar for more Bitcoin. Ambitious Target Of 210,000 BTC Metaplanet has set a goal to hold 210,000 BTC by the end of 2027. That is 10 times its current pile. To reach that number, it will need to keep tapping the capital markets—and it plans to. The firm even created a dedicated Bitcoin Treasury Operations arm in December 2024, moving away from its hotel management roots. Related Reading: Stablecoin Wars Ignite: Peter Schiff Champions Gold-Backed Digital Assets Dilution And Risk For Shareholders Metaplanet’s fully diluted share count rose to close to 760 million as of June 23. That puts its Bitcoin per 1,000 shares at 0.0146 BTC. More bonds and shares mean more dilution for existing investors. If Bitcoin’s price slips, the cost of raising money could climb, eating into any gains from the crypto itself. Metaplanet’s approach mirrors what some other big holders have done. It’s a bold stance. If Bitcoin holds up or heads higher, the firm could see big returns. But it will need to balance fresh capital raises against the risk of pushing down its own stock. For now, Metaplanet shows no sign of slowing down its Bitcoin buying. The only real question is how far this strategy can run before the bills come due. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Ethereum Holds Critical Support – $2,350 Level Could Define The Next Move",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-holds-critical-support-2350-level-could-define-the-next-move/",
      "summary": "Ethereum has dropped 17% since Friday, breaking down from the long-standing range that held firm since early May. The sharp sell-off came after news broke of US airstrikes targeting Iranian nuclear facilities, sending shockwaves across global markets and sparking panic selling in risk assets. ETH was no exception, plunging below multiple support zones before finding a temporary floor at $2,100. Related Reading: Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106 This level served as a critical demand area, and Ethereum has since managed to bounce, offering bulls a glimmer of hope in an otherwise uncertain market. However, the breakdown of the previous trading range indicates that momentum has clearly shifted in favor of the bears. According to top analyst Ted Pillows, Ethereum must reclaim the top of the former range to signal that the downside move was a deviation rather than a full breakdown. As investors digest the growing geopolitical risk and continue to react to macroeconomic pressures such as persistent inflation and hawkish Federal Reserve policy, Ethereum’s path forward remains uncertain. Still, the bounce from $2,100 provides a chance for bulls to reestablish control—if they can push the price back above key resistance levels in the sessions ahead. Ethereum Holds Support But Bears Still in Control Recent price action has taken a heavy toll on altcoins, with Ethereum leading the downturn as most assets fall to lower demand levels. Since reaching its early June high, Ethereum has shed over 26% of its value, now trading under intense bearish pressure. Despite the decline, bulls have managed to defend the critical $2,100 support level, providing a temporary floor in an otherwise fragile environment. Geopolitical instability—particularly the escalating conflict between the US, Israel, and Iran—continues to add volatility and risk aversion to the market. Investors remain cautious, with the broader macroeconomic backdrop dominated by high US Treasury yields, stubborn inflation, and a hawkish Federal Reserve. These factors have put additional weight on the crypto sector, especially on Ethereum, which is widely seen as the main catalyst for a potential altseason that has yet to materialize. Ted Pillows notes that Ethereum recently tested the $2,100 support and successfully bounced. However, he emphasizes that the price must reclaim the top of its previous range to regain bullish momentum. If ETH fails to break and hold above the $2,350 range low, it risks a deeper move toward the start of the previous impulse leg—or worse. The coming days will be critical for Ethereum. Reclaiming lost levels would indicate strength and possibly kick off the long-awaited altcoin rotation. But continued rejection could signal more downside ahead, with sentiment already fragile and demand still lacking. Until clarity returns, Ethereum remains in a decisive phase where every candle matters. Related Reading: Ethereum Weekly Chart Nears Tower Top Formation As US Launches Attack On Iran – Details ETH Price Analysis: Breakdown Below Key Structure Ethereum (ETH) has sharply declined, with the price now sitting around $2,248. This move marks a confirmed breakdown from the key range between $2,320 and $2,850, which had been holding since early May. The rejection from the upper resistance zone near $2,850, combined with high-volume selling, indicates clear bearish momentum. The current candle structure on the 3-day timeframe shows strong downward pressure, especially as ETH failed to hold above the 100-day and 200-day moving averages (currently at $2,638 and $2,776, respectively). These levels now act as dynamic resistance, adding more weight against any short-term bullish reversal attempts. ETH is also trading well below the 50-day moving average at $2,265, a level that has historically acted as a short-term directional signal. Unless price reclaims and consolidates above that zone, the bearish trend could continue toward the $2,000–$2,100 support cluster—an area that previously sparked buying interest during March&#8217;s recovery. Related Reading: Tron Energy Usage Surges 108% – Smart Contract Activity Accelerates Volume has spiked significantly on this drop, suggesting panic selling rather than a controlled correction. For bulls to regain control, ETH must reclaim the range low at $2,320 quickly. Otherwise, downside pressure could continue to dominate in the near term. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Sequans Launches $384M Bitcoin Treasury Initiative with Swan Bitcoin Partnership",
      "link": "https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Sequans-Launches-384M-Bitcoin-Treasury-Initiative-with-Swan-Bitcoin-Partnership.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a France-based developer of 5G and IoT semiconductor technology, has announced a move into Bitcoin with a new treasury initiative backed by a $384 million private placement.&#160;&#160; The funding includes $195 million in equity securities and $189 million in convertible secured notes. Sequans plans to allocate this capital toward building a Bitcoin position [&#8230;]</p> <p>"
    },
    {
      "title": "The Blockchain Group Acquires 75 BTC After €7.2M Raise",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/10.4B-Bitcoin-Firm-Unchained-Announces-First-Regulated-Bitcoin-Native-Trust-Company-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise\" rel=\"nofollow\"> </a></p> <p>Total holdings reach 1,728 BTC as YTD yield climbs to 1,231.7%, reinforcing its Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Fintech Company DigiAsia Corp to Launch Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Southeast-Asian-fintech-company-aims-to-raise-100-million-for-long-term-Bitcoin-holdings-as-part-of-their-corporate-treasury-initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DigiAsia Corp, a leading Southeast Asian Fintech-as-a-Service platform, has signed an indicative term sheet for up to $3 million in non-recourse debt financing to kickstart its Bitcoin treasury acquisition strategy. The funding comes from High West Capital Partners and is expected to close within 45 days.&#160; The $3 million facility represents the first phase of [&#8230;]</p> <p>"
    },
    {
      "title": "ECD Automotive Design Secures $500M Facility to Acquire Bitcoin",
      "link": "https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ECD-Automotive-Design-Secures-500M-Facility-to-Acquire-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin\" rel=\"nofollow\"> </a></p> <p>Luxury auto builder will grow its Bitcoin treasury, expand operations, and offer $21,000 in upgrades to early customers who pay with Bitcoin and other crypto.</p> <p>"
    },
    {
      "title": "Anthony Pompliano Announces $1 Billion Merger in Record Bitcoin Treasury Company Fundraise",
      "link": "https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ProCap-Financial-has-raised-over-750-million-in-the-largest-initial-funding-round-for-a-public-Bitcoin-treasury-company.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise\" rel=\"nofollow\"> </a></p> <p>Anthony Pompliano announced a $1 billion merger creating ProCap Financial through a Special Purpose Acquisition Company (SPAC) transaction with Columbus Circle Capital Corp. (CCCM). The deal represents the largest initial fundraise in history for a public Bitcoin treasury company, raising $516.5 million in equity and $235 million in convertible notes.&#160;&#160; ProCap Financial will operate with [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Donald Trump and Bitcoin: From 'Not a Fan' to Crypto President—With His Own Meme Coin",
      "link": "https://decrypt.co/240580/donald-trump-bitcoin-evolution-timeline-president",
      "summary": "President Donald Trump used to slam Bitcoin as \"a scam.\" Now he's back in the White House and making pro-crypto moves."
    },
    {
      "title": "Midnight Network Plots NIGHT Airdrop for Users of Bitcoin, Ethereum, Cardano and Beyond",
      "link": "https://decrypt.co/326566/midnight-network-night-airdrop-bitcoin-ethereum-cardano",
      "summary": "Cardano-powered privacy network Midnight will offer NIGHT tokens in an airdrop to millions of crypto users on Bitcoin, Ethereum, and beyond."
    },
    {
      "title": "Wen Lambo? Jaguar, Land Rover Customizer Revs Up Bitcoin Strategy",
      "link": "https://decrypt.co/326565/wen-lambo-jaguar-land-rover-customizer-bitcoin-strategy",
      "summary": "ECD Automotive Design, which bills itself as the largest Land Rover and Jaguar restorator, has raised half a billion dollars to buy Bitcoin and fund its corporate growth."
    },
    {
      "title": "Circle Stock in Up Only Mode Even as Bitcoin, Crypto Market Struggle—Why?",
      "link": "https://decrypt.co/326519/circle-stock-in-up-only-mode-bitcoin-crypto-market-struggle-why",
      "summary": "Circle stock soared above $298 amid geopolitical chaos as the USDC issuer's market cap eclipsed its own stablecoin for the first time."
    },
    {
      "title": "Bitcoin Shakes Off Market Chaos as Traders Pile Into Even Riskier Assets: Analysis",
      "link": "https://decrypt.co/326526/bitcoin-market-chaos-traders-riskier-assets-analysis",
      "summary": "Meme coins defy macro chaos with explosive gains as Bitcoin and Ethereum trade sideways amid escalating Middle East tensions."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin drops below $100K, then rebounds after Iran reportedly fires missiles toward US military targets in Qatar and Iraq",
      "link": "https://cryptobriefing.com/bitcoin-price-drop-mideast-tensions/",
      "summary": "<p>Geopolitical tensions can significantly impact cryptocurrency markets, highlighting their volatility and sensitivity to global events.</p> <p>"
    },
    {
      "title": "Crypto fund veterans to raise $100M to build BNB strategic reserve",
      "link": "https://cryptobriefing.com/bnb-treasury-strategy-listed-company/",
      "summary": "<p>The initiative could diversify crypto investment strategies, potentially increasing BNB's market influence and public company crypto adoption.</p> <p>"
    },
    {
      "title": "Fintech giant Fiserv to launch FIUSD stablecoin and digital asset platform with Circle, Paxos, and Solana",
      "link": "https://cryptobriefing.com/fiusd-stablecoin-platform-launch/",
      "summary": "<p>Fiserv's FIUSD launch could revolutionize digital payments, enhancing real-time transactions and expanding blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Michael Saylor’s Strategy makes smallest Bitcoin purchase since mid-March",
      "link": "https://cryptobriefing.com/strategy-bitcoin-acquisition-record/",
      "summary": "<p>Saylor's ongoing Bitcoin acquisitions highlight a strategic commitment to digital assets, potentially influencing market dynamics and investor sentiment.</p> <p>"
    },
    {
      "title": "Hackers exploit Trezor’s website to send phishing emails",
      "link": "https://cryptobriefing.com/trezor-security-alert-phishing-warning/",
      "summary": "<p>This incident highlights the growing sophistication of phishing attacks, underscoring the need for enhanced cybersecurity measures in crypto platforms.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin: What these KEY datasets say about BTC’s market direction",
      "link": "https://ambcrypto.com/bitcoin-what-these-key-datasets-say-about-btcs-market-direction/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-7-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As Bitcoin dropped to $98k, STHs turned to selling, offloading 17.8k BTC as bearish sentiment surged."
    },
    {
      "title": "Whale grabs $39M in Ethereum as ETH bleeds – Recovery in sight?",
      "link": "https://ambcrypto.com/whale-grabs-39m-in-ethereum-as-eth-bleeds-recovery-in-sight/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika5-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is ETH gearing up for a stealth Q3 rally while everyone else panic sells?"
    },
    {
      "title": "Decoding Fartcoin’s short squeeze zone: Traders, watch out for…",
      "link": "https://ambcrypto.com/decoding-fartcoins-short-squeeze-zone-traders-watch-out-for/",
      "summary": "<img alt=\"FARTCOIN\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-23T134638.879-1-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whale buys, rising OI, and oversold RSI point to possible FARTCOIN breakout."
    },
    {
      "title": "XRP faces major sell-off risk as whales lock in profits – Is a crash coming?",
      "link": "https://ambcrypto.com/xrp-faces-major-sell-off-risk-as-whales-lock-in-profits-is-a-crash-coming/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-2-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Technical weakness and whale exits pile pressure on XRP as bulls struggle to hold the line."
    },
    {
      "title": "Mapping Bitcoin’s next move: Rally or reversal – Here are 4 possible outcomes",
      "link": "https://ambcrypto.com/examining-bitcoins-next-chapter-rally-or-reversal-here-are-4-possible-outcomes/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250623_094322_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BTC shows both price possibilities; a fall or a rally."
    }
  ]
}