{
  "CoinDesk": [
    {
      "title": "The Big Bet on Crypto’s AI Infrastructure",
      "link": "https://www.coindesk.com/coindesk-indices/2025/07/09/the-big-bet-on-crypto-s-ai-infrastructure",
      "summary": ""
    },
    {
      "title": "The Evolution of Crypto Trading: From Wild West to Regulated Innovation",
      "link": "https://www.coindesk.com/coindesk-indices/2025/07/09/the-evolution-of-crypto-trading-from-wild-west-to-regulated-innovation",
      "summary": ""
    },
    {
      "title": "ICP Approaches $5 as Breakout Volume and DeFi BTC Flows Signal Strength",
      "link": "https://www.coindesk.com/markets/2025/07/09/icp-approaches-5-as-breakout-volume-and-defi-btc-flows-signal-strength",
      "summary": ""
    },
    {
      "title": "Decentralized Exchange GMX Exploited for $42M, Offers Hacker 10% White Hat Bounty",
      "link": "https://www.coindesk.com/business/2025/07/09/decentralized-exchange-gmx-exploited-for-usd42m-offers-hacker-10-white-hat-bounty",
      "summary": ""
    },
    {
      "title": "Pump.fun to Launch PUMP Token via ICO on July 12",
      "link": "https://www.coindesk.com/markets/2025/07/09/pumpfun-to-launch-pump-token-via-ico-on-july-12",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Germany’s top banks managing $4.5 trillion+ in assets are going crypto—Here’s what to watch",
      "link": "https://cointelegraph.com/explained/germanys-top-banks-managing-45-trillion-in-assets-are-going-cryptoheres-what-to-watch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy80NWQxNDg5ZjhmZGU3NjYzYmE1YjA5OGY0ZWVjYzM2OS5qcGc=.jpg\" /></p><p>Germany’s top banks, including Deutsche Bank and Sparkassen, are entering crypto with regulated trading and custody services by 2026.</p>"
    },
    {
      "title": "LetsBonk overtakes Pump.fun: Are Solana memecoins back for good?",
      "link": "https://cointelegraph.com/news/letsbonk-overtakes-pumpfun-solana-memecoins?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzExNDUtNzZjZS03YjZjLWFjNGYtNTJjMjU3YmY1MDg0.jpg\" /></p><p>Key metrics on Solana remain flat despite LetsBonk’s recent surge, but supporting data suggests memecoins may be staging a comeback.</p>"
    },
    {
      "title": "Bitcoin rich list 2025: Who holds the most BTC this year?",
      "link": "https://cointelegraph.com/news/bitcoin-rich-list-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VmYzQtOTE2MS03ODQ2LWEyNTgtNWZiZDAzOTNhZWNm.jpg\" /></p><p>From exchanges and ETFs to sovereign treasuries and crypto billionaires, Bitcoin’s ownership map in 2025 reveals a mix of concentration and quiet decentralization.</p>"
    },
    {
      "title": "Bitcoin analyst warns time &#039;running out&#039; for another BTC price parabolic rally",
      "link": "https://cointelegraph.com/news/bitcoin-analyst-warns-time-could-be-running-out-for-btc-price-parabolic-rally?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzNhNzYtODQxNS03ZjVjLWFhOTQtNjdlMTUwOTVjNDQ1.jpg\" /></p><p>Crypto analyst TradingShot says that while Bitcoin’s long-term outlook is still bullish, there might not be enough time for another leg up.</p>"
    },
    {
      "title": "Death, divorce and lost keys: The question of succession in tokenized property",
      "link": "https://cointelegraph.com/news/succession-in-tokenized-property?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NGI2Y2YtNGFlMC03M2E2LWFkYjktNWI4MDJmNzg4YWVl.jpg\" /></p><p>Blockchain’s promise of democratized property ownership faces a potential roadblock. Integrating automated, blockchain-native succession protocols is essential to protect digital assets and enable true democratization of RWA ownership.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "The Graph Brings Real Time Data Streaming to TRON, Providing Builders with Advanced Blockchain Insights",
      "link": "https://cryptoslate.com/the-graph-brings-real-time-data-streaming-to-tron-providing-builders-with-advanced-blockchain-insights/",
      "summary": "<p>SAN FRANCISCO, July 9, 2025 – The Graph, the open, universal data layer for web3, announced today a strategic integration with the TRON blockchain network. This integration leverages Substreams, a powerful streaming product developed by StreamingFast, a core developer team for The Graph, and marks a significant expansion in blockchain data accessibility by offering developers [&#8230;]</p> <p>"
    },
    {
      "title": "Kraken expands xStocks to BNB Chain enabling global access to tokenized equities",
      "link": "https://cryptoslate.com/kraken-expands-xstocks-to-bnb-chain-enabling-global-access-to-tokenized-equities/",
      "summary": "<p>Kraken has announced the expansion of its xStocks product to Binance-backed BNB Chain, marking a significant step toward making tokenized US equities more accessible globally. According to a July 9 statement, Kraken&#8217;s users outside the United States will soon be able to deposit and withdraw tokenized stocks, such as AAPLx, TSLAx, SPYx, and NVDAx, via [&#8230;]</p> <p>"
    },
    {
      "title": "GMX suffers $42M hack, issues 10% bounty offer to hacker",
      "link": "https://cryptoslate.com/gmx-suffers-42m-hack-issues-10-bounty-offer-to-hacker/",
      "summary": "<p>A major security incident struck the decentralized exchange GMX, siphoning approximately $42 million from its Arbitrum-based v1 perpetual platform. In response, GMX has sent an on-chain message to the hacker offering a 10% white-hat bounty. The platform stated that no legal action will be pursued if the remaining funds are returned within 48 hours. This [&#8230;]</p> <p>"
    },
    {
      "title": "Ripple appoints BNY Mellon as custodian for RLUSD reserves as supply tops $500M",
      "link": "https://cryptoslate.com/ripple-appoints-bny-mellon-as-custodian-for-rlusd-reserves-as-supply-tops-500m/",
      "summary": "<p>According to a July 9 announcement, Ripple has appointed BNY Mellon as the official reserve custodian for its enterprise-focused stablecoin, Ripple USD (RLUSD). According to a July 9 announcement, BNY Mellon was selected based on its extensive experience in digital asset infrastructure and its role as a trusted provider of transaction banking services in the US. The [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto.com signs major deals in Dubai to enable crypto payments",
      "link": "https://cryptoslate.com/crypto-com-signs-major-deals-in-dubai-to-enable-crypto-payments/",
      "summary": "<p>Crypto.com has significantly expanded its presence in the United Arab Emirates (UAE), striking multiple high-impact partnerships across aviation, real estate, and public sector services. During the last three months, the crypto exchange has partnered with leading institutions, including Emirates Airlines, the Dubai Land Department, and the Dubai Department of Finance, positioning itself at the center [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ledger Offers a 30% Discount on Most Colors for Nano S Plus and Nano X Until July 15",
      "link": "https://www.newsbtc.com/crypto/30-discount-on-ledgers-nano-s-plus-and-nano-x-until-july-15/",
      "summary": "Ledger has announced a limited-time 30% discount on nearly all color models of its popular Nano S Plus and Nano X hardware wallets, valid through July 15. The promotion has drawn fresh attention to the company’s flagship products, widely regarded as industry benchmarks for secure crypto storage. Together, the Nano S Plus and Nano X boast 13,345 reviews, the majority of which are positive, underscoring the strong trust and satisfaction among users worldwide. But what makes Ledger such a popular hardware wallet? Ledger Wallet’s Blend of Security, Comfort, and Style – this is what makes them so attractive to its loyal fanbase and newbies alike. Ledger excels in the areas of security, comfort level, and overall style, but it’s the wallet’s security features that attract users. Ledger relies on a multi-layered security profile, with several noticeable features, like: ✅ The PIN code that secures the actual device to prevent unauthorized access is required to complete any transaction ✅ The 24-word phrase, which acts as the master key, secures your funds against any malicious access ✅ The trademark Blockchain Open Ledger Operating System (BOLOS), which isolates any installed apps from one another and the 24-word phrase from all apps and the operating system itself ✅ Secure Element Chip, the hardware component that keeps the private keys offline for a higher level of security Plus, Ledger’s Donjon team, which consists of seasoned hackers, is constantly testing the products’ security to identify any potential vulnerabilities. Their efforts are part of Ledger’s Bug Bounty program, which rewards anyone who finds security weaknesses in Bitcoin, showcasing the team’s commitment to continuous improvements in the security department. While security is the most important aspect, other features matter as well, like the comfort level associated with carrying and using the wallet. Ledger’s Nano S Plus and Nano X are the sleekest and most comfortable to use and wear, thanks to their slim builds. Nano S Plus consists of steel and plastic, weighing only 0.74 ounces, while Nano X is slightly larger, thanks to the lithium battery, reaching 1.19 ounces. The slim format makes them comfortable to wear, even as keychains if you always insist on having them with you. Finally, the color palette offers a final touch to the already unique style, imbuing the wallets with a modern vibe. Colors like emerald-green, sapphire-blue, and amethyst-purple come with a plus of personality and X factor. The Massive 30% Discount Ends on July 15 Ledger’s flash promotion (offering a 30% discount on its Nano S Plus and Nano X wallets) is set to end on July 15, giving buyers less than a week to take advantage. The deal aims to spotlight two of Ledger’s most widely used products, with a combined user base of around 7 million worldwide. Most color options are eligible, with only onyx-black and BTC-orange for the Nano X, and matte-black and BTC-orange for the Nano S Plus excluded from the promotion. Should You Buy the Ledger Wallet? Nobody can answer that for you, but if you’ve decided that the Ledger wallet meets your expectations in terms of security, style, and ease of use, and you want to buy it, buy it today. Or, at the very least, until July 15, when the current 30% promotion ends, because discounts like these don’t come often. Also, go to Ledger’s website and scroll through their offers. You’ll find a lot of products and accessories, based on your needs. Remember, this is not financial advice. Do your own research before buying any product."
    },
    {
      "title": "Elon Musk Drops Epstein ‘Peanut’ Bomb — PNUT Coin Explodes 10%",
      "link": "https://www.newsbtc.com/altcoin/elon-musk-drops-epstein-peanut-bomb-pnut-coin-explodes-10/",
      "summary": "A sudden social media jab sent Solana’s Peanut the Squirrel token soaring this week. In a Tuesday post, billionaire Elon Musk criticized US authorities for ignoring names on the Jeffrey Epstein &#8220;client list&#8221;, quipping that “more squirrels and raccoons have been arrested” than any Epstein affiliates. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 A nod to a squirrel named Peanut—said to have been “arrested (and killed)”—coincided with a sharp pop in the PNUT token’s value. According to on‑chain data, PNUT climbed over 10% in 24 hours, touching $0.23 at one point. Elon Musk Highlights Justice Concerns Based on reports, Musk’s post racked up more than 13.7 million views within hours. Traders quickly linked “Peanut” to the PNUT ticker. Almost immediately, PNUT price rose from about $0.22 to $0.23. Peanut price up in the last 24 hours. Source: Coingecko The token’s 24‑hour trading volume jumped roughly 80%, crossing $215 million. Market watchers estimate PNUT’s market cap now sits near $224 million, out of a total supply approaching 1 billion tokens. Market Reaction Follows Viral Meme Meme tokens often depend on hype, and PNUT was no exception. After Musk’s message spread, order books filled fast. Buy orders outnumbered sells, driving price momentum. Crypto bots and retail traders piled in, hoping to catch the wave. Some investors told reporters they moved funds into PNUT within minutes of seeing Musk’s post. They arrested (and killed) Peanut, but have not even tried to file charges against anyone on the Epstein client list. Government is deeply broken. pic.twitter.com/YndRadQUBE — Elon Musk (@elonmusk) July 8, 2025 Token Jump Drives Trading Frenzy Solana’s speedy network helped too. Transactions cleared in seconds, letting traders react without delay. That low‑fee environment amplifies meme coin rallies: when hype hits, people can buy or sell without worrying about high gas costs. In this case, volume spiked from around $120 million to $214 million in under a day. Related Reading: 2% Of All XRP Is In His Hands — But Who Is He? Looking Ahead, Caution Advised Despite the rush, crypto veterans warn that PNUT’s gains could reverse just as fast. Meme tokens lack fundamentals, and hype fades quickly. Traders could face losses if views shift or if Musk moves on to the next joke. For now, Musk’s satirical jab has put Peanut the Squirrel on center stage. Whether PNUT can hold its gains may depend on more viral moments—and on whether investors remember to take profits before the next twist. No &#8216;Client List&#8217; Meanwhile, according to a memo obtained by Axios, the Justice Department and FBI under US President Donald Trump found no evidence that convicted sex offender Jeffrey Epstein blackmailed powerful individuals, kept a “client list,” or was murdered. Featured image from Meta, chart from TradingView"
    },
    {
      "title": "Analyst Predicts 50% “Moonshot” For XRP Price If This Line Breaks",
      "link": "https://www.newsbtc.com/analysis/xrp/50-moonshot-for-xrp-price/",
      "summary": "Crypto analyst Jaydee has predicted a 50% rally for the XRP price. He highlighted a resistance level, which the altcoin needs to break above on its BTC pair to record this massive uptrend. XRP Price Eyes 50% Rally With Break Above $2.20 In an X post, Jaydee predicted that the XRP price will record a 50% “moonshot” rally once it breaks above the $0.00002 resistance level on its Bitcoin pair. XRP has since broken above this resistance level, suggesting that this moonshot rally may be imminent, with the altcoin surging to as high as $3.35. Related Reading: Analyst Reveals Rational Behind XRP Price Reaching $9.5 And $37.5 A rally to $3.35 will bring the XRP price close to its current all-time high (ATH) of $3.84 and also mark a new yearly high for the altcoin. In a subsequent analysis, Jaydee confirmed that XRP could rally to new ATHs with a successful break above this resistance level. On the other hand, he warned that the altcoin could crash to as low as $1.60 if it fails to hold this level on at least the 3-day timeframe. Crypto analyst Guy also recently predicted that the XRP price could rally to a new ATH of $5.30. The analyst indicated that the $2.33 level is the key to kickstarting this uptrend for the altcoin. Once XRP breaks above, he predicts that it will rally to $2.55. A break above this $2.55 level would then pave the way for another rally to the current ATH and the Fibonacci extension at $5.30. Possible Scenarios Following Break Above $2.30 In an X post, crypto analyst CasiTrades outlined three potential scenarios that could unfold following the XRP price break above $2.30. The first scenario is the cleanest move, in which she predicts that XRP could run towards $2.45, then flips $2.30 into support on a backtest. CasiTrades remarked that this gives the altcoin a solid base for a move to $2.69 and beyond. Related Reading: Will XRP Dethrone Ethereum To Lead This Altcoin Season? For the second scenario, the crypto analyst described this as a more aggressive move. In this case, she predicts that the XRP price could record a sharp breakout through $2.30 and head straight to $2.69. From there, she added that the altcoin could pull back to $2.45 as the mid-way support zone before continuing its uptrend. The third scenario is the most bullish for the XRP price. CasiTrades predicts that the altcoin could break through $2.69, confirm this price level as support, and then clear the way towards $3 and above. This would then put the current ATH in sight for the altcoin. At the time of writing, the XRP price is trading at around $2.32, up over 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Price Action Signals Momentum Shift: BTC Sleeps And ETH Moves",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-price-action-signals-momentum-shift-btc-sleeps-and-eth-moves/",
      "summary": "Ethereum has finally pushed above the critical $2,600 level after weeks of range-bound trading, marking a potential turning point in its price structure. This breakout comes as bullish momentum builds, with Ethereum now preparing for a possible expansion toward the $2,800 resistance level—a zone that has repeatedly rejected upward attempts since early May. The coming days will be decisive in shaping Ethereum’s short-term trajectory, especially if bulls manage to drive the price beyond this key barrier. Related Reading: ERC-20 Stablecoin Supply Hits All-Time High At $121B – Liquidity On The Rise A breakout above $2,800 would not only signal renewed strength in Ethereum but could also catalyze a broader altcoin rally. Market sentiment is gradually shifting, with traders growing more optimistic amid easing macroeconomic pressures and signs of renewed risk appetite. Top analyst Ted Pillows recently shared an Ethereum chart showing a clear upward breakout from compression. This technical pattern typically precedes strong directional moves, and in this case, it favors the bulls. Pillows suggests that Ethereum is taking the lead while Bitcoin remains in consolidation, indicating that ETH may be setting the pace for the next phase of the crypto cycle. All eyes are now on the $2,800 level, which could unlock significant upside if breached. Ethereum Leads the Charge: Major Move Ahead Since early May, Ethereum has traded within a tight consolidation range between $2,400 and $2,700, unable to break out despite several attempts. This extended period of sideways action has built up pressure, and market participants widely expect the next move to be significant. Bulls have shown resilience, defending demand levels and keeping ETH above the $2,500 mark for several weeks. However, a clear breakout above critical resistance is still needed to confirm a broader bullish trend. Altcoins continue to struggle, with most still trading below key resistance levels. Many analysts agree that a sustained Ethereum breakout is the missing trigger for the long-awaited altseason. Market leadership from ETH has historically marked the start of major altcoin rallies, and the current setup could be no different. Top analyst Ted Pillows shared a 4-hour chart highlighting an upward breakout from a compression pattern just above $2,600. According to Pillow’s analysis, Ethereum is leading the market while Bitcoin remains in a holding pattern below all-time highs. This leadership role for ETH could signal a shift in capital toward altcoins, especially if Ethereum follows through and breaks the $2,800 resistance level. Related Reading: Ethereum Turns Key Resistance Into Support – Momentum Builds For Range Breakout ETH Price Analysis: Upward Momentum Builds Above $2,600 Ethereum (ETH) is showing renewed strength after breaking above the key $2,600 level. The 12-hour chart reveals a bullish structure forming, with ETH currently trading at $2,612.61. This move follows a sustained period of consolidation between $2,400 and $2,600, where buyers consistently defended lower levels. Now, Ethereum is printing higher lows and gradually reclaiming its moving averages. Price is now trading above the 50-period and 100-period simple moving averages (SMAs), currently positioned at $2,483.37 and $2,536.77, respectively. This alignment is bullish and suggests ETH is building momentum for a potential retest of the $2,700–$2,800 resistance zone. A successful break above this area would confirm the breakout from compression and open the door for a more significant rally. Related Reading: Ethereum Range Tightens – Liquidity Looms At $2,800 And $2,350 Volume remains moderate, but recent green candles show growing buyer interest as ETH pushes upward. The 200-period SMA sits lower at $2,221.56, reflecting Ethereum’s longer-term bullish trend and acting as a strong base of support. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "XRP Makes Trump’s Unspoken Crypto Top 5—What You Need To Know",
      "link": "https://www.newsbtc.com/xrp-news/xrp-makes-trump-unspoken-crypto-top-5/",
      "summary": "Trump Media &#38; Technology Group (TMTG) quietly lodged an S-1 with the US Securities and Exchange Commission late on July 8, seeking approval for the “Truth Social Crypto Blue Chip ETF.” Despite a swirl of social-media posts placing the paperwork in early June, the SEC’s time-stamp confirms the filing date as July 8. The prospectus sketches a five-coin portfolio weighted approximately 70 percent to bitcoin, 15 percent to ether, 8 percent to solana, 5 percent to Cronos and 2 percent to XRP, making it the first Trump-branded product to diversify beyond the two largest digital assets. The trust, structured as a Nevada business trust and sponsored by boutique issuer Yorkville America Digital, aims to list its shares on NYSE Arca. Foris DAX Trust — the US institutional arm of Crypto.com — is named digital-asset custodian, while authorized participants will create and redeem blocks of 10,000 shares in kind or for cash, subject to NYSE rule changes. The prospectus also discloses that staking rewards on ether, solana and cronos may be passed through to the fund, a design choice that would set a precedent among US spot-crypto ETFs. Related Reading: Pundit Explains Why XRP Stands To Gain Big From Ripple’s RLUSD Analyst Eric Balchunas of Bloomberg distilled the filing in two succinct posts on X: “New filing for the Truth Social Crypto Blue Chip ETF, which will be a spot crypto basket holding Bitcoin, Ether, Solana, XRP and Cronos,” he wrote; in a follow-up, he reproduced the pivotal language: “the Trust’s allocation… is initially expected to approximate 70% bitcoin, 15% ether, 8% SOL, 5% CRO and 2% XRP.” Those percentages now serve as the market’s working model for how the Trump universe ranks crypto’s ‘blue chips.’ Why Solana, Cronos And XRP? Overall, the allocation may serve as an implicit ranking of the top five crypto assets as viewed through the lens of Trump’s inner circle. Binance top trader by PnL Nachi (@alphawifhat) commented via X: “I think it&#8217;s useful to look at the allocation ratio of the Truth Social Crypto ETF [&#8230;] I see this as an indication of how Trump&#8217;s crypto team looks at the top crypto assets and what are the top 5 they want to value the most. This could be a catalyst to pump CRO as it&#8217;s a dark horse.” Solana’s climb to an 8 percent weight is more than a momentum trade. CME Group this spring announced cash-settled Solana futures pending CFTC sign-off, extending the same institutional rails that helped bitcoin and ether graduate into ETF form. Notably, the SEC has set a July deadline for spot Solana ETF refilings, indicating a potential approval before the October 2 deadline. Related Reading: XRP Set To Shock The Crypto Market With 30% Share, Analyst Predicts Cronos leaps over better-capitalized tokens because Crypto.com is literally powering Trump’s ETFs. “We are proud to partner with Trump Media and Yorkville… including the first-of-its-kind basket of tokens featuring CRO,” Crypto.com co-founder Kris Marszalek said in March when the multi-year, roughly $2.7 billion partnership was unveiled. Under the agreement, Crypto.com supplies custody, liquidity and back-end order routing for all Truth-branded funds. XRP brings up the rear at two percent, reflecting both its renewed legitimacy and its still-nascent institutional plumbing. On June 27, Ripple Labs announced that it will withdraw its cross appeal against the SEC. The token’s modest two-percent slice is politicized as much as it is financial. In early March a staffer from Ballard Partners—the K-Street shop that counts Ripple as a client—slipped Donald Trump draft language for a Truth Social post urging that XRP, Solana and Cardano be placed in a national “Crypto Strategic Reserve.” Trump hit “post” and only later discovered the Ripple connection; insiders told Politico he “was furious and felt like he’d been used.” Despite that, the inclusion of XRP still shows Trump’s ties with Ripple. At press time, XRP traded at $2.33. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "H100 Group Increases Bitcoin Holdings With Purchase of 46.93 BTC",
      "link": "https://bitcoinmagazine.com/news/h100-group-increases-bitcoin-holdings-with-purchase-of-46-93-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/H100-Group-Increases-Bitcoin-Holdings-With-Purchase-of-46.93-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/h100-group-increases-bitcoin-holdings-with-purchase-of-46-93-btc\" rel=\"nofollow\"> </a></p> <p>The SEK 49.5 million Bitcoin purchase comes as H100 raises SEK 516 million through share and convertible debenture issues to expand its Bitcoin focused treasury strategy.</p> <p>"
    },
    {
      "title": "Apple Approves First-Ever iOS Game Integrating Bitcoin Microtransactions, Powered by ZBD",
      "link": "https://bitcoinmagazine.com/news/apple-approves-first-ever-ios-game-integrating-bitcoin-microtransactions-powered-by-zbd",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Apple-Approves-First-Ever-iOS-Game-Integrating-Bitcoin-Microtransactions-Powered-by-ZBD.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/apple-approves-first-ever-ios-game-integrating-bitcoin-microtransactions-powered-by-zbd\" rel=\"nofollow\"> </a></p> <p>Apple has approved the first iOS game to feature native Bitcoin microtransactions, according to a press release sent to . The game, SaruTobi, now enables real-money in-app payments using ZBD’s Bitcoin Lightning technology—marking a shift in Apple’s historically closed approach to alternative payment systems.&#160; This approval follows regulatory pressure from the EU’s Digital Markets [&#8230;]</p> <p>"
    },
    {
      "title": "Unchained Surpasses $1 Billion in Bitcoin-Backed Loan Originations",
      "link": "https://bitcoinmagazine.com/news/unchained-surpasses-1-billion-in-bitcoin-backed-loan-originations",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Unchained-Surpasses-1-Billion-in-Bitcoin-Backed-Loans.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/unchained-surpasses-1-billion-in-bitcoin-backed-loan-originations\" rel=\"nofollow\"> </a></p> <p>Unchained lowers APRs, and reinforces its long standing commitment to transparency with a non-rehypothecation model and client-controlled multisig vaults.</p> <p>"
    },
    {
      "title": "Bitcoin Showed Up in DC — And Washington Took Notice",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Showed-Up-in-DC-—-And-Washington-Took-Notice-fotor-2025070812361.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice\" rel=\"nofollow\"> </a></p> <p>Reflections on the Bitcoin Policy Summit in Washington DC during May 2025. </p> <p>"
    },
    {
      "title": "Bow Valley Credit Union in Canada turns on Bitcoin purchases for Albertans",
      "link": "https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_an_orange_bull_running_through_an_Alberta_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans\" rel=\"nofollow\"> </a></p> <p>BVCU’s Bitcoin Gateway, with Balance Custody and Bull Bitcoin API, simplifies buying bitcoin. “Facilitates institutional adoption,” says Francis Pouliot. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Tornado Cash Judge Won’t Let One Case Be Mentioned in Roman Storm’s Trial: Here’s Why",
      "link": "https://decrypt.co/329304/tornado-cash-judge-wont-let-one-case-be-mentioned-in-roman-storms-trial-heres-why",
      "summary": "Judge Failla said mentioning the Van Loon ruling would confuse jurors, outweighing its limited value in Roman Storm’s upcoming trial."
    },
    {
      "title": "ETH CONTINUES TO RISE, PHANTOM LAUNCHES PERPS, TRUMP SHELVES TARIFFS",
      "link": "https://decrypt.co/videos/interviews/hyrmNhGC/eth-continues-to-rise-phantom-launches-perps-trump-shelves-tariffs",
      "summary": "ETH leads crypto majors higher, BTC dominance falls. US House taking steps for US to be crypto capital. Sharplink to buy $20m ETH, stock pops 12%. GameSquare raises $8m to buy ETH, stock +60%. Bit Digital stock keeps pumping on ETH pivot. BioSig, StreamEx to tokenise commodities on SOL. Phantom intros perps powered by Hyperliquid. GMX faces $40m exploit. Tether reveals $8b gold stock pile in Swiss vault. Expect us to be largest BTC miner this year: Tether. OpenAI stock tokens backed by SPV: Robinhood. Aevo offers 1000x lev on tokenised stocks. DoJ charges OmegaPro founders with $650m fraud. Tether is a money launderer’s dream: The Economist. EIGEN announces 25% reduction in staff"
    },
    {
      "title": "Solana Meme Coin Launchpad Pump.fun Confirms PUMP Token—With Airdrop 'Coming Soon'",
      "link": "https://decrypt.co/329281/pump-fun-token-sale-july-12-bybit",
      "summary": "Pump.fun launches massive PUMP token ICO July 12 across major exchanges, but US and UK users banned from the potentially record-breaking sale."
    },
    {
      "title": "Ripple Chooses BNY Mellon for Stablecoin Custodian as RLUSD Reaches $500 Million",
      "link": "https://decrypt.co/329297/ripple-mellon-stablecoin-custodian",
      "summary": "Ripple’s CEO said the tie-up with BNY Mellon represents how regulatory headwinds are no longer a reality for the firm."
    },
    {
      "title": "Linda Yaccarino Leaves Elon Musk's X Following Grok 'MechaHitler' Debacle",
      "link": "https://decrypt.co/329314/linda-yaccarino-leaves-elon-musks-x-grok-mechahitler-debacle",
      "summary": "X CEO Linda Yaccarino has stepped down from Elon Musk's social media platform, one day after AI chatbot Grok pivoted to antisemitism."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Linda Yaccarino steps down as CEO of Elon Musk’s X ahead of Grok 4 launch",
      "link": "https://cryptobriefing.com/x-ceo-transition-grok-launch/",
      "summary": "<p>Yaccarino's departure may impact X's strategic direction, especially as it expands into AI and financial services, potentially altering its market position.</p> <p>"
    },
    {
      "title": "The Graph brings real time data streaming to TRON, providing builders with advanced blockchain insights",
      "link": "https://cryptobriefing.com/real-time-data-streaming-tron/",
      "summary": "<p>The Graph and TRON integration introduces real-time data streaming, enabling developers access to live blockchain insights and analytics.</p> <p>"
    },
    {
      "title": "Top perps DEX GMX hacked for over $40m, $GMX token plunges",
      "link": "https://cryptobriefing.com/gmx-exchange-exploit-incident/",
      "summary": "<p>The exploit highlights vulnerabilities in DeFi platforms, potentially undermining trust and prompting stricter security measures industry-wide.</p> <p>"
    },
    {
      "title": "Ripple taps BNY to secure RLUSD stablecoin with institutional-grade custody",
      "link": "https://cryptobriefing.com/enterprise-stablecoin-custody-rlusd/",
      "summary": "<p>Ripple's partnership with BNY Mellon could accelerate institutional crypto adoption, enhancing trust and bridging traditional finance with digital assets.</p> <p>"
    },
    {
      "title": "Airline giant Emirates to accept Bitcoin and crypto payments for flights, services",
      "link": "https://cryptobriefing.com/emirates-crypto-payments-flights/",
      "summary": "<p>Emirates' crypto payment integration could accelerate digital currency adoption in global travel, aligning with Dubai's financial innovation goals.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Top 7 VPNs of July 2025",
      "link": "https://ambcrypto.com/top-7-vpns-of-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1248\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/hazel-z-FocSgUZ10JM-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Virtual Private Networks, or VPNs, have become an essential part of the online experience. They [&#8230;]"
    },
    {
      "title": "Bitcoin’s price rally may just be starting – All the details!",
      "link": "https://ambcrypto.com/bitcoins-price-rally-may-just-be-starting-all-the-details/",
      "summary": "<img alt=\"Bitcoin&#039;s price rally may just be starting - All the details!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-FI-risk.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin's long-term remained bullish, but analysts cautioned against the August volatility."
    },
    {
      "title": "Cardano whales move 120M tokens – But ADA could rally ONLY IF…",
      "link": "https://ambcrypto.com/cardano-whales-move-120m-tokens-but-ada-could-rally-only-if/",
      "summary": "<img alt=\"ADA\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will ADA break past $0.6566 and trigger a sustained rally or stall just short of liftoff?"
    },
    {
      "title": "Bonk.fun flips Pump.fun – What does this mean for the Solana-based meme’s demand?",
      "link": "https://ambcrypto.com/bonk-fun-flips-pump-fun-what-does-this-mean-for-the-solana-based-memes-demand/",
      "summary": "<img alt=\"Bonk.fun flips Pump.fun - What does this mean for the Solana-based meme&#039;s demand?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-1-2.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The dominance of Bonk.fun against Pump.fun could kickstart Solana-based meme demand."
    },
    {
      "title": "New Meme Coin Little Pepe (LILPEPE) Exceeds $4,475,000 as Presale Stage 4 Wraps Up Early",
      "link": "https://ambcrypto.com/new-meme-coin-little-pepe-lilpepe-exceeds-4475000-as-presale-stage-4-wraps-up-early/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"414\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Screenshot-2025-07-09-165017.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"738\" />The meme coin landscape has just been shaken by a rising powerhouse—Little Pepe (LILPEPE). With [&#8230;]"
    }
  ]
}