{
  "CoinDesk": [
    {
      "title": "Tencent Is Looking to Buy Nexon, the Creator of Web 3 Gaming Franchise MapleStory",
      "link": "https://www.coindesk.com/web3/2025/06/13/tencent-is-looking-to-buy-nexon-the-creator-of-web-3-gaming-franchise-maplestory",
      "summary": ""
    },
    {
      "title": "Ether Plunges 7% as Traders Flee to Dollar and Gold After Israel Strikes Iran",
      "link": "https://www.coindesk.com/markets/2025/06/13/ether-drops-below-usd2-550-as-israel-iran-escalation-sparks-flight-to-safety",
      "summary": ""
    },
    {
      "title": "Crypto Daybook Americas: Bitcoin Weathers Market Rout as Israel Hits Iran",
      "link": "https://www.coindesk.com/daybook-us/2025/06/13/crypto-daybook-americas-bitcoin-weathers-market-rout-as-israel-hits-iran",
      "summary": ""
    },
    {
      "title": "Walmart, Amazon Mull Dollar-Pegged Stablecoins in the U.S.: WSJ",
      "link": "https://www.coindesk.com/markets/2025/06/13/walmart-amazon-mull-dollar-pegged-stablecoins-in-the-us-wsj",
      "summary": ""
    },
    {
      "title": "XRP Could Capture 14% of SWIFT’s Global Volume, Ripple CEO Says",
      "link": "https://www.coindesk.com/markets/2025/06/13/xrp-could-capture-14-of-swifts-global-volume-ripple-ceo-says",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "How to use Grok for real-time crypto trading signals",
      "link": "https://cointelegraph.com/news/how-to-use-grok-for-crypto-trading?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVhZGMtNWZlYy03YzZjLWJkMmYtNGFkMzZiNTUwMzE1.jpg\" /></p><p>Grok scans posts and sentiment shifts on X to help crypto traders identify early signals, memes and macro-driven momentum plays.</p>"
    },
    {
      "title": "BlackRock quietly accumulated 3% of all Bitcoin. Here’s what that means",
      "link": "https://cointelegraph.com/explained/blackrock-quietly-accumulated-3-of-all-bitcoin-heres-what-that-means?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy83YzIyOGRiMjRlNGJjMDdjZWE0ZTU1ZDMwOGNhN2M5Zi5qcGc=.jpg\" /></p><p>How Much Bitcoin Does BlackRock Own and Why It Matters in 2025.</p>"
    },
    {
      "title": "Bitcoin mirrors 80% rally setup that preceded 2024 Israel-Iran conflict",
      "link": "https://cointelegraph.com/news/bitcoin-mirrors-80-rally-setup-that-preceded-2024-israel-iran-conflict?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY4Y2QtNmJkNy03MmZkLTg0YTUtY2Y3MDAzYTZjNjk5.jpg\" /></p><p>One analyst spots a bullish fractal driven by 2024-like liquidity grabs, hinting that Bitcoin may breakout toward new all-time highs.</p>"
    },
    {
      "title": "Bitcoin 2025 builders predict DeFi will unseat traditional finance",
      "link": "https://cointelegraph.com/news/bitcoin-2025-defi-traditional-finance?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY0ZDktM2UwMi03NjE1LThjNTYtNjU5NDViODZiMGNk.jpg\" /></p><p>Bitcoin’s foundational security is powering a new frontier: DeFi systems built on self-sovereignty, security and real-world financial inclusion.</p>"
    },
    {
      "title": "Anthony Pompliano to lead new Bitcoin-buying group raising $750M: FT",
      "link": "https://cointelegraph.com/news/anthony-pompliano-lead-bitcoin-buying-vehicle-raise-750-million-ft?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY4YWMtM2ViZi03MjU4LWI3NTctNGE5YmNjNTFjOTIx.jpg\" /></p><p>Under Pompliano’s leadership, ProCapBTC would reportedly seek to raise $750 million in equity and convertible debt as part of a merger with Columbus Circle Capital 1.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin fills CME gap after Iran strike sparks $5,000 sell-off",
      "link": "https://cryptoslate.com/bitcoin-fills-cme-gap-after-iran-strike-sparks-5000-sell-off/",
      "summary": "<p>Bitcoin&#8217;s retracement from $109,000 over the past 24 hours capped off a volatile week defined by thin weekend liquidity and sharp reactions to geopolitical stress. In the early hours of Friday, June 13, the market saw the $1,490 CME gap closed, which formed between the Friday (June 6) close at $105,060 and the Sunday (June [&#8230;]</p> <p>"
    },
    {
      "title": "XRP corporate treasury investments near $1 billion as companies embrace blockchain potential",
      "link": "https://cryptoslate.com/xrp-corporate-treasury-investments-near-1-billion-as-companies-embrace-blockchain-potential/",
      "summary": "<p>A growing number of public companies are committing significant funds to XRP treasuries, with total commitments approaching the $1 billion milestone. The move signals rising institutional interest in integrating blockchain-based assets into corporate financial strategies. Momentum builds around corporate XRP reserves On June 12, Singapore-based Web3 firm Trident Digital revealed plans to raise up to [&#8230;]</p> <p>"
    },
    {
      "title": "Cardano considers offloading $100M ADA to jumpstart lagging DeFi and stablecoin ecosystem",
      "link": "https://cryptoslate.com/cardano-considers-offloading-100m-in-ada-to-jumpstart-lagging-defi-and-stablecoin-ecosystem/",
      "summary": "<p>The Cardano ecosystem could soon undergo a strategic treasury shift to energize its DeFi and stablecoin sectors. On June 13, the network founder Charles Hoskinson suggested allocating around $100 million worth of ADA from the network&#8217;s treasury towards a mix of stablecoins and Bitcoin. According to him: &#8220;[W]e take about a hundred million worth of ADA [&#8230;]</p> <p>"
    },
    {
      "title": "SEC pulls back from crypto rules proposed under Gary Gensler administration",
      "link": "https://cryptoslate.com/sec-pulls-back-from-crypto-rules-proposed-under-gary-gensler-administration/",
      "summary": "<p>The US Securities and Exchange Commission (SEC) is rolling back 14 proposed rules, including key measures that once targeted the crypto industry. The decision, announced on June 12, illustrates the shift in regulatory priorities as the agency distances itself from the aggressive stance adopted during the previous administration. The withdrawn proposals were introduced between March [&#8230;]</p> <p>"
    },
    {
      "title": "How Nemo Money Is Redefining Global Investing With Smart Tools and Zero Commission Trading",
      "link": "https://cryptoslate.com/how-nemo-money-is-redefining-global-investing-with-smart-tools-and-zero-commission-trading/",
      "summary": "<p>Introduction In an increasingly complex investment world, Nemo Money is breaking through the noise. As a next-generation investing app developed by Exinity, Nemo is designed for both new and experienced investors looking for smarter, more accessible ways to manage their money — without paying excessive fees. Built for Investors Who Want More With over 6,000 [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Stablecoins To Hit $2 Trillion? US Treasury Hints At Explosive Growth",
      "link": "https://www.newsbtc.com/stablecoin/stablecoins-to-hit-2-trillion-us-treasury-hints-at-explosive-growth/",
      "summary": "US Treasury Secretary Scott Bessent told lawmakers that dollar-pegged stablecoins could swell to more than $2 trillion in the next few years. He spoke at a Senate hearing this week. His outlook came as Congress moved to set new rules on how these tokens must be backed. Related Reading: TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin Growth Forecast Details According to Bloomberg, Bessent said a leading industry group expects the stablecoin market cap to top $2 trillion. He called that view “very reasonable.” It would mean backing up to $2 trillion in tokens with US Treasury Bills. Based on reports, Citigroup analysts think issuers might buy an extra $1 trillion in those bills by 2030. Treasury Secretary Scott Bessent said that dollar-linked stablecoins could hit $2 trillion or even more as he reiterated the potential for these digital assets to strengthen the greenback’s position https://t.co/HwVRu0aPkT — Bloomberg (@business) June 11, 2025 Backing Rules Move Forward Lawmakers voted to advance a key amendment to the GENIUS Act, which would force stablecoin issuers to hold reserves in top-tier assets. The amendment won cloture yesterday. That clears the way for a final vote, likely early next week. Supporters say the change will boost confidence by ensuring every dollar-linked token has real backing. Market Size Today Right now, the total stablecoin market sits at about $255 billion. Dollar-pegged coins make up roughly $233 billion of that. That equals 90% of the whole market. The top nine dollar-pegged coins include USDT, USDC, USDe, DAI, USD1, FDUSD, PYUSD, TUSD, and USDD. They account for nearly all stablecoin activity. Challenges Ahead Regulators have work to do. If the GENIUS Act stalls or changes, issuers might head to friendlier markets. There’s also a risk that a handful of big players could dominate. That could create new “too big to fail” worries if a major issuer faces trouble. Plus, tech glitches and smart-contract bugs could still trigger runs on tokens. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC If stablecoin use really takes off in cross-border payments and decentralized finance, the US dollar could win new fans overseas. Every $1 trillion in token issuance backed by Treasury Bills might add to demand for US debt. But the path isn’t guaranteed. Lawmakers must iron out rules that balance safety with innovation. Issuers need strong risk plans. And users must see clear benefits beyond speculation. For now, the market is small compared with the broader financial system. But the shift toward programmable money keeps pace. Featured image from Sygnum Bank, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Crashes Below $103,000—What Triggered It?",
      "link": "https://www.newsbtc.com/news/bitcoin-price-crashes-below-103000/",
      "summary": "After hitting $110,450 on Monday, the Bitcoin price is writing its third consecutive red day as the benchmark cryptocurrency fell 5.3% from an intra-day top of $108,450 to a trough of $102,664 before clawing back to about $104,456 by press time. The sell-off coincided, almost minute-for-minute, with confirmation that Israel had conducted large-scale air-strikes on Iranian nuclear installations, sending ripples through every major asset class. Why Is Bitcoin Going Down Today? Israel’s pre-dawn operation — its first overt attack on Iranian territory since the October-2024 raids — instantly repriced global risk. Oil futures jumped more than 10%, spot gold printed a fresh record high above $3,400 an ounce, and US equity futures slid roughly 1.5%. Bitcoin’s draw-down resembled its initial reaction to Iran’s failed missile barrage on Israel in April. Related Reading: Bitcoin Nears All-Time High as Whale Behavior Suggests Further Upside “Oil up. Gold up. Bitcoin down,” Anthony Pompliano wrote on X, noting that the pattern echoes April’s missile incident, after which “Bitcoin ended up outperforming the other two over the first 48 hours.” Bitcoin educator Peter Duan argued in a separate post that “a dip in Bitcoin happens every time there is serious geopolitical [turmoil] … In the long run, this will only push more people to Bitcoin,” pointing to the 24/7 nature of crypto trading versus the still-closed equity cash markets. Macro strategist Joe Consorti drilled down on the mechanics: “Bitcoin, S&#38;P and NDX are all being panic-sold. Crude oil, natural gas, gold and US Treasuries are all spiking higher. The flight to safety trade is here.” A fresh surge in crude is precisely what US policymakers did not need. West Texas Intermediate vaulted past $77 a barrel—its first visit to that level in four months—after Israel struck Iranian nuclear facilities, erasing much of the hard-won disinflation dividend and dragging energy back to centre stage. The contract is now more than $21 above its April trough, threatening to unwind the benign price trends that had been taking hold. This comes after US inflation data once again surprised to the upside this week. May’s Consumer Price Index rose just 0.1% on the month and 2.4% year-over-year, while core CPI matched that modest 0.1% gain and held at 2.8% on an annual basis. Producer prices told a similar tale on Thursday, with the headline PPI up only 0.1% month-over-month and 2.6% on the year, both below consensus expectations. Related Reading: Bitcoin Is Wildly Undervalued, Says Bitwise: ‘Fair Price’ Today Is $230,000 Lower fuel costs had been a cornerstone of President Trump’s strategy for reining in inflation; the renewed march higher in oil now threatens that narrative. If energy continues to climb, markets will anticipate a rebound in headline inflation and the Federal Reserve may feel compelled to postpone the rate-cut cycle traders had pencilled in for September. Bitcoin, which is acutely sensitive to fluctuations in global liquidity, often underperforms when the policy outlook tilts toward tighter financial conditions—explaining its abrupt slide alongside the spike in crude. The newsflow triggered one of the heaviest forced-liquidation washes of 2025. CoinGlass data show that roughly $1.14 billion in crypto futures positions were wiped out over the past 24 hours, $1.04 billion of which were longs, as 236,788 traders were forced out of the market. The single-largest hit was a $201 million BTC-USDT long on Binance, the biggest one-ticket liquidation since January. For Bitcoin alone, long-side liquidations totalled $443 million. For the entire crypto market, this is the worst wipe-out since"
    },
    {
      "title": "Coinbase, Shopify to Simplify Real-World Crypto Payments: Best Wallet to Join the Fray with Fiat Card",
      "link": "https://www.newsbtc.com/news/coinbase-shopify-best-wallet-fiat-card-payments/",
      "summary": "Crypto exchange Coinbase announced that it will launch its Coinbase One Card later this fall. To be offered in partnership with American Express, the card will provide up to 4% Bitcoin cashback, and zero trading fees (with a spread for the first $500 traded per month), among other goodies. According to the Coinbase One Card website, you can sign up for early access, and you&#8217;ll be notified when they start receiving applications. There are also no foreign transaction fees, and you can repay your balance using your linked bank account or crypto on Coinbase. Given the current context of increased current adoption, payment solutions like these are becoming the norm. And This puts Best Wallet’s planned Best Card in a great position to capitalize on the growing demand for crypto cards used in real-world transactions. Shopify to Start Accepting $USDC Payments Meanwhile, eCommerce platform Shopify teamed up with Coinbase and Stripe to allow shoppers to pay with the $USDC stablecoin. This option will become available in 34 countries in the coming weeks. This will be a boon to Shopify merchants as well, as they will be able to receive stablecoin payments in their preferred local currency directly in their bank accounts. Big Tech to Adopt Crypto Too Shopify isn’t the only tech company eyeing greater crypto adoption. Big names in the industry like Google, Meta, and Apple are also in talks with crypto firms about stablecoin integration. When these discussions finally come to fruition, we expect more and more people to adopt crypto. Imagine average folk using digital currencies to pay for their next iPhone, buy an app in the Google Play Store, or purchase a Facebook ad—that&#8217;s the kind of future we may have soon. And trailblazing that future is Best Wallet with its upcoming Best Card for crypto payments. With the Best Wallet Token presale supercharging the entire ecosystem with lower fees, this non-custodial wallet will more than likely become a central hub for new adopters. Best Card: Best Wallet’s Answer to the Growing Crypto Payment Cards Market Aside from Coinbase and Shopify, Best Wallet is also determined to grab its slice of the crypto payment pizza pie by offering real-world convenience through its Best Card. With it, you can use crypto to pay for basic amenities like your morning coffee or your next shopping spree. While Best Card isn&#8217;t live yet, the Best Wallet ecosystem is already feature-rich. The non-custodial crypto wallet lets you buy buy, sell, and swap coins, and even access the best crypto presales via its Token Launchpad. And the Best Wallet Token ($BEST) takes that to an entirely new level. For one, you’ll enjoy lower transaction fees across the ecosystem, get higher staking rewards, and vote on key decisions on Best Wallet. The $BEST token is available at the official Best Wallet presale page. It’s currently priced at $0.025175, but with a price increase happening in less than two days, it’s best that you act as quickly as possible. Our Best Wallet Token buying guide has all the details you need to grab the tokens. You can also stake your tokens for a 105% APY, giving you a source of passive income. The staking APY may still change as more investors lock in their tokens in the pool, though. HODLing $BEST tokens may also be a good idea if you’re banking on the project&#8217;s appreciation in a few years. According to our Best Wallet Token price prediction, $BEST could grow to $0.07 in 2030, or a 211% increase from its initial presale price. Easy Crypto Payments are Coming to a Store Near You With the growing crypto adoption staring everyone in the face, the emergence of crypto payment solutions like Best Card or Coinbase&#8217;s One Card is expected. It’s only a matter of time before regular folks start storing crypto and using these cards for everyday purchases. In this sense, Best Wallet’s Best Card is perfectly positioned to capitalize on this trend, especially if you hold its native Best Wallet Token ($BEST). With lower fees and exclusive access to presales (alongside benefits for the coming Best Card), it&#8217;s the perfect starting point for any crypto newcomer. But if you’re considering buying crypto, always ensure that you do your own research. Remember that the crypto market is highly volatile, so only invest money that you can afford to lose."
    },
    {
      "title": "Bitcoin Bears Back In Control After $110,000 Rejection, What Comes Next?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-bears-back-in-control/",
      "summary": "The Bitcoin price has suffered a violent rejection after hitting the $110,000 level, showing a clear intention of the bears to keep the digital asset from hitting new all-time highs. So far, the rejections from $110,000 have been swift and have put the bears back in control. This has given credence to calls that the Bitcoin price will fall back below the psychological level of $100,000, something that could trigger another wave of declines in the crypto market. Bitcoin Rejection At $110,000 Part Of The Plan? The Bitcoin price rejection has no doubt triggered a wave of panic among investors, many of whom believe that this is the end of the cycle. However, a crypto analyst has suggested that the pullback is part of the larger plan as the largest cryptocurrency by market cap moves on its way to new all-time highs. Related Reading: Bitcoin Risks Pullback To $105,000 After Facing Rejection Above $110,000 In the analysis, they explain that the digital asset is currently at a point where it is undergoing significant distribution, and this will explain the decline in price. The pullback in and of itself is no cause for alarm, as minor corrections after major surges are normal. In addition to this, there is a lot of accumulation going on as Bitcoin moves from the hands of old investors into the hands of new investors at a higher cost basis. The accumulation is expected to move Bitcoin into the next bullish wave. This bullish wave is the next step in the trend as the BTC price moves into place for the next price surge. Once the volume moves upward as expected, then the asset’s price is expected to follow in succession. BTC Price Could Hit $130,000 Target After Breakout Going by the analyst’s chart shared on the TradingView website, the Bitcoin price correction is not expected to last for long. Mainly, holding the $107,000 support becomes paramount at this level as this could set the launchpad point for the next bullish impulse. Related Reading: XRP Price Forms Flag Pattern Above Accumulation Zone That Points To $5 Target The completion of the accumulation phase puts the next breakout level as high as $130,000, which would be an over 20% increase from the current level. However, this may not be the end as the crypto analyst has set a swing target for as high as $150,000. As for the timeline for when this could happen, the crypto analyst places a long-term target for the end of the year 2025. But there is also the possibility that the trend would be completed sooner and the Bitcoin price could reach its target and new all-time highs before the year runs out. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "ONDO To Repeat 2024’s ‘Parabolic’ Run? Analyst Anticipates 130% Rally Soon",
      "link": "https://www.newsbtc.com/news/ondo-to-repeat-2024s-parabolic-run-analyst-anticipates-130-rally-soon/",
      "summary": "Despite failing to break out of its downtrend, ONDO could be preparing for a surge above the $2 barrier. Some analysts suggest it could repeat its 2024 playbook if it continues to hold its current levels. Related Reading: Ethereum Prepares For Massive Run After $2,800 Reclaim – ‘Up Only’ Ahead? ONDO Breakout Eyes $2 ONDO, the native token of the tokenized real-world asset (RWA) platform Ondo Finance, is attempting to reclaim a key area amid the market pullback. Notably, the cryptocurrency has struggled to hold the $1 mark since losing the area as support over three months ago. In December, the RWA token hit its all-time high (ATH) of $2.14 after US President Donald Trump’s crypto venture, World Liberty Financial (WLFI), purchased 134,216 ONDO tokens for 250,000 USDC. This propelled ONDO’s price above the $2 barrier for the first time, but the late 2024 and Q1 2025 corrections halted its bullish momentum, sending its price to the $0.60-$0.70 range. Following the late April market recovery, ONDO’s price reclaimed the $0.85 area and broke out of its multi-month downtrend. The cryptocurrency then hovered between the $0.85-$1.10 levels throughout May, hitting a three-month high of $1.13 nearly a month ago. Since then, the token has been in a one-month downtrend, dipping below its local range after the recent market pullback. However, the cryptocurrency has been attempting to reclaim this range for the past week, hitting a one-week high of $0.92 on Wednesday. Crypto analyst World of Charts highlighted the token’s performance, affirming, “after a long correction, Finally Looking Good For Midterm.” As ONDO attempts to reclaim the $0.90 area, the analyst anticipates that the cryptocurrency will soon break out of its current range and the downtrend line, forecasting a 130% rally toward the $2 barrier. 2024 ATH Repeat Coming? On Thursday, analyst Sjuul from AltCryptoGems noted ONDO’s performance over the past year, asserting, “Not sure there are many other charts looking as good on high time frames like ONDO.” He explained that “The King of RWA” is “basically holding a bullish structure since its launch,” making a series of higher lows for over a year while maintaining its ascending support trendline. Meanwhile, analyst Alex Clay suggested that ONDO could see a parabolic run based on its performance in 2024. The market watcher noted that the token is currently accumulating at the bottom of a 15-month ascending channel, which previously served as a crucial bounce point for its rally toward its ATH. As Clay explained, after reaching the channel’s upper boundary last year, ONDO saw a multi-month downtrend toward the lower boundary, before printing a higher low. This was followed by a massive rally toward the channel’s top. Related Reading: Bitcoin Eyes New Highs As Price Retests $109,000, But Analyst Warns Of Potential Pullback This year, ONDO is “following the Bullish Fractal from the previous year” after falling to the channel’s lower boundary, breaking out of the downtrend line, and registering a higher low. “These 2 reasons are more than enough to pump straight up to the channel&#8217;s top,” the analyst concluded. If history repeats, the cryptocurrency could surge toward the $2.8-$3 area. At the time of writing, ONDO trades at $0.84, a 5.2% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Will Replace Gold And Go To $1,000,000, Says Galaxy Digital CEO Mike Novogratz",
      "link": "https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Will-Replace-Gold-And-Go-To-1000000-Says-Galaxy-Digital-CEO-Mike-Novogratz.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz\" rel=\"nofollow\"> </a></p> <p>Mike Novogratz, in an interview with CNBC, said “there have been more Bitcoins lost than will be mined for the rest of eternity.\"</p> <p>"
    },
    {
      "title": "Coinbase Announces Bitcoin Rewards Credit Card, Offering up to 4% BTC Back on Everything",
      "link": "https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-BTC-Credit-Card.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything\" rel=\"nofollow\"> </a></p> <p>Coinbase is launching its first-ever branded credit card in partnership with American Express, set to roll out this fall. Called the Coinbase One Card, it will be available only to U.S. members of Coinbase One, the platform’s monthly subscription service. The card will offer 2% to 4% back in Bitcoin on everyday purchases, along with [&#8230;]</p> <p>"
    },
    {
      "title": "France’s The Blockchain Group Secures €9.7 Million More For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Frances-The-Blockchain-Group-Secures-E9.7-Million-More-For-Its-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Adam Back, TOBAM and Ludovic Chechin-Laurans back ALTBG with €9.7 million in equity and convertible bonds.</p> <p>"
    },
    {
      "title": "Bitcoin: How To Solve the Student Loan Crisis",
      "link": "https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/studentdebt.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis\" rel=\"nofollow\"> </a></p> <p>Students are already taking out mortgage-sized loans for college. The financial jiu-jitsu of pairing bitcoin with student loans can fix the student debt crisis.</p> <p>"
    },
    {
      "title": "Passport Prime: A New Security Device For a New Generation",
      "link": "https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Passport-Prime-A-New-Security-Device-For-a-New-Generation.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation\" rel=\"nofollow\"> </a></p> <p>Passport Prime from Foundation Devices gears up for a Q3 2025 release, offering NFC, 2FA, and a sleek design to boost Bitcoin security.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Altcoins Plunge, Crypto Liquidations Hit $1B Amid Israel-Iran Tensions",
      "link": "https://decrypt.co/325039/altcoins-plunge-crypto-liquidations-hit-1b-amid-israel-iran-tensions",
      "summary": "Major crypto liquidations sweep the market as altcoins plummet in response to rising tensions in the Middle East."
    },
    {
      "title": "Obama Campaign Strategist David Plouffe Joins Coinbase Advisory Council",
      "link": "https://decrypt.co/325040/obama-campaign-strategist-david-plouffe-joins-coinbase-advisory-council",
      "summary": "The political mastermind joins Trump's ex-campaign manager at Coinbase as the crypto firm deepens its bipartisan strategy."
    },
    {
      "title": "Meta Invests $14 Billion in Scale AI to ‘Deepen’ its Work on Superintelligence",
      "link": "https://decrypt.co/325031/meta-invests-14-billion-in-scale-ai-to-deepen-its-work-on-superintelligence",
      "summary": "The deal values data-labeling startup Scale AI at $29 billion, as Meta aims to catch up with rivals such as OpenAI and Google."
    },
    {
      "title": "Thai Police Arrest Chinese Suspect in $6.1 Million Bitcoin Fraud Case",
      "link": "https://decrypt.co/325028/thai-police-arrest-chinese-suspect-bitcoin-fraud-case",
      "summary": "Two Chinese victims lost their Bitcoin after a business meeting in Mae Sai district, transferring funds in two separate transactions."
    },
    {
      "title": "Coinbase Launches Bitcoin Rewards Card to Drive Subscriber Growth",
      "link": "https://decrypt.co/325025/coinbase-bitcoin-rewards-card-drive-subscriber-growth",
      "summary": "Coinbase has launched a Bitcoin rewards credit card, with possible plans to support multiple tokens over time, was told."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Amazon, Walmart, and Expedia consider issuing stablecoins to sidestep costly card fees: WSJ",
      "link": "https://cryptobriefing.com/retailers-embrace-stablecoins/",
      "summary": "<p>Retailers' stablecoin adoption could revolutionize payment systems, enhance cash flow, and challenge traditional financial networks.</p> <p>"
    },
    {
      "title": "Bitcoin slides, gold spikes after Israel strikes Iran, Israeli PM warns campaign will last as many days as needed",
      "link": "https://cryptobriefing.com/crypto-market-volatility-israel-iran/",
      "summary": "<p>Geopolitical tensions may drive investors to traditional safe-haven assets, impacting cryptocurrency markets and regional economic stability.</p> <p>"
    },
    {
      "title": "$USD1 stablecoin begins minting on TRON",
      "link": "https://cryptobriefing.com/usd1-stablecoin-minting-on-tron/",
      "summary": "<p>The minting of USD1 on TRON could enhance institutional trust and adoption, bolstering TRON's position in the global blockchain market.</p> <p>"
    },
    {
      "title": "Trump says Fed can raise rates if inflation returns, but warns Powell will be “too late for that too”",
      "link": "https://cryptobriefing.com/trump-fed-interest-rates-inflation/",
      "summary": "<p>Trump's remarks highlight ongoing tensions with the Fed, potentially impacting future monetary policy decisions and economic stability.</p> <p>"
    },
    {
      "title": "Circle brings USDC to Ripple’s network as XRP Ledger gears up for EVM-compatible sidechain this quarter",
      "link": "https://cryptobriefing.com/usdc-on-xrp-ledger-evm-sidechain/",
      "summary": "<p>The integration of USDC on XRPL and the upcoming EVM sidechain could significantly enhance XRPL's utility and attract diverse blockchain projects.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Charles Hoskinson admits, ‘What’s killing Cardano is our stablecoin situation’",
      "link": "https://ambcrypto.com/charles-hoskinson-admits-whats-killing-cardano-is-our-stablecoin-situation/",
      "summary": "<img alt=\"Charles Hoskinson admits, &#039;What&#039;s killing Cardano is our stablecoin situation&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"939\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Hoskinson-defends-Cardano.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1670\" />What’s the catch, and why is the community panicking?"
    },
    {
      "title": "Hyperliquid, ‘the first meaningful competitor’ to Binance: Jump Trading CIO",
      "link": "https://ambcrypto.com/hyperliquid-the-first-meaningful-competitor-to-binance-jump-trading-cio/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Hyperlquid-Binance-.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE gets its first Strategy-like corporate treasury firm - Will others follow suit?"
    },
    {
      "title": "Ethereum’s sharp 15% fall: Is this a classic bull trap in play?",
      "link": "https://ambcrypto.com/ethereums-sharp-15-fall-is-this-a-classic-bull-trap-in-play/",
      "summary": "<img alt=\"Ethereum&#039;s sharp 15% fall: Is this a classic bull trap in play?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-5.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A bull trap wiped out Ethereum gains - Can support hold the line?"
    },
    {
      "title": "GameStop stock tanks amid news of $1.75B Bitcoin bet: ‘Insane!’",
      "link": "https://ambcrypto.com/gamestop-stock-tank-amid-news-of-1-75b-bitcoin-bet-insane/",
      "summary": "<img alt=\"GameStop shares tank 11.7% amid news of $1.75B Bitcoin bet: &#039;Insane!&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"723\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/GameStop-Announces-Proposed-Private-Offering.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1286\" />Is GameStop’s crypto pivot backfiring?"
    },
    {
      "title": "Top 9 presales to look out for in June 2025",
      "link": "https://ambcrypto.com/top-9-presales-to-look-out-for-in-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1469\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/john-mcarthur-ROQzKIAdY78-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A presale refers to an early sale of tokens before they are listed on public [&#8230;]"
    }
  ]
}