{
  "CoinDesk": [],
  "Cointelegraph": [
    {
      "title": "How crypto scammers used dating apps to steal $36.9M and launder it to Cambodia",
      "link": "https://cointelegraph.com/explained/how-crypto-scammers-used-dating-apps-to-steal-369m-and-launder-it-to-cambodia?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy80ODQ5ODZkOTY2ZTFiOTNmN2M5NmM4NWIzZGU5OTYxOS5qcGc=.jpg\" /></p><p> Looking for love lost $36.9 million to crypto scammers: A story of how Axis Digital turned sweet words into stolen coins and laundered it all to Cambodia. </p>"
    },
    {
      "title": "TRON strengthens its role in stablecoin settlements: Mid-year report",
      "link": "https://cointelegraph.com/news/tron-strengthens-its-role-in-stablecoin-settlements-mid-year-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Y2MmEtYmRlYi03ZGY4LWIzYWItMWNlNDRiYTkwMGUy.jpg\" /></p><p>TRON’s strong position in the stablecoin market continues with steady user growth, transaction volume and ecosystem expansion.</p>"
    },
    {
      "title": "‘Crypto Week’ approaches: Will these three pro-crypto bills pass?",
      "link": "https://cointelegraph.com/news/crypto-week-will-three-pro-crypto-bills-pass?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5Njk5YWYtNzBkZS03YmIzLWJhZjktMmVmMGQwYmQzYWMy.jpg\" /></p><p>“Crypto week” is approaching as lawmakers in Washington aim to pass three bills related to digital assets.</p>"
    },
    {
      "title": "SharpLink buys 10,000 ETH from Ethereum Foundation as Ether reclaims $3K",
      "link": "https://cointelegraph.com/news/sharplink-gaming-buys-10-000-eth-from-ethereum-foundation-as-ether-reclaims-3k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2U1OGQtMmM3Yy03MmQwLThjZTEtMzAyMDhjZmIxZDNj.jpg\" /></p><p>The Ethereum Foundation sold 10,000 ETH to SharpLink Gaming at a steep discount just before Ether briefly surpassed $3,000.</p>"
    },
    {
      "title": "US Congress prepares for ‘Crypto Week’ as industry urges lawmakers to act",
      "link": "https://cointelegraph.com/news/u-s-congress-prepares-for-crypto-week-as-industry-urges-lawmakers-to-act?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWNhZjYtNDc3MS03YTE5LWJlY2MtMTRjYjMzZTYyMTk3.jpg\" /></p><p>As Congress prepares to debate three major crypto bills during “Crypto Week,” the crypto community and advocacy groups are racing to turn momentum into real legislation.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Ethereum futures volume surpasses Bitcoin for first time amid 5 month high",
      "link": "https://cryptoslate.com/ethereum-futures-volume-surpasses-bitcoin-for-first-time-amid-5-month-high/",
      "summary": "<p>Ethereum’s daily futures trading volume exceeded Bitcoin’s for the first time on July 10, a landmark development that coincided with the asset’s price testing the $3,000 level. The technical flip in the derivatives market indicates a potential shift in trader sentiment and capital allocation, lending credence to narratives of a changing market structure. Data from [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation denies selling assets amid ETH’s climb past $3,000",
      "link": "https://cryptoslate.com/ethereum-foundation-denies-selling-assets-amid-eths-climb-past-3000/",
      "summary": "<p>Ethereum has surged past the $3,000 mark for the first time since February, riding on the renewed momentum sweeping across the broader crypto market. According to data, ETH&#8217;s price peaked at $3,033 during the last 24 hours amid a 9% increase. However, its value has slightly retraced to $2,991 as of press time. This [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin ETFs see record $1.2B inflow as market hits all-time high in dollars",
      "link": "https://cryptoslate.com/bitcoin-etfs-see-record-1-2b-inflows-as-market-hits-all-time-high-in-dollars/",
      "summary": "<p>US-based spot Bitcoin ETFs saw a dramatic uptick in investor activity as the top crypto price reached a new all-time high of over $118,000, at least in dollars. According to SoSoValue data, the 12 funds saw cumulative inflows of $1.2 billion, the second strongest daily performance since launch in 2024, and the best this year. [&#8230;]</p> <p>"
    },
    {
      "title": "European watchdog warns of ‘inadequate’ Malta crypto licensing for MiCA regulations",
      "link": "https://cryptoslate.com/european-watchdog-warns-of-inadequate-malta-crypto-licensing-for-mica-regulations/",
      "summary": "<p>The European Securities and Markets Authority (ESMA) has raised red flags over Malta’s handling of license approvals under the EU’s Markets in Crypto-Assets (MiCA) regulation. In a peer review report released on July 10, ESMA highlighted deficiencies in how the Malta Financial Services Authority (MFSA) approved a recent crypto asset service provider (CASP), urging tighter [&#8230;]</p> <p>"
    },
    {
      "title": "Investors rush into historic PUMP pre-sale while whales quietly prepare for a crash",
      "link": "https://cryptoslate.com/investors-rush-into-historic-pump-pre-sale-while-whales-quietly-prepare-for-a-crash/",
      "summary": "<p>Solana-based memecoin platform Pump.fun is preparing for what could become one of the largest token sales in crypto history. The project aims to raise $1.32 billion through its upcoming PUMP token offering, potentially securing the third spot among the highest-ever fundraising events in the industry. According to data from Cryptorank, Pump.fun&#8217;s fundraising goal would put [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin MVRV Oscillator Predicts First Sell Pressure Level At $130,900 – Details",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-mvrv-oscillator-predicts-first-sell-pressure-level-at-130900-details/",
      "summary": "Bitcoin has officially broken through its previous all-time high of $112,000, surging to $118,000 just hours ago and entering uncharted territory for the first time since late May. The breakout confirms bullish momentum after weeks of consolidation and failed attempts, with price action now showing clear strength. With the psychological and technical barrier of $112K cleared, many analysts believe this move could mark the beginning of Bitcoin’s next expansive rally. Related Reading: Altcoins Jump Off Critical Support Level – Relief Or Reversal? Bulls are firmly in control, and on-chain metrics support this breakout narrative. According to fresh data from CryptoQuant, the MVRV (Market Value to Realized Value) Extreme Deviation Pricing Bands currently stand at 2.25. Historically, Bitcoin enters the overheated zone around 3.0 or higher, suggesting there is still room for growth before reaching excessive valuation territory. This metric, which measures the deviation between market price and realized value, helps identify when BTC is overbought or undervalued relative to past performance. At current levels, the data points to continued upside potential without major overheating concerns, fueling confidence that this breakout could extend further. Bitcoin Enters Expansion Phase As Market Eyes $130K After weeks of tight consolidation below the $110,000 mark, Bitcoin has finally broken out, signaling the start of a new market phase. The breakout above previous highs has reignited investor optimism, not only for BTC but also for the broader altcoin market, with many altcoins now pushing above key resistance levels for the first time in months. This move comes amid growing anticipation of a weakening US dollar and renewed inflationary pressures as Washington adopts looser fiscal policies. The market is increasingly pricing in the effects of tax cuts, high government spending, and dovish political rhetoric—all of which create a favorable environment for risk assets like Bitcoin. Still, the macro backdrop is not without risks. US Treasury yields remain elevated, flashing warnings of underlying systemic stress in credit markets. This tension underscores the fragility of the current rally and the importance of monitoring fundamental shifts. Top analyst Axel Adler shared insights using the MVRV oscillator, a model that compares Bitcoin’s market value to its realized value. According to Adler, historical data over the last four years suggests that when MVRV reaches 2.75, Bitcoin tends to face its first wave of meaningful selling pressure. If the same pattern holds true in this cycle, Bitcoin could reach approximately $130,900 before seeing notable profit-taking activity. While the current MVRV reading remains below that threshold, the model offers a clear signal of where long-term holders may begin offloading. Until then, the breakout sets the stage for a potential leg higher, with bulls now in control, pushing toward price discovery and a possible test of the $130K zone. Related Reading: Ethereum Back At Range Highs: Breakout Above $2,800 Could Ignite Altseason BTC Enters Uncharted Territory With Strong Momentum Bitcoin has officially broken into price discovery after blasting through its all-time high resistance near $112,000. The 3-day chart shows a massive bullish candle pushing BTC up to $118,683, representing an 8.94% gain in the last session. This breakout is the first clear sign of a strong bullish continuation after weeks of sideways consolidation below key resistance. The chart highlights a textbook breakout structure. BTC respected the $103,600 and $109,300 support zones multiple times throughout May and June before finally gaining enough momentum to pierce through the upper resistance. The recent surge came with a noticeable spike in volume, adding confidence to the breakout’s sustainability. Moving averages also confirm the bullish trend. The 50, 100, and 200 SMA lines remain aligned upward with increasing separation, suggesting that market structure remains strong and trend continuation is likely. Bitcoin is now trading well above all major moving averages, reinforcing the strength of the rally. Related Reading: Bitcoin 30-Day Average Funding Rate Drops – Bullish Setup Takes Shape With no historical resistance levels above, BTC enters a price discovery phase. The next psychological target for bulls will likely be $120,000, followed by the MVRV-based resistance level around $130,900. As long as BTC holds above $112K, the momentum remains decisively in favor of the bulls. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Missed Bitcoin’s Pump? Kraken’s Trading Tools Help You Surf the Altcoin Surge",
      "link": "https://www.newsbtc.com/news/missed-bitcoins-pump-kraken-helps-you-surf-the-altcoin-surge/",
      "summary": "Bitcoin’s up nearly 8.5% this week, approaching $120K and clocking over $123B in 24h volume. But now, the real volatility (and upside) is rotating into the best altcoins. Traders are chasing faster gains down the cap table (memes, AI tokens, new L1s), and Kraken’s making those trades easier to find and execute. If you’re looking for what’s next, not what already happened, Kraken’s where you start. Altcoin Rotation Is Heating Up Bitcoin&#8217;s ripping, but Ethereum’s catching up fast. $ETH is up over 17% this week and now flirting with the $3K mark. Historically, when $ETH gains momentum, the altcoin floodgates tend to open, and that’s exactly what we’re seeing. BTC dominance is also slipping below 65%, a key signal that traders are rotating into higher-beta plays. On Kraken, it’s not just the best meme coins flying. In the past 24 hours, Omni ($OMNI) pumped +174%, Matchain ($MAT) +66%, and Dolomite ($DOLO) +53.35%. Even coins like Renzo ($REX), Initia ($INIT), and Unicorn Fart Dust ($UFD) are putting up 30–50% days. With many low-cap, high-velocity tokens, Kraken gives you the first shot at these rotations before the crowd catches on. Kraken Moves with the Market In the past three days alone, Kraken has listed $HBAR, $TANSSI, and $EPT. These additions align perfectly with what traders are rotating into: AI, Layer 2 (L2) infrastructure, and real-world asset plays. That speed and narrative alignment isn’t a fluke. Kraken just climbed to #2 globally in Kaiko’s Q2 2025 Exchange Rankings, a data-driven benchmark that weighs market quality, regulatory strength, liquidity, and transparency. Kraken scored high across the board, particularly on depth and execution reliability – two pillars that matter most when chasing volatile small caps. For traders trying to stay in sync with the flow of capital, Kraken is a front-row seat to what’s next. Built for the Way You Trade Altcoins Catching altcoin moves isn’t just about spotting the right tokens. It’s about having the tools to act on them fast. With 452+ listed assets, Kraken exposes you to everything from the best low-cap coins to AI, L2s, and real-world asset plays, all in one place. Kraken lets you buy instantly using bank transfers, cards, Apple Pay, Google Pay, or PayPal. So you’re never stuck on the sidelines when the market starts moving. You can go long on a momentum play, hedge it with 300+ derivatives, or stake your bags across 20+ supported assets, including newer staking listings like $SUI. Need flexibility? Kraken offers up to 5x margin and consistently deep liquidity, with 88% of 2024 orders filling at the top of the book, minimizing slippage when every second counts. For altcoin traders also tracking macro trends, Kraken’s xStocks expansion brings tokenized equities like TSLA, AAPL, and SPY into play, bridging TradFi and crypto in real time. Alt Season Needs a Platform Bitcoin lit the fuse, but the real action is in altcoins. With capital rotating fast and new narratives popping up daily, you need a platform that keeps up. Kraken&#8217;s deep listings, fast access to new tokens, and pro-grade trading tools give you everything you need to execute quickly and confidently when a window opens. This content is for informational purposes only and does not constitute financial advice. Always do your own research (DYOR) before making any investment decisions. All crypto assets mentioned in this piece are volatile and carry risk."
    },
    {
      "title": "Dogecoin Chart Is ‘One Of The Best’ In Crypto—$1 Remains Likely: Analyst",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-chart-one-of-the-best-crypto/",
      "summary": "Dogecoin hovered near $0.20 on Friday, nursing a weekly gain of about 17 percent and a 24-hour trading volume above $2 billion as traders digested a late-June livestream by technical analyst Kevin, who argued that the meme-coin’s structure “has to be one of the best-looking altcoin charts out there.” Dogecoin Double Bottom Could Trigger $1 During the one-hour session Kevin highlighted a textbook double-bottom that printed on Dogecoin’s weekly chart exactly at the confluence of the 200-week simple and exponential moving averages, the 0.382 Fibonacci retracement of the 2023–2025 advance, and a long-term up-trend line dating back to the 2022 bear-market trough. Entering at that zone, he said, “the risk-reward here is phenomenal,” noting that a tight stop just below the cluster implied limited downside while upside targets stretched toward the previous cycle’s highs. Kevin told viewers the weekly momentum profile supports a larger breakout. Money-flow on Market Cipher is curling higher for the first time in more than a year; the MACD is preparing to cross bullish from a higher low; and the stochastic RSI has turned up from mid-range. On the monthly chart, relative strength continues to print higher highs and higher lows, and the stock-RSI “is hanging on, ready to push back up,” he said, adding that the entire structure “looks freakin’ great” for a sustained move once Bitcoin clears its own resistance band near $116,000. Related Reading: Dogecoin To $3.94 This Cycle? This Chart Says It’s No Meme His price map for the coming months begins with a purple resistance box between $0.94 and $1.31—the 2021 peak plus the 1.618 extension of the 2022–24 base. “I’d be pretty shocked if Dogecoin can’t at least tag 94 cents,” Kevin said, stressing that a decisive break of a dollar would likely attract a new wave of retail traders and algorithmic trend-followers. He stopped short of offering an end-of-cycle target, but insisted “$1 remains likely,” conditional on Bitcoin extending toward the $150,000 region and—crucially—on macro tail-winds such as an end to quantitative tightening by the Federal Reserve. Even so, Kevin warned against complacency. Dogecoin’s intraday spike coincided with Bitcoin’s test of a major Fib cluster at $116,000, while USDT dominance hit golden-pocket support—levels that could spark a near-term cooldown. “Don’t be fooled by green candles,” he said, reminding viewers that meme-coins “can get crushed even in bull markets” and advising strict risk management: take partial profits after big thrusts, move stops to break-even, and “rinse and repeat.” Related Reading: Dogecoin Resistance Walls Ahead: Analyst Flags 3 Key Levels Beyond pure chart work, Kevin framed Dogecoin as a perpetual beneficiary of retail psychology. “You can walk into any gas station and someone owns Doge,” he quipped. “It’s the retail darling—it always will be—especially when new money shows up with deeper pockets than last time.” For now, price action is validating that thesis. If the double-bottom holds and macro conditions align, the analyst argues, Dogecoin could once again headline the next alt-season—this time with a dollar tag that traders in the last cycle could only meme about. At press time, DOGE traded at $0.1978. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Research Predicts $160,000 Bitcoin By EOY—If Treasury Firms Hold",
      "link": "https://www.newsbtc.com/bitcoin-news/research-160000-bitcoin-eoy-if-treasury-firms-hold/",
      "summary": "A sweeping new research report by Ben Harvey and Will Clemente III, commissioned by market maker Keyrock, projects that Bitcoin could reach $160,000 by the end of 2025—but only if the capital structure supporting Bitcoin Treasury Companies (BTC-TCs) remains intact. The research, “BTC Treasuries Uncovered: Premiums, Leverage, and the Sustainability of Proxy Exposure,” dissects the capital structures, market impact, and debt profiles of the fast-growing cohort of “Bitcoin Treasury Companies” (BTC-TCs), led by Strategy (the renamed MicroStrategy). The Impact Of Bitcoin Treasury Firms Harvey and Clemente open with a startling figure: “Bitcoin Treasury Companies have accumulated around 725,000 BTC, equivalent to 3.64 percent of the entire BTC supply.” Much of that hoard sits with Strategy’s 597,000-coin trove, but the analysts track more than a dozen follow-on players—from Marathon Digital and Metaplanet to newer entrants such as Twenty One Capital—whose combined exposure now outstrips US spot-ETF holdings by more than half. Related Reading: Bitcoin Is One Candle Away From $141,300 Breakout, Chart Master Warns Yet the report’s headline forecast is explicitly conditional. Keyrock’s bull case assigns a thirty-percent probability that global liquidity remains flush, institutional demand accelerates, and Bitcoin rallies fifty percent past today’s levels, “pushing BTC to over $160 k by EOY.” That outcome rests on the fragile flywheel of net-asset-value premiums: BTC-TC equities still trade, on average, at a seventy-three-percent premium to the dollar value of the coins they custody. Those premiums let boards issue new shares “accretively,” convert sentiment into fresh BTC, and—crucially—service the $33.7 billion in debt and preferred stock the sector has rung up to fund its buying binge. No company illustrates the reflexive loop better than Strategy. Since August 2020, Michael Saylor has driven Bitcoin-per-share (BPS) up eleven-fold, an annualized sixty-three-percent run rate that dwarfs the 6.7 percent CAGR needed to justify the firm’s current ninety-one-percent NAV premium. “If an investor believes that Strategy’s BPS growth rates will hold long-term,” the authors contend, “holding MSTR would be far more beneficial in BTC terms than holding spot BTC.” Still, that calculus assumes the equity premium stays afloat; if sentiment turns, dilution flips from accretive to punitive overnight. Debt maturities pose the next stress point. BTC-TCs owe a wall of convertible notes in 2027-28. Harvey and Clemente calculate that Strategy alone has issued $8.2 billion of the cohort’s $9.5 billion in debt; Marathon follows at $1.3 billion. Most instruments carry zero-to-low coupons and conversion prices well below current share levels, but a deep Bitcoin drawdown could drive equities under those strikes, forcing firms to repay in cash or refinance at far harsher terms. “Since many BTC-TC valuations are tightly correlated to Bitcoin price performance,” the authors warn, “a sharp BTC drawdown could drive down equity value, increasing the risk that conversion thresholds are breached.” Related Reading: Last Time This Happened, Bitcoin Jumped $50,000—Is History Repeating? The report splits the universe into cash-flow-generative names such as Metaplanet, CoinShares, and Boyaa Interactive—each with eight or more quarters of runway—and capital-dependent players like Marathon, Nakamoto, and DeFi Technologies, which could face dilution above three percent per quarter merely to stay solvent if premiums persist. Should those premiums compress, equity issuance “becomes purely dilutive,” and treasury companies could be forced to sell Bitcoin, undermining the proxy thesis that justifies their existence. The Base Case Keyrock’s base case, to which it assigns the highest probability, envisions Bitcoin finishing 2025 around $135,000, with NAV premiums cooling into a thirty-to-sixty-percent range. In that environment, well-managed treasuries still out-perform spot, but the leverage trade loses its shine. The bear scenario—assigned the lowest but non-trivial odds—combines a twenty-percent Bitcoin drawdown with a glut of new treasury listings that flood the market with supply. In that world, premiums vanish, refinancing windows slam shut, and “the entire investment case for BTC-TCs comes under pressure.” Harvey and Clemente do not dismiss the BTC-TC model; rather, they frame it as a high-beta overlay that amplifies both the upside and the solvency risk inherent in Bitcoin itself. They credit Saylor’s “Bitcoin yield” thesis—using premium-funded share issuance to compound coin holdings—as a demonstrably effective strategy to date, but caution that it relies on a delicate equilibrium of bullish sentiment, cheap capital, and meticulous execution. “The premium to NAV is of the utmost importance here,” the study concludes, “assuming a BTC-TC doesn’t have a core operating business that can cover debt payments, or is entirely free of debt payments altogether.” Whether Bitcoin can sprint to $160,000 by 31 December hinges less on hash-rate projections or macro modeling than on the continued faith of equity investors willing to pay a dollar-fifty for a dollar of embedded BTC. If those investors blink—if premiums fade or convertible maturities collide with a broad risk-off shift—the leverage that has propelled treasury companies to date could flip, turning “one of the best performing equities on the planet” into the market’s most crowded exit. For now, Keyrock’s research leaves readers with a simple countdown: hold the line, and the path to price discovery remains intact; lose it, and the proxy trade could unwind long before the New Year’s fireworks. At press time, BTC traded at $117,788. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Open Interest Climbs Above December 2024 Levels, Here’s What Happened Last Time",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-open-interest-climbs/",
      "summary": "The Bitcoin open interest has risen rapidly once again, with the price pushing above previous peaks to new all-time highs. The BTC price has also stayed over the $100,000 mark for an extended period of time, triggering a new wave of confidence that the cryptocurrency has found its bottom. This has led to crypto traders making their bets and driving the open interest up, pushing it back above December 2024 levels and May 2025 peaks. Bitcoin Open Interest Crosses $70 Billion Again Back in December 2024, the Bitcoin open interest had recorded a new milestone after the volume rose to over $70 billion, marking a new all-time high at the time. The Bitcoin price had also risen sharply at this time and was able to hit $100,000 for the first time in history, triggering even more interest in the asset. Related Reading: Last Crash Before The Surge: Why Bitcoin Is Set To Drop Below $107,000 However, once both the price and the open interest hit these milestones, it wasn’t long before the shorters began to take over the market. The Bitcoin price quickly plummeted back down below $100,000, and over the next few months, open interest would crash back down to the $40 billion territory, resulting in a 40% loss by May 2025. Now, once again, the Bitcoin open interest has crossed the $70 billion mark, sitting close to the $77 billion peak recorded back in May 2025, data from Coinglass shows. In the same vein, the BTC price has been able to maintain above $100,000 and has hit a new all-time high of $117,000. Going by historical performance, it is likely that the Bitcoin price will continue to rise from here, but this break to new all-time highs could carry bearish implications. This is because it is possible that the trend from December 2024 could play out once again. If this happens, then the Bitcoin price could retrace after hitting new highs, an expected correction as shorts pile up. BTC Price Risks Another Crash As the Bitcoin open interest continues to rise and the price has already broken out to new highs, the expectations of a downtrend have become stronger. reported that crypto analyst FriendlyRox expects the Bitcoin price to crash by almost 50%, putting the target as low as $60,000 by the time it’s done. Related Reading: Pundit Says XRP’s Rise To $1,000 Will Happen A Lot Sooner Than Anticipated Crypto analyst and market expert Capo of Crypto has also joined the train, predicting a notable crash event that will send Bitcoin below $100,000 and obliterating altcoins in the process. This comes as institutions are piling into the crypto market, with Bitcoin in the lead, and Capo forecasts a possible ‘Black Swan’ event like the COVID crash. Featured image from Dall.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Hits New All Time High of $113,900 as Adoption Accelerates",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-of-113000-as-Adoption-Accelerates.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates\" rel=\"nofollow\"> </a></p> <p>Bitcoin’s surge to $113,900 signals rising adoption, and Fed rate cut expectations.</p> <p>"
    },
    {
      "title": "Rumble Partners with MoonPay to Launch Bitcoin Wallet for Creators",
      "link": "https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Rumble-Partners-with-MoonPay-to-Launch-Bitcoin-Wallet-for-Creators-Today.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators\" rel=\"nofollow\"> </a></p> <p>Today, Rumble announced an exclusive partnership with MoonPay to launch a Bitcoin and crypto wallet that will let creators handle their earnings outside traditional banking systems.&#160; The new Rumble Wallet, set to arrive in Q3 2025, will use MoonPay&#8217;s infrastructure to power all digital currency transactions on the platform. Users will be able to buy, [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Technology Increases Bitcoin Holdings to $101 Million",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million\" rel=\"nofollow\"> </a></p> <p>KULR now holds 1,021 BTC, reporting a 291% BTC yield year to date.</p> <p>"
    },
    {
      "title": "K Wave Media Raises $1 Billion For Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/K-Wave-Media-Raises-1-Billion-For-Bitcoin-Treasury-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>K Wave Media Inc. has announced a $500 million convertible note agreement with Anson Funds to support its Bitcoin treasury strategy. This financing follows an earlier $500 million standby equity purchase agreement with Bitcoin Strategic Reserve, bringing the company’s total capital capacity to $1 billion. As part of the Anson agreement, K Wave will issue [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: Sidechains",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-sidechains",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Layer-2-Sidechains.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-sidechains\" rel=\"nofollow\"> </a></p> <p>The fourth article in the Bitcoin Layer 2 series. This article covers sidechains, a concept originally proposed by the founders of Blockstream.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin ETFs Post Second-Biggest Day Ever: Why It Matters",
      "link": "https://decrypt.co/329677/bitcoin-etfs-post-second-biggest-day-ever-why-it-matters",
      "summary": "BlackRock’s IBIT led Thursday’s ETF inflows with $448.5 million, as capital consolidated into top issuers despite outflows from GBTC."
    },
    {
      "title": "Bitcoin Price Reaches Pivotal Moment—Is $120K Next?",
      "link": "https://decrypt.co/329674/bitcoin-price-reaches-pivotal-moment-is-120k-next",
      "summary": "Bitcoin hit a new all-time high above $118,000 as institutions drove the rally—while analysts predicted a $120K target by month-end."
    },
    {
      "title": "$1.14B in Crypto Shorts Rekt as Ethereum Tops $3K For First Time Since February",
      "link": "https://decrypt.co/329673/1-14b-in-crypto-shorts-rekt-as-ethereum-tops-3k-for-first-time-since-february",
      "summary": "Ethereum topped $3,000 for the first time since February, following the largest single day for ETH exchange-traded fund inflows."
    },
    {
      "title": "Malicious Pull Request Inserted Into Ethereum Code Extension: Research",
      "link": "https://decrypt.co/329667/malicious-pull-request-inserted-into-ethereum-code-extension-research",
      "summary": "Cybersecurity firm ReversingLabs uncovered two lines of malicious code in an update forETHCode, an open source suite of tools."
    },
    {
      "title": "Florida AG Investigates Robinhood Over Crypto Pricing Claims",
      "link": "https://decrypt.co/329664/florida-ag-investigates-robinhood-crypto-pricing",
      "summary": "Florida's AG said Robinhood's payment-for-order-flow model may mislead users by hiding true crypto costs behind marketing claims."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Grayscale challenges SEC stay on approval of BTC, ETH, XRP, ADA large-cap fund",
      "link": "https://cryptobriefing.com/sec-grayscale-approval-large-cap-fund/",
      "summary": "<p>Grayscale's challenge to the SEC's stay highlights ongoing regulatory tensions, potentially impacting future crypto fund approvals and market dynamics.</p> <p>"
    },
    {
      "title": "Bitcoin creator Satoshi Nakamoto may now be richer than Dell CEO Michael Dell",
      "link": "https://cryptobriefing.com/satoshi-nakamoto-wealth-bitcoin/",
      "summary": "<p>Satoshi Nakamoto's rising wealth underscores Bitcoin's potential to disrupt traditional wealth hierarchies and influence global financial systems.</p> <p>"
    },
    {
      "title": "REX Shares files for 2X leveraged TRON ETF",
      "link": "https://cryptobriefing.com/2x-tron-etf-launch/",
      "summary": "<p>The filing highlights the increasing diversification in crypto investment products, potentially broadening market participation and innovation.</p> <p>"
    },
    {
      "title": "Pump.fun acquires Kolscan ahead of PUMP token launch",
      "link": "https://cryptobriefing.com/pump-fun-acquires-kolscan-onchain-wallet-tracking/",
      "summary": "<p>Pump.fun acquires wallet tracker Kolscan to boost social trading tools ahead of its PUMP token ICO on July 12.</p> <p>"
    },
    {
      "title": "Why is Bitcoin going up today? Rising US demand, strong ETF inflows, and steady corporate accumulation",
      "link": "https://cryptobriefing.com/bitcoin-price-surge-etf-corporate/",
      "summary": "<p>Bitcoin's sustained growth signals its maturation as a stable asset, attracting institutional interest amid economic and geopolitical uncertainties.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Hyperliquid breaks ATH at $46.32 – Can HYPE sustain its run?",
      "link": "https://ambcrypto.com/hyperliquid-breaks-ath-at-46-32-can-hype-sustain-its-run/",
      "summary": "<img alt=\"HYPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-3.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Hyperliquid whales and Assistance Fund continue accumulation despite price trading at the peak."
    },
    {
      "title": "Top 12 Telegram games of July 2025",
      "link": "https://ambcrypto.com/top-12-telegram-games-of-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/andrey-metelev-DEuansgqjns-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Telegram has become much more than just a messaging platform, and its importance in the [&#8230;]"
    },
    {
      "title": "Top 11 casinos to watch out for in July 2025",
      "link": "https://ambcrypto.com/top-11-casinos-to-watch-out-for-in-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1440\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/chris-liverani-MJX7-BAdkt0-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Crypto casinos are online gambling platforms similar to traditional casinos, offering players live dealer games, [&#8230;]"
    },
    {
      "title": "Top 11 staking platforms of July 2025",
      "link": "https://ambcrypto.com/top-11-staking-platforms-of-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/markus-spiske-vrbZVyX2k4I-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Staking is the system of earning rewards and interest by the process of holding or [&#8230;]"
    },
    {
      "title": "Top 9 cloud mining platforms in July 2025",
      "link": "https://ambcrypto.com/top-9-cloud-mining-platforms-in-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1282\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/joshua-sortino-LqKhnDzSF-8-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Cloud mining is an innovative method by which individuals can participate in the process of [&#8230;]"
    }
  ]
}