{
  "CoinDesk": [
    {
      "title": "Bitcoin Holds Above $105K Despite Donald Trump’s Threats Against Elon Musk",
      "link": "https://www.coindesk.com/markets/2025/06/07/bitcoin-holds-above-usd105k-despite-donald-trump-s-threats-against-elon-musk",
      "summary": ""
    },
    {
      "title": "Ether Holds Steady Above $2,500 as ETF Demand Signals Institutional Confidence",
      "link": "https://www.coindesk.com/markets/2025/06/07/ether-holds-steady-above-usd2-500-as-etf-demand-signals-institutional-confidence",
      "summary": ""
    },
    {
      "title": "Coinbase, BiT Global End Legal Fight Over WBTC Delisting",
      "link": "https://www.coindesk.com/policy/2025/06/07/coinbase-bit-global-end-legal-fight-over-wbtc-delisting",
      "summary": ""
    },
    {
      "title": "Solana 's SOL Rebounds as Buyers Step In Above $147",
      "link": "https://www.coindesk.com/markets/2025/06/07/solana-s-sol-rebounds-from-usd147-support-as-double-bottom-pattern-signals-possible-breakout",
      "summary": ""
    },
    {
      "title": "Deutsche Bank Considers Stablecoin or Joining Industry-Led Initiative, Exec Says",
      "link": "https://www.coindesk.com/business/2025/06/07/deutsche-bank-considers-stablecoin-or-joining-industry-led-initiative-exec-says",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "10 signs an airdrop is a scam — and how to stay safe",
      "link": "https://cointelegraph.com/news/fake-airdrops-and-how-to-avoid-them?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzBjYmQtMzExYS03M2IzLWFlNDMtMjc0YzZmYTJlMTkw.jpg\" /></p><p>Fake airdrops are designed to drain users’ funds from their wallets. You need to be well-versed in airdrop scams to protect your crypto wallet.</p>"
    },
    {
      "title": "Gaming data is the next AI battleground",
      "link": "https://cointelegraph.com/news/gaming-data-next-ai-battleground?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzExNWYtNWZiZC03NWY4LTg4OGItODAwYjM2M2NhMDg5.jpg\" /></p><p>Gaming’s behavioral data is rapidly becoming the most sought-after resource in AI. Game telemetry fuels next-gen AI agents for everything from logistics to finance. The battle for gaming data is on.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Michael Saylor teases fresh Bitcoin buy after $1B stock offering",
      "link": "https://cointelegraph.com/news/strategy-bitcoin-buy-signal-stock-offering?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzJkZTYtNTQwNy03ZjE0LTk3Y2EtMjJiNGFhODBmZDIx.jpg\" /></p><p>“Send more Orange,” Strategy executive chairman Michael Saylor wrote on X, signaling another Bitcoin purchase from the company.</p>"
    },
    {
      "title": "‘Bitcoin Family’ revamps security after crypto crime wave",
      "link": "https://cointelegraph.com/news/bitcoin-family-splits-seed-phrase-global-security-upgrade?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzA4N2YtNTE2Zi03MGI1LThlNGItN2ZmZmEzMjU4ODQ5.jpg\" /></p><p>After a wave of crypto crimes, Didi Taihuttu and his “Bitcoin Family” revamped their security by splitting their Bitcoin seed phrase across four continents.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Proof-of-Reserves: Is it applicable to MicroStrategy?",
      "link": "https://cryptoslate.com/proof-of-reserves-is-it-applicable-to-microstrategy/",
      "summary": "<p>The following is a guest post and analysis from Shane Neagle, Editor In Chief fromThe Tokenist. On Tuesday, Michael Saylor, the Executive Chairman of MicroStrategy (NASDAQ: MSTR), riled up the Bitcoin part of the internet. At an event adjacent to Bitcoin 2025 conference in Las Vegas, Saylor was asked whether the company (rebranded as Strategy) [&#8230;]</p> <p>"
    },
    {
      "title": "Bigger than Coca-Cola? If Tether went public, it could reach a $515B valuation",
      "link": "https://cryptoslate.com/bigger-than-coca-cola-if-tether-went-public-it-could-reach-a-515b-valuation/",
      "summary": "<p>A recent analysis posted by Artemis CEO Jon Ma has sparked discussion about Tether’s potential market value, suggesting that if the company were to go public, its valuation could reach $515 billion. This figure would place Tether among the world’s largest corporations by market capitalization, ahead of well-known names such as Costco and Coca-Cola. Jon [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto was never about decentralization; It is about Pluralism",
      "link": "https://cryptoslate.com/crypto-was-never-about-decentralization-it-is-about-pluralism/",
      "summary": "<p>The following is a guest post and opinion from John deVadoss, Co-Founder of the InterWork Alliancez. “Decentralization” is crypto’s all-purpose slogan, yet the word never appears in the 2008 Bitcoin white paper. What Satoshi outlined was narrower and more radical: a peer-to-peer system that swaps institutional trust for publicly auditable cryptographic proof. Trust can be [&#8230;]</p> <p>"
    },
    {
      "title": "‘Come to Dubai, habibi,’ what’s luring crypto companies to the Middle East?",
      "link": "https://cryptoslate.com/come-to-dubai-habibi-whats-luring-crypto-companies-to-the-middle-east/",
      "summary": "<p>Welcome to Slate Sundays, ’s new weekly feature showcasing in-depth interviews, expert analysis, and thought-provoking op-eds that go beyond the headlines to explore the ideas and voices shaping the future of crypto. One of the main takeaways from TOKEN2049 earlier this year was that the UAE, and Dubai in particular, is the hottest spot (quite literally) [&#8230;]</p> <p>"
    },
    {
      "title": "The ‘Bitcoin Family’ has split and hidden seed phrase across 4 continents amid rising kidnappings",
      "link": "https://cryptoslate.com/the-bitcoin-family-has-split-and-hidden-seed-phrase-across-4-continents-amid-rising-kidnappings/",
      "summary": "<p>The ‘Bitcoin Family’ has completely overhauled its security measures amid rising cases of crypto-related kidnappings, according to a CNBC report. The family, which sold all their belongings in 2017 to invest in Bitcoin (BTC) and now travels around the world, has taken extreme measures amid a rise in perceived threats. This includes storing parts of [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Whale Breaks Silence With $26 Million Transfer — What’s Going On?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-whale-breaks-silence-with-26-million-transfer-whats-going-on/",
      "summary": "Based on reports, a long-dormant Bitcoin whale made a surprise move this week, snapping up 250 BTC for about $26.37 million. It’s the first time this wallet has shown activity in two years. Related Reading: Bitcoin To Hit $180,000 In 2025? Analyst Highlights The Trigger The purchase has stirred talk among traders and on-chain analysts alike. Some see it as a sign that big players are getting ready for more action in the weeks ahead. Whale Returns After Two Years According to Lookonchain data, the same whale pulled 500 BTC out of Gemini back in 2022 when Bitcoin was trading near $27,400, a move worth nearly $14 million at the time. Now, with BTC hovering around $105,000, the whale’s holdings sit on an unrealized gain of over $39 million. That kind of profit margin grabs attention. Other large holders often watch these moves closely. They wonder if this is the start of a wider trend or just one wallet’s play. A whale that had been dormant for 2 years bought another 250 $BTC($26.37M) 9 hours ago. 2 years ago, this whale withdrew 500 $BTC($13.7M) from Gemini at $27,401, now sitting on an unrealized profit of $39M.https://t.co/c0U92isSfc pic.twitter.com/vcb4V3M0Uz — Lookonchain (@lookonchain) June 8, 2025 Big Gains On Early Bet Early adopters have seen massive upside in Bitcoin over the years. This whale’s 2022 withdrawal came just before a multi-year price boom. Since then, Bitcoin has climbed nearly 300%. Not everyone can make moves like that. Small investors often feel left behind when a wallet this size shifts coins. Still, some traders say it can create a ripple of optimism. When big holders buy, retail traders sometimes pile in, chasing the same gains. Technical Indicators Show Mixed Signals On the charts, BTC seems to be shaping an inverse cup-and-handle pattern with a significant neckline at $100,800 serving as major support. The price has fallen into the handle stage, and a dip below $100,800 could propel Bitcoin to $91,000, which coincides with its 200-day exponential moving average (EMA). Bitcoin&#8217;s relative strength index (RSI) is 52, indicating the bullish momentum is fading. A fall below 50 could introduce additional selling pressure. For the bulls to regain control, BTC must recapture the 20-day EMA resistance, which is just above $105,000. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Market Volatility And Liquidations There were some wild price movements last week fueled in part by social media battles between US President Donald Trump and billionaire Elon Musk. The price of bitcoin fell below $101,000 for a moment, causing close to $1 billion in liquidations across futures markets, before recovering to above $105,000 within hours. The miner capitulation signal was also detected by CryptoQuant’s Hash Ribbons indicator, pointing to near-term pain for worse-off miners, but some potential rallies ahead once they pulled through. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Bitcoin Leveraged Traders Are Back Betting On A Price Decline — What This Means",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-leveraged-traders-are-back-betting-on-a-price-decline/",
      "summary": "The price of Bitcoin has been in a good recovery form since succumbing to the bearish pressure from the ongoing feud between United States President Donald Trump and Elon Musk. The premier cryptocurrency climbed above the $105,000 mark in the early hours of Saturday, June 7. According to the latest on-chain data, the Bitcoin price looks set to continue its upward trajectory over the next few days. What Negative Leveraged Traders’ Sentiment Means For Price In a new post on the X platform, data analytics firm Alphractal shared fresh on-chain insights into the recent movement of the Bitcoin price. According to the market intelligence firm, the major catalyst of BTC’s latest recovery is the sudden shift in the market sentiment. Related Reading: Bitcoin Golden Cross Pattern Says The Crash To $100,000 Is Normal – What To Expect Next This on-chain observation is based on the Leveraged Traders’ Sentiment, which tracks the outlook or positioning of leveraged traders in the market. It provides insight into the kind of bets (longs or shorts) that leveraged traders are placing in the crypto market and the funding rates of the derivatives market. Data from Alphractal shows a rising interest in opening short positions in the Bitcoin market, with most retail traders betting on a price decline. Ultimately, this on-chain trend suggests that the sentiment in the Bitcoin derivatives market is currently bearish. However, Alphractal noted that this kind of behavior might not be as straightforward as it looks, as the market historically tends to move in the crowd’s opposite direction. Hence, when several traders are betting on a Bitcoin price decline, the flagship cryptocurrency tends to witness a contrasting market bounce. Alphractal said: When sentiment becomes excessively bullish or bearish, the market tends to do the opposite. Therefore, this metric is not just a sentiment gauge — it&#8217;s also a warning signal for potential contrarian moves that often catch traders off guard. According to the analytics firm, this is exactly what is currently happening in the Bitcoin market, with the market leader bouncing back despite the negative traders’ sentiment. Interestingly, if these leveraged traders continue to bet against Bitcoin, the BTC price could potentially ride this fresh bullish momentum to a new all-time high. Bitcoin Price At A Glance As of this writing, BTC is valued at around $105,700, reflecting an almost 2% increase in the past 24 hours. Following the latest resurgence, the premier cryptocurrency is now up by more than 1% on the weekly timeframe. Related Reading: Bitcoin Recovers From $100K Dip While On-Chain Data Shows Rising Miner Activity Featured image from iStock, chart from TradingView"
    },
    {
      "title": "Bitcoin At A Crossroads: $97,000 Cost Basis Holds Key To Next Breakout",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-at-a-crossroads-97000-cost-basis-holds-key-to-next-breakout/",
      "summary": "Bitcoin prices have returned above $105,000 in the past 24 hours following a sharp price decline on Thursday triggered by macroeconomic pressures. Notably, US President Donald Trump and former political ally Elon Musk had engaged in a public spat which spiked the volatility in a crypto market already undergoing a corrective phase. Amidst some level of renewed stability in the last two days, popular analytics firm Glassnode has now shared an important on-chain analysis highlighting the presently key price levels in the Bitcoin market. Related Reading: Can Bitcoin Price Bounce To $120,000 Or Will It Break Below $100,000? Bitcoin Ready For Breakout As Traders Eye $114K And $83K Levels In an X post on June 7, Glassnode provides an insight on potential Bitcoin price action using the Short-Term Holder (STH) cost basis model, derived from the Work of Cost (WOC) price framework. As the name implies, the STH cost basis represents the average purchased price of all coins belonging to short-term holders i.e. investors who acquired their Bitcoin within the last 155 days. The STH cost basis is an important market metric as it reflects the risk appetite of newer market participants who are typically the most reactive to price change. It is also a strong indicator of market sentiment with an ability to act as resistance or support depending on the price direction. According to the data by Glassnode, the current Bitcoin STH cost basis is estimated at $97,100. Using standard deviation bands in this WOC model, Glassnode has further identified the $114,800 price level as the +1STD level of this cost basis and a potentially heated market zone. Considering Bitcoin&#8217;s price, this $114,800 price zone represents the next major resistance, a break above which is expected to trigger a massive buying pressure and push the premier cryptocurrency further into uncharted price territory. Glassnode’s WOC model also identifies the -1STD level at $83,200 to represent a critical support zone in the present bullish structure. A decisive price fall below this level would signal market weakness and is likely to cause a cascade of liquidations and further price corrections. Related Reading: Crypto Analyst Says This Bitcoin Top Signal Hasn’t Gone Off Yet — What To Know Bitcoin Price Overview At the time of writing, Bitcoin trades at $105,745 reflecting a 1.07% gain in the last 24 hours. Meanwhile, the asset’s daily trading volume is down by 34.27% and valued at $38.66 billion. Provided Bitcoin continues to consolidate above the STH cost basis at $97,100, there is a valid chance for a market bullish push towards resistance at $114,800. However, a loss of the critical support at $97,100 would points to a retest at $83,200 which holds strong potential bearish consequences. Featured image from iStock, chart from Tradingview"
    },
    {
      "title": "Breakout In Sight? SUI Set To Test Crucial $3.5 Resistance With ATH In View",
      "link": "https://www.newsbtc.com/altcoin/breakout-in-sight-sui-set-to-test-crucial-3-5-resistance-with-ath-in-view/",
      "summary": "Popular market analyst Ted Pillows has tipped Sui (SUI) for an impending price breakout. Notably, the prominent altcoin has recorded a steady price decline in the past month with an estimated loss of 17.18% within this period. However, Pillows notes the formation of a bullish pattern which indicates substantial market relief ahead. Related Reading: SUI Rally At Risk? Analysts Warn Of 30% Dip If This Level Doesn’t Hold SUI Gathers Momentum Ahead Of Showdown With Resistance In an X post on June 7, Pillows shares a positive insight into the SUI market despite a sustained downtrend throughout May and early June. The analyst notes that SUI appears to hit local bottom within the $2.8-$3.0 following a slight rebound in the past 48 hours. Interestingly, this recent price action could signal market reversal especially considering the formation of a bullish descending wedge pattern on the SUI daily chart. For context, the descending wedge is a classic bullish reversal pattern marked by two converging trend lines sloping downward as seen in the chart below. The price action within the wedge which typically consists of lower highs and lower lows but the decreasing slope of the lows signal a weakening bearish pressure. Considering the rebound from the $2.8 which represents the lower boundary of the descending wedge and the narrowing of both trend lines, Pillows postulates SUI is preparing for a major upside price breakout. However, the altcoin must overcome a crucial resistance at $3.5 price level which represents the upper boundary of the descending wedge pattern. Pillows explains that a successful daily price close above $3.5 is likely to trigger a robust buying pressure that could force a SUI market rally for the next 2-3 weeks leading to a new all-time high. Based on the analysis presented, initial price targets are set at $4.00 indicating an instant return to the peak price region in May. However, with Pillows’ analysis hinting at a new all-time high, investors should expect any potential price breakout to hit a minimum price target of $5.21 representing a 60.8% gain on present market prices. Related Reading: Crypto Analyst Says This Bitcoin Top Signal Hasn’t Gone Off Yet — What To Know SUI Price Overview At the time of writing, SUI trades at $3.23 representing a 2.33% gain in the past day. However, weekly and monthly losses of 1.01% and 17.10%, respectively suggests the altcoin still has ground to make up. Nevertheless, SUI remains one of the best performing tokens of the present market cycle with potential star of the altseason considering its 211.11% in the last year. Featured image from Binance Academy, chart from Tradingview"
    },
    {
      "title": "Ethereum Head & Shoulders Pattern Breakdown: Can Bulls Reclaim Control?",
      "link": "https://www.newsbtc.com/altcoin/ethereum-head-shoulders-pattern-breakdown-can-bulls-reclaim-control/",
      "summary": "Ethereum&#8217;s recent price action on the 4-hour chart has led to the formation of a classic Head and Shoulders pattern that opens up the possibility of a deeper correction. After a relatively stable period around the $2,500 zone, Ethereum broke below a neckline support level as last week drew to a close. This raises the question of whether a bearish continuation is already in motion for the Ethereum price or if bulls still have a shot at regaining momentum in the new week. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Head &#38; Shoulders Pattern Confirmed After Breakdown Below $2,480 The Head and Shoulders pattern, one of the most recognizable reversal formations in technical analysis, is now clearly visible on Ethereum’s 4-hour candlestick chart. This chart and the technical outlook were first shared on the TradingView platform by crypto analyst MelikaTrader94. The structure includes a left shoulder, a prominent head peaking above $2,700, and a right shoulder that topped near $2,650. The neckline, drawn around $2,480, was breached during Ethereum&#8217;s recent pullback to $2,380. This, in turn, shifted the short-term outlook toward the bearish side. After the break, Ethereum attempted to reclaim lost ground and is currently retesting the neckline area. This retest around $2,500 is significant, as a failure to push back above this level significantly would likely validate the bearish setup and cause the Ethereum price to reverse downwards toward the next support zone. According to the outlook from analyst MelikaTrader94, the price target from this Head and Shoulders breakdown before any notable rebound upward can occur lies between $2,200 and $2,250. Chart Image From TradingView: MelikaTrader94 Bulls Must Reclaim $2,650 To Invalidate Bearish Setup A confluence of factors supports the $2,200 region as a likely landing zone. Not only is this level consistent with the measured move of the Head and Shoulders pattern, but it also aligns with an order block on May 9 during Ethereum&#8217;s rally above $2,000 at the time. This adds further technical relevance to the $2,200 to $2,250 range acting as a support zone. However, the situation is not fully bearish yet. The path forward is clear but narrow for Ethereum bulls. The first step to invalidate the bearish setup is to reclaim the neckline around $2,500 decisively. Beyond that, breaking back above the right shoulder level around $2,650 would invalidate the Head and Shoulders pattern, and another pattern will most likely come into play. Related Reading: Bitcoin To Hit $180,000 In 2025? Analyst Highlights The Trigger A successful bullish reclaim would not only nullify the bearish pattern but could also revive sentiment for another retest of the $2,700 to $2,800 zone, which corresponds to the peak of the head in the recently formed pattern. Until such a recovery occurs, the Ethereum price can quickly reverse downwards at any time. At the time of writing, Ethereum is trading at $2,510. Featured image from Unsplash, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin 2025 Las Vegas: Here’s What Went Down",
      "link": "https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-2025_ig.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down\" rel=\"nofollow\"> </a></p> <p>My name is Jenna Montgomery, and maybe you’ve read some of my news articles here before, or seen me on the TikTok. But today, I wanted to switch it up and give you an inside look at the Bitcoin 2025 Conference in Las Vegas through my eyes as an intern, hired just one [&#8230;]</p> <p>"
    },
    {
      "title": "TakeOver Successfully Hosts Second Annual BitGala Celebrating Bitcoin in Las Vegas",
      "link": "https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/TakeOver-Successfully-Hosts-Second-Annual-BitGala-Celebrating-Bitcoin-in-Las-Vegas.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas\" rel=\"nofollow\"> </a></p> <p>LAS VEGAS, NV, May 26, 2025 &#8211; TakeOver, Magic Eden, Spark, and Stacks successfully hosted their second annual BitGala on May 26th at the Wynn in Las Vegas. The celebration brought together over 200 Bitcoin industry leaders and community members for an evening dedicated to celebrating Bitcoin. The BitGala was designed as a curated gathering [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini Files Draft With The SEC For Proposed IPO",
      "link": "https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini-Files-Draft-With-The-SEC-For-Proposed-IPO.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo\" rel=\"nofollow\"> </a></p> <p>Gemini has confidentially filed a draft registration statement with SEC for a proposed IPO of its Class A common stock.</p> <p>"
    },
    {
      "title": "‘MicroStrategy of Asia’ Metaplanet Aims To Acquire Over 210,000 BTC By the End of 2027",
      "link": "https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘MicroStrategy-of-Asia-Metaplanet-Aims-To-Acquire-Over-210000-BTC-By-the-End-of-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027\" rel=\"nofollow\"> </a></p> <p>Metaplanet Inc. plans to acquire over 210,000 BTC by the end of 2027, which is equivalent to 1% of Bitcoin’s total supply.</p> <p>"
    },
    {
      "title": "Know Labs, Inc. Announces Adopting a Bitcoin Treasury Strategy, Starting with 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Know-Labs-Inc.-Announces-Adopting-a-Bitcoin-Treasury-Strategy-Starting-with-1000-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>Know Labs, Inc. announces making a Bitcoin Treasury Strategy, holding 1,000 Bitcoin and placing Greg Kidd as the CEO of the company.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "'Dogecoin Millionaire' Is Now a Pepe Millionaire—And He’s Stacking These Meme Coins Next",
      "link": "https://decrypt.co/324050/dogecoin-millionaire-pepe-stacking-meme-coins-next",
      "summary": "\"Dogecoin Millionaire\" Glauber Contessoto still hasn't sold his DOGE, but now he's amassed enough Pepe to take on another title."
    },
    {
      "title": "To Reap Tokenization's Benefits, Accredited Investor Rules Should Be Revamped: Robinhood Crypto GM",
      "link": "https://decrypt.co/324074/tokenization-benefits-accredited-investor-rules-revamped-robinhood-crypto-gm",
      "summary": "Robinhood Crypto's Johann Kerbrat said that tokenization could eliminate “middlemen” to the advantage of startup founders."
    },
    {
      "title": "AI Is Coming for Your Job, Much Faster Than Anyone Thought",
      "link": "https://decrypt.co/323916/ai-coming-jobs-faster-anyone-though",
      "summary": "White-collar workers are facing displacement due to AI—and AGI hasn't even arrived yet. Here's why experts are raising alarms."
    },
    {
      "title": "DOJ Seeks $7.7 Million Forfeiture in Crypto From North Korean Hackers Masquerading as IT Workers",
      "link": "https://decrypt.co/324162/doj-forfeiture-7-million-crypto-north-korean-hackers",
      "summary": "DOJ seeking $7.74M in crypto from North Korean IT workers who used fake identities to infiltrate U.S. companies and fund the regime."
    },
    {
      "title": "Cudis Bets on Wearables, AI and a Solana Token to Drive the Longevity Movement",
      "link": "https://decrypt.co/324052/cudis-bets-wearables-ai-solana-token-drive-longevity-movement",
      "summary": "Smart ring startup Cudis rewards users with crypto—via its new Solana and BNB token—for building consistent, healthy habits."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Circle rejected Ripple’s $5 billion buyout — now valued at over $20 billion after NYSE debut",
      "link": "https://cryptobriefing.com/circles-21-billion-valuation/",
      "summary": "<p>Circle's successful IPO highlights the growing legitimacy of stablecoins, potentially accelerating regulatory clarity and institutional adoption.</p> <p>"
    },
    {
      "title": "VanEck, 21Shares, and Canary urge SEC to revert to ‘first to file, first to approve’ standard for crypto ETFs",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec-standard/",
      "summary": "<p>The shift from a \"first-to-file\" to simultaneous approval for crypto ETFs may hinder innovation and favor larger firms, impacting market fairness.</p> <p>"
    },
    {
      "title": "Best way of staking USDT in 2025: Loopring AI-powered staking platform",
      "link": "https://cryptobriefing.com/ai-powered-staking-usdt-loopring/",
      "summary": "<p>Loopring's AI-powered staking platform offers up to 20% daily on USDT, leveraging AI &#38; Ethereum Layer 2 for optimal returns.</p> <p>"
    },
    {
      "title": "Elon Musk’s X names Polymarket as official prediction market partner",
      "link": "https://cryptobriefing.com/elon-musks-prediction-markets/",
      "summary": "<p>This partnership could enhance the accuracy of public sentiment analysis, potentially influencing decision-making in politics and finance.</p> <p>"
    },
    {
      "title": "Apple, X, and Google hold talks with crypto firms on stablecoin integration",
      "link": "https://cryptobriefing.com/stablecoin-integration-tech-discussions/",
      "summary": "<p>The integration of stablecoins by major tech firms could revolutionize global payment systems, enhancing efficiency and reducing costs.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Algorand active addresses spike 72%, but why isn’t ALGO responding?",
      "link": "https://ambcrypto.com/algorand-active-addresses-spike-72-but-why-isnt-algo-responding/",
      "summary": "<img alt=\"ALGO user base explodes: Can 72% growth fuel a breakout?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-90-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite rising users and whale inflows, ALGO needs stronger conviction to break current resistance."
    },
    {
      "title": "Bitcoin bears bet against BTC’s rally, but a short squeeze could follow IF…",
      "link": "https://ambcrypto.com/bitcoin-bears-bet-against-btcs-rally-but-a-short-squeeze-could-follow-if/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-1-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Retail traders are betting against Bitcoin’s rally, but rising short positions could trigger a squeeze. Could bearish sentiment backfire?"
    },
    {
      "title": "Hyperliquid: Is $40 within reach for HYPE? – Metrics reveal…",
      "link": "https://ambcrypto.com/hyperliquid-defends-key-support-is-40-within-reach-for-hype/",
      "summary": "<img alt=\"HYPE Eyes $40 as Buyers Dominate After Demand Zone Rebound\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_39_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE price are accumulating bullish momentum after a 6% rebound from a key demand zone at around $30.67."
    },
    {
      "title": "From chocolates to shades: Bolivia’s embrace of USDT signals major shift",
      "link": "https://ambcrypto.com/tether-ceo-applauds-bolivias-shift-to-usdt-for-daily-transactions/",
      "summary": "<img alt=\"USDT Adoption In Bolivia\" class=\"attachment-full size-full wp-post-image\" height=\"713\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/USDT-Adoption-In-Bolivia.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1267\" />Tether CEO applauds Bolivia's shift to USDT for daily transactions."
    },
    {
      "title": "Bitcoin traders, forget halving; instead, watch THIS for BTC’s next move!",
      "link": "https://ambcrypto.com/bitcoin-traders-forget-halving-instead-watch-this-for-btcs-next-move/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-08T094901.275-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin consolidates near $106K as whales accumulate but momentum shows signs of exhaustion."
    }
  ]
}