{
  "CoinDesk": [
    {
      "title": "KindlyMD Raises Another $51.5M for Bitcoin Treasury Strategy",
      "link": "https://www.coindesk.com/markets/2025/06/20/kindlymd-raises-another-515m-for-bitcoin-treasury-strategy",
      "summary": ""
    },
    {
      "title": "A South Korean Biotech Firms Gets $183.3M Funding to Build Bitcoin Treasury",
      "link": "https://www.coindesk.com/business/2025/06/20/a-south-korean-biotech-firms-gets-1833m-funding-to-build-bitcoin-treasury",
      "summary": ""
    },
    {
      "title": "Coinbase Wins European MiCA License in Luxembourg",
      "link": "https://www.coindesk.com/policy/2025/06/20/coinbase-wins-european-mica-license-in-luxembourg",
      "summary": ""
    },
    {
      "title": "ATOM Breaks $4 Resistance as Volume Surges 3%",
      "link": "https://www.coindesk.com/markets/2025/06/20/atom-breaks-usd4-resistance-as-volume-surges-3",
      "summary": ""
    },
    {
      "title": "TON Breaks $3 Barrier Amid Surging Volume, Riding Telegram's Growth",
      "link": "https://www.coindesk.com/markets/2025/06/20/ton-breaks-usd3-barrier-amid-surging-volume-riding-telegram-s-growth",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin price &#039;trending back&#039; but new highs before July unlikely: Analysis",
      "link": "https://cointelegraph.com/news/bitcoin-price-trending-back-new-highs-before-july-analysis?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWFlYjItZTUzZi03NzlkLWJmMzMtNmUzZDRjZDYzOGU1.jpg\" /></p><p>Bitcoin’s open interest divergence and a cleansing of latecomer longs could set BTC price on track toward fresh all-time highs.</p>"
    },
    {
      "title": "Bitcoin price slips under $104K into &#039;triple witching&#039; options expiry",
      "link": "https://cointelegraph.com/news/bitcoin-price-slips-under-104k-into-triple-witching-options-expiry?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhkZjQtZjRlNy03ZmFmLWIyNmQtZDljNDM5YmEzYTA2.jpg\" /></p><p>Bitcoin bulls attempt to reclaim daily moving averages while volatility warnings come before a unique options expiry event for TradFi markets.</p>"
    },
    {
      "title": "High risk, high reward: Crypto perpetual futures gain momentum in US",
      "link": "https://cointelegraph.com/news/crypto-perpetual-futures-gain-momentum-united-states?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhkYTUtMzQyYi03YjZkLWI4MDktMDVkYWRmM2MxMTE2.jpg\" /></p><p>Coinbase is gearing up to launch crypto perpetual futures as the CFTC reconsiders its previous stance toward the high-risk financial products.</p>"
    },
    {
      "title": "The SEC’s staking guidance pivot is what tech-savvy regulation looks like",
      "link": "https://cointelegraph.com/news/sec-staking-guidance-pivot?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5Njg5NjctZDZmNS03NDJhLWJmNDUtNTk1N2EzMTRjY2Jl.jpg\" /></p><p>The SEC’s new approach to staking is a turning point for US crypto regulation, showing that genuine, tech-savvy engagement can build smarter policy and keep blockchain innovation onshore.</p>"
    },
    {
      "title": "Korean biotech firm bought by Parataxis for Bitcoin treasury use",
      "link": "https://cointelegraph.com/news/parataxis-bitcoin-treasury-south-korea-bridge-bio-stock-20?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNiMWEtNDQ3Mi03MzMxLTg0ZmYtZDBiNWY0MzJhNTNh.jpg\" /></p><p>Parataxis will launch a Bitcoin-native treasury platform in South Korea via Bridge Bio, aiming to expand institutional access to BTC despite regulatory barriers.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "TikTok clashes with US congressman over alleged $300M TRUMP token bribe",
      "link": "https://cryptoslate.com/tiktok-clashes-with-us-congressman-over-alleged-300m-trump-token-bribe/",
      "summary": "<p>TikTok has publicly denied allegations that it bought $300 million worth of TRUMP memecoins to sway US President Donald Trump. The company addressed the claims on June 19 in a post on X, labeling the accusation &#8220;false and irresponsible&#8221; and aimed at misrepresenting its actions. The statement followed comments by US Congressman Brad Sherman, who [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto funding soars past $1.5 billion in June with Circle IPO boost",
      "link": "https://cryptoslate.com/crypto-funding-soars-past-1-5-billion-in-june-with-circle-ipo-boost/",
      "summary": "<p>Venture capital activity in the crypto space has seen a significant rebound this month, with total investments crossing $1.5 billion by June 20, according to DeFiLlama data. This marks the strongest monthly performance since March 2025 and signals growing confidence in blockchain startups after a quieter second quarter. The raised funds are more than double [&#8230;]</p> <p>"
    },
    {
      "title": "Bitwise CEO says Bitcoin’s true rival is US Treasuries, not gold",
      "link": "https://cryptoslate.com/bitwise-ceo-says-bitcoins-true-rivals-are-us-treasuries-not-gold/",
      "summary": "<p>Bitwise CEO Hunter Horsley believes the actual competition for Bitcoin isn&#8217;t gold, but government-backed bonds like US Treasuries and UK gilts. In a June 20 post on X, Horsley argued that gold and Bitcoin are apolitical stores of value that operate outside direct government control. However, he said Bitcoin&#8217;s actual competition lies with instruments tightly [&#8230;]</p> <p>"
    },
    {
      "title": "Why Ripple thinks London can become the main crypto powerhouse in the west",
      "link": "https://cryptoslate.com/why-ripple-thinks-london-can-become-the-main-crypto-powerhouse-in-the-west/",
      "summary": "<p>When Ripple unveiled its four-point policy blueprint in London this week, the message was unmistakable: if the UK wants to lead in crypto, the time to act is now. Unfolding against a backdrop of draft legislation and shifting global regulatory alignments, the move signals Ripple’s intent to turn Britain into the world’s next blockchain capital [&#8230;]</p> <p>"
    },
    {
      "title": "You’re Hired! North Korea’s new crypto scam starts with a job offer",
      "link": "https://cryptoslate.com/north-korea-leverages-fake-job-offers-and-deep%e2%80%91fakes-to-infiltrate-crypto-developer-networks/",
      "summary": "<p>A new wave of cyberattacks shows the DPRK is exploiting the crypto industry&#8217;s recruitment funnel, using fake LinkedIn job offers, deep‑fake Zoom calls, and backdoored interview files to access Web3 developers’ wallets and repositories. With seasoned developer talent already thinning and open‑source protocols increasingly reliant on individual contributors, the stakes have never been higher. North [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Prepares For A Decisive Move: ETH/BTC Setup Could Trigger Altseason",
      "link": "https://www.newsbtc.com/news/ethereum-prepares-for-a-decisive-move-eth-btc-setup-could-trigger-altseason/",
      "summary": "Ethereum is approaching a critical test as price action tightens, setting the stage for a decisive move above key demand. After weeks of volatile yet controlled trading, bulls are attempting to reclaim higher ground, but momentum remains limited. At the same time, bears have repeatedly failed to drive ETH below the $2,400 level, reinforcing it as a strong support zone for now. With global markets under pressure from geopolitical tensions and macro uncertainty, Ethereum’s next move could define the direction of the broader altcoin market. Related Reading: Ethereum Analyst Eyes High Timeframe Close – Range Break Above $2,800 Could Be Violent Top analyst M-log1 believes the ETH/BTC pair is the most important chart to monitor in the coming days. According to his view, a breakout—either to the upside or downside—will determine the fate of altcoins across the board. The setup has reached an inflection point after multiple tests of the lower support band, with bulls continuing to defend it against breakdown attempts. This consolidation phase, combined with suppressed volatility and rising macro tension, makes Ethereum’s current structure one of the most significant technical formations in crypto right now. All eyes are now on ETH/BTC as traders prepare for what could be a defining moment in the altcoin cycle. Ethereum Builds Pressure As Breakout Nears Ethereum continues to trade within a narrow range that began in early May, hovering between the $2,400 and $2,800 levels. This prolonged consolidation comes at a time of growing geopolitical instability, as the conflict in the Middle East escalates and macroeconomic uncertainty grips global markets. While many investors had anticipated an altseason by now, that rotation of capital into altcoins has yet to materialize. All eyes remain on Ethereum to serve as the catalyst for that next leg higher. M-log1 believes the ETH/BTC pair holds the most important signal in the coming days. “This is probably the most important chart you want to keep an eye on,” he stated, highlighting that whichever direction ETH/BTC breaks could determine the fate of the altcoin market. The chart has repeatedly tested the lower support range, with bulls successfully defending that level on at least eight occasions. According to M-log1, this persistent defense suggests that bears are losing momentum, and a breakout to the upside is more likely. “I am 80/20 in favor of the upside,” he said, citing the market’s inability to break lower as a sign of underlying strength. Related Reading: Ethereum Mirrors Bitcoin 2017-2021 Pattern – $4,000 Is The Trigger Point ETH Tests Weekly Moving Averages Ethereum (ETH) is currently trading at $2,550, maintaining its position above all major weekly moving averages—50, 100, and 200. This level marks a key technical pivot as price consolidates between $2,450 and $2,680 after a strong recovery from its April low near $1,500. Despite multiple attempts to break higher, ETH continues to face resistance just below the $2,700 mark, showing that sellers remain active near historical supply zones. Importantly, the recent weekly candles have held the 100-week and 200-week simple moving averages as support. This indicates structural strength, especially considering the broader macro uncertainty driven by Middle East tensions and tighter U.S. monetary policy. Volume remains steady, with no signs of panic selling, further supporting the idea that ETH is stabilizing. Related Reading: Bitcoin Consolidates as Realized Profits Stay Low – No Signs Of Major Sell-Off Yet The current compression in price around key moving averages typically precedes a larger directional move. A confirmed weekly close above $2,700 could open the door to a rapid push toward the psychological $3,000 level. Conversely, losing the $2,400 support would likely trigger a short-term correction back toward the 50-week SMA near $2,289. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "XRP Price In 2026? Pattern From 2017 Reveals How It Will Happen",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-2026-pattern-with-2017/",
      "summary": "The XRP price is currently trading well below $3; however, a crypto expert believes that in less than two years, this popular altcoin could enter the double-digit territory, marking a historic moment in crypto. The analyst has forecasted a potential surge to $27, pointing to a re-emerging pattern from 2017. With over six months left before 2026 begins, the expert has outlined a clear roadmap of how XRP could reach this bullish target if it completely mirrors the historic fractal. XRP Price Prediction For 2026 A new technical analysis by X (formerly Twitter) market expert Egrag Crypto suggests that XRP has yet to see its biggest breakout. The trajectory of the analyst’s chart mirrors the same technical path that XRP followed before hitting its 2018 peak and current all-time high of $3.84. Related Reading: XRP To End 7-Month Consolidation After 700% Surge – Is A Major Move Coming? Egrag Crypto highlights that XRP is on the verge of an explosive rally that may extend into 2026, with current market behavior echoing the conditions and buildup that preceded its 2017 breakout. Notably, the analyst’s price chart shows that the XRP monthly candle structure went through six candles of consolidation before it launched into a parabolic rise in late 2017. Now, the cryptocurrency has consolidated for seven monthly candles, highlighted by the green triangle in the chart. If the eight completes, the analyst expects a dramatic “KABOOM phase” to follow—one that could propel XRP to price levels not seen before. The bullish projections point to a possible blow-off top somewhere between $22 and $27, aligning with the highest blue arc on the chart. Currently, XRP is trading at $2.15, meaning a surge to $27 would represent a whopping 1,156% in less than two years. With July 2025 highlighted as the potential trigger month, Egrag Crypto believes that the breakout could extend its momentum toward the end of 2025 and peak in 2026. The formation, known as the RGB Arcs, presents a visual roadmap of this projected bullish path—reinforcing the possibility that XRP is preparing to repeat history—only bigger. XRP To Reach $4 Before $27 Target In his analysis, Egrag Crypto’s chart spanned from 2013 through 2017, connecting XRP’s peaks to a series of colored parabolic curves. The red arcs in the chart represented the macro support line, while the green arc marked historical resistance levels—reached in 2018, and now projected for 2025-2026. Related Reading: XRP Price Enters Perfect Setup After Buy Retest – Next Stop $3.7 Notably, the analyst predicts that XRP’s first breakout zone lies between $4 and $5. Once this target is hit, the cryptocurrency is expected to move into the upper green and blue arcs, positioning it for a stronger surge toward the forecasted $27 peak. Egrag Crypto has described this initial target as a measured move, where the final outcome is solely based on historical price patterns rather than pure speculation. He urges the broader XRP community to remain strong and patient until the cryptocurrency progresses toward these levels. Featured image from Shutterstock, chart from Tradingview.com"
    },
    {
      "title": "Crypto Analyst Predicts $4 Dogecoin After Exhausted Selling Phase",
      "link": "https://www.newsbtc.com/news/dogecoin/crypto-analyst-4-dogecoin-exhausted-selling-phase/",
      "summary": "Dogecoin’s six-month consolidation is a coil, not a coffin, according to the pseudonymous technician Cantonese Cat, whose 19 June video marshals multiple time-frame evidence to argue that the meme-coin’s next directional break will be up—potentially as far as $4.13 before the current cycle tops out. Dogecoin Breakout Is Only A Matter Of Time The analyst begins by addressing sentiment. Retail comment threads have turned caustic, he notes, because price has slipped from last autumn’s spike and then “done nothing for months.” Yet such fatigue is precisely what bull-market retracements are meant to produce: “A lot of people are getting really bitter about Doge … that’s exactly how higher highs and higher low type situations are supposed to get you all frustrated. This is still a bull trend until proven otherwise.” Related Reading: Dogecoin Looks Like ‘It Wants To Play Dead’—Again At the highest zoom level, Dogecoin is tracing what he calls “still a cup and … still a handle until proven otherwise.” The first thrust of that handle halted almost exactly at the 0.786 Fibonacci retracement of the 2022–24 bear range—“a very important fib level here.” Because initial attempts rarely pierce that resistance, he expected rejection. What matters is where the pullback found support: “In the case of Dogecoin, it decided to go all the way down to 0.382, which is nothing unusual … this is actually a pretty important zone of this nice Adam-and-Eve double bottom.” The market is therefore testing, not violating, an historically powerful neckline. Zooming to the monthly chart, Dogecoin sits beneath what the analyst calls “a pretty thick Ichimoku cloud.” Two breakout attempts have failed, producing a pair of wicks that look ominous to casual chart watchers. Cantonese Cat disagrees: “We had a little bit of a false breakout here on the monthly … I think a third time is going to be the charm.” Beneath the cloud, six consecutive monthly candles have nested entirely inside the tall green bar printed last November. He interprets the formation—six inside bars—as latency building for a violent move: “You’re talking about consolidation with six inside candles forming a lot of energy here.” That compression is mirrored on the weekly time frame: “If you also look at the weekly here, you can also see that you have six inside candles over here too … that tells me that there is not much bearish energy necessarily left anymore. I think we’re closer to the bottom than the top.” Key structural support is supplied by a rising 20-month simple moving average, now at $0.1737. Price currently ticks below it, but the slope is still positive. Historically, such combinations resolve in favour of the trend: “If you have a 20-month moving average that is up-sloping, most likely this is just going to be a wick.” He cites an earlier cycle when Dogecoin wicked beneath the same metric before staging a dramatic reversal. Price action, he argues, is meaningless without context. “If I end up looking at Doge here on Coinbase and I pull up the volume here, you can also see that there is no selling volume here at all.” Binance, the world’s deepest Dogecoin market, shows identical inertia. “The selling volume is essentially non-existent,” he says, concluding that supply overhang has vaporised and only demand is required to propel a reversal. Twice before—in July 2023 and February 2024—identical volume droughts preceded V-shaped rallies: “Low selling volume over here, reversal once volume comes in … low selling volume over here, reversal once volume comes in.” Related Reading: Dogecoin Shows Signs Of Life With Bottoming Signal Daily-chart oscillators are beginning to corroborate the structural read. Dogecoin has just registered what Cantonese Cat labels a “treasure bottom”—his term for a localised capitulation whose candle body is far smaller than its wick. More formally, the relative-strength index has exhibited bullish divergence: price has etched lower lows while RSI turns higher. “Last time when you have some bullish diversions was right here … that was the local bottom right there,” he says, pointing to the October 2023 reversal. The pattern repeated in March 2024 and appears again today: “I think that we might be experiencing a trend change here relatively soon.” DOGE Price Targets Should volume arrive and price claw back through the 0.5 and 0.618 retracements, Cantonese Cat’s Fibonacci ladders flag successive targets. From the Binance dataset, “$1.60, $2.26 and $4.13, all of these are possibility for Dogecoin.” A composite feed of multiple exchanges tweaks the numbers to $1.50, $2.27 and $3.94. What he does not foresee is a reprise of 2021’s parabolic blow-off, when Dogecoin tagged the 2.272 extension and briefly suggested a trajectory towards $23. “I think that $23 doge is insane … I don’t think that doge is going to end up becoming, you know, like anything like $3 trillion market cap.” A quarter- to half-trillion-dollar capitalisation, however—roughly the price zone between three and four dollars—remains “something to think about” given current monetary expansion. Cantonese Cat interprets the community’s malaise as a contrarian gift: “The market makers are giving us more time to buy while the sentiment is extremely, extremely poor.” Inside-bar ranges serve as a simple trigger. A close above the six-month range high would, in his reading, unlock the primary up-trend’s next leg. Conversely, a close below the 20-month average might delay—but not necessarily invalidate—the thesis, provided the moving average itself keeps rising. Across every lens—the macro cup-and-handle, the Adam-and-Eve neckline test, Ichimoku resistance, 20-month moving average support, volume exhaustion, daily bullish divergence—the weight of evidence converges on a bullish outcome. Timing, he concedes, is unknowable: “When is that going to be? I don’t know.” Yet none of the data justify capitulation. He closes with the maxim he repeats three times in the broadcast: “The trend is your friend, and the trend is up.” If that view holds, Dogecoin’s dormant coil may eventually unwind toward the analyst’s most ambitious extension at $4.13—a level unthinkable to today’s demoralised sellers, and precisely for that reason, he argues, still within reach. At press time, DOGE traded at $0.171. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin’s Back on the Table: 3 Best New Crypto as Arizona Revives Bill on Seized $BTC",
      "link": "https://www.newsbtc.com/news/arizona-hb2324-bitcoin-reserve-fund/",
      "summary": "Arizona’s Senate has moved to revive a bill that will create the state’s crypto reserve fund. This growing attention to the world’s most valuable cryptocurrency further adds interest to related new cryptos, such as BTC Bull Token ($BTCBULL) and secure crypto wallets like Best Wallet. Arizona’s House Bill 2324 is now under reconsideration after the Senate voted 16-14 to revive it. The House of Representatives initially voted down the bill in May. What Arizona’s HB2324 is About HB2324 expands Arizona’s ability to seize and forfeit property that has been used or obtained through criminal activity to include crypto and other digital assets. The state will then sell the forfeited digital asset. The bill also clarifies the role of Arizona’s ‘Bitcoin and Digital Assets Reserve Fund,’ wherein the state will deposit 25% of any seized digital assets worth over $300K. In May, Arizona created the reserve fund to store unclaimed digital assets, making it one of the first US states to do so. Why HB2324 Matters The revival of HB2324 signals the US’s push to add $BTC and other crypto to its finances. Aside from Arizona, other states have created similar crypto reserves, including New Hampshire and Texas. This growing momentum highlights a broader trend: US states no longer wait for federal guidance to make crypto moves. Instead, they’re taking matters into their own hands, with Bitcoin increasingly viewed as a strategic asset rather than a speculative gamble. By actively building reserves in digital assets, states like Arizona and New Hampshire are positioning themselves at the forefront of a financial shift, diversifying treasuries, hedging against inflation, and embracing innovation as a competitive advantage. The 3 Best New Crypto to Buy as Bitcoin Adoption Grows With government institutions and Wall Street starting to embrace $BTC and other digital assets more openly, here are three new crypto that could benefit from this development: 1. Best Wallet Token ($BEST) – A Secure Way to Store Your Bitcoin and Other Crypto With crypto becoming more mainstream, there’s a growing demand for a secure crypto wallet where people can store their valuable digital assets. That’s the demand that Best Wallet wants to meet. This crypto wallet lets you store, buy, and stake crypto and a lot more. It even has a Token Launchpad where you can access the best presales while they’re still cheap. As a non-custodial crypto wallet, Best Wallet gives you sole control over your private keys. This makes it more secure compared to wallets where private keys are in the hands of the wallet provider. It’s also a no-KYC crypto wallet, meaning it doesn’t require you to undergo the know-your-customer (KYC) verification, which helps maintain your privacy. Behind the wallet is its native Best Wallet Token ($BEST). It’s currently on presale, which you can get for only $0.025205 each. Our Best Wallet Token buying guide has all the details you need to grab $BEST tokens. Owning the token has various advantages. These include getting low transaction fees within the Best Wallet ecosystem, higher staking rewards, early access to presales in the Token Launchpad, and governance rights that give you control over the project’s direction. 2. BTC Bull Token ($BEST) – Buy BTC Bull Tokens, Get the Chance to Receive Free Bitcoins As the world’s biggest cryptocurrency, Bitcoin’s value is on its way to new highs. That’s the BTC Bull Token ($BTCBULL) team’s rallying cry as it urges believers to push $BTC to $250K and beyond. At its heart are the free $BTC and $BTCBULL airdrops when Bitcoin hits price milestones. This means when you hold $BTCBULL, you’ll get the chance to receive Bitcoins when it hits $150K and $200K. Then, when it finally reaches $250K, you’ll get free BTC Bull tokens. The team will also have regular token burns happening at $125K, $175K, and $225K. These will help reduce the number of $BTCBULL in circulation, making them scarcer and more valuable. The token is currently available for $0.00257 each at the BTC Bull Token presale page. To buy tokens, connect your crypto wallet like Best Wallet to the presale widget, enter the number of coins you want to buy, and pay with your credit/debit card or crypto. If you prefer, you can stake tokens after you buy them and enjoy staking rewards that are currently set at 56% p.a. HODLing could also be an ideal strategy, as it could be worth as much as $0.0096 each. 3. Bitcoin Pepe ($BPEP) – Merging the World of Bitcoin and Meme Coins Bitcoin was never meant for the world of meme coins, that is, until Bitcoin Pepe ($BPEP) arrived. By creating a Layer 2 blockchain, the Bitcoin Pepe team aims to merge Bitcoin with meme coins. When completed, this will deliver the best that Solana has to offer—speed, low transaction fees, and user-friendly UX—and bank on the biggest crypto&#8217;s massive value and mainstream appeal. $BPEP is available for $0.0416 on the Bitcoin Pepe presale page. But with just 10 days before the presale closes, it’s your last chance to get the tokens at a discount. Crypto Has Gone Mainstream and There’s No Looking Back With the revival of HB2324 in Arizona, Bitcoin and other crypto are back in the spotlight. While this is still big news at the moment, it will be a matter of time before it completely becomes a part of the mainstream. Because of this, it’s always best to be a step ahead of the crowd, such as by getting a secure crypto wallet powered by Best Wallet Token ($BEST) or betting on Bitcoin’s bull run with BTC Bull Token ($BTCBULL). But before you invest in crypto, make sure you do your research. This will allow you to be aware of the opportunities as well as the risks of trading these digital assets. Also, use the information in this article for educational purposes and not as investment advice."
    },
    {
      "title": "Analyst Warns Of Bitcoin Breakdown—’If This Continues, It Snaps’",
      "link": "https://www.newsbtc.com/bitcoin-news/itcoin-breakdown-if-this-continues-it-snaps/",
      "summary": "Bearish sentiment on X continues to grow, fueling a rising number of crash forecasts. Among them is Dom (@traderview2), a widely followed crypto market analyst, who issued a stark warning on Wednesday: Bitcoin is approaching a structural tipping point that could trigger a severe breakdown if bulls fail to act swiftly. “If this continues, it snaps,” Dom cautioned, referring to a wave of relentless selling pressure and thinning liquidity across major exchanges. Time Is Ticking For Bitcoin In a detailed post, Dom described current market conditions as “vital,” noting that Bitcoin and the broader crypto space are at a moment where “it needs to save itself or we&#8217;re going south.” The recent weekly chart, he said, reflects a bearish “liquidity grab”—a move where BTC pushed above the previous weekly high only to sharply reverse, a pattern often marking local tops. That reversal has been accompanied by a three-touch declining strength formation, signaling fading bullish momentum. “I think time is ticking for bulls to save this chart, as it needs to happen soon IMO,” Dom added, underscoring the urgency of a bullish reclaim to invalidate the setup. Related Reading: Bitcoin Is The Purest AI Trade, Says Wall Street Veteran Beneath price action, the structural foundation appears increasingly fragile. Dom pointed to alarmingly thin order books across key spot markets—Binance, Bybit, Coinbase, OKX, and Kraken. Over the past three weeks, roughly 38,000 BTC has been sold into the market, absorbed by passive bids. While buyers have held so far, the analyst warned that visible liquidity beneath current price levels is virtually nonexistent. “There is virtually no support down to 80ks (at least as of now), not even advertisement of support,” he said. The same bearish pattern is playing out in perpetual futures markets. Platforms like Binance, Bybit, OKX, and Hyperliquid have seen consistent taker-side selling, forming what Dom described as a “relentless downtrend of market selling.” With perp books also thin, the pressure may be unsustainable unless conditions change quickly. Drawing a parallel to Bitcoin’s February breakdown from the 90k level, Dom noted, “We saw the same dynamic pre-90k breakdown.” The implication is clear: without a shift in market behavior, BTC may be headed toward a similar fate. Related Reading: Buy Bitcoin Now? Not Yet—Analyst Says Time Holds The Key Seasonal trends are adding weight to the bearish outlook. Dom highlighted that summer months historically bring weaker market participation and lower liquidity—an environment that exacerbates downside moves and limits the impact of bullish efforts to regain control. Despite the grim analysis, Dom remains clear on what would invalidate his bearish stance: a recovery of the 108.5k level. “If that level regains, great. I think we can void these signals,” he said. “But for now, bearish outlook for me is the better R/R on a risk-first basis.” In a separate reply, Dom acknowledged that a dip to the $96,000–$98,000 region, even with a wick into the $80,000’s, would not necessarily break structure. “It surely would not be abnormal and I think structure would still be ok,” he wrote, adding that he would reassess the setup if such a move occurs. With order books thinning, taker flow intensifying, and no solid support beneath, Dom’s message is blunt: time is running out. At press time, BTC traded at $104,694. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Parataxis Holdings to Create South Korea’s First Bitcoin Treasury Company",
      "link": "https://bitcoinmagazine.com/news/parataxis-holdings-to-create-south-koreas-first-bitcoin-treasury-company",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/New-York-based-investment-firm-Parataxis-enters-definitive-agreement-to-transform-Korean-biotech-company-into-institutional-Bitcoin-platform.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/parataxis-holdings-to-create-south-koreas-first-bitcoin-treasury-company\" rel=\"nofollow\">Parataxis Holdings to Create South Korea&#8217;s First Bitcoin Treasury Company </a></p> <p>Parataxis Holdings LLC has entered into a definitive agreement to acquire a controlling interest in South Korean biotech company Bridge Biotherapeutics, Inc. (KOSDAQ: 288330) for KRW 25 billion ($18.3 million), marking the creation of South Korea&#8217;s first institutionally backed Bitcoin treasury company.&#160; The transaction will see Bridge Biotherapeutics renamed to Parataxis Korea and continue trading [&#8230;]</p> <p>"
    },
    {
      "title": "KindlyMD Secures $51.5M to Accelerate Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/kindlymd-secures-51-5m-to-accelerate-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KindlyMD-Secures-51.5M-to-Accelerate-Its-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kindlymd-secures-51-5m-to-accelerate-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>KindlyMD secures a total of $763M as it prepares to merge with Bitcoin-native Nakamoto Holdings to build one of the largest public Bitcoin treasuries.</p> <p>"
    },
    {
      "title": "BitBox Announces BitBox02 Nova, A New Hardware Wallet For Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bitbox-announces-bitbox02-nova-a-new-hardware-wallet-for-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BitBox-Announces-BitBox02-Nova-A-New-Hardware-Wallet-For-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitbox-announces-bitbox02-nova-a-new-hardware-wallet-for-bitcoin\" rel=\"nofollow\"> </a></p> <p>BitBox's latest wallet introduces iOS support, Bluetooth isolation, and hardware security for Bitcoin self-custody.</p> <p>"
    },
    {
      "title": "South Korea Moves Closer to Approving Spot Bitcoin ETFs",
      "link": "https://bitcoinmagazine.com/news/south-korea-moves-closer-to-approving-spot-bitcoin-etfs",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/03/south-korea-bitcoin-pic.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/south-korea-moves-closer-to-approving-spot-bitcoin-etfs\" rel=\"nofollow\"> </a></p> <p>South Korean Financial regulators submit an implementation roadmap for Bitcoin and crypto ETFs as institutional adoption accelerates globally.</p> <p>"
    },
    {
      "title": "The CLARITY Act Shouldn’t Be Included in the GENIUS Act Say Senator Hagerty, Analysts",
      "link": "https://bitcoinmagazine.com/politics/the-clarity-act-shouldnt-be-included-in-the-genius-act-say-senator-hagerty-analysts",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Senator-Hagerty-GENIUS-Act-and-CLARITY-Act.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/the-clarity-act-shouldnt-be-included-in-the-genius-act-say-senator-hagerty-analysts\" rel=\"nofollow\"> </a></p> <p>Senator Bill Hagerty (R-TN), the main sponsor for the GENIUS Act, and policy analysts from the Bitcoin Policy Institute and Galaxy Digital believe that combining the GENIUS Act with the CLARITY Act as the former heads to the House floor for a vote will lower the likelihood of it passing.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "China to Restore Classic Bruce Lee, Jackie Chan and Jet Li Movies Using AI",
      "link": "https://decrypt.co/326252/china-to-restore-classic-bruce-lee-jackie-chan-and-jet-li-movies-using-ai",
      "summary": "China invests $14M in AI to restore 100 classic kung fu films, reviving Bruce Lee and Jackie Chan movies for global cultural influence."
    },
    {
      "title": "CRYPTO EDGES HIGHER, TRUMP FAMILY REDUCES WLFI STAKE, PUMPFUN TOKEN DELAYED!",
      "link": "https://decrypt.co/videos/interviews/qPEdhutt/crypto-edges-higher-trump-family-reduces-wlfi-stake-pumpfun-token-delayed",
      "summary": "FOMO HOUR LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. Crypto edges higher on volatile macro. Circle continues to push higher after GENIUS Act. Arizona passes crypto reserve bill. BTC buying surges in Japan as JPY hedge. Semler Scientific plans to buy 105k BTC in 3 years. Revolut considers its own stablecoin. Trump family reduces WLFI stake to 40%. Animoca, StanChart, HKT to collab for stablecoin. TRON flips DOGE market cap. Visa expands stablecoin to EMEA. Kraken debuts BTC staking. Fake OTC rounds see $50m stolen. Tether proposes fix to password exploits. 00:00 - Intro 01:30 - NBA going to a Game 7 02:00 - What's on todays show 03:52 - Mandos Market Report 06:27 - Iran/US news and the markets 10:38 - CRCL stocks still moving 12:00 - Trump reduces stake in WLFI 12:55 - Are we going to chop? 17:20 - BTC/ETH charts 19:00 - PumpFun Token Delayed 21:30 - Hyperliquid 25:58 - Digging into the CRCL trade 32:30 - Sharplink Gaming 34:55 - Gorbagana meme runs to $40M 37:52 - Trump WLFi tylers thoughts 40:00 - OSF and Rekt sell out 7/11 launch 42:08 - Yeet Giveaway! LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    },
    {
      "title": "Tokenized Assets ‘Expand Participation in Equity’ and Bring Wall Street On-Chain: Exodus",
      "link": "https://decrypt.co/326237/tokenized-assets-expand-participation-in-equity-and-bring-wall-street-on-chain-exodus",
      "summary": "Blockchain paves the way for 24/7 trades and lightning-fast settlement, the self-custodial crypto platform told ."
    },
    {
      "title": "Bitcoin Holds Ground as Fed’s Waller Calls for July Rate Cut",
      "link": "https://decrypt.co/326241/bitcoin-holds-ground-as-feds-waller-calls-for-july-rate-cut",
      "summary": "Fed futures traders penciled in a 14% chance that the U.S. central bank would cut rates in July on Friday."
    },
    {
      "title": "USDC Issuer Circle Spikes After Wall Street Firm Initiates With Buy Rating",
      "link": "https://decrypt.co/326235/usdc-issuer-circle-spikes-buy-rating",
      "summary": "Circle stock jumps 14% as stablecoin legislation passes Senate and Wall Street analyst predicts $2T market growth for the USDC issuer."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Coinbase secures MiCA license, unlocks access to all 27 EU countries",
      "link": "https://cryptobriefing.com/coinbase-mica-license-eu/",
      "summary": "<p>Coinbase's MiCA license enhances EU crypto market integration, boosting institutional trust and potentially accelerating regional blockchain innovation.</p> <p>"
    },
    {
      "title": "Fed’s Waller says rate cut could come as soon as July",
      "link": "https://cryptobriefing.com/fed-rate-cut-july-outlook/",
      "summary": "<p>A potential rate cut in July could signal a shift in monetary policy, impacting economic growth, inflation expectations, and market dynamics.</p> <p>"
    },
    {
      "title": "Norway to impose temporary restrictions on Bitcoin mining to save electricity",
      "link": "https://cryptobriefing.com/norway-bitcoin-mining-restrictions/",
      "summary": "<p>Norway's restrictions on Bitcoin mining highlight the tension between energy-intensive industries and sustainable energy priorities.</p> <p>"
    },
    {
      "title": "Arizona revives Bitcoin reserve bill and passes it in Senate",
      "link": "https://cryptobriefing.com/arizona-bitcoin-reserve-fund-bill/",
      "summary": "<p>Arizona's legislative actions on digital assets could set a precedent for integrating cryptocurrencies into state financial systems, despite political challenges.</p> <p>"
    },
    {
      "title": "Trump-affiliated company cuts stake in World Liberty Financial to 40%",
      "link": "https://cryptobriefing.com/world-liberty-stake-reduction/",
      "summary": "<p>The reduced stake may signal a strategic shift in investment focus, potentially impacting the company's influence in the crypto sector.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Is your crypto security at risk after the leak of 16 billion logins?",
      "link": "https://ambcrypto.com/is-your-crypto-security-at-risk-after-the-leak-of-16-billion-logins/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"756\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Crypto-security-at-risk.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1344\" />Cisco Talos warned against a targeted crypto malware campaign using Python-based trojans."
    },
    {
      "title": "FARTCOIN sees a $2.3 mln whale dump: Is a deeper correction coming?",
      "link": "https://ambcrypto.com/fartcoin-sees-a-2-3-mln-whale-dump-is-a-deeper-correction-coming/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-20T093749.152-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />FARTCOIN faces growing bearish pressure despite technical support."
    },
    {
      "title": "Arizona revives controversial Bitcoin Reserve bill – Here’s what it means for crypto seizures",
      "link": "https://ambcrypto.com/arizona-revives-controversial-bitcoin-reserve-bill-heres-what-it-means-for-crypto-seizures/",
      "summary": "<img alt=\"Arizona Revives Bitcoin Reserve Bill\" class=\"attachment-full size-full wp-post-image\" height=\"486\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Arizona-Revives-Bitcoin-Reserve-Bill.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"864\" />Arizona almost buried this bill, but a surprising Senate move brought it back. Now it’s gaining serious traction."
    },
    {
      "title": "Bitcoin’s price braces for H2 2025 breakout – Watch these two critical signals!",
      "link": "https://ambcrypto.com/bitcoins-price-braces-for-h2-2025-breakout-watch-these-two-critical-signals/",
      "summary": "<img alt=\"Bitcoin&#039;s price braces for H2 2025 breakout - Watch these two critical signals!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-1-7.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Where do Bitcoin's rally odds stand right now?"
    },
    {
      "title": "Bitwise CEO warns of Bitcoin’s ‘next obstacle over the coming quarters’",
      "link": "https://ambcrypto.com/bitwise-ceo-warns-of-bitcoins-next-obstacle-over-the-coming-quarters/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-FIII.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Gold ETF inflows dropped 50% from $30B to $15B while BTC recovered up to $10B."
    }
  ]
}