{
  "CoinDesk": [
    {
      "title": "Trump’s Team ‘Knows Nothing’ About Apparent ‘$TRUMP Wallet’ Launch",
      "link": "https://www.coindesk.com/business/2025/06/03/trumps-team-knows-nothing-about-apparent-trump-wallet-launch",
      "summary": ""
    },
    {
      "title": "France Charges 25 People, Including 6 Minors, in Crypto Kidnapping Cases",
      "link": "https://www.coindesk.com/policy/2025/06/03/france-charges-25-people-including-6-minors-in-crypto-kidnapping-cases",
      "summary": ""
    },
    {
      "title": "Bitcoin Miner MARA Holdings Posts Record Block Wins, Produces 950 BTC in May",
      "link": "https://www.coindesk.com/markets/2025/06/03/bitcoin-miner-mara-holdings-posts-record-block-wins-produces-950-btc-in-may",
      "summary": ""
    },
    {
      "title": "OpenAI's $6.4 Billion Hardware Gamble Exposes the Closed AI Trap",
      "link": "https://www.coindesk.com/opinion/2025/06/03/openais-64-billion-hardware-gamble-exposes-the-closed-ai-trap",
      "summary": ""
    },
    {
      "title": "ATOM Surges 5% Before Forming Bearish Head-and-Shoulders Pattern",
      "link": "https://www.coindesk.com/markets/2025/06/03/atom-surges-5-before-forming-bearish-head-and-shoulders-pattern",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Tokenized funds are scaling fast, hitting $5.7B — Moody’s",
      "link": "https://cointelegraph.com/news/tokenized-funds-scaling-fast-hitting-5-7b-moodys?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM3MWUtM2FmOC03Y2QxLTk4NWYtYjIyNWY0NGMzNjRi.jpg\" /></p><p>Moody’s finds growing institutional demand for tokenized money market funds, citing benefits in liquidity, compliance and operational efficiency.</p>"
    },
    {
      "title": "Classover signs $500M convertible note deal for Solana reserve",
      "link": "https://cointelegraph.com/news/classover-500m-convertible-note-deal-solana-reserve?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM2OWUtYzhjZS03ZTUxLWI2ZmYtNzczNDhjZWFiYzZl.jpg\" /></p><p>The K-12 education company has up to $900 million to purchase Solana tokens.</p>"
    },
    {
      "title": "Retail is back, but not where you think — Bitget COO",
      "link": "https://cointelegraph.com/news/crypto-retail-traders-changed-bitget-executive?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzJjYmItYzJjZC03MWQ1LTkwZWEtZjVhNDliMjc5ZDMz.jpg\" /></p><p>Vugar Usi Zade dispelled the myth that retail investors are no longer interested in Bitcoin and cryptocurrency.</p>"
    },
    {
      "title": "Crypto policy trends to watch in 2025: Privacy, development and adoption",
      "link": "https://cointelegraph.com/explained/crypto-policy-trends-to-watch-in-2025-privacy-development-and-adoption?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9kY2E5YTUwZDUxOGMwOGUzNWQ1ZTI3MzEyYzM5YjBiYS5qcGc=.jpg\" /></p><p>As crypto goes mainstream, regulation is no longer a distant threat or bureaucratic detail — it’s the new foundation. </p>"
    },
    {
      "title": "Is Bitcoin price going to crash again?",
      "link": "https://cointelegraph.com/news/is-bitcoin-price-going-to-crash-again?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDkvMDE5MWUxYmEtM2VjOC03NDU4LWE4NDctNTA1ZGY2YjQzMTQ4.jpg\" /></p><p>Bitcoin’s decreasing buyer momentum and high supply in profit could be an early sign that the top is in.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Eric Trump and Donald Trump Jr. deny involvement in Magic Eden’s ‘Trump Wallet’",
      "link": "https://cryptoslate.com/eric-trump-and-donald-trump-jr-deny-involvement-in-magic-edens-trump-wallet/",
      "summary": "<p>Eric Trump and Donald Trump Jr. denied involvement in Magic Eden&#8217;s June 3 announcement of a partnership to develop a &#8220;Trump Wallet.&#8221; On June 3, Magic Eden announced it was developing a new Trump wallet and shared a landing page with a public waitlist. The page promoted $1 million in TRUMP memecoin payouts through a [&#8230;]</p> <p>"
    },
    {
      "title": "StanChart warns of potential liquidation risks for corporations adopting Bitcoin at high prices",
      "link": "https://cryptoslate.com/stanchart-warns-of-potential-liquidation-risks-for-corporations-adopting-bitcoin-at-high-prices/",
      "summary": "<p>A growing number of public companies are buying Bitcoin (BTC) for their balance sheets, but many could be exposed to significant losses if prices drop, according to a new Standard Chartered report shared with . The bank’s research, authored by head of digital assets research Geoffrey Kendrick, highlighted that 61 companies now hold Bitcoin in [&#8230;]</p> <p>"
    },
    {
      "title": "Binance founder CZ warns of Bitcoin treasury risks amid growing adoption",
      "link": "https://cryptoslate.com/binance-founder-cz-warns-of-bitcoin-treasury-risks-amid-growing-adoption/",
      "summary": "<p>Changpeng Zhao, founder and former CEO of Binance, has urged companies adopting Bitcoin as a treasury asset to fully understand the risks involved with the top crypto. In a June 3 post on X, Zhao acknowledged that risk is an unavoidable part of doing business, but emphasized the importance of assessing and managing it properly. According [&#8230;]</p> <p>"
    },
    {
      "title": "US Bitcoin ETFs navigate $1.2 billion outflows amid European retail approval",
      "link": "https://cryptoslate.com/bitcoin-etfs-navigate-1-2-billion-us-outflows-amid-european-retail-approval/",
      "summary": "<p>US-listed spot Bitcoin exchange-traded funds (ETFs) have entered a third consecutive day of outflows, shedding more than $1 billion. This trend reflects a shift in institutional sentiment as Bitcoin&#8217;s price continues to hover around the $105,000 mark without a clear breakout. US Bitcoin ETFs outflow Data from SoSoValue shows that the 12 US-listed spot Bitcoin [&#8230;]</p> <p>"
    },
    {
      "title": "XRP Ledger transaction volume dips in May as institutional interest rises",
      "link": "https://cryptoslate.com/xrp-ledger-transaction-volume-dips-in-may-as-institutional-interest-rises/",
      "summary": "<p>The XRP Ledger (XRPL) recorded a drop in transaction volume in May 2025, even as institutional adoption of the blockchain network continues to rise. According to data from XPMarket, XRPL processed over 50.1 million transactions last month, down from 54.8 million in April. Despite the decline, active wallets rose to 278,362, up from 252,000 in [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Is $250K Bitcoin Possible This Year? This Research Chief Thinks So",
      "link": "https://www.newsbtc.com/news/bitcoin/is-250k-bitcoin-possible-this-year-this-research-chief-thinks-so/",
      "summary": "Tom Lee, Fundstrat’s head of research, says Bitcoin could climb to $250,000 by the end of 2025. According to an interview on CNBC’s Squawk Box today, Lee pointed out that Bitcoin recently dipped from its all-time high of $111,970 down to about $104,000. He still thinks that the market is holding up around that level. Related Reading: Bitcoin Maxi Max Keiser Isn’t Buying The Hype Around New Crypto Holding Companies Lee’s Short-Term Outlook Lee told Squawk Box’s host Joe Kernen that 95% of all Bitcoin—about 19.80 million coins—has already been mined out of a maximum of 21 million. That leaves roughly 1.13 million coins waiting to be produced. He sees that as a tight supply setup. He also noted that while nearly all Bitcoin exists, 95% of the global population does not own any. Based on reports, that gap between supply and potential buyers could push prices higher in the months ahead. To reach $250,000 from around $104,000 now, Bitcoin would need to jump about 140%. Lee still believes it can hit $150,000 by December and could even stretch toward $200,000 to $250,000 if demand heats up. Supply And Demand Gap Lee highlighted the fact that most people in the world have not bought any Bitcoin. He said this creates an imbalance. On one side you have a nearly fixed supply. On the other, there may be millions of new buyers in the next 10 years. He explained that if even a fraction of those people decide to buy Bitcoin, the price could move a lot higher. Right now, only about 5% of all coins remain to be mined. That means new supply is slowing down fast. At the same time, more wallets, apps, and easy ways to buy could bring in fresh money. Lee thinks this mismatch is a big part of why Bitcoin could keep climbing. Long-Term Valuation Targets When asked about Bitcoin’s terminal value—meaning its price when all coins are mined by 2140—Lee said he expects it to match gold’s roughly $23 trillion market cap. That works out to at least $1.15 million per Bitcoin if there are 20 million coins in circulation. He chose 20 million instead of 21 million because assumed losses (lost keys, forgotten wallets) mean not every coin will ever be spent. Lee went further, saying he sees room for Bitcoin to hit $2 million or $3 million per coin. That would put his average “bull case” at $2.5 million, which is roughly a 2,300% rise from today’s levels. Related Reading: XRP Could Transform Your Finances Long Before $10K, Angel Investor Says Other Analyst Projections VanEck’s head of digital asset research, Matthew Sigel, also has a long-range prediction. Based on what Sigel told investors, VanEck sees Bitcoin hitting $3 million by 2050. That forecast lines up with Lee’s idea of Bitcoin matching or even beating gold over time. Both calls assume steady growth in demand, plus wider use by big institutions like hedge funds or pension plans. Featured image from Gemini, chart from TradingView"
    },
    {
      "title": "Crypto Analyst Says XRP Community Should Pay Attention To June 4-6, Here’s Why",
      "link": "https://www.newsbtc.com/analysis/xrp/key-dates-for-xrp-price-action/",
      "summary": "XRP’s price is now looking to break above $2.20 again after inching a few moves upwards in the past 24 hours. Notably, the cryptocurrency&#8217;s price action has seen a volatile movement over the past week. After briefly rallying above $2.65 earlier in May, XRP failed to sustain its momentum, instead trending downwards until it rebounded at $2.10 on the last day of May. Amid this backdrop of price action, there have been discussions around the timing for the next major price movement for XRP. A fresh outlook by a crypto analyst suggests XRP investors should pay attention to June 3 to June 6. Crypto Analyst Predicts Timeline For XRP Bottom And Breakout A crypto analyst known pseudonymously as WatersAbove has drawn attention to specific calendar dates that could play important roles in XRP’s short-term and long-term price trajectories. Taking to the social media platform X to share his outlook, the analyst suggested that June 4th to 6th could mark the bottom for XRP before there is any significant upside. Related Reading: Wave Count Analysis Reveals The XRP Price Trigger Point For Take-Off However, aside from this bottom, what&#8217;s more important is the potential price manipulation that could take place within this period. According to the crypto analyst, this particular window between June 3 and June 6 will likely be characterized by market manipulation, as larger players may be attempting to shake out weak hands ahead of a more decisive rally. &#8220;In the meantime, watch out for this week ahead,&#8221; the analyst said. Although WatersAbove did not accompany the prediction with any technical chart, the confidence in his tone resonates among XRP investors who are closely watching these dates for signals of a bottom, as shown in"
    },
    {
      "title": "Stablecoins Ignite Record-Breaking May, Supply Jumps To $244B – Data",
      "link": "https://www.newsbtc.com/stablecoin/stablecoins-ignite-record-breaking-may-supply-jumps-to-244b-data/",
      "summary": "A surge of stablecoin transactions marked May as a standout month for the crypto sector. It moved beyond mere token swaps. Lots of people and services turned to dollar-pegged coins for moving value. Activity hit fresh highs, hinting that stablecoins are now the main channel for on-chain payments. Related Reading: XRP Could Transform Your Finances Long Before $10K, Angel Investor Says Spike In Wallet Activity According to Artemis data, more than 33 million wallets sent or received stablecoins during May. That’s a big jump compared with earlier months. It shows more folks are leaning on these digital dollars than on native tokens. Many traders, DeFi users, and everyday people tapped stablecoins to keep their funds tied to the US dollar. This wave of usage also came as the wider market showed signs of life, with prices slowly rising and confidence climbing. Shift To Faster Networks Based on reports, BNB Smart Chain counted over 10 million active wallets for stablecoin moves early in May. TRON came very close, with a little over 9 million wallets during that same stretch. These two networks are cheap and quick. Folks want to dodge higher fees on older chains. By month’s end, both BNB Smart Chain and TRON could top those numbers again. That trend speaks to growing demand for fast, low-cost payments and DeFi deals. Ethereum simply can’t match these lower fees right now. Stablecoin Supply Growth Stablecoins also saw more tokens enter circulation. The total supply grew to $244 billion, up nearly 3% in just one month. But not all coins minted equally. Tether’s USDT remained the heavyweight champion. It added nearly $4 billion to its total supply in May alone. Most of that new USDT landed on TRON. Today, TRON holds nearly $78 billion in USDT, while Ethereum carries $73 billion. In sum, USDT’s overall supply now tops $153 billion and added tokens almost every day. USDC moved in the opposite direction. Its supply dipped slightly, thanks to outflows on Solana. Still, USDC keeps about $60 billion circulating across all its chains. Related Reading: Pepe Makes It To Trump’s Feed—Is A Crypto Endorsement Next? Payments And Bridges Overtake Cards Stablecoins didn’t just grow in supply and usage. They carried huge volumes of payments. Over the past 30 days, those coins moved over $2 trillion worth of value. That level beats what many debit and credit cards handled in the same span. For example, Visa’s volumes were lower than what stablecoins saw. Plus, USDC’s cross-chain moves spiked. The CCTP bridge saw $7.7 billion flow through it, up 83% month-on-month. That rush of bridging means more people are shuttling dollars between networks for trades, lending, or simple transfers. Featured image from ETF Stream, chart from TradingView"
    },
    {
      "title": "XRP Sell-Off Rumors Swirl After Expert Questions Ripple’s War Chest",
      "link": "https://www.newsbtc.com/xrp-news/xrp-sell-off-rumor-ripple-war-chest/",
      "summary": "CoinRoutes chief executive Dave Weisberger detonated a fresh round of anxiety in the XRP market on Monday when he asked, on Scott Melker’s podcast, whether Ripple Labs could finance a takeover of Circle “for $10 to $20 billion” without off-loading roughly $10 billion in XRP. “Who’s going to buy the $10 billion worth of XRP they would need to sell out of their treasury?” Weisberger said, warning that a sudden supply surge could overwhelm order books and “hammer the price.” Is A XRP Sell-Off Conceivable? Within hours, pro-XRP attorney Fred Rispoli fired back on X. “I love @daveweisberger1, but on this point he is mcgloning so hard,” he wrote, invoking Bloomberg strategist Mike McGlone’s reputation for bearish hyperbole. “Just based on what I’m getting offered for my Ripple shares on the secondary market, I don’t think Ripple would even have to sell one XRP to buy Circle.” Rispoli agreed that Ripple cannot raise $10 billion in pure cash, yet insisted the company could “easily afford the acquisition for a mix of cash and debt” and a heavy equity-swap. Related Reading: $3 XRP Dream Delayed—No Bull Run Before November, Says Top Analyst When Weisberger replied that Circle’s board would likely demand hard dollars unless it accepted Ripple equity or XRP “without a haircut,” Rispoli dug in. “No way to get $10B in cash—and $10B is too high anyway,” he wrote, citing late-2024 private-research valuations that placed Ripple at $15 billion excluding its ~36 billion escrowed XRP. If Circle’s price tag fell to $7–9 billion, he said, Ripple could close with “$1–3 billion cash on hand, a heavy stock exchange, and debt,” especially with “all that GCC money sloshing around crypto world right now.” Rispoli conceded it would be “a reach” but “doable without meaningfully selling XRP.” Weisberger acknowledged the math—“That’s a reasonable analysis,” he wrote—yet cautioned that any price at the upper end of Rispoli’s range “could be some short-term pain for us XRP holders.” Ripple’s tender-offer buyback in January 2024 valued the company at $11.3 billion, disclosing more than $1 billion in cash and about $25 billion in digital assets—mostly XRP—on its books. The firm still controls roughly 52 billion XRP (about 40 percent of supply), though 36 billion sit in timed escrow releases, limiting immediate access. At today’s $2.20 spot price, the spendable portion is worth a little under $35 billion, but moving even a fraction quickly would collide with thin venue depth—a point Weisberger hammered home. Related Reading: Wave Count Analysis Reveals The XRP Price Trigger Point For Take-Off Ripple’s cash pile also shrank after its $1.25 billion purchase of prime broker Hidden Road in April, a deal settled with a blend of cash, equity and RLUSD stablecoins. That acquisition suggests the company prefers hybrid structures, bolstering Rispoli’s claim that Treasury XRP need not flood the market. Is Circle Even For Sale? The debate may be academic. Circle, issuer of USDC, has repeatedly declared it “not for sale” while marching toward a New York Stock Exchange listing that now targets a $7.2 billion valuation. Ripple’s rumored approach earlier this spring reportedly topped $5 billion, well below Weisberger’s stress case and within Rispoli’s “doable” band, but Circle rebuffed the talks and updated its S-1 two weeks later, enlarging the float rather than seeking a buyer. Strategically, Ripple already fields its own dollar-token RLUSD, launched in January and positioned by president Monica Long as “complementary to XRP, not a competitor.” Absorbing USDC’s issuer would instantly rocket Ripple towards the size of Tether. Even under Rispoli’s optimistic structure, Ripple might still need to liquidate several hundred million dollars’ worth of XRP for working capital and closing costs. At current volumes, unloading just 500 million XRP (≈ $1.1 billion) would equal half a week of global turnover—enough to distort price unless executed as private blocks. At press time, XRP traded at $2.19. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Crash: Why $107,500 And $103,500 Are The Levels To Watch",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-crash/",
      "summary": "The Bitcoin price crash is in focus following the flagship crypto’s recent drop to as low as $103,700. Crypto analyst Captain Faibik has commented on why $107,500 and $103,500 are the most important levels to watch as BTC looks to decide its next move. Why $107,500 &#38; $103,500 Are Key For The Bitcoin Price In an X post, Captain Faibik explained that $107,500 and $103,500 are key as the bulls and bears battle to dictate the next move for the Bitcoin price. The analyst noted that later this week, BTC bulls will attempt to reclaim the $107,500 resistance and regain momentum. Related Reading: Bitcoin Price Risks Break Down To $92,000 As It Enters Accumulation Phase He predicted that a clean break and hold above $107,500 could trigger a bullish leg toward the $117,000 level, which would mark a new all-time high (ATH) for the flagship crypto. Meanwhile, on the other hand, $103,500 is an important support level which the bulls must defend as the Bitcoin price eyes new highs. Captain Faibik warned that a breakdown below could shift momentum back in favor of the bears. The Bitcoin price had surged above $106,000 on May 2 following news about the US decision to extend its pause of tariffs on some Chinese goods to August. This provided a bullish outlook for the flagship crypto after Donald Trump stated last week that China had violated the trade deal with the US. Trump and China’s president are set to have a call later this week, which could further boost the Bitcoin price if both sides could resolve any dispute regarding the current trade deal. Meanwhile, Fed Chair Jerome Powell failed to discuss the economy during his speech at the International Finance Division Anniversary Conference, which also continues to fuel market uncertainty. First Step For BTC Is To Get Back Above $106,500 In an X post, crypto analyst Kevin Capital indicated that the first step is for the Bitcoin price to successfully reclaim $106,500. He noted that BTC had recorded a weekly close below this level, which puts the flagship crypto back in the danger zone. The analyst further remarked that BTC needs to get back above this level in the coming days or things can get “sketchy looking.” Kevin Capital added that this has been a key level for months, and nothing has changed. Related Reading: Bitcoin Rise To $111,000 ATH Doesn’t Mean The Market Is Bullish, Certified Expert Says Meanwhile, crypto analyst Titan of Crypto revealed that a Katana is forming on the weekly chart for the Bitcoin price. He explained that in Ichimoku analysis, a Katana forms when Tenkan and Kijun overlap. This signals low momentum and market equilibrium. He added that this development also precedes strong directional moves, with an expansion or pullback on the horizon. At the time of writing, the Bitcoin price is trading at around $105,435, up in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "How Strategy (MSTR) Built Their Capital Stack to Accelerate Bitcoin Accumulation",
      "link": "https://bitcoinmagazine.com/bitcoin-for-corporations/how-strategy-mstr-built-their-capital-stack-to-accelerate-bitcoin-accumulation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/How-Strategy-MSTR-Built-Their-Capital-Stack-to-Accelerate-Bitcoin-Accumulation.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bitcoin-for-corporations/how-strategy-mstr-built-their-capital-stack-to-accelerate-bitcoin-accumulation\" rel=\"nofollow\"> </a></p> <p>Strategy (MSTR) engineered a multi-layer capital stack to accelerate Bitcoin accumulation—tailoring instruments to raise capital without compromise.</p> <p>"
    },
    {
      "title": "Vegas Comedown, or Was Bitcoin 2025 Too Noisy?",
      "link": "https://bitcoinmagazine.com/takes/vegas-comedown-or-was-bitcoin-2025-too-noisy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/aphoto_2025-06-03_20-49-42-2.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/vegas-comedown-or-was-bitcoin-2025-too-noisy\" rel=\"nofollow\"> </a></p> <p>Clear eyes and open minds about Bitcoin 2025: Was there too much noise, politicians, and shitcoinery?</p> <p>"
    },
    {
      "title": "Canadian Company SolarBank Adopts Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/canadian-company-solarbank-adopts-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Canadian-Company-SolarBank-Adopts-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/canadian-company-solarbank-adopts-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>SolarBank adds Bitcoin to its treasury strategy, with over $200M in clean energy partnerships.</p> <p>"
    },
    {
      "title": "Norwegian Public Company K33 AB Purchased 10 BTC For Their New Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/norwegian-public-company-k33-ab-purchased-10-btc-for-their-new-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norwegian-Public-Company-K33-AB-Purchased-10-BTC-For-Their-New-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norwegian-public-company-k33-ab-purchased-10-btc-for-their-new-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>K33 AB made its first purchase of 10 BTC valued at SEK 10 million of the secured SEK 60 million under its new Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "SEC Commissioner Hester Peirce Speaks On Privacy And Permissionlessness At PubKey",
      "link": "https://bitcoinmagazine.com/news/sec-commissioner-hester-peirce-speaks-on-privacy-and-permissionlessness-at-pubkey",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Hester-Peirce-PubKey-Bitcoin.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sec-commissioner-hester-peirce-speaks-on-privacy-and-permissionlessness-at-pubkey\" rel=\"nofollow\"> </a></p> <p>On Monday, June 2, 2025, Commissioner Peirce made the case for why permissionless technology like Bitcoin is important and should be protected, and she stated explicitly that Americans should be permitted to use crypto mixers.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Why a Bitcoin Treasury Strategy Is Risky: Analyst",
      "link": "https://decrypt.co/323489/why-a-bitcoin-treasury-strategy-is-risky-analyst",
      "summary": "Roughly half of Bitcoin treasuries established by non-crypto companies will be forced to liquidate if Bitcoin falls below $90,000, the Standard Chartered analyst wrote."
    },
    {
      "title": "Trump Meme Coin Team Is Launching a Crypto Wallet, President's Sons Deny Involvement",
      "link": "https://decrypt.co/323469/trump-crypto-wallet-president-solana-meme-coin",
      "summary": "An official President Trump-branded crypto wallet is launching in connection with his Solana meme coin and Magic Eden."
    },
    {
      "title": "Publicly Traded Edtech's Stock Soars 44% After Solana Treasury Pivot",
      "link": "https://decrypt.co/323484/publicly-traded-edtechs-stock-soars-44-solana-treasury-pivot",
      "summary": "Another Nasdaq-listed company is adopting a crypto-buying strategy—but not with Bitcoin."
    },
    {
      "title": "MARA Hits Record-High Bitcoin Production in May",
      "link": "https://decrypt.co/323457/mara-hits-record-high-bitcoin-production-in-may",
      "summary": "MARA Holdings has now grown its Bitcoin treasury to 49,228 BTC, currently worth approximately $5.3 billion."
    },
    {
      "title": "Dogecoin Begins Rebound—But These Solana and Ethereum Meme Coins Are Up Even More",
      "link": "https://decrypt.co/323465/dogecoin-begins-rebound-solana-ethereum-meme-coins-up",
      "summary": "After a rough week for meme coins, Dogecoin is outpacing Bitcoin in daily gains—while Dogwifhat, Pepe, and others are up way more on the day."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump’s son confirms team is launching a crypto wallet, denies link to circulating website",
      "link": "https://cryptobriefing.com/trump-crypto-wallet-launch/",
      "summary": "<p>Trump's potential crypto venture could significantly influence the digital asset market, attracting both political and financial interest.</p> <p>"
    },
    {
      "title": "Ripple’s flagship stablecoin approved for use in Dubai’s key financial center",
      "link": "https://cryptobriefing.com/ripple-stablecoin-approval-difc/",
      "summary": "<p>Ripple's stablecoin approval in Dubai enhances its global reach, fostering innovation in cross-border payments and digital asset solutions.</p> <p>"
    },
    {
      "title": "Coinbase aware of data leak months before public disclosure: Report",
      "link": "https://cryptobriefing.com/coinbase-data-breach-taskus/",
      "summary": "<p>The delayed disclosure of the data leak may undermine trust in Coinbase's security measures and impact its reputation and customer confidence.</p> <p>"
    },
    {
      "title": "Ethereum Foundation overhauls core team to focus on L1 performance, blob efficiency, and UX",
      "link": "https://cryptobriefing.com/ethereum-team-overhaul-performance-efficiency/",
      "summary": "<p>The Ethereum Foundation's restructuring could enhance blockchain efficiency and user experience, potentially accelerating Ethereum's adoption.</p> <p>"
    },
    {
      "title": "Justin Sun takes center stage at Bitcoin Vegas 2025 with TRON DAO as top sponsor of Code + Country and co-host of Kraken’s Oceanic Night",
      "link": "https://cryptobriefing.com/tron-dao-sponsorship-bitcoin-2025/",
      "summary": "<p>TRON DAO sponsorship highlights from Bitcoin Vegas 2025, featuring keynotes, panels, and networking events with industry leaders.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin: How BlackRock can create BTC’s next supply shock",
      "link": "https://ambcrypto.com/bitcoin-how-blackrock-can-create-btcs-next-supply-shock/",
      "summary": "<img alt=\"Bitcoin&#039;s demand spike: How Blackrock can help BTC rise\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_30_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BlackRock signals $100T advisor interest in Bitcoin market as metrics point to an incoming institutional demand."
    },
    {
      "title": "XRP on-chain payments crash 45% – Bear market signal or buying opportunity?",
      "link": "https://ambcrypto.com/xrp-on-chain-payments-crash-45-bear-market-signal-or-buying-opportunity/",
      "summary": "<img alt=\"XRP on-chain payments crash 45% - Bear market signal or buying opportunity?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-10.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Steady whale holdings hint at potential accumulation amid low activity."
    },
    {
      "title": "Uniswap breaks out: Is whale activity UNI’s missing catalyst?",
      "link": "https://ambcrypto.com/uniswap-breaks-out-is-whale-activity-unis-missing-catalyst/",
      "summary": "<img alt=\"Uniswap breaks out: Is whale activity UNI&#039;s missing catalyst?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-82-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />UNI shows signs of recovery with whale inflows, strong volume, and rising participation."
    },
    {
      "title": "Maker pump 8% as MKR whales jump to SKY staking – Details",
      "link": "https://ambcrypto.com/maker-pump-8-as-mkr-whales-jump-to-sky-staking-details/",
      "summary": "<img alt=\"Maker pump 8% as MKR whales jump to SKY staking - Details \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Maker-MKR-WP.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here's how SKY staking's double-digit rewards stirred Maker [MKR] whale activity."
    },
    {
      "title": "44 mln SUI drops into the market – 2 paths ahead for price action",
      "link": "https://ambcrypto.com/44-mln-sui-drops-into-the-market-2-paths-ahead-for-price-action/",
      "summary": "<img alt=\"44 mln SUI drops into the market - 2 paths ahead for price action\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-1-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SUI's latest token unlock tests its limits: Will bulls continue holding on, or will bears take over?"
    }
  ]
}