{
  "CoinDesk": [
    {
      "title": "Hashed Research CEO Appointed Chief Policy Officer at Korea's Presidential Office",
      "link": "https://www.coindesk.com/policy/2025/06/06/hashed-research-ceo-appointed-chief-policy-officer-at-koreas-presidential-office",
      "summary": ""
    },
    {
      "title": "Billionaire Winklevoss Twins-Backed Exchange Gemini Files With SEC For Planned IPO",
      "link": "https://www.coindesk.com/business/2025/06/06/billionaire-winklevoss-twins-backed-exchange-gemini-files-with-sec-for-planned-ipo",
      "summary": ""
    },
    {
      "title": "Weekly Recap: Circle Scores Big on IPO Fever",
      "link": "https://www.coindesk.com/news-analysis/2025/06/06/circle-scores-big-on-ipo-fever",
      "summary": ""
    },
    {
      "title": "HIVE Digital Capacity Crosses 10 EH/s in May, Aims to More Than Double That by Year-End",
      "link": "https://www.coindesk.com/markets/2025/06/06/hive-digital-capacity-crosses-10-ehs-in-may-aims-to-more-than-double-that-by-year-end",
      "summary": ""
    },
    {
      "title": "House Dems Get Bonus Hearing on Crypto Market Structure, Assail Trump Conflicts",
      "link": "https://www.coindesk.com/policy/2025/06/06/house-dems-get-bonus-hearing-on-crypto-market-structure-assail-trump-conflicts",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "TRUMP memecoin ‘hasn’t pumped’ after Eric Trump says WLF will buy big stack",
      "link": "https://cointelegraph.com/news/official-trump-memecoin-price-eric-trump-world-liberty-financial?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ3YzEtMGRkZS03MTBhLTg3MmYtNzliMmQ4N2ZkM2Q2.jpg\" /></p><p>The price of Official Trump coin briefly spiked 6% before pulling back, following Eric Trump saying the team \"remain focused on building the most exciting MEME on earth.\"</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Reality show to pit Twitch streamers against each other to win 1 BTC",
      "link": "https://cointelegraph.com/news/reality-show-twitch-streamers-win-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5NDA2NzMtMmM0MS03ODE0LWJhNjItOTVjNDk2NDgwMDli.jpg\" /></p><p>The series’ website issued a notice in May warning of a “fraudulent cryptocurrency scheme” using its branding to lure investors.</p>"
    },
    {
      "title": "Winklevoss&#039; Gemini submits confidential IPO filing amid renewed investor confidence",
      "link": "https://cointelegraph.com/news/winklevoss-gemini-confidential-ipo-investor-confidence?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ3MGItNWUwNC03MDBjLTk5MzktNGNjYzA4NDFmMDlh.jpg\" /></p><p>Gemini’s November 2021 fundraise of $400 million valued the exchange at $7.1 billion, though it has had challenges since.</p>"
    },
    {
      "title": "ETF issuers pen letter urging SEC return to ‘first-to-file’ approvals",
      "link": "https://cointelegraph.com/news/etf-issuers-letter-urging-sec-return-first-file-approvals?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDZhYjMtMjEwNC03MmUyLWI1OGYtYTA3ZGRkOWI0OTJl.jpg\" /></p><p>ETF issuers say abandoning the long-held first-to-file method stifles innovation and rewards lazy behavior on the part of filers.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Song A Day creator recounts ‘tax nightmare’ after making millions from NFT sale",
      "link": "https://cryptoslate.com/song-a-day-creator-recounts-tax-nightmare-after-making-millions-from-nft-sale/",
      "summary": "<p>Singer-songwriter Jonathan Mann recently shared the story of how earning millions in Ethereum (ETH) during a one-hour sale of his NFTs eventually became a &#8220;tax nightmare.&#8221; Mann has published one song a day over the past 17 years and released his 6,000th song on June 5, which was about the purported nightmare resulting from the [&#8230;]</p> <p>"
    },
    {
      "title": "Trump–Musk feud becomes memecoin meta, leads to surge in trading volume",
      "link": "https://cryptoslate.com/trump-musk-feud-becomes-memecoin-meta-leads-to-surge-in-trading-volume/",
      "summary": "<p>President Donald Trump and Elon Musk&#8217;s fallout caused a major spikes in memecoin launches and trading, with the largest tokens by trading activity generating over $355 million in volume over the past 24 hours, according to DEX Screener data. As traders seized on the pair’s high-profile social media clash using Solana&#8217;s ecosystem, Official Trump (TRUMP) [&#8230;]</p> <p>"
    },
    {
      "title": "Eric Trump says WLFI will acquire TRUMP for treasury, unofficial wallet project nixed",
      "link": "https://cryptoslate.com/eric-trump-says-wlfi-will-acquire-trump-for-treasury-unofficial-wallet-project-nixed/",
      "summary": "<p>Eric Trump announced that World Liberty Financial, the DeFi platform linked to President Donald Trump and his family, will take a significant treasury stake in the Official TRUMP memecoin. He also confirmed that the controversial Trump-branded wallet recently unveiled by the team behind the memecoin would not continue development. Wallet project nixed The announcement comes [&#8230;]</p> <p>"
    },
    {
      "title": "Spot Ethereum ETFs post 14-day inflow run, lifting year-to-date haul above $3B",
      "link": "https://cryptoslate.com/spot-ethereum-etfs-post-14-day-inflow-run-lifting-year-to-date-haul-above-3b/",
      "summary": "<p>Spot Ethereum (ETH) exchange-traded funds (ETFs) notched a 14-session streak of net inflows as of June 5, fueled by investment advisors and hedge fund managers. According to Bloomberg data shared by ETF Store CEO Nate Geraci, Ethereum ETFs since May 20 added roughly $812 million. This movement resulted in total net inflows of over $3 [&#8230;]</p> <p>"
    },
    {
      "title": "Senator Lummis says new Fed vice chair appointment signals ‘brighter future’ for crypto",
      "link": "https://cryptoslate.com/senator-lummis-says-new-fed-vice-chair-appointment-signals-brighter-future-for-crypto/",
      "summary": "<p>US Senator Cynthia Lummis said the confirmation of Michelle “Miki” Bowman as Vice Chair for Supervision at the Federal Reserve marks a critical shift in the regulatory approach toward digital assets. According to Lummis, the appointment is a “turning point” for crypto policy, and she expects a &#8220;brighter future&#8221; for the industry ahead. The Senate [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Sees Negative Funding On Binance – A Classic Setup For A Short Squeeze?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-sees-negative-funding-on-binance-a-classic-setup-for-a-short-squeeze/",
      "summary": "As political tensions between US President Donald Trump and Elon Musk escalated yesterday, the Bitcoin (BTC) market experienced a sharp shift in sentiment, with the funding rate on Binance flipping from positive to negative within hours. Bitcoin Funding Rates Turn Negative On Binance According to a CryptoQuant Quicktake post by contributor Darkfost, BTC funding rates on Binance have once again turned negative, even as the top cryptocurrency continues to trade above the $100,000 mark at the time of writing. Related Reading: Bitcoin Upward Momentum ‘Highly Likely’ To Continue, On-Chain Data Shows The analyst attributed the sudden reversal in funding &#8211; from +0.003 to -0.004 &#8211; to the public spat between Trump and Musk on social media. This rapid shift reflects growing fear among market participants amid heightened uncertainty. Following the sentiment shift, BTC fell from the mid-$100,000 range to a low of $100,984, according to CoinGecko. Over the past two weeks, the asset has declined by 4.1%. That said, the current dip may offer a prime buying opportunity to investors. If Bitcoin rebounds strongly, it could result in a strong resurgence in buying pressure, leading to a short squeeze that may propel BTC’s price further up. Darkfost highlighted that there have been three instances during the current market cycle when BTC witnessed such deep negative funding. Notably, each of these instances were followed by a strong upward move in the cryptocurrency. For example, on October 16, 2023, BTC dipped into negative funding territory before rallying from $28,000 to $73,000. A similar pattern played out on September 9, 2024, when the asset surged from $57,000 to $108,000. The most recent case was on May 2, 2025, when BTC jumped from $97,000 to a new all-time high (ATH) of $111,000. If history repeats, then the market may see a new ATH for BTC in the coming weeks. Darkfost noted: Such extreme readings often mark moments of maximum pessimism, precisely the kind of sentiment that can precede a strong bullish reversal when the short term negativity is gone. Large Investors Increase BTC Exposure Meanwhile, Bitcoin whales &#8211; wallets holding large amounts of BTC &#8211; continue to accumulate at a rapid pace. Notably, new whales have acquired BTC worth $63 billion, reflecting strong confidence in the asset’s near-term prospects. Related Reading: Bitcoin Hash Ribbons Indicating Prime Buying Opportunity, Analyst Says Supporting this bullish outlook, recent analysis by QCR Capital indicates that large investors expect BTC to surge to as high as $130,000 by the end of Q3 2025. Additionally, the realized cap held by long-term holders has surpassed $20 billion, reinforcing positive sentiment. That said, some analysts urge caution, expecting BTC to crash below $100,000 before resuming its bullish momentum. At press time, BTC trades at $104,069, down 0.5% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Traders Turn Bearish on Bitcoin Following High-Profile Political Tensions, Data Shows",
      "link": "https://www.newsbtc.com/bitcoin-news/traders-turn-bearish-on-bitcoin-following-high-profile-political-tensions-data-shows/",
      "summary": "Bitcoin (BTC) dropped sharply over the past 24 hours, nearing the $100,000 mark with an intraday low of $100,984. This price movement reflects increased volatility across the crypto market following a public exchange on social media between US President Donald Trump and Tesla CEO Elon Musk. Their clash appears to have triggered a wave of risk-off sentiment among traders. In response, the global crypto market cap slipped 4%, falling from over $3.4 trillion yesterday to $3.33 trillion. Meanwhile, the broader market correction has not gone unnoticed in derivatives data. Related Reading: Crypto Analyst Warns: This Bitcoin Bull Cycle Looks Nothing Like 2017 or 2021 Derivative Metrics Reveal Bearish Sentiment Spike According to CryptoQuant analyst Darkfost, the Binance net taker volume, a metric that measures the difference between aggressive longs and shorts, fell dramatically from $20 million to -$135 million in under eight hours. This signals a sharp pivot in sentiment, as traders rushed to hedge or speculate on downside risk in response to the unfolding news. Darkfost emphasized that this was the largest intraday net taker volume reversal observed on Binance this year. The abrupt shift reflects how quickly sentiment can change when macro-level narratives or influential figures dominate headlines. In this case, the market responded swiftly to perceived uncertainty, leading to a concentration of short positions and significant selling pressure. The situation also led to a notable change in BTC perpetual futures funding rates. Funding on Binance turned negative after briefly trending toward positive territory, dropping from +0.003 to below -0.004. This indicates that short sellers were willing to pay a premium to maintain bearish positions, underscoring rising fear and potentially overextended downside bets. 🔔When Funding rates turns negative. 🔹 Buying or considering a long position is often wise when funding rates turn highly negative, especially if the price starts to trend upward. This typically signals a disbelief sentiment among traders, creating strong contrarian… pic.twitter.com/LGyHU9uNNK — Darkfost (@Darkfost_Coc) June 6, 2025 Bitcoin Past Patterns Suggest Potential for Reversal Historically, deeply negative funding rates have been followed by strong recoveries in Bitcoin’s price. Darkfost noted three previous events where similar funding shifts led to large rallies: October 2023 (BTC surged from $28,000 to $73,000), September 2024 (from $57,000 to $108,000), and May 2025 (from $97,000 to $111,000). Related Reading: Bitcoin’s Key Investors Double Down, Buy Another 79,000 BTC While not guaranteed, these patterns suggest that extreme pessimism can sometimes signal market turning points. The only recent exception occurred in March 2025 following trade tariff announcements, which led to a continued decline. Still, many traders are watching closely for signs of a short squeeze, where price rebounds force short sellers to cover, amplifying upward momentum. Featured image created with DALL-E, Chart from TreadingView"
    },
    {
      "title": "Bitcoin Price Crash Trigger To $96,000: The Head And Shoulders Pattern That’s Forming",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-crash-trigger-to-96000/",
      "summary": "After days of fluctuating around the $105,000 range, Bitcoin appears to be succumbing to pressure from bears and profit-taking from traders. The most recent 24 hours were marked by Bitcoin losing its hold on the $105,000 price level, crashing until it rebounded at a lower support range around $101,000. However, technical analysis of Bitcoin&#8217;s daily candlestick timeframe chart shows that this price level is increasingly under threat, and a formation is currently in place that could lead to a price crash towards $96,000. Bitcoin Head And Shoulders Pattern Forming Crypto analyst Titan of Crypto has highlighted what is a textbook head and shoulders formation on the daily chart. This bearish pattern, if completed, would imply a breakdown toward the $96,000 price zone, according to the analyst. Related Reading: Major Bitcoin Price Drop Alert: Crash To $98,000 To Fuel Altcoin Buying Opportunity The setup is clearly defined by a peak (head) around mid-May that is flanked by two lower highs (shoulders) on either side, all sitting atop a slanted neckline that now acts as the last line of support. As of now, Bitcoin is trading just above this neckline, testing its structural integrity. In technical analysis, a clean break below the neckline accompanied by strong volume often activates the measured move from the head’s peak to the neckline, projected downward. Based on the chart, that drop points directly to $96,054. This puts Bitcoin at risk of a near 8% drawdown from current levels, with little support in between. Aside from this formation, Bitcoin&#8217;s daily RSI is currently around the 50 reading, which is a zone that often triggers reactions. As such, a drop below this midline will confirm a bearish shift in momentum. Bitcoin Price Action Closing On Bearish Mode If Bitcoin does collapse toward the $96,000 level, it would mark a departure from the bullish strength that dominated its price just two weeks ago when it registered a new all-time high at $111,814. Since then, however, Bitcoin has lost subsequent support levels at $110,000, $107,000, and $105,000, which now places the next zone of importance at $103,000. Should Bitcoin fail to hold above that threshold, the pressure would likely shift toward the $101,000 level, which could act as the final buffer before steeper declines. Related Reading: Bitcoin Price Crash Below $100,000 Still Possible: Analysts Issue Downtrend Warnings Interestingly, the neckline level of the inverse head and shoulders pattern highlighted by crypto analyst Titan of Crypto is around the $103,500 price level. Bitcoin broke below this price level in the past 24 hours, but the bulls managed to prevent further losses below $101,700. This has led to the creation of lower lows on the daily timeframe. At the time of writing, Bitcoin is trading at $103,250, which means it is back to testing the neckline resistance from below. Its reaction here would determine if it eventually crashes toward $96,000. If sellers take control at this level, it would not only confirm the head and shoulders breakdown but could also lead to a short-term capitulation across other cryptocurrencies. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Sees Largest Net Taker Volume Drop Of 2025 –  Traders React To Trump-Elon Clash",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-sees-largest-net-taker-volume-drop-of-2025-traders-react-to-trump-elon-clash/",
      "summary": "Bitcoin has continued to show strength amid rising macroeconomic uncertainty, with surging U.S. bond yields and escalating global tensions keeping markets on edge. However, recent political drama has injected new volatility into the crypto space. The world’s leading cryptocurrency experienced a sharp 5% pullback after a highly publicized clash between Elon Musk and US President Donald Trump unfolded on the social platform X. The dispute, centered around the “Big Beautiful Bill” criticized by Musk, quickly triggered reactions across financial markets. Related Reading: Solana Horizontal Support Under Pressure – Bearish Target At $142 According to top analyst Darkfost, last night marked the most significant shift in trader behavior on Binance so far in 2025. As the political spat gained attention, traders responded rapidly, viewing the event as a risk-off signal. The fallout was immediate in the derivatives market, where Binance’s net taker volume plunged from $20 million to -$135 million in under eight hours. This dramatic shift marks the largest net taker volume decline of the year, highlighting just how sensitive crypto traders remain to political developments. While Bitcoin holds key levels for now, market participants are watching closely to see if this pullback will deepen or become a launchpad for the next move higher. Bitcoin Rebounds From $100K Support But Faces Resistance Ahead Bitcoin is once again at a pivotal point after rebounding from the $100,000 support level and climbing to the $103,000 range, showing resilience despite recent volatility. The move signals strength among bulls, but the broader market remains cautious as all eyes turn to the $112,000 all-time high. A breakout above that level could ignite a new leg up, but failure to maintain momentum may lead to a deeper correction below current demand levels. Macroeconomic conditions continue to weigh on market sentiment, with rising US bond yields and escalating geopolitical tensions—particularly the public clash between Elon Musk and US President Donald Trump—injecting uncertainty into global risk assets. The reaction was clearly visible in the crypto derivatives market. Top analyst Darkfost reported that the net taker volume on Binance experienced a record shift, plunging from $20 million to -$135 million in under eight hours. This marks the largest decline in directional sentiment seen in 2025. The net taker volume reflects the imbalance between aggressive longs and shorts, and such a steep drop points to traders rapidly flipping bearish. This sharp reversal indicates fear-driven positioning. However, should Bitcoin rebound convincingly, it could trigger a cascade of short liquidations, potentially fueling a strong rally toward new highs. Related Reading: Ethereum Mirrors Bitcoin 2020 Breakout Setup – Historic Run Incoming? Price Action Details: Testing Key Level The 4-hour Bitcoin chart shows a strong rebound after briefly breaking below the $103,600 support level. BTC dipped as low as $101,159 before buyers stepped in aggressively, driving the price back to $103,826 at the time of writing. This bounce came precisely at the 200-period moving average (red line), signaling that bulls are still defending key demand zones despite recent volatility. The recovery candle printed with rising volume, suggesting renewed interest and a potential short-term trend reversal. However, Bitcoin still faces critical resistance ahead, with the 50, 100, and 200 EMAs (green, blue, purple lines) now acting as dynamic resistance between $104,600 and $107,000. A close above these levels would confirm strength and could open the door for a retest of the $109,300 resistance. Related Reading: Solana Analyst Sets $300 Target – Can Bulls Sustain A Rally? For now, the price action indicates a high-stakes battle between bulls and bears. If BTC holds above $103,600 and builds momentum, the market could regain confidence and push higher. However, failure to reclaim the moving averages may signal exhaustion and expose the price to another retest of the $100K psychological level. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Musk Exits DOGE, Clashes With Trump—Dogecoin Gets Caught In The Crossfire",
      "link": "https://www.newsbtc.com/dogecoin-2/musk-exits-doge-clashes-with-trump-dogecoin-gets-caught-in-the-crossfire/",
      "summary": "Dogecoin took a hard hit this week as tensions flared between Elon Musk and US President Donald Trump. Prices slid sharply, and red numbers dominated the market. Traders who had been riding the hype found themselves on the losing end. It was a week many will remember for how politics and memes intersected in unexpected ways. Related Reading: $500M Bet On Solana: Education Platform Aims To Supercharge Its Treasury Musk And Trump Clash According to public posts, Elon Musk officially left the Department of Government Efficiency (DOGE) on Thursday. That move came after he criticized Trump’s spending bill. He had been co-leading that department since late 2024. Their back-and-forth heated up after Trump said he was “very disappointed” in Musk. 🚨TRUMP: &#8220;I&#8217;m very disappointed with Elon. I&#8217;ve helped him a lot. He knew the inner workings of the bill better than anybody sitting here. He had no problem with it. All of a sudden he had a problem &#38; he only developed the problem when he found out we&#8217;re going to cut EV mandate&#8221; pic.twitter.com/aeCcmCAODQ — DogeDesigner (@cb_doge) June 5, 2025 In response, Musk claimed Trump would not have won the election without his support. Then Trump called Musk “CRAZY” and threatened to cancel Tesla and SpaceX contracts. Musk fired back on X with, “Go ahead, make my day.” He even warned he might decommission SpaceX’s Dragon spacecraft. Musk Mentions Epstein Documents Based on posts on X, Musk also said that files about Jeffrey Epstein’s case have stayed secret because Trump’s name appears in them. That claim added another layer to the feud. It wasn’t just about spending anymore. Now there was an allegation tying the US President to sealed Epstein investigations. Trump replied that he would pull any contracts with Musk’s companies. Time to drop the really big bomb:@realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. Have a nice day, DJT! — Elon Musk (@elonmusk) June 5, 2025 Dogecoin Price Plunge Based on reports, Dogecoin fell about 11% on Thursday alone. Over the past week, it was down 16% from its recent highs. Traders pointed to Musk’s political exit as a key factor. Many still see Dogecoin as “the people’s crypto” because of Musk’s early support. But without his backing in that government role, sentiment soured quickly. It’s a coin that has no real asset behind it, so any shift in hype can send prices tumbling. A drop of this size is rare, yet it felt inevitable once the Musk-Trump feud spilled into public view. Tesla Shares Slide Elon Musk’s companies did not escape the fallout. Tesla stock closed down 13% on Thursday. That tumble came after Trump signaled he would pull federal contracts from any company owned by Musk. Investors feared lost revenue and stiffer regulatory oversight. Tesla shares had been riding high this year, but angry tweets from Trump were enough to shake confidence. Even a short phrase on X can move markets—especially when it involves a figure as polarizing as Trump or Musk. Related Reading: Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge Crypto Market Liquidations Meanwhile, the broader crypto market also felt a jolt. According to Coinglass data, total liquidations reached $982 million in a single day. Of that, long liquidations—bets on rising prices—totaled $881 million. Short positions, or bets expecting prices to fall, saw losses of $100 million. That level of liquidation is striking, and it showed how quickly nerves can fray when big personalities clash. Bitcoin and many altcoins slid alongside Dogecoin, creating a chain reaction of forced sell-offs. Featured image from Allison Robbert and Saul Loeb/AFP, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin 2025 Las Vegas: Here’s What Went Down",
      "link": "https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-2025_ig.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down\" rel=\"nofollow\"> </a></p> <p>My name is Jenna Montgomery, and maybe you’ve read some of my news articles here before, or seen me on the TikTok. But today, I wanted to switch it up and give you an inside look at the Bitcoin 2025 Conference in Las Vegas through my eyes as an intern, hired just one [&#8230;]</p> <p>"
    },
    {
      "title": "TakeOver Successfully Hosts Second Annual BitGala Celebrating Bitcoin in Las Vegas",
      "link": "https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/TakeOver-Successfully-Hosts-Second-Annual-BitGala-Celebrating-Bitcoin-in-Las-Vegas.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas\" rel=\"nofollow\"> </a></p> <p>LAS VEGAS, NV, May 26, 2025 &#8211; TakeOver, Magic Eden, Spark, and Stacks successfully hosted their second annual BitGala on May 26th at the Wynn in Las Vegas. The celebration brought together over 200 Bitcoin industry leaders and community members for an evening dedicated to celebrating Bitcoin. The BitGala was designed as a curated gathering [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini Files Draft With The SEC For Proposed IPO",
      "link": "https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini-Files-Draft-With-The-SEC-For-Proposed-IPO.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo\" rel=\"nofollow\"> </a></p> <p>Gemini has confidentially filed a draft registration statement with SEC for a proposed IPO of its Class A common stock.</p> <p>"
    },
    {
      "title": "‘MicroStrategy of Asia’ Metaplanet Aims To Acquire Over 210,000 BTC By the End of 2027",
      "link": "https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘MicroStrategy-of-Asia-Metaplanet-Aims-To-Acquire-Over-210000-BTC-By-the-End-of-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027\" rel=\"nofollow\"> </a></p> <p>Metaplanet Inc. plans to acquire over 210,000 BTC by the end of 2027, which is equivalent to 1% of Bitcoin’s total supply.</p> <p>"
    },
    {
      "title": "Know Labs, Inc. Announces Adopting a Bitcoin Treasury Strategy, Starting with 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Know-Labs-Inc.-Announces-Adopting-a-Bitcoin-Treasury-Strategy-Starting-with-1000-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>Know Labs, Inc. announces making a Bitcoin Treasury Strategy, holding 1,000 Bitcoin and placing Greg Kidd as the CEO of the company.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Crypto Advocacy Groups Urge Dismissal of Case Against Bitcoin Mixer Samourai",
      "link": "https://decrypt.co/324098/crypto-advocacy-groups-urge-dismissal-case-bitcoin-mixer-samourai",
      "summary": "Crypto advocacy groups have argued that the case against Bitcoin mixer Samourai Wallet is unjust. Here's why."
    },
    {
      "title": "Circle IPO Outperforms Public Debuts From Meta, Robinhood and Airbnb",
      "link": "https://decrypt.co/324066/circle-ipo-outperforms-public-debuts-meta-robinhood-airbnb",
      "summary": "Stablecoin issuer Circle's stock skyrocketed out of the gate, beating the initial public markets performance of tech giants."
    },
    {
      "title": "Trump Crypto Wallet 'Isn't Moving Forward' After World Liberty Clash: Eric Trump",
      "link": "https://decrypt.co/324070/trump-crypto-wallet-isnt-moving-forward-eric-trump",
      "summary": "Eric Trump said Friday that the TRUMP meme coin team will not launch its crypto wallet following a dispute with World Liberty Financial."
    },
    {
      "title": "Polymarket to Serve as Official Prediction Market of Elon Musk’s X",
      "link": "https://decrypt.co/324062/polymarket-serve-official-prediction-market-elon-musks-x",
      "summary": "The two companies struck an agreement to create a product that will explain market moves, combining data from X posts, event contracts from Polymarket and xAI’s chatbot, Grok."
    },
    {
      "title": "Metaplanet Aims to Raise $5.3 Billion to Buy More Bitcoin",
      "link": "https://decrypt.co/324025/metaplanet-aims-raise-5-3-billion-to-buy-more-bitcoin",
      "summary": "The Bitcoin treasury is hungry for the leading cryptocurrency."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "VanEck, 21Shares, and Canary urge SEC to revert to ‘first to file, first to approve’ standard for crypto ETFs",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec-standard/",
      "summary": "<p>The shift from a \"first-to-file\" to simultaneous approval for crypto ETFs may hinder innovation and favor larger firms, impacting market fairness.</p> <p>"
    },
    {
      "title": "Best way of staking USDT in 2025: Loopring AI-powered staking platform",
      "link": "https://cryptobriefing.com/ai-powered-staking-usdt-loopring/",
      "summary": "<p>Loopring's AI-powered staking platform offers up to 20% daily on USDT, leveraging AI &#38; Ethereum Layer 2 for optimal returns.</p> <p>"
    },
    {
      "title": "Elon Musk’s X names Polymarket as official prediction market partner",
      "link": "https://cryptobriefing.com/elon-musks-prediction-markets/",
      "summary": "<p>This partnership could enhance the accuracy of public sentiment analysis, potentially influencing decision-making in politics and finance.</p> <p>"
    },
    {
      "title": "Apple, X, and Google hold talks with crypto firms on stablecoin integration",
      "link": "https://cryptobriefing.com/stablecoin-integration-tech-discussions/",
      "summary": "<p>The integration of stablecoins by major tech firms could revolutionize global payment systems, enhancing efficiency and reducing costs.</p> <p>"
    },
    {
      "title": "Coinzilla fuels 80 million+ impressions for Solidus Ai Tech in landmark crypto ad campaign",
      "link": "https://cryptobriefing.com/crypto-ad-campaign-record-impressions/",
      "summary": "<p>The campaign's success highlights the transformative potential of strategic advertising in rapidly scaling crypto and AI ventures.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum whale moves $159M in 1 mysterious transfer – Dump incoming?",
      "link": "https://ambcrypto.com/ethereum-whale-moves-159m-in-1-mysterious-transfer-dump-incoming/",
      "summary": "<img alt=\"Ethereum whale moves $159M in 1 mysterious transfer - Dump incoming?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum whales slow accumulation amid tightening profits. Is capitulation next?"
    },
    {
      "title": "Solana rattled by whale moves – Is SOL’s path to $160 still alive?",
      "link": "https://ambcrypto.com/solana-rattled-by-whale-moves-is-sols-path-to-160-still-alive/",
      "summary": "<img alt=\"Solana rattled by whale moves – Is SOL&#039;s path to $160 still alive?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-87-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana sees mixed whale behavior, a major CDD spike, and key resistance near $155."
    },
    {
      "title": "SUI loaded with 25x shorts – Hints of a violent move emerge",
      "link": "https://ambcrypto.com/sui-loaded-with-25x-shorts-hints-of-a-violent-move-emerge/",
      "summary": "<img alt=\"SUI loaded with 25x shorts - Hints of a violent move emerge\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-1-2.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SUI can embark on a breakdown, instead of a pullback."
    },
    {
      "title": "53 mln XRP whale transfer jolts market – Can bulls defend the $2 wall?",
      "link": "https://ambcrypto.com/53-mln-xrp-whale-transfer-jolts-market-can-bulls-defend-the-2-wall/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-06T144405.358_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whales moved $118M, shorts dominate—can XRP hold $2 or will the bears drive it down harder?"
    },
    {
      "title": "Bitcoin drops to $100K after $324 mln liquidations – Traders eye recovery",
      "link": "https://ambcrypto.com/bitcoin-drops-to-100k-after-324-mln-liquidations-traders-eye-recovery/",
      "summary": "<img alt=\"Bitcoin drops to $100K after $324 mln liquidations - Traders eye recovery\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-6.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin Futures suffer with $324 million in long position liquidations, as Trump-Musk feud goes public."
    }
  ]
}