{
  "CoinDesk": [
    {
      "title": "Investment Advisors Become Top Holders of Spot Bitcoin ETFs, Ether ETF Demand Rises",
      "link": "https://www.coindesk.com/markets/2025/06/05/investment-advisors-become-top-holders-of-spot-bitcoin-etfs-ether-etf-demand-rises",
      "summary": ""
    },
    {
      "title": "Bitcoin's 50-Day Average Hits Record High, but There's a Catch",
      "link": "https://www.coindesk.com/markets/2025/06/05/bitcoin-s-50-day-average-hits-record-high-but-there-s-a-catch",
      "summary": ""
    },
    {
      "title": "Crypto Investment Firms 3iQ, Cryptonite Debut Structured Investment Vehicle in Switzerland",
      "link": "https://www.coindesk.com/business/2025/06/05/crypto-investment-firms-3iq-and-cryptonite-launch-amc-in-switzerland",
      "summary": ""
    },
    {
      "title": "Elon Musk Blasts U.S. Spending Bill as Debt Nears $37T",
      "link": "https://www.coindesk.com/markets/2025/06/05/elon-musk-blasts-us-spending-bill-as-debt-nears-37t",
      "summary": ""
    },
    {
      "title": "Coinbase Unlocks DeFi Opportunities for XRP and Dogecoin Holders on Base",
      "link": "https://www.coindesk.com/markets/2025/06/05/coinbase-unlocks-defi-opportunities-for-xrp-and-dogecoin-holders-on-base",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "$13B fund manager APS buys $3.4M in tokenized real estate via MetaWealth",
      "link": "https://cointelegraph.com/news/metawealth-aps-tokenized-real-estate-investment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNmOTUtZDI0OC03ZGIzLTg5MTUtYzE1MWZmMDE5M2Qz.jpg\" /></p><p>European fund manager APS bought $3.4 million in tokenized real estate via MetaWealth, marking the first direct institutional purchase of retail-available tokenized assets.</p>"
    },
    {
      "title": "RWA token market grows 260% in 2025 as firms embrace regulating crypto",
      "link": "https://cointelegraph.com/news/rwa-token-market-bitcoin-adoption-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNmNWUtNzNiZi03MzdlLWE1NmUtMzk0YjRmN2Q5MTgy.jpg\" /></p><p>RWAs are benefiting from increasing US crypto regulatory clarity, which has pushed the tokenization sector past $23 billion.</p>"
    },
    {
      "title": "US seizes 145 domains, crypto linked to BidenCash dark web market",
      "link": "https://cointelegraph.com/news/us-seizes-crypto-145-domains-bidencash-dark-web-market?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNlZGMtN2I2YS03MGM5LWJmOGEtNjA2ODhiYjViMjQ5.jpg\" /></p><p>US authorities seized 145 domains and crypto linked to BidenCash, a dark web market accused of selling millions of stolen credit cards.</p>"
    },
    {
      "title": "Crypto leverage trader James Wynn loses $25M on Bitcoin bet",
      "link": "https://cointelegraph.com/news/crypto-leverage-trader-james-wynn-loses-25m-bitcoin-bet?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNlMDctY2JmZi03NjEyLWI3OTAtMzdiY2MzZjVkYTA3.jpg\" /></p><p>Hyperliquid leverage trader James Wynn has claimed the market is being manipulated against him after he was liquidated for 240 Bitcoin, worth $25 million.</p>"
    },
    {
      "title": "California advances bill on unclaimed crypto and merchant payments",
      "link": "https://cointelegraph.com/news/california-moves-forward-bill-unclaimed-crypto-merchant-payments?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWU5ZDEtNWRhOC03MjNlLWFmYzctMGRlNTQ4NWMxMTcw.jpg\" /></p><p>The bill has seen contention online, but Satoshi Action Fund’s Eric Peterson says it updates the state’s unclaimed property laws so crypto doesn’t get liquidated.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US takes down 145 domains linked to $17M darknet marketplace and seize crypto wallets",
      "link": "https://cryptoslate.com/us-takes-down-145-domains-linked-to-17m-darknet-marketplace-stealing-crypto-and-credit-card-data/",
      "summary": "<p>US law enforcement agencies seized 145 domains and crypto linked to BidenCash, a darknet marketplace known for selling stolen credit card data, and personal information, according to a June 4 statement. The takedown followed a court-approved investigation that targeted the platform’s infrastructure. The seized domains now redirect users to a server controlled by the authorities, [&#8230;]</p> <p>"
    },
    {
      "title": "Venezuelans turn to stablecoins as Government arrests Instagram FX rate account mods",
      "link": "https://cryptoslate.com/venezuelans-turn-to-stablecoins-as-government-arrests-instagram-fx-rate-account-mods/",
      "summary": "<p>Venezuela’s government has arrested at least 20 moderators of the popular Instagram page “Monitor Dólar,” accusing them of terrorism, money laundering, and fraud for publishing the widely used parallel exchange rate, Interior Minister Diosdado Cabello has reported.. The sweep, which began in night‑time raids on May 29, revives tactics last seen during the country’s 2013‑18 hyper‑inflation [&#8230;]</p> <p>"
    },
    {
      "title": "Donald Trump’s advisor Bo Hines meets Nayib Bukele as US eyes El Salvador’s Bitcoin strategy",
      "link": "https://cryptoslate.com/donald-trumps-advisor-bo-hines-meets-nayib-bukele-as-us-eyes-el-salvadors-bitcoin-strategy/",
      "summary": "<p>Bo Hines, who leads President Donald Trump’s advisory council on digital assets, recently met with El Salvador’s President Nayib Bukele to discuss potential partnerships in the crypto space. In a post shared on June 5, Hines revealed that the meeting centered around digital asset development and a shared ambition to reshape global finance. He also [&#8230;]</p> <p>"
    },
    {
      "title": "AEON Integrates TRON Network to Enable Seamless In-Store Payments",
      "link": "https://cryptoslate.com/aeon-integrates-tron-network-to-enable-seamless-in-store-payments/",
      "summary": "<p>Singapore &#8211; June 5, 2025 – AEON, the next-generation crypto framework built for payments, has integrated the TRON network to enable seamless in-store payments. Through AEON Pay, users can now transact using TRX, the native utility token of the TRON network. USDT and USDD on TRON for offline payments are also included to bring fast [&#8230;]</p> <p>"
    },
    {
      "title": "Moroccan police arrests suspect behind recent crypto-related kidnappings in France",
      "link": "https://cryptoslate.com/moroccan-police-arrests-suspect-behind-recent-crypto-related-kidnappings-in-france/",
      "summary": "<p>Moroccan police have arrested a dual-national French-Moroccan man wanted for an alleged connection with a series of kidnappings in France that targetted individuals with crypto holdings, Reuters reported on June 4, citing a source familiar with the case. According to the source, Moroccan police identified the man as Bajjou Badiss Mohamed AmiDe, who is 24 [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Scarcity May Spark Explosive Surge, Bank Study Shows",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-scarcity-may-spark-explosive-surge-bank-study-shows/",
      "summary": "Bitcoin’s available coins for trading have dropped sharply. That change could push prices higher if demand holds up. Related Reading: Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge According to Sygnum Bank’s June 2025 Monthly Investment Outlook, the liquid supply of Bitcoin fell by about 30% over the last 18 months. In that time, nearly 1 million BTC left exchanges. That means fewer coins are ready to move at a moment’s notice. Liquid Supply Tightens Based on reports from Sygnum Bank, exchange balances dropped by around 1 million BTC since late 2023. That amount equals roughly 5% of Bitcoin’s total supply. When coins leave exchanges, they often go into cold storage or long-term funds. Some of these funds include new exchange-traded funds and corporate buyers issuing equity or debt to buy Bitcoin. If coins are locked away, traders have to compete for a smaller pool of available coins. That gap between supply and demand can cause bigger price swings on the upside. Institutions And State Moves Three US states have now passed laws to hold Bitcoin as part of their reserves. New Hampshire already signed its bill into law. Texas is expected to follow soon. A third state is also moving forward, though details are still pending. In addition, governments abroad are paying attention. Pakistan’s government has said it will look into Bitcoin reserves. In the UK, the Reform Party—currently leading in election polls—plans to study something similar. When a state or country actually buys Bitcoin for its coffers, it can spark more buying. That act has a double effect: it creates immediate demand and it signals that public institutions see Bitcoin as a store of value. Safe-Haven Status Strengthens Rising uncertainty over the US dollar and US debt worries have driven some investors toward Bitcoin. In May, as US Treasury prices slid on concerns about rising debt levels, digital gold and physical gold saw higher interest. Bitcoin is being viewed more like a hedge against dollar weakness. On days when Treasuries wobble, some cash moves into crypto markets. Larger swings on the upside than on the downside also hint that institutions may be soaking up dips more quickly. Sygnum’s data shows that since June 2022, Bitcoin’s upward moves have been larger than its downward moves. That may be a sign that big players have become more confident in holding through small sell-offs. Related Reading: XRP Could Transform Your Finances Long Before $10K, Angel Investor Says Ethereum’s Comeback Ethereum is also stirring after a period of sluggish performance. The recent Pectra upgrade on Ethereum has spurred more fees and drawing fresh interest. Several big banks and financial firms are now exploring tokenization platforms built on Ethereum and its layer-2 networks. When more institutions issue tokenized assets, the whole crypto space could benefit. Renewed activity on Ethereum often spills back into Bitcoin. That could add to overall demand for top coins. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "The Last Bitcoin Cycle? Swan Says History’s Turning",
      "link": "https://www.newsbtc.com/bitcoin-news/last-bitcoin-cycle-swan-history-turning/",
      "summary": "Bitcoin is drifting just above $105,000 on June 5, its lowest realized volatility in almost two years, yet Swan, the Los-Angeles-based “Bitcoin-only” financial services firm, contends the market is on the verge of its most radical re-pricing ever. The Last Chance To Buy? In a X thread on Wednesday night, the company argued that the familiar four-year boom-and-bust cadence is giving way to “the last rotation”—a silent transfer of coins from retail speculators to institutions whose investment horizons stretch decades. “People less committed to the long term are exiting […] and a whole new class of investors is entering,” Swan is quoting Michael Saylor, framing the hand-off from retail traders to corporate treasuries, ETFs and multinationals such as BlackRock and Fidelity. So far, 2025 has defied the script. The third calendar year of every prior cycle—2013, 2017 and 2021—delivered the vertical moves that defined those eras. This year has offered “big moves, but also shallower corrections and longer periods of sideways chop,” Swan writes, conceding that the price action “is boring people.” Related Reading: Bitcoin Signals Strength As Long-Term Holder Realized Cap Surges Past $20 Billion – Details The firm’s thesis is that boredom masks an invisible supply squeeze: long-time holders taking profits above $100,000 while “long-only buyers,” in Swan’s words, methodically absorb the float. “These corporations, they’re long-only buyers. Not traders of Bitcoin,” Swan argues, underscoring the firm’s view that coins migrating into corporate vaults are effectively removed from circulation. The thread portrays three intertwined rotations: Between entities – Trustees, lawyers and early adopters are exiting; ETFs, corporations and “sovereign-grade balance sheets” are stepping in. Between intentions – Speculation gives way to allocation. “This new wave of buyers isn’t speculating,” Swan writes. “They’re allocating.” Between generations. The Silent Generation hoarded gold; Boomers compounded in equities; Gen X surfed tech; now Millennials, “entering their peak accumulation years,” are “inheriting trillions—and they’re choosing Bitcoin.” Related Reading: Bitcoin Pauses Below $106K as Analyst Reveals Key Support Level To Watch Supply dynamics, Swan contends, make those rotations irreversible. “When long-term capital meets inelastic supply, the float starts vanishing,” the firm warns. “That’s when things get explosive.” The macro backdrop adds pressure: Swan points to a “rare and dangerous split” in which the US dollar is weakening even as bond yields surge—an environment, it says, that could funnel excess capital toward a neutral store of value. “This isn’t just the next cycle. It’s the end of an era,” Swan concludes. “If you’re selling now, understand you’re likely handing your Bitcoin to an institution that plans to hold it indefinitely. Once it’s gone, you’re probably never getting it back.” For Swan, the implication is stark. The apparent tranquility near $105,000 is less a sign of exhaustion than the quiet before a permanent liquidity event—one in which the marginal seller disappears, the marginal buyer never sells, and price must eventually mark higher to find equilibrium. “Think twice,” Swan advises would-be profit-takers. “The float is drying up. The buyers are built different. This is the last Bitcoin rotation.” If the firm is right, history is not repeating so much as culminating, and the market’s current stillness may soon be remembered as the eye of a generational storm. At press time, BTC traded at $104,605. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Solana Turns to Wall Street Investors, Pushing Meme Coins like Snorter to New Highs",
      "link": "https://www.newsbtc.com/news/solana-turns-to-wall-street-investors-pushing-meme-coins-like-snorter-to-new-highs/",
      "summary": "Solana’s out to rebuild a digital empire, and it’s doing it from an office building in Lower Manhattan. Having a physical headquarters might seem a bit counter-intuitive for a company focused on digital assets. But the move is fueling an ongoing shift at Solana Labs, from Solana the meme coin chain to Solana as a serious, ‘Wall-Street-ready’ DeFi chain. The offices opened back in 2023, and Solana Labs uses them as a staging board where potential partners and investors can come visit and chat directly with Solana’s devs. The move is paying off; even as more and more companies adapt a ‘Bitcoin reserve’ strategy to use with $SOL. What does it all mean? Even as Solana takes aim at becoming the go-to blockchain for finance, top crypto presales set out to build on the blend of memes and finance provided by the Solana chain. Solana: Go-To Blockchain for Finance? Major companies like Upexi, Inc ($UPXI) are taking Michael Saylor’s Bitcoin reserve strategy and applying it to Solana. Upexi purchased 77,879 $SOL, giving it a total of 679,677 $SOL valued at $121M. The company has gained roughly $24.5M from token appreciation so far, aided by a good month, performance-wise, from $SOL itself. Upexi isn’t the only company looking to capitalize on Solana’s success: SkyBridge Capital, led by Anthony Scaramucci, poured $50M into a Solana Staking ETF in Canada Apollo and Securitize partnered to launch tokenized credit funds on Solana and other blockchains SOL Strategies announced a $500M investment to facilitate SOL token acquisitions and partnerships Classover, an education company, will issue up to $500M in convertible notes to build a SOL treasury That’s a lot of money starting to pour into Solana&#8217;s potential as a financial tool, instead of a simple platform for spamming new meme coins. Of course, degens being what they are, meme coins are still being spammed. A lot of them. A million of them, actually, just in May alone on Solana. Most of those launches fail almost immediately. But the sheer volume of new tokens launched demonstrates continued interest in Solana’s speed and low fees, ideal factors for meme coin success. With a pump.fun token launch likely incoming, it’s not like Solana’s abandoning the meme coin world altogether. Instead, some of the most promising new crypto projects bring both sectors together. Snorter Token ($SNORT): Find 100x Opportunities On Telegram with Snorter Bot With so many tokens launching all the time, the question isn’t ‘will there be a 100x token.’ The real question is – how do you find it? That’s where the Snorter Token ($SNORT) and the Snorter Bot come in. Tons of Solana meme coins never make it to big CEX listings or major news coverage. Instead, they’re traded on Telegram groups. If they do make it big, the best opportunities for buying low and selling high are long gone. Finding these underground opportunities takes a lot of effort, but thankfully, the Snorter Bot simplifies it all. Safety features like honeypot detection and rugpull alerts help minimize losses, while automated sniping and copy trading let you sniff out and snag the best opportunities. It’s all powered by the $SNORT token, the native utility token for the Snorter Bot. This isn’t a meme coin; it’s a sophisticated trading bot designed to sort through the millions of Solana memes and find the real winners. That utility is driving a wave of interest in $SNORT, with well over $400K raised so far. The presale is in the early days, which makes it the perfect time to buy and stake your $SNORT tokens for an estimated 735% dynamic APY. Buy and stake now, claim your rewards at the token launch, and they’ll be disbursed block-by-block over the next year. A full quarter of the token supply is reserved for product development, powering $SNORT into the future of Solana’s meme coin development. Will the Snorter Bot Bridge the Gap Between Memes and Finance? With millions of dollars flowing into Solana and the $SOL token as a strategic reserve, there’s room for a token that stays true to Solana’s meme coin roots while also looking to the finance future. Do your own research – you’ll need to decide for yourself. But given Solana’s trajectory, $SNORT could be positioned perfectly. Don’t miss out."
    },
    {
      "title": "Dogecoin Price Crash Below $0.2: 4H Order Block Shows Exactly What’s Happening",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-price-crash-0-2/",
      "summary": "Following the Bitcoin price sweep down below the $104,000 level over the weekend, the Dogecoin price was pushed back down below $0.2 once again. This move understandably shocked the community as the $0.2 has held for a long time. However, using the 4-hour order block (OB), a crypto analyst has explained what is going on with the Dogecoin price, why the decline happened, and where it could be headed next. Dogecoin Price Experienced A Liquidity Sweep Crypto analyst Smart Flows, on the TradingView website, pointed out an interesting development on the Dogecoin price chart. This showed a clear delineation for why the meme coin’s price dropped below the $0.2 psychological support level, and it came down to something as clean as a liquidity sweep. Related Reading: Ethereum Price Headed For Crash To $2,000 With Current Price Action The crypto analyst uses the 4-Hour order block on the Dogecoin price chart to explain this, starting just above the $0.22 price level. This saw a liquidity sweep through the Fair Value Gap (FVG) at the 0.5 Fibonacci level, breaking through the $0.2 support. This move, Smart Flows explains, was in no way emotional and was more of a ‘mechanical’ move, suggesting it was engineered to happen. The outcome of this liquidity sweep is that there has now been a reset of sentiment surrounding the Dogecoin price, setting the stage for a potential reversal. If this is the case, then Dogecoin may be sitting on the cusp of what could be the next major rally above $0.2. What To Expect Next From Here According to the crypto analyst, Dogecoin is now sitting in a 4-Hour demand order block zone that is in confluence with the Fair Value Gap (FVG) above $0.2. This makes the $0.20928 level the first “key reaction point,” and the analyst points out two possibilities for the meme coin here: either the price continues to stall or consolidation begins at this level. Related Reading: Crypto Analyst Says XRP Community Should Pay Attention To June 4-6, Here’s Why Basically, the Dogecoin price has to be able to beat the first major test at $0.209 before moving higher from here. This means it must complete a clean clearance of the FVG to grab liquidity above. After this, the real test begins at $0.22094, where the next major 4-Hour order block sits. The analyst explains that being able to clear the FVG will mean a continuation model is in play. However, there is still the possibility that the Dogecoin price is rejected before it is able to clear the FVG above $0.2. In this case, it could signal a further downtrend for the altcoin. “If we reject early — that tells me distribution is starting, and I’ll prep for a secondary sweep below 0.18 to retest the deeper 4H OB near 0.16387,” the analyst concluded. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin’s Key Investors Double Down, Buy Another 79,000 BTC",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoins-key-double-down-buy-another-79000-btc/",
      "summary": "On-chain data shows the large Bitcoin investors have added to their holdings in the past week, a sign that could be bullish for BTC&#8217;s price. Bitcoin Investors With 10 To 10,000 BTC Have Added To Their Holdings In a new post on X, the on-chain analytics firm Santiment has talked about the latest trend in the Bitcoin supply held by the 10 to 10,000 BTC investors. The on-chain indicator of relevance here is the &#8220;Supply Distribution,&#8221; which tells us about the total number of tokens that a particular wallet group is carrying right now. Related Reading: Bitcoin ATH Fails To Hype Retail—Demand Is Actually Down Addresses or investors are placed into these cohorts based on the size of their balance. For example, the 1 to 10 coins group includes all holders owning between 1 and 10 tokens of the cryptocurrency. In the context of the current discussion, the groups lying inside the 10 to 10,000 BTC range are of interest. This wide range includes some of the key holders of the sector like the sharks and whales. These investors own significant holdings, so their behavior can often be worth keeping an eye on. Now, here is the chart shared by the analytics firm that shows the trend in the Bitcoin Supply Distribution of the 10 to 10,000 BTC holders over the last few months: As is visible in the above graph, the Bitcoin supply held by the 10 to 10,000 BTC investors has registered a significant jump over the past week, implying this group has purchased a net number of coins. More specifically, the members of the cohort have collectively added 79,244 BTC to their wallets in this period. At the current exchange rate, this amount converts to a whopping $8.3 billion. Related Reading: Bitcoin 3–5 Year Holders Slow Selloff—Waiting for Higher Prices? From the chart, it&#8217;s visible that this accumulation from the key investors has arrived while BTC has been going down after forming a new all-time high (ATH). This could be a potential indication that these holders still believe in the rally and see this drawdown as just a dip opportunity. That said, the 10 to 10,000 range is a bit wide, so while it does include the big-money investors, it also mixes up their behavior with some of the less-significant hands. Fortunately for Bitcoin, it would appear that the whales (1,000 to 10,000 BTC) agree with this trend of buying, as the chart shared by analyst Ali Martinez implies. As displayed in the graph, the whales of the cryptocurrency have added around 30,000 tokens to their holdings during the past few days, meaning that it&#8217;s not just the mid-sized hands buying this dip. BTC Price At the time of writing, Bitcoin is floating around $105,200, down over 2% in the last seven days. Featured image from Dall-E, Santiment.net, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Matador Technologies Raises C$1.64M To Invest in Their Bitcoin Reserve",
      "link": "https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Matador-Technologies-Raising-C1-Million-to-Invest-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve\" rel=\"nofollow\"> </a></p> <p>Matador Technologies announced it raised C$1,644,300 across the issuance of 2,652,097 units to add more bitcoin to their reserve.</p> <p>"
    },
    {
      "title": "Support The Blockchain Regulatory Certainty Act (BRCA) To Protect Noncustodial Services",
      "link": "https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Blockchain-Regulatory-Certainty-Act-Save-Our-Wallets-Bitcoin-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services\" rel=\"nofollow\"> </a></p> <p>Call your local elected officials and tell them to support the BRCA, which protects developers of noncustodial technology as well as a variety of services that preserve privacy and make it easier to scale Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: The Key To Scaling Bitcoin",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Layer2-Introduction.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bitcoin and other blockchains are robust and decentralized systems, but they do not scale. In order to make them work, a layered approach is necessary.</p> <p>"
    },
    {
      "title": "JPMorgan to Offer Clients Financing Against Bitcoin & Crypto ETFs",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-Morgan-Plans-to-Offer-Clients-Financing-Against-Crypto-ETFS.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs\" rel=\"nofollow\">JPMorgan to Offer Clients Financing Against Bitcoin &#038; Crypto ETFs</a></p> <p>JPMorgan Chase &#38; Co. plans to allow its trading and wealth-management clients to use cryptocurrency-linked assets, including spot Bitcoin exchange-traded funds (ETFs), as collateral for loans, according to Bloomberg. The bank will begin with BlackRock’s iShares Bitcoin Trust (IBIT), and additional ETFs are expected to be added over time. The policy will apply globally, spanning [&#8230;]</p> <p>"
    },
    {
      "title": "BTCPay Server: The Backbone of Bitcoin Commerce, 2025",
      "link": "https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_young_modern_wizard_male_futuristic_clothi_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025\" rel=\"nofollow\"> </a></p> <p>With plugins for Boltz swaps and WooCommerce, BTCPay Server’s open-source platform supports merchants globally, no middleman required.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Hong Kong Opens Door to Crypto Derivatives in Bid to Rival Global Hubs",
      "link": "https://decrypt.co/323833/hong-kong-crypto-derivatives",
      "summary": "Hong Kong may soon be able to trade crypto derivatives thanks to the securities regulator's new plan."
    },
    {
      "title": "Amazon to Spend $10 Billion on North Carolina Data Centers for AI Expansion",
      "link": "https://decrypt.co/323815/amazon-10-billion-north-carolina-data-centers-ai-expansion",
      "summary": "Amazon’s AI expansion may boost jobs, but it risks concentrating innovation in Big Tech’s hands, an expert told ."
    },
    {
      "title": "Japanese Company Ispace's Probe Expected to Land On The Moon Tomorrow",
      "link": "https://decrypt.co/323812/japanese-company-ispaces-probe-land-moon-tomorrow",
      "summary": "The Tokyo-listed company aims to land its RESILIENCE probe on the moon Friday, marking its second attempt to reach the lunar surface."
    },
    {
      "title": "US Seizes Crypto and 145 Domains Linked to Dark Web Marketplace",
      "link": "https://decrypt.co/323809/us-seizes-crypto-145-domains-dark-web-marketplace",
      "summary": "BidenCash served 117,000 users and trafficked over 15 million stolen credit cards and personal data before being taken down."
    },
    {
      "title": "Ethereum Foundation Sets Treasury Strategy to Back DeFi, Cut Spending Over Time",
      "link": "https://decrypt.co/323805/ethereum-foundation-treasury-strategy-back-defi-cut-spending",
      "summary": "The new policies seek to lower operating costs, establish strict triggers for ETH sales, and enforce “Defipunk” privacy standards."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "JPMorgan Chase set to accept Bitcoin, crypto ETFs as loan collateral",
      "link": "https://cryptobriefing.com/jpmorgan-crypto-loan-collateral/",
      "summary": "<p>JPMorgan's move to accept crypto ETFs as collateral could accelerate mainstream adoption and integration of digital assets in traditional finance.</p> <p>"
    },
    {
      "title": "BlackRock’s Bitcoin ETF futures go live on Moscow Exchange as fund surpasses $70 billion AUM",
      "link": "https://cryptobriefing.com/bitcoin-futures-moscow-exchange/",
      "summary": "<p>The integration of Bitcoin ETFs into Russia's financial markets may signal a shift towards broader acceptance and regulation of crypto assets.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus files with SEC for potential $300M XRP reserve strategy, stock surges pre-market",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy/",
      "summary": "<p>Webus's strategic XRP reserve plan could enhance global payment solutions, potentially transforming cross-border transactions and boosting investor confidence.</p> <p>"
    },
    {
      "title": "Trump’s top crypto advisor meets with Pakistan blockchain chief to discuss Bitcoin",
      "link": "https://cryptobriefing.com/bitcoin-strategic-cooperation-pakistan/",
      "summary": "<p>Pakistan's strategic Bitcoin initiatives could strain IMF relations, highlighting challenges for emerging markets in crypto adoption.</p> <p>"
    },
    {
      "title": "Eric Trump threatens legal action over unauthorized Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/eric-trump-crypto-wallet-warning/",
      "summary": "<p>The incident highlights the complexities and potential legal challenges of using high-profile branding in the rapidly evolving crypto space.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum whales scoop up $364 mln – but why ETH isn’t rallying yet",
      "link": "https://ambcrypto.com/ethereum-whales-scoop-up-364-mln-but-why-eth-isnt-rallying-yet/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The purchase is bold, but is it too quiet to move Ethereum out of its rut?"
    },
    {
      "title": "South Korea’s President Lee reveals why crypto is a ‘national growth engine’",
      "link": "https://ambcrypto.com/south-koreas-president-lee-reveals-why-crypto-is-a-national-growth-engine/",
      "summary": "<img alt=\"South Korea&#039;s President Lee reveals why crypto is a &#039;national growth engine&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"777\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/South-Koreas-crypto-push.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1382\" />Trump might be influencing more than just U.S. politics, Is South Korea mirroring his crypto stance?"
    },
    {
      "title": "Ethereum Foundation’s treasury plan – Will a 66% spending cut boost ETH’s value?",
      "link": "https://ambcrypto.com/ethereum-foundations-treasury-plan-will-a-66-spending-cut-boost-eths-value/",
      "summary": "<img alt=\"Ethereum Foundation&#039;s treasury plan - Will a 66% spending cut boost ETH&#039;s value?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Benjamin47.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Arkham data showed the Ethereum Foundation has 216.15K ETH worth $565.18 million at current prices."
    },
    {
      "title": "XRP hits a wall as sellers push price below $2.3: Can buyers reclaim control?",
      "link": "https://ambcrypto.com/xrp-hits-a-wall-as-sellers-push-price-below-2-3-can-buyers-reclaim-control/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/XRP-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The 3-month liquidation heatmap revealed that a rejection from the $2.3-$2.35 supply zone was imminent."
    },
    {
      "title": "Raydium price under threat: Will $2.2 support prevent further losses?",
      "link": "https://ambcrypto.com/raydium-price-under-threat-will-2-2-support-prevent-further-losses/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Raydium-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The Raydium bulls were fighting an uphill battle after a night's forced march and on empty stomachs."
    }
  ]
}