{
  "CoinDesk": [
    {
      "title": "SHIB Long-Short Ratio Slides as Over $1.8M in Bullish Bets Liquidated",
      "link": "https://www.coindesk.com/markets/2025/06/18/shib-long-short-ratio-slides-as-over-usd1-8m-in-bullish-bets-liquidated",
      "summary": ""
    },
    {
      "title": "Bitcoin Traders’ Are Looking at a Key Data Point in Fed Meeting and Its Not Interest Rate Decision",
      "link": "https://www.coindesk.com/markets/2025/06/18/here-is-what-bitcoin-traders-are-focusing-on-for-wednesdays-fed-meeting",
      "summary": ""
    },
    {
      "title": "Dogecoin Zips Down 7% Amid Low Risk-On Sentiment",
      "link": "https://www.coindesk.com/markets/2025/06/18/dogecoin-zips-down-7-amid-low-risk-on-sentiment",
      "summary": ""
    },
    {
      "title": "XRP, ADA Lead Crypto Majors Slide, While Bitcoin Watchers Target Return to Highs in Q3",
      "link": "https://www.coindesk.com/markets/2025/06/18/xrp-ada-lead-crypto-majors-slide-while-bitcoin-watchers-target-return-to-highs-in-q3",
      "summary": ""
    },
    {
      "title": "XRP Drops 5% as High-Volume Selling Pressure Dominates Market",
      "link": "https://www.coindesk.com/markets/2025/06/18/xrp-drops-5-as-high-volume-selling-pressure-dominates-market",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Agriculture firm AgriFORCE powers 120 crypto miners with natural gas",
      "link": "https://cointelegraph.com/news/agriforce-powers-120-crypto-miners-stranded-natural-gas?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgwZGItOGYzOC03MDQ3LWIwMTEtNTBkYWY0ODU1Yjhl.jpg\" /></p><p>AgriFORCE says it launched a site that uses stranded gas to power 120 Bitcoin mining rigs and will expand to two additional sites in Canada.</p>"
    },
    {
      "title": "Bitcoin, crypto dip as Trump says Iran’s leader an ‘easy target’",
      "link": "https://cointelegraph.com/news/bitcoin-crypto-market-tumble-donald-trump-iran-leader-comments?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgxMzItZGYzMS03Y2RmLTkzZjQtZjQyNWRkZDBkY2Q2.jpg\" /></p><p>The crypto market dropped after US President Donald Trump said he knows where Iran’s leader is hiding and that he is an “easy target.”</p>"
    },
    {
      "title": "Washington’s second-biggest city, Spokane, bans crypto ATMs",
      "link": "https://cointelegraph.com/news/washington-spokane-bans-crypto-atms?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgxMmQtMDUwZi03MjU0LTg4NTAtODViMDZhMGIwZWYw.jpg\" /></p><p>Spokane City Council has banned crypto ATMs to curb rising scams, giving operators 60 days to remove machines amid concerns over fraud and vulnerable residents.</p>"
    },
    {
      "title": "Archetyp dark web market shut down, but ecosystem adapts: TRM Labs",
      "link": "https://cointelegraph.com/news/archetyp-dark-web-market-takedown-darknet-adapts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGQ3MjYtMTMxMC03ZWZhLTliYmQtMThkOGE5OTY4MDFl.jpg\" /></p><p>The Archetyp dark web market had over 600,000 users, a total transaction volume of at least $287 million and over 17,000 listings, mainly offering drugs for sale.</p>"
    },
    {
      "title": "Bitcoin and HYPE could get $844M total windfall from 4 public US firms",
      "link": "https://cointelegraph.com/news/bitcoin-hype-884-million-windfall-public-firms-allocation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgwNjgtOTMzOC03ZjJiLTg0Y2QtYzczNWFmZmJhMTZh.jpg\" /></p><p>DDC Enterprise and Fold Holdings have confirmed raises worth a total of $778 million as a biotech firm said it would raise $50 million to add HYPE as a treasury asset.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US DOJ, Europol seize world’s largest dark web drug market operating via Monero",
      "link": "https://cryptoslate.com/us-doj-europol-seize-worlds-largest-dark-web-drug-market-operating-via-monero/",
      "summary": "<p>An international law enforcement effort has dismantled one of the world’s largest and longest-running criminal marketplaces on the darknet, arresting its suspected German operator in Spain and seizing millions in illicit assets, according to a June 16 press release. The takedown, coordinated by the Frankfurt Public Prosecutor’s Office, Germany’s Federal Criminal Police Office (BKA), the [&#8230;]</p> <p>"
    },
    {
      "title": "LatAm energy giant executes landmark $75M oil and gas deal via blockchain tokenization",
      "link": "https://cryptoslate.com/latam-energy-giant-executes-landmark-75m-oil-and-gas-deal-via-blockchain-tokenization/",
      "summary": "<p>Feniix Energy, an energy firm based in Latin America, has completed a $75 million acquisition of a live oil and gas operation using blockchain tokenization, according to a statement shared with on June 17. Global Settlement, a blockchain firm specializing in real-world assets (RWAs), executed the deal through its GSX Protocol. The protocol enabled [&#8230;]</p> <p>"
    },
    {
      "title": "DAMA 2: Deutsche Bank unveils institutional tokenization stack to fast-track regulated funds",
      "link": "https://cryptoslate.com/dama-2-deutsche-bank-unveils-institutional-tokenization-stack-to-fast-track-regulated-funds/",
      "summary": "<p>Deutsche Bank, Memento Blockchain, and Interop Labs published a litepaper on June 17 outlining plans for Digital Asset Management Access 2 (DAMA 2), a tokenization platform intended to operate on public blockchains and facilitate the issuance of regulated funds. According to the paper, DAMA 2 would link three layers: Ethereum (ETH) would act as the [&#8230;]</p> <p>"
    },
    {
      "title": "VanEck’s Solana ETF moves closer to market entry with DTCC listing",
      "link": "https://cryptoslate.com/vanecks-solana-etf-moves-closer-to-market-entry-with-dtcc-listing/",
      "summary": "<p>VanEck’s planned Solana (SOL) exchange-traded fund has been listed with the Depository Trust &#38; Clearing Corporation (DTCC) under the ticker symbol VSOL, signaling another step in mainstreaming Solana exposure for traditional investors. According to DTCC records, the fund is labeled “VANECK SOLANA TR COM SHS BEN INT” and falls under the ‘D’ settlement category, an [&#8230;]</p> <p>"
    },
    {
      "title": "US Senate approves landmark GENIUS Act for stablecoin regulation",
      "link": "https://cryptoslate.com/us-senate-approves-landmark-genius-act-for-stablecoin-regulation/",
      "summary": "<p>The Senate approved the Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act in a 51-23 vote on June 17, sending the measure to the House for consideration. The vote followed a 68-30 cloture decision on June 11 that cut off debate and started the mandatory 30-hour countdown to the final roll call. Senator [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Setting Up For ‘Large Move’ Amid $103,000 Retest – Key Levels To Watch",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-setting-up-for-large-move-amid-103000-retest-key-levels-to-watch/",
      "summary": "Amid the tension in the Iran-Israel conflict, the cryptocurrency market experienced another daily pullback. Bitcoin (BTC), which had just recovered from Friday’s drop, erased its recent gains and recorded a 4.5% dip to the $103,000 mark in the past 24 hours. However, some analysts believe that the flagship crypto is preparing for a big move in the coming weeks. Related Reading: Ethereum Eyes Big Move As Price Compresses Between Key Levels – $2,100 Or $4,000 Next? Bitcoin Could See Massive Move Soon On Monday, Bitcoin attempted to break its post-November range high but failed to hold the $108,000-$109,000 area as support for the fourth time in a month, falling back into its larger range. Market watcher Daan Crypto Trades noted that this resistance level remains a key area to watch, adding that “without a clean break above, it&#8217;s not the time to get excited just yet.” Nonetheless, the trader considers that the BTC is “setting up for a large move” as the cryptocurrency continues to hold its monthly range between $100,000 and $110,000. He asserted that this range will break &#8220;at some point in June,” as well as the current weekly high and low, which have “a very low probability of being held” in the coming days. Daan added that a break from these levels is highly possible in the next 1-2 weeks, likely leading to a big move in the direction of the break. Analyst Sjuul from AltCryptoGems highlighted the crypto market’s performance and investors’ concerns amid the war-related headlines, noting that Bitcoin reacted in a similar pattern during past geopolitical and crypto-related events. According to the analyst, global events’ uncertainty has led to mass liquidation and on-chain panic multiple times since 2020, leading to 30%-50% crashes. However, the market has recovered from these events after significant accumulation. Here’s the pattern: Big event (Black Swan). Panic headlines. Sharp BTC dump. Retail Panic sells. Smart money buys. Time passes. Bitcoin hits new highs. Based on this, Sjuul forecasted a strong Bitcoin pump and a new all-time high (ATH) once the current war tensions are over. BTC Holds Key Support Amid Pullback Meanwhile, analyst Rekt Capital emphasized that Bitcoin has been retesting its old range high as support for the past six weeks and showing stability around the $104,400 level during this period. According to the analyst, as long as BTC’s price Weekly Closes above this level, the candle wicks below it are “just noise” and it is positioned to transition into its Second Price Discovery Uptrend. He also pointed out that the cryptocurrency has only seen a less than 10% dip during the recent pullbacks. Moreover, these drop depths have also been diminishing, with the first rejection producing a 7.72% drop and the second dip being 5.79% deep, while the current rejection has seen a 4.5% retrace so far. Rekt Capital considers the strongest support to be between the $102,000-$104,000 area, and the final level to break is the range high resistance of $108,890. Related Reading: XRP Must Complete Right Shoulder Before Takeoff—But How Low First? &#8220;As long as this resistance isn&#8217;t rejecting price too much, then maybe it&#8217;s getting weaker over time,” he affirmed, concluding that a weekly close above this level would be “a very strong sign for a reclaim of this resistance into new support to springboard price higher.” As of this writing, Bitcoin is trading at $105,085, a 1.1% jump in the past hour. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Bitcoin Holds Below $110K as IBCI Suggests Market in Transition Phase",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-holds-below-110k-as-ibci-suggests-market-in-transition-phase/",
      "summary": "Bitcoin continues to trade in a range just below its recent all-time high, maintaining a relatively stable price structure despite broader market fluctuations. As of the time of writing, BTC is priced at approximately $105,756, reflecting a 1% drop in the past 24 hours and a 5.4% decline from its record peak of over $111,000 reached last month. The asset has been consolidating within this band for several weeks, with no clear breakout yet in sight, indicating a moment of uncertainty or possible transition in market direction. A CryptoQuany analyst known as Gaah has offered insights into this phase of the cycle. Related Reading: On-Chain Analyst Warns: Bitcoin Peak Expected, Altcoins Facing -95% Plunge Bitcoin IBCI Suggests Cycle Is Ongoing, Not Exhausted Gaah recently published an analysis on the QuickTake platform, focusing on Bitcoin’s IBCI (Index Bitcoin Cycle Indicators). According to"
    },
    {
      "title": "Solana (SOL) Tests Support After Dip — Bounce or Breakdown Ahead?",
      "link": "https://www.newsbtc.com/analysis/solana-sol-tests-support-145/",
      "summary": "Solana started a fresh decline from the $160 zone. SOL price is now consolidating losses and might decline further below the $145 level. SOL price started a fresh decline from the $160 resistance zone against the US Dollar. The price is now trading below $155 and the 100-hourly simple moving average. There was a break below a bullish trend line with support at $150 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could start a fresh increase if it clears the $152 resistance zone. Solana Price Dips Further Solana price failed to continue higher above the $160 level and started a fresh decline, like Bitcoin and Ethereum. SOL gained pace and traded below the $155 support level. There was a break below a bullish trend line with support at $150 on the hourly chart of the SOL/USD pair. The pair even traded below the $148 level. A low was formed near $145 and the price recently started a consolidation phase. It tested the 23.6% Fib retracement level of the recent decline from the $158 swing high to the $145 low. Solana is now trading below $150 and the 100-hourly simple moving average. On the upside, the price is facing resistance near the $150 level. The next major resistance is near the $152 level. It is close to the 50% Fib retracement level of the recent decline from the $158 swing high to the $145 low. The main resistance could be $155. A successful close above the $155 resistance zone could set the pace for another steady increase. The next key resistance is $160. Any more gains might send the price toward the $165 level. Another Decline in SOL? If SOL fails to rise above the $152 resistance, it could start another decline. Initial support on the downside is near the $145 zone. The first major support is near the $142 level. A break below the $142 level might send the price toward the $130 zone. If there is a close below the $130 support, the price could decline toward the $125 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is gaining pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $145 and $142. Major Resistance Levels – $152 and $155."
    },
    {
      "title": "$150,000 Bitcoin Is In Play—Unless This One Macro Metric Snaps",
      "link": "https://www.newsbtc.com/bitcoin-news/150000-bitcoin-unless-this-one-macro-metric-snaps/",
      "summary": "Bitcoin may be gearing up for a renewed surge, but according to trader Josh Olszewicz, the bullish setup is walking a macroeconomic tightrope—and one wrong move could send everything tumbling. In his June 16 “Macro Monday” update, Olszewicz laid out a broad-based technical and macroeconomic case for why BTC is holding firm near all-time highs, while warning that the market’s resilience is underpinned by a single, fragile macro factor: liquidity. $150K Bitcoin? Only If Powell Doesn’t Pull The Plug “Crypto clearly doesn&#8217;t care. Legacy clearly doesn&#8217;t care,” Olszewicz said, referring to the continued rally in risk assets despite no rate cuts from the Federal Reserve. “Both of those are mooning without rates coming down.” The key, according to him, lies in the quiet resurgence of global liquidity. While the Fed has not yet pivoted to easing, and markets are pricing near-zero odds of cuts in the June or July FOMC meetings, US and global liquidity metrics have started to turn upward. Olszewicz specifically pointed to reverse repo operations and the Treasury General Account (TGA) as crucial levers. “When reverse repo drains, it helps liquidity. When TGA spends down, it helps liquidity. Right now, neither is doing much, but both are trending in the right direction,” he said. “And that’s enough to keep risk assets buoyant.” Related Reading: Bitcoin To $140,00 In 50 Days? Bitwise Bets On War Rally The current setup, Olszewicz argued, bears little resemblance to the hard tightening regimes of 2018 or 2022. Globally, rate hike cycles are easing or reversing altogether. “It has been liquidity going up,” he emphasized. “If liquidity falls, if rates go up, then I&#8217;d expect crypto to have a hard time.” For Bitcoin, which remains pinned near its all-time high, the structure looks increasingly constructive. The trader noted that BTC has so far resisted any meaningful breakdowns and continues to reclaim key technical levels. “We&#8217;re hovering at all-time highs. That&#8217;s what you want to see,” he said. “You want to see us just continually fight off these sell-offs. It&#8217;s not a good look to lose highs quickly.” From a technical standpoint, Olszewicz identified $97,980 as the key downside level to watch if Bitcoin does falter. But on the upside, he sees clear potential for continuation: “I like $122K as a pit stop, and then eventually we’ll settle in probably somewhere in the $150K range if we really get going.” But that path is far from guaranteed. The wildcard in Olszewicz’s framework is US liquidity—a metric he calculates as the Federal Reserve balance sheet minus the TGA and reverse repo. It’s rising, but only modestly. “We are seeing liquidity start to tick up again back to the top of the range,” he said. “Nothing super impressive just yet, but this is very helpful—especially for alts, obviously for BTC, but this is what alts need.” And that’s the catch. If liquidity stalls or reverses—whether due to an unexpected Fed tightening move, a jump in TGA balances around tax deadlines, or a reactivation of reverse repo drains—then the entire crypto rally could be put at risk. “If this goes to zero,” Olszewicz warned about the reverse repo facility, “there may be liquidity issues and then they may have to reinstate QE.” Related Reading: On-Chain Analyst Warns: Bitcoin Peak Expected, Altcoins Facing -95% Plunge He also flagged August as a critical juncture, with a possible US debt ceiling crunch looming. “Just pay attention to what&#8217;s going on going into August, assuming the debt ceiling isn&#8217;t raised,” he said. “Higher the debt, higher the deficit, the more investors move to fixed supply assets. That’s better for crypto.” But none of this guarantees a clean move to $150K. As Olszewicz noted, we’re still waiting on one essential domino to fall: inflation stability. While “true inflation” data from independent trackers is hovering in the low 2s, Fed-preferred metrics like CPI and PCE remain volatile. For Powell to act, the data needs to show three to six months of sustained, flatline 2% inflation. “You do not want 2.3 one month, 2.6 the next month, 2.4, 2.8,” Olszewicz said. “You want a stable 2%.” Until then, the Fed is likely to hold firm. But the longer Bitcoin maintains momentum without a rate cut, the more market psychology begins to shift—toward a scenario where easing becomes a bonus, not a prerequisite. “If we’re doing well without rates coming down, why are we rooting for rates to come down?” Olszewicz asked. The answer, for Bitcoin, may come down to just one macro metric: liquidity. If it holds, $150,000 is still very much in play. But if it snaps—so could the cycle. At press time, BTC traded at $105,325. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "XRP Price Slides Under Support Level, Selling Pressure Intensifies",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-slides-2-220/",
      "summary": "XRP price started a fresh decline below the $2.20 zone. The price is now consolidating losses and might decline further below the $2.150 zone. XRP price started a fresh decline below the $2.20 zone. The price is now trading below $2.20 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $2.180 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start another decline if it trades below the $2.120 support zone. XRP Price Dips Again XRP price failed to continue higher above the $2.280 level and reacted to the downside, like Bitcoin and Ethereum. The price declined below the $2.250 and $2.220 support levels. Besides, there was a break below a key bullish trend line with support at $2.180 on the hourly chart of the XRP/USD pair. The pair tested the $2.150 support A low was formed at $2.1425 and the price is now consolidating losses below the 23.6% Fib retracement level of the recent decline from the $2.335 swing high to the $2.145 low. The price is now trading below $2.220 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.1880 level. The first major resistance is near the $2.20 level. The next resistance is $2.240 or the 50% Fib retracement level of the recent decline from the $2.335 swing high to the $2.145 low. A clear move above the $2.240 resistance might send the price toward the $2.280 resistance. Any more gains might send the price toward the $2.320 resistance or even $2.350 in the near term. The next major hurdle for the bulls might be $2.40. More Losses? If XRP fails to clear the $2.220 resistance zone, it could start another decline. Initial support on the downside is near the $2.150 level. The next major support is near the $2.120 level. If there is a downside break and a close below the $2.120 level, the price might continue to decline toward the $2.050 support. The next major support sits near the $2.020 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.150 and $2.120. Major Resistance Levels – $2.20 and $2.220."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "U.S. Senate Passes Stablecoin Bill The GENIUS Act",
      "link": "https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/USA-GENIUS-BILLpg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act\" rel=\"nofollow\"> </a></p> <p>The U.S. Senate has passed the Guiding and Establishing National Innovation for U.S. Stablecoins (GENIUS) Act (S. 394) by a vote of 68-30, establishing the first comprehensive federal framework for fiat-backed stablecoins. The bipartisan legislation was introduced by Senator Bill Hagerty and co-sponsored by Senators Tim Scott, Kirsten Gillibrand, and Cynthia Lummis. It passed under [&#8230;]</p> <p>"
    },
    {
      "title": "BBVA Tells Wealthy Clients to Invest Up to 7% in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BBVA.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Spanish bank BBVA is now advising its wealthy clients to invest up to 7% of their portfolios in crypto and Bitcoin, showing how traditional banks are starting to see the potential of Bitcoin.&#160; &#8220;With private customers, since September last year, we started advising on Bitcoin,&#8221; said Philippe Meyer, head of digital &#38; blockchain solutions at [&#8230;]</p> <p>"
    },
    {
      "title": "Ukraine Introduces Bill to Allow Bitcoin in National Reserves",
      "link": "https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Ukraine-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves\" rel=\"nofollow\"> </a></p> <p>Ukraine has introduced a bill that would give its central bank the legal right to hold Bitcoin and other assets as part of its national reserves. The draft law, submitted to the Verkhovna Rada on June 10, 2025, proposes updates to existing legislation to include “virtual assets” in the foreign exchange and gold reserves of [&#8230;]</p> <p>"
    },
    {
      "title": "Fold Holdings Secures $250 Million Equity Deal to Expand Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Fold-Holdings-Secures-250M-Equity-Deal-to-Expand-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>Fold aims to increase its bitcoin treasury through a $250M equity facility, giving the company flexibility to raise funds as needed.</p> <p>"
    },
    {
      "title": "Thailand Approves Five Year Bitcoin And Crypto Tax Break",
      "link": "https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Thailand-Approves-Tax-Exemption-on-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break\" rel=\"nofollow\"> </a></p> <p>Thailand has approved a five year tax exemption on capital gains from cryptocurrency trading made through licensed digital asset platforms. The exemption will be in effect from January 1, 2025, through December 31, 2029. Deputy Finance Minister Julapun Amornvivat announced the measure, calling it a move to increase investment, stimulate economic activity, and drive long [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Thailand Exempts Crypto Capital Gains to Boost Global Hub Ambitions",
      "link": "https://decrypt.co/325746/thailand-exempts-crypto-capital-gains",
      "summary": "Deputy Finance Minister Julapun Amornvivat said Thailand aims to become “one of the world’s financial hubs” with its crypto tax exemption."
    },
    {
      "title": "Gemini Files Complaint Against CFTC, Alleges 7-Year 'Lawfare' Campaign",
      "link": "https://decrypt.co/325742/gemini-files-complaint-against-cftc",
      "summary": "Gemini flagged a whistleblower tied to fraud who may still receive a $1.5 million award, despite an arbitrator ruling he lied to regulators."
    },
    {
      "title": "Meta is Attempting to Poach OpenAI Staff With $100M Signing Bonuses: Sam Altman",
      "link": "https://decrypt.co/325739/meta-openai-staff-100m-signing-bonuses-altman",
      "summary": "OpenAI CEO Sam Altman said Tuesday Facebook parent Meta is attempting to woo his employees with limited success."
    },
    {
      "title": "China’s JD Eyes Global Stablecoin Licenses to Slash Payment Costs",
      "link": "https://decrypt.co/325723/chinas-jd-eyes-global-stablecoin-licenses",
      "summary": "Chinese e-commerce giant JD.com says it could cut cross-border settlement costs as it plans to acquire stablecoin licenses"
    },
    {
      "title": "OpenAI Lands Pentagon Deal—Musk’s xAI Left Watching From Sidelines",
      "link": "https://decrypt.co/325716/openai-lands-pentagon-deal",
      "summary": "A new $200 million contract with the Department of Defense puts OpenAI ahead in the race to bring AI to government."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "US Senate passes GENIUS stablecoin bill, advancing it to the House for final approval",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house/",
      "summary": "<p>US Senate passes the GENIUS stablecoin bill, advancing it to the House for a vote in 3 weeks with rules on backing, audits, and oversight.</p> <p>"
    },
    {
      "title": "JPMorgan Chase to pilot stablecoin-like JPMD for institutional clients on Base",
      "link": "https://cryptobriefing.com/jpmorgan-jpmd-deposit-token/",
      "summary": "<p>JPMorgan's pilot of JPMD tokens could accelerate institutional adoption of blockchain technology, influencing future financial systems.</p> <p>"
    },
    {
      "title": "How is technology redefining money and currency?",
      "link": "https://cryptobriefing.com/technology-redefining-money-currency/",
      "summary": "<p>Technology is redefining money with digital assets, smart contracts, and blockchain, shifting value exchange beyond traditional currency.</p> <p>"
    },
    {
      "title": "Kraken-backed layer 2 Ink to launch $INK token",
      "link": "https://cryptobriefing.com/kraken-ink-token-launch/",
      "summary": "<p>The launch of $INK could significantly enhance DeFi ecosystems by fostering user-driven governance and expanding on-chain capital markets.</p> <p>"
    },
    {
      "title": "Coinbase plans to offer tokenized equities to rival Robinhood, Charles Schwab",
      "link": "https://cryptobriefing.com/coinbase-tokenized-equities-sec-approval/",
      "summary": "<p>Coinbase's move into tokenized equities could reshape financial markets by increasing competition, innovation, and accessibility in trading.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin’s next big move? Here’s why there’s good reason to believe it’s coming soon!",
      "link": "https://ambcrypto.com/bitcoins-next-big-move-heres-why-theres-good-reason-to-believe-its-coming-soon/",
      "summary": "<img alt=\"Bitcoin&#039;s next big move? Here&#039;s why there&#039;s good reason to believe its coming soon!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-5.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The current scenario is a potent combination of permanent holder demand, reduced selling on exchanges."
    },
    {
      "title": "Tron crypto’s $210M IPO plan – Will it take TRX to the next level?",
      "link": "https://ambcrypto.com/tron-cryptos-210m-ipo-plan-will-it-take-trx-to-the-next-level/",
      "summary": "<img alt=\"TRON\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_48_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Backed by Dominari Securities, the $210 million TRX fund aims to fuel Tron Inc.’s public debut."
    },
    {
      "title": "Zebec crypto’s price struggles at $0.004 – Will support hold on for recovery?",
      "link": "https://ambcrypto.com/zebec-cryptos-price-struggles-at-0-004-will-support-hold-on-for-recovery/",
      "summary": "<img alt=\"Zebec crypto&#039;s price struggles at $0.004 – Will support hold on for recovery?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Zebec-crypto-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Stalled ZBCN momentum over the past ten days could be advantageous to swing traders."
    },
    {
      "title": "What do Bitcoin’s mid-cycle metrics tell us about its next price rally?",
      "link": "https://ambcrypto.com/what-do-bitcoins-mid-cycle-metrics-tell-us-about-its-next-price-rally/",
      "summary": "<img alt=\"What do Bitcoin&#039;s mid-cycle metrics tell us about its next price rally?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-17T161334.568-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin metrics hinted at mid-cycle strength and undervaluation, suggesting room for a sustained uptrend."
    },
    {
      "title": "Optimism unveils major decentralization push with Season 8 governance overhaul",
      "link": "https://ambcrypto.com/optimism-unveils-major-decentralization-push-with-season-8-governance-overhaul/",
      "summary": "<img alt=\"Optimism unveils major decentralization push With Season 8 governance overhaul\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Optimism-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Optimism governance changes lowered the barriers for participation."
    }
  ]
}