{
  "CoinDesk": [
    {
      "title": "Crypto Daybook Americas: Bitcoin Holds the Line as Trump Labels Iran Leader ‘Easy Target’",
      "link": "https://www.coindesk.com/daybook-us/2025/06/18/crypto-daybook-americas-bitcoin-holds-the-line-as-trump-labels-iran-leader-easy-target",
      "summary": ""
    },
    {
      "title": "Token That’s Literally USELESS Is Crypto’s Latest Meme Cult",
      "link": "https://www.coindesk.com/markets/2025/06/18/token-that-s-literally-useless-is-crypto-s-latest-meme-cult",
      "summary": ""
    },
    {
      "title": "Bitcoin 'Accumulator' Better Fit for Corporates Than Dollar-Cost Averaging Strategy, Research Suggests",
      "link": "https://www.coindesk.com/markets/2025/06/18/bitcoin-accumulator-better-fit-for-corporates-than-dollar-cost-averaging-strategy-research-suggests",
      "summary": ""
    },
    {
      "title": "Every Fintech Firm Will Run Its Own Blockchain 'in Next Five Years:' Optimism",
      "link": "https://www.coindesk.com/business/2025/06/18/every-fintech-firm-will-run-its-own-blockchain-in-next-five-years-optimism",
      "summary": ""
    },
    {
      "title": "Spain's BBVA Is Advising Clients to Invest Up to 7% of Portfolio in BTC, ETH: Reuters",
      "link": "https://www.coindesk.com/business/2025/06/18/spains-bbva-is-advising-clients-to-invest-up-to-7-of-portfolio-in-btc-eth-reuters",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "GENIUS Act passage paves way for institutional stablecoin use",
      "link": "https://cointelegraph.com/news/genius-act-stablecoin-bank-settlements-institutional-adoption?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NWY5ZDMtNWQ3Yy03OWZjLTk4MDAtYWYxNjNmMGU2MzA2.jpg\" /></p><p>The GENIUS Act is one step closer to becoming law in a development that may make stablecoin issuers key players in the US economy.</p>"
    },
    {
      "title": "XRP price consolidates for 200 days: Analysts predict where it’s going next",
      "link": "https://cointelegraph.com/news/xrp-price-consolidates-for-200-days-analysts-predict-next?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzg3MTUtNGYwNS03MDE5LTlhNzAtNGIzN2U2YmY3NDU0.jpg\" /></p><p>Bullish fractals from 2017 suggest XRP could rally toward $3.70–$10, with some projections pointing to a breakout as high as $25 or more.</p>"
    },
    {
      "title": "Circle dump: Cathie Wood’s Ark sells another $45M as shares tumble",
      "link": "https://cointelegraph.com/news/circle-dump-cathie-wood-ark-dumps-45-million-more-shares-tumble?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgyNDgtN2YwOC03ZGY2LWE2YjAtNDI2NGE4NmM2YTNl.jpg\" /></p><p>In the past two days, ARK has offloaded a total of 642,766 Circle shares, accounting for 14% of its 4.49 million CRCL purchase made during the company’s public launch.</p>"
    },
    {
      "title": "Chinese Bitcoin ASIC makers to begin US production amid tariff pressure",
      "link": "https://cointelegraph.com/news/producer-behind-90?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDg4MjQtZDQxMi03ZjE5LTg5ZGItZmMyNWYwODgwY2U3.jpg\" /></p><p>Bitmain, Canaan and MicroBT — producing over 99% of global Bitcoin mining ASICs — are launching US-based production units in response to tariffs.</p>"
    },
    {
      "title": "Europe’s first Bitcoin treasury firm buys another $20M BTC, now holds over $170M",
      "link": "https://cointelegraph.com/news/blockchain-group-adds-20m-bitcoin-holdings-now-over-170m?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzg3OGItOWIyNi03Y2NlLTg1ZTctMTJhYWUzNTE1OGY1.jpg\" /></p><p>The Blockchain Group has acquired another $20 million in Bitcoin, lifting its total holdings to 1,653 BTC and posting a 1,173% BTC yield in 2025.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Chinese Bitcoin mining giants move production to US amid tariff tensions",
      "link": "https://cryptoslate.com/chinese-bitcoin-mining-giants-move-production-to-us-amid-tariff-tensions/",
      "summary": "<p>China&#8217;s top three Bitcoin mining rig manufacturers, Bitmain, Canaan, and MicroBT, are reportedly shifting parts of their production to the United States, Reuters reported on June 18. The move comes as a response to intensifying trade tensions triggered by President Donald Trump&#8217;s renewed tariff policies. These tariffs, aimed at reducing US reliance on foreign technology, [&#8230;]</p> <p>"
    },
    {
      "title": "Solana faces consolidation after failing to hold $180 breakout",
      "link": "https://cryptoslate.com/solana-faces-consolidation-after-failing-to-hold-180-breakout/",
      "summary": "<p>Solana is currently in a retracement that unwound most of its late-May upside. After a monthly high of $179.68 on May 22, spot prices lost traction and declined to $148.00 by June 18, marking a 14.6% slide. Futures tracked the spot decline closely, ending the period down 11.2% at $148.30. Price action was defined by [&#8230;]</p> <p>"
    },
    {
      "title": "Iran-based crypto exchange hacked for $48M amid cyberattack claims by Israel-linked group",
      "link": "https://cryptoslate.com/iran-based-crypto-exchange-hacked-for-48m-amid-cyberattack-claims-by-israel-linked-group/",
      "summary": "<p>Iranian crypto exchange Nobitex has suffered a major security breach, resulting in the loss of over $48 million. The company confirmed the attack via an X post on June 18, revealing that the incident targeted its hot wallets. It stated: &#8220;This morning our technical team detected signs of unauthorized access to a portion of our [&#8230;]</p> <p>"
    },
    {
      "title": "How Nemo Money Is Redefining Global Investing With Smart Tools and Zero Commission Trading",
      "link": "https://cryptoslate.com/how-nemo-money-is-redefining-global-investing-with-smart-tools-and-zero-commission-trading/",
      "summary": "<p>Introduction In an increasingly complex investment world, Nemo Money is breaking through the noise. As a next-generation investing app developed by Exinity, Nemo is designed for both new and experienced investors looking for smarter, more accessible ways to manage their money — without paying excessive fees. Built for Investors Who Want More With over 6,000 [&#8230;]</p> <p>"
    },
    {
      "title": "US DOJ, Europol seize world’s largest dark web drug market operating via Monero",
      "link": "https://cryptoslate.com/us-doj-europol-seize-worlds-largest-dark-web-drug-market-operating-via-monero/",
      "summary": "<p>An international law enforcement effort has dismantled one of the world’s largest and longest-running criminal marketplaces on the darknet, arresting its suspected German operator in Spain and seizing millions in illicit assets, according to a June 16 press release. The takedown, coordinated by the Frankfurt Public Prosecutor’s Office, Germany’s Federal Criminal Police Office (BKA), the [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "How Low Can Cardano Go? Analyst Maps Final Crash Before Resolution",
      "link": "https://www.newsbtc.com/news/cardano/how-low-can-cardano-go-final-crash/",
      "summary": "After more than five weeks of unrelenting downside pressure, Cardano (ADA) finds itself approaching a potentially decisive juncture. In a new analysis published June 18, crypto analyst Quantum Ascend (@quantum_ascend) offered a fresh take on ADA’s price structure, warning that the final leg of a downward five-wave Elliott pattern may now be unfolding—with a critical resolution point drawing near. How Low Can Cardano Crash? “We dropped down into that second wave&#8230; and had it highlighted, it bounced from there. So we did call that correctly,” the analyst began, referencing earlier predictions. But despite the brief bounce, he now sees a more extended impulse playing out. “It does look like we&#8217;re turning this into more of a five-wave move down. So one, two, three, four, and working on a fifth wave now,” he explained while analyzing the one-day chart of ADA. Related Reading: Whales Dump Over 270 Million Cardano In One Week – Bearish Signal Or Shakeout? At the core of the bearish outlook is Fibonacci confluence. Quantum Ascend pointed out that ADA currently hovers around the 0.702 retracement level, with the 0.786 level lying just beneath it—both key zones often associated with deeper corrections in Elliott Wave theory. “Makes complete sense for us to go ahead and drop in right to this area at the very minimum,” he noted. Yet despite the grim technicals, the analyst maintains that no structural damage has occurred—at least not yet. “As long as we hold the 51 cent level, nothing&#8217;s broken, it&#8217;s not a problem, right?” he reassured. The broader context, however, is less encouraging: “We need Bitcoin to catch a little bit of a bid or Ethereum or something. We need some kind of good news to come in to alleviate a little bit of this because the market’s just pretty much been bleeding… for over a month now.” ADA has underperformed relative to its peers since early May, with sentiment sliding alongside price. But Quantum Ascend encouraged viewers not to overreact to the current downtrend. “All it is is an opportunity to dollar cost average,” he said, before addressing the exhaustion many long-term holders are feeling. “I know what you&#8217;re saying, QA. I&#8217;ve been dollar cost averaging for seven months. I get it. I&#8217;ve been there.” Related Reading: Nasdaq Says Yes To Cardano: ADA Earns A Spot Among Crypto Giants Rather than panic-sell or obsess over day-to-day moves, the analyst recommended mental distance and patience. “Go do something fun, it’s beautiful, it’s summer. Go do something else, anything else. But this thing is gonna resolve itself and alt season is around the corner,” he said. Despite short-term bearishness in the chart, his long-term conviction remains intact. “World War III is not starting. I could not have more conviction in all those things.” With ADA potentially entering the final leg of a corrective structure and broader markets searching for a catalyst, all eyes are now on whether support zones hold—or if Cardano is headed even lower before the long-awaited resolution finally arrives. At press time, ADA traded at $0.6158. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Crypto’s Unlikely Ally: Top Analyst Reveals War As A Surprising Bullish Force",
      "link": "https://www.newsbtc.com/news/cryptos-unlikely-ally-top-analyst-reveals-war-as-a-surprising-bullish-force/",
      "summary": "Crypto analyst Cyclop has made a potentially significant statement, claiming that the ongoing crisis between Israel and Iran may inadvertently boost the performance of digital assets. Despite recent volatility, which saw a sell-off of approximately $140 billion in the crypto market, Cyclop&#8217;s long-term analysis reveals a more optimistic outlook for the broader digital asset industry. Analyst Predicts Bullish Trends For Crypto Amid Conflicts In a recent post on X (formerly Twitter), Cyclop pointed to historical patterns that suggest geopolitical tensions often lead to bullish trends in cryptocurrency. Citing specific instances from April and October 2024, he noted that Bitcoin (BTC) experienced an initial decline of 18% and 10% respectively during these conflicts, only to rebound with impressive gains of 28% and 62% shortly thereafter. This trend, he argues, indicates a recurring cycle where war-related dips in crypto prices eventually transform into significant growth, as can be depicted in the chart below shared by Cyclop. Related Reading: On-Chain Analyst Warns: Bitcoin Peak Expected, Altcoins Facing -95% Plunge The analyst explains that while such conflicts can trigger short-term bearish movements, the overarching impact tends to be favorable for cryptocurrencies. As wars ignite fears of inflation and instability, Cyclop has noted that many investors for the traditional finance arena turn to crypto as a hedge against weakening fiat currencies. Unlike traditional bank accounts, cryptocurrencies are not subject to freezing, he said, making them appealing during times of geopolitical unrest. Increasingly, digital currencies are being viewed as a form of &#8220;digital gold,&#8221; a safe haven in tumultuous times. Favorable Macroeconomic Factors The current market dynamics echo previous events, such as the Russia-Ukraine conflict and US-Iran tensions in 2020, which similarly resulted in temporary dips followed by recoveries. Cyclop remains confident that the present situation will yield similar outcomes, despite the typical summer slowdown that often affects market activity. Supporting this bullish sentiment are favorable macroeconomic factors. Recent developments indicate that the US and China have reached a compromise, easing tariffs and aiming to stabilize global supply chains. This move is expected to help cool inflation and restore investor confidence. Moreover, President Donald Trump&#8217;s decision to delay new tariffs has contributed to a more risk-friendly environment, allowing liquidity to flow back into crypto markets. Related Reading: Dogecoin Sets The Stage For A Liftoff With Key Reversal Pattern Further aiding this positive outlook is the latest Consumer Price Index (CPI) report, which showed a modest increase of just 0.1% month-over-month, slightly below forecasts. With year-over-year inflation at 2.4%—down from an expected 2.5%—the Federal Reserve (Fed) is now anticipated to cut interest rates twice by the end of the year. Historically, such rate cuts have been bullish for cryptocurrencies, as they often lead to increased liquidity in the markets. While the immediate aftermath of the Israel-Iran conflict may present challenges, historical data suggests that cryptocurrencies have the potential to thrive in such environments. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Volume Surges 100% Amid War Threats – What To Expect",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-volume-surges-100/",
      "summary": "Amid the chaos that was sparked by Israel’s attack on Iran, Bitcoin has climbed again, shaking off the losses triggered by the conflict. Not only has the price seen an increase from its last week’s lows, but there has also been a notable change in the cryptocurrency’s daily trading volume. This points to continued interest despite global factors and could mean that the expectations of war are already getting priced in for the crypto market. Bitcoin Sees Almost 100% Jump In Volume According to data from Coinglass, there has been a turn in the tide for the Bitcoin trading volume after starting out the new week in a slow trend. Sunday and Monday had seen the Bitcoin daily trading volume come out under $50 billion. However, as the Bitcoin price rose leading up to Tuesday, so did the trading volume. Related Reading: What Are The Implications For XRP If Ripple Captures 14% Of SWIFT’s Volume? At the time of writing, the Bitcoin daily trading volume had already crossed $88 billion for Tuesday, leading to an almost 100% increase in the trading volume during this time. This follows the trend of high volatility coming with increased volumes as the Bitcoin price swung wildly between $105,000 and $108,000. The sharp jump in volume comes as the Bitcoin open interest remains high at near all-time highs while the rest of the market struggles. Coinglass data shows the current open interest at $71 billion, less than $10 billion away from the $80 billion all-time high recorded in May 2025. In light of altcoins continuing to trend low while Bitcoin remains close to all-time highs, it suggests that most of the attention in the crypto market is now being focused on Bitcoin. As a result, the leading asset continues to dictate the direction of the market, with dominance remaining high above 64%. How War Could Affect This Trend The positive developments surrounding Bitcoin are coming as there seems to be a cooldown in the conflict in the Middle East. But with so little time having passed, expectations are that the war may only be starting, with some calling it the start of ‘World War 3.’ Related Reading: Key Fractal From 2023 Says Bitcoin Price Is Still Bullish, But A Crash To $90,000 Could Be Coming The Kobeissi Letter has taken to X (formerly Twitter) to address these World War 3 predictions, revealing how the markets would react if there really was a possibility of this happening. The first thing was that a 50% chance of World War 3 would’ve seen the S&#38;P crash not 2%, but more of a 30% crash. Gold would be $5,000/oz, and oil would go for $100/barrel. Furthermore, a 90% chance of World War 3, as explained in"
    },
    {
      "title": "Ethereum Staking Hits 35M ETH: Is a Major Price Explosion on the Horizon?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-staking-hits-35m-eth-is-a-major-price-explosion-on-the-horizon/",
      "summary": "Ethereum (ETH) has experienced a notable pullback after a brief period of upward momentum earlier this month. The asset, which surged past the $2,800 level in mid-June, has since declined by 8.7% over the past week, now trading at around $2,498. This retreat follows broader market consolidation, as Ethereum struggles to maintain upward pressure despite strong on-chain activity. Related Reading: Ethereum Consolidation Continues – Altseason May Follow A Clean Break Above Resistance Ethereum Staking and Accumulation Trends While ETH&#8217;s price action has turned negative, on-chain indicators suggest a contrasting narrative of growing investor conviction. According to insights shared by on-chain analyst OnChainSchool via CryptoQuant’s QuickTake platform, Ethereum has set a new record in staking activity. In the first half of June alone, more than 500,000 ETH were staked, pushing the total locked amount to over 35 million ETH. This growth in staked ETH not only reflects rising validator participation but also contributes to reducing the circulating supply, a dynamic that may influence future price movements. The report also highlights a rise in accumulation addresses, wallets that have received ETH but have never transferred any out. These addresses now collectively hold 22.8 million ETH, another all-time high. This trend is often interpreted as a sign of long-term holding behavior and suggests that certain investor cohorts are positioning themselves for future price appreciation rather than short-term gains. Taken together, the record levels of staking and accumulation point toward an increasingly illiquid supply, which, if demand increases, could amplify upward price pressure. Ethereum Hits ATH in Staking: Over 35 Million ETH Locked “Alongside this, Accumulation Addresses (holders with no history of selling) have also reached an all-time high, now holding 22.8 million ETH.” – By @onchainschool Read more ⤵️https://t.co/WYoX9qpODZ pic.twitter.com/6MAlK0sCfJ — CryptoQuant.com (@cryptoquant_com) June 17, 2025 A Technical Look: Price Explosion on the Horizon? In addition to the on-chain data, market participants are also analyzing Ethereum from a technical perspective. A crypto analyst on X operating under the pseudonym “Bitcoinsensus” has drawn attention to a multi-year “bullish flag” pattern forming on ETH charts since 2021. A bullish flag is a technical chart formation that typically follows a strong price move upward, marked by a period of consolidation in a downward-sloping channel. If the asset breaks out of the flag to the upside, it can signal a continuation of the prior bullish trend. Related Reading: Ethereum Holds Key Range Support – Bulls Set Sights on Higher Levels Bitcoinsensus suggests that if the pattern completes, Ethereum could target a move toward the $8,000 range. This potential breakout would depend on several factors, including macroeconomic sentiment, ETF flows, and on-chain fundamentals. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin NVT Enters Reversal Zone: BTC Dangerously Overvalued?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-nvt-reversion-btc-dangerously-overvalued/",
      "summary": "On-chain data shows the Bitcoin Network Value to Transactions (NVT) Golden Cross has surged into a zone that has historically signaled overpriced conditions for the asset. Bitcoin NVT Golden Cross Has Crossed Above 2.2 In a new post on X, CryptoQuant author Darkfrost has talked about the latest trend in the NVT Golden Cross of Bitcoin. The NVT Golden Cross is an indicator based on another metric known as the NVT Ratio. The NVT Ratio keeps track of the ratio between the BTC market cap and transaction volume. The idea behind the indicator is that the ability to transact coins (as gauged by the transaction volume) could be considered as a reflection of the asset&#8217;s &#8216;fair value.&#8217; Related Reading: XRP Bullish Signal: Shark &#38; Whale Wallets Set New All-Time High Thus, through the comparison of the cryptocurrency&#8217;s current value (that is, the market cap) with this fair value, the metric can tell us about whether the asset is overvalued or undervalued. When the value of the metric is high, it means the market cap is high compared to the transaction volume. Such a trend could imply BTC may be becoming overheated. On the other hand, the indicator being low could suggest room for the coin to grow relative to its volume. Now, the NVT Golden Cross, the actual metric of relevance here, is a signaling indicator like the Bollinger bands for the NVT Ratio that aims to locate tops and bottoms in its value. The NVT Golden Cross does so by comparing the short-term trend (represented by the 10-day MA) with the long-term one (30-day MA). Below is the chart shared by the analyst that shows the trend in the metric over the last couple of years. As displayed in the above graph, the Bitcoin NVT Golden Cross has recently registered a sharp uptick and entered into the region above the 2.2 mark (highlighted in red). This zone is where the cryptocurrency&#8217;s market cap has historically outpaced the transaction volume to a degree that a reversion to the mean has tended to occur. In other words, it&#8217;s where price corrections to the downside have taken place for the asset. Related Reading: Stablecoin Exchange Inflows Plummet $61 Billion—Warning Sign For Bitcoin? Though, it&#8217;s visible from the chart that not every top in the NVT Golden Cross inside this territory coincides with a price top. And in many instances that it does, the decline in the asset isn&#8217;t to some major degree. So far since the signal has appeared, however, the asset has indeed been going down, a potential sign that the same reversion effect may be in play once more. It now remains to be seen whether downside will be limited, or if this will be one of those instances where the signal was followed by an extended drawdown. BTC Price At the time of writing, Bitcoin is floating around $103,700, down almost 5% in the last seven days. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "U.S. Senate Passes Stablecoin Bill The GENIUS Act",
      "link": "https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/USA-GENIUS-BILLpg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act\" rel=\"nofollow\"> </a></p> <p>The U.S. Senate has passed the Guiding and Establishing National Innovation for U.S. Stablecoins (GENIUS) Act (S. 394) by a vote of 68-30, establishing the first comprehensive federal framework for fiat-backed stablecoins. The bipartisan legislation was introduced by Senator Bill Hagerty and co-sponsored by Senators Tim Scott, Kirsten Gillibrand, and Cynthia Lummis. It passed under [&#8230;]</p> <p>"
    },
    {
      "title": "BBVA Tells Wealthy Clients to Invest Up to 7% in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BBVA.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Spanish bank BBVA is now advising its wealthy clients to invest up to 7% of their portfolios in crypto and Bitcoin, showing how traditional banks are starting to see the potential of Bitcoin.&#160; &#8220;With private customers, since September last year, we started advising on Bitcoin,&#8221; said Philippe Meyer, head of digital &#38; blockchain solutions at [&#8230;]</p> <p>"
    },
    {
      "title": "Ukraine Introduces Bill to Allow Bitcoin in National Reserves",
      "link": "https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Ukraine-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves\" rel=\"nofollow\"> </a></p> <p>Ukraine has introduced a bill that would give its central bank the legal right to hold Bitcoin and other assets as part of its national reserves. The draft law, submitted to the Verkhovna Rada on June 10, 2025, proposes updates to existing legislation to include “virtual assets” in the foreign exchange and gold reserves of [&#8230;]</p> <p>"
    },
    {
      "title": "Fold Holdings Secures $250 Million Equity Deal to Expand Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Fold-Holdings-Secures-250M-Equity-Deal-to-Expand-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>Fold aims to increase its bitcoin treasury through a $250M equity facility, giving the company flexibility to raise funds as needed.</p> <p>"
    },
    {
      "title": "Thailand Approves Five Year Bitcoin And Crypto Tax Break",
      "link": "https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Thailand-Approves-Tax-Exemption-on-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break\" rel=\"nofollow\"> </a></p> <p>Thailand has approved a five year tax exemption on capital gains from cryptocurrency trading made through licensed digital asset platforms. The exemption will be in effect from January 1, 2025, through December 31, 2029. Deputy Finance Minister Julapun Amornvivat announced the measure, calling it a move to increase investment, stimulate economic activity, and drive long [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Thailand Exempts Crypto Capital Gains to Boost Global Hub Ambitions",
      "link": "https://decrypt.co/325746/thailand-exempts-crypto-capital-gains",
      "summary": "Deputy Finance Minister Julapun Amornvivat said Thailand aims to become “one of the world’s financial hubs” with its crypto tax exemption."
    },
    {
      "title": "Gemini Files Complaint Against CFTC, Alleges 7-Year 'Lawfare' Campaign",
      "link": "https://decrypt.co/325742/gemini-files-complaint-against-cftc",
      "summary": "Gemini flagged a whistleblower tied to fraud who may still receive a $1.5 million award, despite an arbitrator ruling he lied to regulators."
    },
    {
      "title": "Meta is Attempting to Poach OpenAI Staff With $100M Signing Bonuses: Sam Altman",
      "link": "https://decrypt.co/325739/meta-openai-staff-100m-signing-bonuses-altman",
      "summary": "OpenAI CEO Sam Altman said Tuesday Facebook parent Meta is attempting to woo his employees with limited success."
    },
    {
      "title": "China’s JD Eyes Global Stablecoin Licenses to Slash Payment Costs",
      "link": "https://decrypt.co/325723/chinas-jd-eyes-global-stablecoin-licenses",
      "summary": "Chinese e-commerce giant JD.com says it could cut cross-border settlement costs as it plans to acquire stablecoin licenses"
    },
    {
      "title": "OpenAI Lands Pentagon Deal—Musk’s xAI Left Watching From Sidelines",
      "link": "https://decrypt.co/325716/openai-lands-pentagon-deal",
      "summary": "A new $200 million contract with the Department of Defense puts OpenAI ahead in the race to bring AI to government."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Iran’s largest crypto exchange appears to have been exploited, suspected Israeli hackers threaten to leak source code and user data",
      "link": "https://cryptobriefing.com/nobitex-cyberattack-iran-exchange/",
      "summary": "<p>The breach highlights vulnerabilities in Iran's financial systems, potentially escalating geopolitical tensions and impacting regional cybersecurity.</p> <p>"
    },
    {
      "title": "US Senate passes GENIUS stablecoin bill, advancing it to the House for final approval",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house/",
      "summary": "<p>US Senate passes the GENIUS stablecoin bill, advancing it to the House for a vote in 3 weeks with rules on backing, audits, and oversight.</p> <p>"
    },
    {
      "title": "JPMorgan Chase to pilot stablecoin-like JPMD for institutional clients on Base",
      "link": "https://cryptobriefing.com/jpmorgan-jpmd-deposit-token/",
      "summary": "<p>JPMorgan's pilot of JPMD tokens could accelerate institutional adoption of blockchain technology, influencing future financial systems.</p> <p>"
    },
    {
      "title": "How is technology redefining money and currency?",
      "link": "https://cryptobriefing.com/technology-redefining-money-currency/",
      "summary": "<p>Technology is redefining money with digital assets, smart contracts, and blockchain, shifting value exchange beyond traditional currency.</p> <p>"
    },
    {
      "title": "Kraken-backed layer 2 Ink to launch $INK token",
      "link": "https://cryptobriefing.com/kraken-ink-token-launch/",
      "summary": "<p>The launch of $INK could significantly enhance DeFi ecosystems by fostering user-driven governance and expanding on-chain capital markets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "PEPE drops 20%, yet whales just bought 531B tokens – Here’s why",
      "link": "https://ambcrypto.com/pepe-drops-20-yet-whales-just-bought-531b-tokens-heres-why/",
      "summary": "<img alt=\"PEPE drops 20%, yet whales just bought 531B tokens - Here&#039;s why\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-27.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A whale just dropped $5M on PEPE—but will that be enough to rescue its sinking chart?"
    },
    {
      "title": "Canada approves first spot XRP ETF – Will the U.S. catch up soon?",
      "link": "https://ambcrypto.com/canada-approves-first-spot-xrp-etf-will-the-u-s-catch-up-soon/",
      "summary": "<img alt=\"Canada approves XRP ETF\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Canada-approves-XRP-ETF.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Even though the U.S. delayed Ripple ETF verdict, Polymarket bets 90% on approval this year."
    },
    {
      "title": "Aptos could hit $8 – But only if APT buyers do this ONE thing!",
      "link": "https://ambcrypto.com/aptos-could-hit-8-but-only-if-apt-buyers-do-this-one-thing/",
      "summary": "<img alt=\"Aptos\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-18T105535.930-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />All signals suggest Aptos may break out soon if bulls reclaim the $4.6 level."
    },
    {
      "title": "Ethereum whale activity at 6-year peak – Is $2,650 ETH’s next stop?",
      "link": "https://ambcrypto.com/ethereum-whale-activity-at-6-year-peak-is-2650-eths-next-stop/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-30.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With inflows not seen since 2017 and Wall Street stepping in, Ethereum may be primed for more."
    },
    {
      "title": "Favrr announces IDO on coin terminal following $5M equity investment from VONROSEN",
      "link": "https://ambcrypto.com/favrr-announces-ido-on-coin-terminal-following-5m-equity-investment-from-vonrosen/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"468\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-18-135921.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"898\" />Favrr, is a token launcher, prediction market and a &#8216;smart investor&#8217; identification tool — all [&#8230;]"
    }
  ]
}