{
  "CoinDesk": [
    {
      "title": "Stellar Performance From XLM as It Posts Top 24H Percentage Gain Among Top 20 Cryptos",
      "link": "https://www.coindesk.com/markets/2025/07/12/stellar-s-xlm-jumps-6-to-lead-top-20-crypto-rankings",
      "summary": ""
    },
    {
      "title": "Another BTC Mining Firm Moves Into Ethereum Reserve, Hailing ETH as ‘Digital Gold’",
      "link": "https://www.coindesk.com/markets/2025/07/12/another-btc-mining-firm-moves-into-ethereum-reserve-hailing-eth-as-digital-gold",
      "summary": ""
    },
    {
      "title": "Pump.fun Swiftly Raises $500M in Public Sale at $4B Fully Diluted Valuation",
      "link": "https://www.coindesk.com/markets/2025/07/12/pumpfun-swiftly-raises-500m-in-public-sale-at-4b-fully-diluted-valuation",
      "summary": ""
    },
    {
      "title": "Tether to Halt USDT on Omni, BCH, Kusama, EOS, Algorand as Focus Shifts to Layer 2s",
      "link": "https://www.coindesk.com/web3/2025/07/12/tether-to-halt-usdt-on-omni-bch-kusama-eos-algorand-as-focus-shifts-to-layer-2s",
      "summary": ""
    },
    {
      "title": "Coinbase’s Pudgy Penguin Avatar Change, ETF Hopes Ignite 60% PENGU Rally",
      "link": "https://www.coindesk.com/markets/2025/07/12/coinbases-pudgy-penguin-avatar-change-etf-hopes-ignite-60-pengu-rally",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Animoca Brands partners with DDC Enterprise to put BTC treasury to work",
      "link": "https://cointelegraph.com/news/animoca-brands-partners-ddc-bitcoin-treasury-work?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjU3NWYtMzk0NS03OWZkLTlhMzItMDk4YmVmNTE3MTU3.jpg\" /></p><p>Animoca Brands joins a growing list of companies adopting a Bitcoin treasury strategy or expanding their existing Bitcoin reserves.</p>"
    },
    {
      "title": "Pump.fun ICO raises $500M, sells out within minutes",
      "link": "https://cointelegraph.com/news/pump-fun-ico-raises-500m-sells-out-minutes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2ZmYTYtZGFjOC03ZWNiLWIzMjAtOTEwYzhlYThiMGEy.jpg\" /></p><p>Venture capitalists and the Solana community touted the ICO as a showcase for capital formation in the age of internet capital markets.</p>"
    },
    {
      "title": "Telegram is not a neobank — it’s the platform where the next ones are born",
      "link": "https://cointelegraph.com/news/telegram-not-neobank?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E2MjMtZjU1NS03YzA2LTg5MmQtZmU3ZjBhYzQwYTY1.jpg\" /></p><p>The next wave of Web3 neobanks won’t be standalone apps; they'll be embedded within platforms people already use.</p>"
    },
    {
      "title": "How a teen stole $243M in Bitcoin and revealed his identity on livestream",
      "link": "https://cointelegraph.com/explained/how-a-teen-stole-243m-in-bitcoin-and-revealed-his-identity-on-livestream?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9iMjYzNTJiZjBjZWM1ODlkOTEwNzZkNzI3YjEwMTFjOC5qcGc=.jpg\" /></p><p>Veer Chetal, a 19-year-old hacker, used social engineering to steal $243 million in Bitcoin, then exposed his identity during a livestream and reoffended while out on bail.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Democrats declare ‘Anti-Crypto Corruption Week’ to counter GOP crypto bills",
      "link": "https://cryptoslate.com/democrats-declare-anti-crypto-corruption-week-to-counter-gop-crypto-bills/",
      "summary": "<p>US Democratic lawmakers, led by House members Maxine Waters and Stephen Lynch, announced on July 11 that next week will be designated &#8220;Anti-Crypto Corruption Week.&#8221; The initiative aims to unite Democrats in opposing several pro-crypto bills that are currently under consideration in Congress, including the GENIUS Act, the CLARITY Act, and a proposed law aimed [&#8230;]</p> <p>"
    },
    {
      "title": "Fortune Magazine owner to lead Thai firm’s pivot into Bitcoin and DeFi banking",
      "link": "https://cryptoslate.com/fortune-magazine-owner-to-lead-thai-firms-pivot-into-bitcoin-and-defi-banking/",
      "summary": "<p>DV8 Public Company Limited, a publicly listed firm in Thailand looking to reinvent itself as a Bitcoin Treasury firm, has appointed Thai business magnate Chatchaval Jiaravanon as its new Chairman, according to a July 11 statement shared with . Jiaravanon, best known internationally for acquiring Fortune Magazine in 2018, is part of Thailand’s influential Charoen [&#8230;]</p> <p>"
    },
    {
      "title": "What the second half of 2025 holds for Bitcoin and the crypto market",
      "link": "https://cryptoslate.com/what-the-second-half-of-2025-holds-for-bitcoin-and-the-crypto-market/",
      "summary": "<p>The first half of 2025 has been eventful for crypto. Bitcoin (BTC) price climbed around 24% during the first six months while Ethereum (ETH) lost nearly 12% of its value. With President Donald Trump taking office in January, the U.S. approach to cryptocurrencies has shifted significantly. Several lawsuits against crypto firms initiated during the Biden [&#8230;]</p> <p>"
    },
    {
      "title": "SEC charges Georgia’s First Liberty Building & Loan and owner in $140M Ponzi scheme",
      "link": "https://cryptoslate.com/sec-charges-georgias-first-liberty-building-loan-and-owner-in-140m-ponzi-scheme/",
      "summary": "<p>The U.S. Securities and Exchange Commission (SEC) has filed civil charges and sought an emergency asset freeze against First Liberty Building &#38; Loan, LLC, a lending institution based in Newnan, Georgia, and its founder and owner, Edwin Brant Frost IV. The SEC alleges that the firm and its owner orchestrated a Ponzi scheme that defrauded [&#8230;]</p> <p>"
    },
    {
      "title": "Tether to sunset USDT redemptions on 5 ‘legacy’ networks including Bitcoin Cash, Algorand",
      "link": "https://cryptoslate.com/tether-to-sunset-usdt-redemptions-on-5-legacy-networks-including-bitcoin-cash-algorand/",
      "summary": "<p>Tether announced it will discontinue support for its USDT stablecoin on five &#8220;legacy&#8221; blockchains, including Omni Layer, Bitcoin Cash SLP, Kusama, EOS, and Algorand. According to the July 11 announcement, the move will become effective Sept. 1, ending redemptions and freezing remaining tokens on those networks. The decision comes as part of what the company [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Price Break Above $118,000 Just The Start, Analyst Unveils ‘Golden Number’",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-break-above-118000/",
      "summary": "Bitcoin has rallied massively over the past seven days by posting an impressive price gain of nearly 9% after climbing from around $108,300 to almost $118,800. This move was quite surprising, particularly as the process saw Bitcoin clearing its previous all-time high from late May by breaking above $111,970. But according to Bitcoin technical analyst CryptoCon, this breakout may just be the beginning. In a recent post on the social media platform X, CryptoCon revealed a long-term cycle pattern that points to a more ambitious price target for Bitcoin. Analyst Unveils BTC&#8217;s Golden Number For This Cycle In a recent post on social media platform X, CryptoCon revealed a long-term cycle pattern that points to a more ambitious target for Bitcoin. His analysis is based on the 5.618 Fibonacci extension, which is a number he says has perfectly aligned with every prior cycle top. The projection opens up the possibility of whether Bitcoin’s current move marks the start of another parabolic run. Related Reading: Market Expert Says It’s Now ‘Illegal’ To Short Bitcoin, Here’s Why CryptoCon’s technical chart analysis builds on the recurring 5.618 Fibonacci extension level in previous market cycles. The analyst shows how Bitcoin’s previous tops have fallen within striking distance of this precise extension by measuring the move of each market cycle and applying this golden ratio. The chart shown below features the $30.84 peak in June 2011, the $1,205 top in November 2013, the $18,702 high from December 2017, and the peak of $63,839 in November 2021. Each of these market tops, as shown in the Bitcoin multi-year price chart below, converged on the same 5.618 multiple from their preceding bear market lows. Now, using this same approach in the ongoing cycle, CryptoCon projected that the next major step for Bitcoin is somewhere between $170,000 and $180,000. Particularly, the 5.618 Fibonacci extension points to a &#8220;Golden Number&#8221; of $184,181 for Bitcoin&#8217;s price in this cycle. Bitcoin Price Compression Is About To Expand Violently Several major forces appear to have contributed to BTC&#8217;s recent surge in the past 48 hours. A significant short squeeze earlier in the week reportedly wiped out over $1 billion in bearish positions. At the same time, US-based Spot Bitcoin ETFs registered over $1 billion in daily inflows in the past two consecutive days. Related Reading: Analyst Predicts Bitcoin Price Breakdown — Here’s The Best Time To Buy In his X post, CryptoCon also commented on the current state of Bitcoin’s chart: “All the boring price action is coming to a squeeze; it can&#8217;t stay that way forever.” This observation reflects the long period of tight, sideways trading between $105,000 and $108,000 that Bitcoin experienced in the previous two weeks. At the time of writing, Bitcoin is trading at $117,762, retracing slightly after reaching its most recent all-time high of $118,667, according to CoinGecko data. Other crypto analysts now find themselves watching the $130,000 region as another zone of consolidation activity on the way to the possible cycle peak. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Pi Network Turns Heads With Symbolic Transfers, $20M Volume Spike",
      "link": "https://www.newsbtc.com/news/pi-network-turns-heads-with-symbolic-transfers-20m-volume-spike/",
      "summary": "The Pi Network coin dipped to $0.46 today, slipping 6% in the past 24 hours. Yet trading volume jumped to $20 million, up 80% over the same period. That mix of a price drop and a big volume rise often points to traders testing the waters rather than rushing in or out. Related Reading: Analyst Sounds The Alarm: Shiba Inu Primed For Over 1,500% Breakout Pi Network Volume Spike Signals Fresh Interest According to on-chain data, weekly gains of 1.1% suggest renewed curiosity around the Pi Network token. Its recent push past $0.48 may have drawn eyes back to the network. A big swell in transfers shows people shifting coins more than usual, even if the price isn’t following the same upward path. In the past few days, two separate moves of exactly 3.14 Pi have caught attention. Those small transfers tie back to the project’s namesake, the number π. Based on reports, these sent-outs came from a single wallet—labeled GASWBD…—which also withdrew over 10 million Pi in just six days. That same address links to about 320 million Pi in earlier activity, leading many to wonder if a big miner, an institutional backer, or someone from the Pi team is behind it. 🔔 3.14 Pi Withdrawn — Twice in One Day: A Signal Echoing Across the Pi Network 🔔 The Numbers Are Speaking. Are You Listening? ⸻ 🚨 In a moment that sent chills through the Pi Network community, a mysterious wallet — GASWBD…J2AODM — made not one, but two withdrawals of… pic.twitter.com/eoLnHeJi0k — Mr Spock 𝛑 (@MrSpockApe) July 10, 2025 Symbolic Transactions Stir Speculation The timing of these 3.14 moves matters. They arrived just as the price flirted with the psychological $0.48 mark. Some community members see the transfers as a rallying call, a nod back to Pi’s roots. Traders, though, tend to watch those numbers for clues of real buying or selling pressure. So far, the pattern looks more like a planned message than a panic sell‑off. Talk of a mainnet rollout or fresh exchange pairings has spread across forums. People point to the organized nature of the withdrawals as proof that bigger plans are underway. They hint that big news might be on the way—maybe new partners or additions that bring Pi out of its test network and into mainline usability. Forecast: Caution Ahead According to current forecasts, the value of Pi could decrease to $ 0.35 by August 11, 2025, a decline of 25%. Technical indicators are showing Bearish, and the Fear &#38; Greed Index for the market is at 79 (Extreme Greed). Related Reading: Don’t Hold Back—Expert Recommends Full Stake In XRP Pi experienced 11 green days in the past 30 (37%) and recorded 9% price fluctuation over that time. That breakdown between high excitement and bearish direction is a picture of conflicting indicators for anyone considering getting on board now. So far, Pi Network is a project generating hope and skepticism. The $208 million volume increase indicates that people are indeed taking notice. But the prediction and on-chain activity suggest caution may be advisable until stronger milestones emerge. Featured image from Jeffrey Coolidge/Getty Images, chart from TradingView"
    },
    {
      "title": "Bitcoin SOPR Signals More Gains Ahead Despite New ATH – Analyst",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-sopr-signals-more-gains-ahead-despite-new-ath-analyst/",
      "summary": "In the past week, Bitcoin has grabbed the major headlines as prices surge to a new all-time high of $118,856 following a market gain of 9.77%. In remarkable fashion, the premier cryptocurrency added an estimated $10,000 to its market value increasing its market cap to a solid $2.34 trillion. Interestingly, recent on-chain data suggest there may be more tailwind ahead backing Bitcoin’s ability to explore new price territory. Related Reading: Bitcoin Breaks $118,000—But Liquidity Still Thin, Glassnode Warns STH SOPR Sits At 1.02, Suggests Market Not Overheating In a recent quicktake post on CryptoQuant, a market analyst with username CryptoMe has shared some compelling insights on Bitcoin’s price trajectory amidst current market euphoria. As earlier stated, the flagship cryptocurrency experienced a significant price gain to brush nearly against the $120,000 mark. Despite this rise, CryptoMe notes that short-term holders&#8217; spent output profit ratio (STH SOPR) indicates that this class of investors are yet to engage in significant profit-taking. For context, The STH-SOPR measures the ratio of realized profits or losses by investors who’ve held BTC for less than 155 days. A STH-SOPR reading above 1.0 indicates that BTC are being sold at a profit, while values below 1.0 indicate losses. Based on the chart below, sharp increases in this on-chain metric especially into the 1.05-1.20+ range (red zone) have correlated with profit-taking phases and can often precede local tops. However, the STH-SOPR currently sits at 1.02, suggesting that although some short-term holders are in profit, no aggressive market distribution has commenced. This development is particularly bullish considering the STH realized price is presently at $100,000 indicating these investors are 17%-18% in profit and are opting to hold for further price gains. Meanwhile, the analyst notes that this present on-chain situation aligns with the broader sentiment in the derivatives market. Open Interest is climbing, signaling growing participation, but funding rates remain neutral to slightly positive. This lack of extreme funding imbalances suggests that traders are not flooding the market with overleveraged long positions due to FOMO. CryptoMe explains that all these factors indicate the Bitcoin market is far from overheating and there is still potential for more growth ahead. Related Reading: Bitcoin MVRV Oscillator Predicts First Sell Pressure Level At $130,900 – Details BTC Price Overview At the time of writing, Bitcoin is trading at $117,840 indicating a 3.40% in the past day but a slight 0.82% decline from the present all-time high. Meanwhile, the asset’s daily trading volume is up by 96.53% indicating a strong market activity behind the ongoing rally backing the potential for a continuation. Featured image from Pexels, chart from Tradingview"
    },
    {
      "title": "Dogecoin Megaphone Pattern Confirms Price Blowup, ‘Don’t Miss This Last Rally’—Analyst",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-megaphone-pattern/",
      "summary": "Crypto analyst TradingShot has drawn attention to a bullish pattern for Dogecoin, indicating that a significant price surge is on the horizon. The analyst suggested that this could be the final leg up for the foremost meme coin and advised market participants not to miss it. Dogecoin Eyes Parabolic Rally With Megaphone Pattern In a TradingView post, TradingShot predicted that Dogecoin could rally to as high as $1.25. He noted that the meme coin has been trading in a bullish Megaphone pattern within a channel up. The analyst added that the recent rebound on June 16 on the weekly MA200 is a higher low at the bottom of both patterns. Related Reading: Machine Learning Algorithm Predicts Dogecoin Price To Jump Double-Digits To $0.2 With the 1-week Relative Strength Index (RSI) also rebounding on its long-term support zone, TradingShot declared that Dogecoin is most likely at the start of a new bullish leg. He noted that this could be the final rally that will shape this cycle’s top. Meanwhile, the analyst claimed that DOGE is targeting $1.25 because the previous two bullish legs peaked on the 3.618 Fibonacci extension of the last decline. He told market participants that they can settle for $0.8 if they wish to pursue a target within the Channel up. A rally to both $0.8 and $1.25 would mark new all-time highs (ATHs) for Dogecoin, whose current ATH is at $0.73. His accompanying chart showed that DOGE could reach these targets in the first half of next year. Dogecoin is expected to maintain a steady climb from now till then as it reaches those targets. The meme coin has already begun another uptrend following Bitcoin’s rally to a new ATH. DOGE has again reclaimed the $ 0.20 psychological price level and could potentially reach its last local high at around $0.26. DOGE Against Its Bitcoin Pair In an X post, crypto analyst Kevin Capital stated that the DOGE/BTC chart is sitting in a historical zone of support with the monthly time frame indicators fully reset. The analyst indicated that this was possibly the best setup for Dogecoin, one that could spark a massive run for the meme coin. Related Reading: Analysts Predict Major Dogecoin Price Rally After Breaking 50-Day Trendline Meanwhile, crypto analyst Trader Tardigrade stated that the Dogecoin-to-Bitcoin chart might show a God candle this month. This God candle could spark a DOGE season, when the meme coin is expected to outperform the flagship crypto. The analyst’s accompanying chart showed that DOGE could rally to as high as $9 during this period. Meanwhile, he highlighted the $0.2 support level as being crucial for this lift-off for the meme coin. At the time of writing, the Dogecoin price is trading at around $0.2, up almost 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "SUI MACD Signals Massive Rally Ahead — 400% Price Surge Possible",
      "link": "https://www.newsbtc.com/sui/sui-macd-signals-massive-rally-ahead-400-price-surge-possible/",
      "summary": "In line with a bullish trading week, Sui (SUI) prices soared by over 20% reaching a local peak of $3.54 before experiencing a slight retracement. The prominent altcoin, which is tipped to be a major player in a potential altseason, has maintained a remarkable price performance in the present market cycle rising by 352.04% in the last year alone. Based on technical indicators, renowned market analyst Ted Pillows postulates SUI may be gearing up for parabolic rally following recent market gains. Related Reading: Ethereum Price Breaks Through 50EMA After Rejection, ETH Dominance Sees Resurgence SUI Market Structure Signals Potential Breakout In an X post on July 11, Ted Pillows shares an insightful price analysis on the SUI market identifying a series of technical signals that precedes explosive market gains. These include a well-defined price movement within a well-defined ascending channel on the weekly timeframe, combined with an imminent bullish MACD crossover. In analyzing the ascending price channel, SUI has shown a strict adherence to both resistance and support zones. Notably, a healthy correction from its previous highs near $5.00 resulted in the altcoin finding support around $2.50 before initiating another rebound. As the altcoin presently consolidates, historical data indicates a potential return to the channel upper’s boundary between $10.50 and $13.00. However, the major strength in Pillows’ bullish thesis is the MACD setup that shows an impending bullish crossover i.e. when the MACD line (white) crosses above the signal line (orange), often interpreted by traders as an early sign of trend reversal or strengthening bullish momentum. Historically, the last time a decisive bullish MACD cross occurred on the weekly chart, it induced a six-month rally that delivered over 400% in gains. Going by this precedent, SUI bulls may be eying a potential price target of $13.76 by end of 2025. Related Reading: SUI Explodes Higher, Climbing Above 20-Day MA — But Can The Rally Hold? SUI Market Overview At the time of writing, SUI trades at $3.42 reflecting a 1.16% decline in the past 24 hours. Meanwhile, the market trading volume is up by 17.68% and valued at $1.95 billion. On a monthly scale, SUI has recorded a marginal loss of 0.11%, suggesting that bearish forces still maintain a subtle grip on the market. Nevertheless, data from CoinMarketCap shows the Sui community remains bullish on the altcoin’s future. Contributors to this market optimism includes the potential of SUI spot ETF following applications by prominent asset managers such as Grayscale, Canary Capital and 21 Shares. Meanwhile, the potential of an altseason remains valid amidst continuous speculations by market analysts. As earlier stated, SUI&#8217;s strong price history and growing recognition places the cryptocurrency as a major frontrunner in any altcoin market run. Featured image from Nairametrics, chart from Tradingview"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "5 Free Metrics Every Bitcoin Investor Needs",
      "link": "https://bitcoinmagazine.com/markets/5-free-metrics-bitcoin-investor",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/5-Free-Metrics-Every-Bitcoin-Investor-Needs.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/5-free-metrics-bitcoin-investor\" rel=\"nofollow\"> </a></p> <p>From SOPR to Funding Rates, these free tools help you navigate Bitcoin markets with confidence. Start now!</p> <p>"
    },
    {
      "title": "Takeaways from the Final Tornado Cash Status Conference Hearing",
      "link": "https://bitcoinmagazine.com/news/takeaways-from-the-final-tornado-cash-status-conference-hearing",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Southern-District-of-New-York.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/takeaways-from-the-final-tornado-cash-status-conference-hearing\" rel=\"nofollow\"> </a></p> <p>In a virtual hearing, the judge presiding over the Tornado Cash case didn't mince words as she highlighted what she plans to focus on as trial begins next week. </p> <p>"
    },
    {
      "title": "The Smarter Web Company Adds 275 BTC to Its Strategic Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-adds-275-btc-to-its-strategic-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/The-Smarter-Web-Company-Adds-275-BTC-to-Its-Strategic-Bitcoin-Treasury.png\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-adds-275-btc-to-its-strategic-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>The UK tech firm now holds 1,275 Bitcoin worth over £100 million, with the £21.88 million bitcoin purchase.</p> <p>"
    },
    {
      "title": "Bitcoin Breaks Records with 100% Profitable Days and Unmatched Returns",
      "link": "https://bitcoinmagazine.com/news/bitcoin-breaks-records-with-100-profitable-days-and-unmatched-returns",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Breaks-Records-with-100-Profitable-Days-and-Unmatched-Returns.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-breaks-records-with-100-profitable-days-and-unmatched-returns\" rel=\"nofollow\"> </a></p> <p>Bitcoin’s explosive growth continues to outshine gold, stocks, and the dollar, with 100% of trading days profitable resulting in unmatched long term returns.</p> <p>"
    },
    {
      "title": "How CoinJoin Anonymity Can Be Undermined Using Clustering",
      "link": "https://bitcoinmagazine.com/bigread/how-coinjoins-achieve-anonymity",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/BM-Big-Read-07-12-25.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bigread/how-coinjoins-achieve-anonymity\" rel=\"nofollow\"> </a></p> <p>BM Big Read: CoinJoins, Bitcoin's most established anonymity feature, leaks more information than people think.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Why Are So Many Crypto Games Shutting Down? Experts Weigh In",
      "link": "https://decrypt.co/329820/why-crypto-games-shutting-down-experts-weigh-in",
      "summary": "Experts say launching tokens for crypto games applies unnecessary pressure on development—and makes failures even more public."
    },
    {
      "title": "As Bitcoin Matures, Volatility Drops—So Expect Slower Climbs, Say Experts",
      "link": "https://decrypt.co/329835/as-bitcoin-matures-volatility-drops-expect-slower-climbs-experts",
      "summary": "Bitcoin to the moon? Not so fast, experts say, as the asset has matured and is now being used by traders for more sophisticated bets."
    },
    {
      "title": "Grok 4 Basic Review: $30 a Month for This? Elon Musk's AI Now Thinks Like Him",
      "link": "https://decrypt.co/329866/grok-4-basic-review-elon-musk-ai-thinks-like-him",
      "summary": "While Elon Musk's $300 “Heavy” model puts up record-breaking benchmark scores, the basic Grok 4 struggles to keep up with competitors."
    },
    {
      "title": "The SEC Chair Who Sued Ripple Is Now Prosecuting Roman Storm",
      "link": "https://decrypt.co/329691/sec-chair-who-sued-ripple-now-prosecuting-roman-storm",
      "summary": "Jay Clayton, President Trump’s onetime SEC head, is now top prosecutor at the DOJ office set to take Roman Storm to trial on Monday."
    },
    {
      "title": "House Democrats Struggle to Approach 'Crypto Week' With Unified Front",
      "link": "https://decrypt.co/329850/house-democrats-struggle-approach-crypto-week-unified-front",
      "summary": "Some Democrats are pledging to punish other party members who support what they see as “Trump’s crypto corruption.” Leadership has largely stayed out of the fight."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Pump.fun secures $500M in public sale; PUMP token jumps in pre-market trading",
      "link": "https://cryptobriefing.com/pump-token-sale-raises-500m/",
      "summary": "<p>The rapid sell-out and price surge of PUMP tokens highlight strong investor interest, potentially boosting confidence in meme coin markets.</p> <p>"
    },
    {
      "title": "Tether to end USDT support for Omni, Bitcoin Cash SLP, Kusama, EOS, and Algorand in September",
      "link": "https://cryptobriefing.com/tether-blockchain-support-changes/",
      "summary": "<p>Tether's shift to focus on scalable, high-utility networks may drive innovation and efficiency, impacting blockchain adoption and ecosystem growth.</p> <p>"
    },
    {
      "title": "PENGU token pumps after Coinbase updates X profile with Pudgy Penguins’ NFT",
      "link": "https://cryptobriefing.com/coinbase-profile-pengu-nft/",
      "summary": "<p>Coinbase's strategic social media engagement could enhance crypto market dynamics, influencing token valuations and investor sentiment.</p> <p>"
    },
    {
      "title": "Grayscale challenges SEC stay on approval of BTC, ETH, XRP, ADA large-cap fund",
      "link": "https://cryptobriefing.com/sec-grayscale-approval-large-cap-fund/",
      "summary": "<p>Grayscale's challenge to the SEC's stay highlights ongoing regulatory tensions, potentially impacting future crypto fund approvals and market dynamics.</p> <p>"
    },
    {
      "title": "Bitcoin creator Satoshi Nakamoto may now be richer than Dell CEO Michael Dell",
      "link": "https://cryptobriefing.com/satoshi-nakamoto-wealth-bitcoin/",
      "summary": "<p>Satoshi Nakamoto's rising wealth underscores Bitcoin's potential to disrupt traditional wealth hierarchies and influence global financial systems.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Cardano – Here’s why ADA’s 23% rally could call for caution!",
      "link": "https://ambcrypto.com/cardano-heres-why-adas-23-rally-could-call-for-caution/",
      "summary": "<img alt=\"ADA\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250712_095642_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ADA might drop soon as it enters a new market phase."
    },
    {
      "title": "Bitcoin – Why BTC’s next move hinges on 3 KEY market forces",
      "link": "https://ambcrypto.com/bitcoin-why-btcs-next-move-hinges-on-3-key-market-forces/",
      "summary": "<img alt=\"Bitcoin [BTC]\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-12T121336.730-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bullish momentum builds, but rising miner activity and leverage zones may disrupt the trend."
    },
    {
      "title": "AI tokens are heating up! Story’s [IP] 25% pump is just the start IF…",
      "link": "https://ambcrypto.com/ai-tokens-are-heating-up-storys-ip-25-pump-is-just-the-start-if/",
      "summary": "<img alt=\"Story IP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-4.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can another leg up for IP turn the $5 level into support?"
    },
    {
      "title": "Will Trump’s $1.2B crypto plans endure ‘anti-crypto corruption week’?",
      "link": "https://ambcrypto.com/will-trumps-1-2b-crypto-plans-endure-anti-crypto-corruption-week/",
      "summary": "<img alt=\"anti-crypto corruption week\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Crypto-bill-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Democrats vowed to block key crypto bills to prevent 'Trump's crypto fraud'."
    },
    {
      "title": "Bitcoin breaks ATH – Identifying why BTC’s rally is just getting started!",
      "link": "https://ambcrypto.com/bitcoin-breaks-ath-identifying-why-btcs-rally-is-just-getting-started/",
      "summary": "<img alt=\"Bitcoin’s New Highs Lack Retail Frenzy: A Sign of Healthy Market Growth?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-Featured-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The signs of market exhaustion and widespread profit-taking were not here for Bitcoin despite the swift short-term rally."
    }
  ]
}