{
  "CoinDesk": [
    {
      "title": "Return of Zero Interest Rate Policy as Swiss Central Bank Cuts Rates",
      "link": "https://www.coindesk.com/markets/2025/06/19/return-of-zero-interest-rate-policy-as-swiss-central-bank-cuts-rates",
      "summary": ""
    },
    {
      "title": "Circle Rockets After Stablecoin Bill Clears Senate, Pushes Post-IPO Rally to Over 500%",
      "link": "https://www.coindesk.com/markets/2025/06/19/circle-rockets-after-stablecoin-bill-clears-senate-pushes-post-ipo-rally-to-over-500",
      "summary": ""
    },
    {
      "title": "Dogecoin Steady But Flashing 'Oversold' in Signal for Bearish Bets",
      "link": "https://www.coindesk.com/markets/2025/06/19/dogecoin-steady-but-flashing-oversold-in-signal-for-bearish-bets",
      "summary": ""
    },
    {
      "title": "KuCoin Allows Institutional Clients to Trade Without Having to Pre-Fund Wallets",
      "link": "https://www.coindesk.com/business/2025/06/19/kucoin-allows-institutional-clients-to-trade-without-having-to-pre-fund-wallets",
      "summary": ""
    },
    {
      "title": "Ether, Solana, and Other Majors Could Slide Further as Trump Threatens Iran Strikes",
      "link": "https://www.coindesk.com/markets/2025/06/19/ether-solana-and-other-majors-could-further-slide-as-trump-threatens-iran-strikes",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin user accidentally sent $60,000 in fees—Don’t make the same mistake",
      "link": "https://cointelegraph.com/news/how-one-bitcoin-user-accidentally-paid-60k-in-fees?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdkYjItYzJjNC03NWIzLThhNjktMTJhMTkxOWI4ODJl.jpg\" /></p><p>RBF lets you resend unconfirmed transactions with higher fees, but it requires a clear understanding of fee units, wallet behavior and transaction structure.</p>"
    },
    {
      "title": "Is crypto still taxed in Australia? Major legal update, explained",
      "link": "https://cointelegraph.com/news/is-crypto-still-taxed-in-australia?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg3YTMtYTc5NC03NzU1LThhNTktMzIyOWI1ZTU3ZjJh.jpg\" /></p><p>Australia now taxes crypto as property, with capital gains on swaps, DeFi and wrapped tokens, plus new ATO data sweeps targeting 1.2 million users.</p>"
    },
    {
      "title": "Why is Bitcoin price stuck?",
      "link": "https://cointelegraph.com/news/why-is-bitcoin-price-stuck?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvYWZjOGVjMDgtNDc2OC00MTdhLWEzNzEtYTQ2NDQyMzQ0ZWE4.jpg\" /></p><p>Bitcoin price remains stuck under $112K since May 23, and data suggest the pattern could continue for a few more days amid macroeconomic and geopolitical uncertainty.</p>"
    },
    {
      "title": "Bitcoin gets Fed rate pause &#039;tailwind&#039; as BTC eyes $106K short squeeze",
      "link": "https://cointelegraph.com/news/bitcoin-fed-rate-pause-tailwind-short-squeeze-106k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDQ1MDEtMmJhZS03ZWIwLTg4MmUtNDIyNjdlMWNlZGUx.jpg\" /></p><p>Bitcoin price trajectory is primed to benefit from both macroeconomic and crypto derivatives trends, said new research from CryptoQuant.</p>"
    },
    {
      "title": "South Korea to investigate fees of local crypto exchanges",
      "link": "https://cointelegraph.com/news/south-korea-investigate-fees-local-crypto-exchanges?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5NDE3NWEtYjRlOS03NTZmLTgzN2UtMTFkNTU0MTk1Yjcw.jpg\" /></p><p>South Korea’s newly elected president Lee Jae-myung reportedly promised to reduce crypto trading transaction costs as part of his presidential campaign.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Ford explores decentralized legal data storage on Cardano blockchain",
      "link": "https://cryptoslate.com/ford-explores-decentralized-legal-data-storage-on-cardano-blockchain/",
      "summary": "<p>Ford Motor Company, a Fortune 500 company, has joined forces with Iagon and Cloud Court to launch a proof-of-concept (PoC) focused on decentralized legal data storage, according to a June 18 announcement. The project, built on the Cardano blockchain, will test decentralized solutions for managing sensitive legal records across large organizations. Following the news, Iagon’s [&#8230;]</p> <p>"
    },
    {
      "title": "Donald Trump urges swift GENIUS Act passage to dominate digital asset space",
      "link": "https://cryptoslate.com/donald-trump-urges-swift-genius-act-passage-to-dominate-digital-asset-space/",
      "summary": "<p>President Donald Trump, who has interests in the stablecoin USD1 via his involvement in World Liberty Financial, has called on the US House of Representatives to move quickly on the GENIUS Act, a new bill aimed at regulating stablecoins and boosting America’s role in the digital asset economy. In a June 19 post shared on [&#8230;]</p> <p>"
    },
    {
      "title": "North Korean dev hijacks dormant Waves repositories, slips credential-stealing code in wallet updates",
      "link": "https://cryptoslate.com/north-korean-dev-hijacks-dormant-waves-repositories-slips-credential-stealing-code-in-wallet-updates/",
      "summary": "<p>A North Korean developer gained elevated privileges inside Waves Protocol&#8217;s Keeper-Wallet codebase, according to a June 18 report by Ketman. The report highlighted routine scans for Democratic People&#8217;s Republic of Korea (DPRK) activity on GitHub, which uncovered the account &#8220;AhegaoXXX&#8221; pushing updates to Keeper-Wallet. The wallet&#8217;s repositories showed no legitimate commits after August 2023, yet [&#8230;]</p> <p>"
    },
    {
      "title": "10-year Bitcoin holdings grow faster than daily issuance, marking scarcity signal after 2024 halving",
      "link": "https://cryptoslate.com/10-year-bitcoin-holdings-grow-faster-than-daily-issuance-marking-scarcity-signal-after-2024-halving/",
      "summary": "<p>On-chain data shows that Bitcoin’s (BTC) “ancient supply” is increasing faster than new BTC daily issuance, according to a June 18 research by Fidelity Digital Assets. The report treats ancient supply as Bitcoins that have remained unmoved for at least a decade, and it counted an average of 566 BTC entering the 10-year-plus cohort daily [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase launches stablecoin payment stack with USDC checkout targeting commerce giants",
      "link": "https://cryptoslate.com/coinbase-launches-stablecoin-payment-stack-with-usdc-checkout-targeting-commerce-giants/",
      "summary": "<p>Coinbase officially launched Coinbase Payments on June 18, a three-layer platform that enables commerce providers to add USDC checkout without running their blockchain infrastructure. The stack begins with Stablecoin Checkout, a wallet-native interface that supports hundreds of wallets, delivers gas-free transactions, and records payments in USDC. Beneath it, an E-commerce Engine exposes application programming interfaces [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Channel Break Below $105,000 Sparks Panic, Analysts Predict Further Crashes",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-channel-break/",
      "summary": "Bitcoin has been crashing with the advent of the new week, spurred on by uncertainties that surround the growing conflict in the Middle East. There has also been a lot of negativity in the crypto market, with expectations that the Bitcoin price will not make new all-time highs after failing to reclaim $111,000. Even as the market continues to bleed, crypto analysts are still predicting further crashes for the digital asset, with some expecting a break of the psychological level at $100,000. Bitcoin Price Headed For Further Breakdown Crypto analyst TehThomas had previously called the Bitcoin price crash from the $108,000 territory, suggesting that the digital asset still had to fill Fair Value Gaps (FVG) at lower levels before it could continue to soar. Then recently, the crypto analyst has once again reiterated his stance as the price had begun to fall back toward $100.000. Related Reading: XRP To End 7-Month Consolidation After 700% Surge – Is A Major Move Coming? Thomas explained that Bitcoin was already showing signs of exhaustion. Hence, the reason for the crash was due to a loss of $108,500. At this level, with the price failing to break out higher, it showed that the initial surge had been a takeout, and the right direction was actually downward. The initial bullish move was seemingly a way for an internal liquidity grab while clearing out breakout buyers at the same time. Now, the Bitcoin price has broken below an important channel at $105,000 after a successful retest. The analyst explains that this aligns with the 50% equilibrium of the high-to-low range. Naturally, this means that the asset is still bearish and could continue to decline from here. The main levels to watch were initially at $104,600, but the Bitcoin price had first broken below this level on Tuesday. Now, if the decline continues, then the next major level investors are looking at is the $102,800, where support now lies for the cryptocurrency. Below $100,000 Is Still Possible In addition to Thomas, crypto analyst Xanrox has also predicted further price crashes for Bitcoin. He points out that the formation of a bull flag does not mean the price will continue to rise, as the flag could very well break. If this happens, then the analyst sees the Bitcoin price dropping to $100,000. Related Reading: Rising Bitcoin Dominance Above 64% Dashes Hopes Of Altcoin Season, Here’s Why Unlike Thomas, Xanrox places his support levels at the much lower price of $88,000, which would suggest a major price crash from here. “When we look at the current price action, it looks like a bullish flag consolidation pattern,” the analyst said. “In this case we will probably see multiple liquidity sweeps below the previous swing lows to kick out early longs.” Another analyst, Doctor Profit, has also turned bearish, predicting a decline below $100,000. In the X post, the crypto analyst said that the Bitcoin price is likely to fall to the $94,000-$95,000 level before seeing a bounce from there. Therefore, the analyst has told investors to prepare for more red candles. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Analyst Warns: Strategy On Track For Historic Collapse, Bigger Than FTX",
      "link": "https://www.newsbtc.com/bitcoin-news/analyst-warns-strategy-on-track-for-historic-collapse-bigger-than-ftx/",
      "summary": "In a bold and alarming statement, on-chain analyst OxChain raised the possibility of a catastrophic collapse involving Strategy (formerly MicroStrategy), the Bitcoin proxy firm co-founded by Michael Saylor. According to OxChain, this potential downfall could surpass the infamous collapse of FTX. ‘Strategy&#8217;s Bitcoin Tactics Resemble Ponzi Scheme’ In a recent post on X (formerly Twitter), OxChain expressed concerns about Strategy&#8217;s aggressive Bitcoin accumulation formula, suggesting that the company&#8217;s operations resemble a Ponzi scheme. OxChain pointed out that since 2020, MicroStrategy has transformed from a traditional software company into a significant player in the Bitcoin market, currently holding around 582,000 BTC, valued at nearly $61 billion. Related Reading: Researchers Forecast Bitcoin At $4.3 Million By 2036, Citing Institutional Demand However, OxChain claims that this impressive figure is underpinned by leverage, debt, and shareholder dilution, rather than genuine conviction in the cryptocurrency. The analyst outlined Strategy&#8217;s approach as a “cyclical financial loop”: the firm raises capital through shares or bonds, purchases Bitcoin, announces these purchases to drive up stock prices, and then raises more funds. The analyst asserts that this cycle has worked as long as Bitcoin&#8217;s price continues to rise. However, with plans for a new $1 billion share sale, OxChain believes that Strategy is increasing its risk exposure. Analyst Predicts Major Liquidation Risk OxChain warns that Strategy&#8217;s average cost per Bitcoin is approximately $70,000, creating a precarious situation. The analyst adds that if Bitcoin’s price falls significantly below this level, the company&#8217;s treasury, currently valued at around $25 billion, could quickly start to suffer losses. According to the analyst, despite Saylor&#8217;s public commitment to never sell Bitcoin, the realities of accounting and risk management may force the company to act if market conditions deteriorate. In the first quarter of 2025, Strategy disclosed $5.9 billion in unrealized Bitcoin losses, revealing the volatility of its assets. Under the new accounting standard ASC 350-60, the company is required to report fair value, eliminating the ability to hide behind book value. This transparency has already led to legal repercussions, with shareholders filing a class action lawsuit alleging that Strategy concealed the risks associated with Bitcoin&#8217;s volatility while aggressively raising capital. OxChain further claimed during his social media thread that Strategy&#8217;s role as a Bitcoin access point is diminishing, especially as institutional capital flows into “more transparent and regulated options,” such as BlackRock’s iShares Bitcoin Trust (IBIT), which has amassed around $70 billion in assets under management. The analyst stressed that unlike Strategy, which reportedly faces dilution risks and operates with limited safeguards, IBIT offers a “more stable investment” for those seeking exposure to Bitcoin. Related Reading: Altcoin Alert: Expert Reveals Hottest Opportunities For The Summer Season If Strategy were to falter, the implications would be far-reaching, OxChain added. The firm holds approximately 2.77% of Bitcoin’s total supply, and a significant liquidation could send shockwaves through the market. The analyst warns that a decline in Bitcoin&#8217;s price by just 22% from its average buy price could trigger corporate liquidations, potentially leading to one of the largest liquidation events in history. Ultimately, OxChain cautions that Strategy is neither a hero nor a villain in the crypto ecosystem; instead, he said that it represents a “risk vector heavily reliant on leverage and market sentiment.” Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "SUI Preparing For New Highs As Falling Wedge Breakout Targets $5",
      "link": "https://www.newsbtc.com/news/sui-preparing-for-new-highs-as-falling-wedge-breakout-targets-5/",
      "summary": "After falling below the key $3.00 mark, SUI now retests a make-or-break level that could ignite or stall the cryptocurrency’s rally. However, some market watchers believe that the altcoin is preparing for new highs despite the recent pullback. Related Reading: Bitcoin Setting Up For ‘Large Move’ Amid $103,000 Retest – Key Levels To Watch SUI Eyes Breakout To $5 This week, SUI fell below the $3.00 mark amid the Israel-Iran news-fueled market retrace. The cryptocurrency has seen a 7% decline over the past three days, hitting a two-month low of $2.68 on Wednesday morning before recovering. Since its late April breakout, SUI has been trading within the $2.33-$4.10 range, with the price hovering around the upper boundary over the past two months. Notably, the altcoin ended its multi-month downtrend after breaking above its descending resistance at the end of March, leading to its rally to the $4.00 mark. On Wednesday, analyst Crypto Bullet suggested that it could be preparing for a similar performance. According to"
    },
    {
      "title": "Solana Plunges 13%: Can Key On-Chain Support Stop The Fall?",
      "link": "https://www.newsbtc.com/news/solana/solana-plunges-13-key-on-chain-support-stop-fall/",
      "summary": "Solana has declined by around 13% in the past week, which has brought the asset back to a major on-chain support cluster. Could this be where the bleed ends? Solana Has Strong On-Chain Support Between $145 &#38; $147 In a new post on X, the on-chain analytics firm Glassnode has talked about where support and resistance levels lie for Solana based on the Cost Basis Distribution (CBD) metric. Related Reading: These Altcoins Are Bucking The Trend—But Can They Keep It Up? The Cost Basis Distribution tells us about how much of the cryptocurrency&#8217;s circulating supply was last purchased or transferred at what spot price. Below is the chart shared by Glassnode that shows the data of the indicator for Solana over the past few months. As is visible, there are a few price zones near the current Solana spot price that stand out in terms of the amount of supply that they hold. The $155 to $157 range carries the cost basis of around 31 million tokens and the $164 to $166 range that of 29 million tokens. A third demand zone exists at $145 to $147, a region that the cryptocurrency&#8217;s price is currently making a retest of. Here, the investors last purchased a total of 13 million SOL. To any investor, their cost basis is an important level, so they are more likely to show some kind of move when a retest of it occurs. Generally, this type of reaction isn&#8217;t anything relevant for the asset when just a few holders share their acquisition mark at the level, but when a large amount of them are involved, like in the case of the range that SOL is retesting right now, a sizeable reaction can sometimes appear. Generally, these moves tend toward buying when the retest occurs from above. That is, when the investors were in the green prior to the retest. This happens because these holders might believe the price decline to be just a dip opportunity or they may simply want to protect their cost basis. Similarly, holders might panic sell when the retest happens from below. This could happen because underwater sellers can be desperate to get back into the green and once they do, they might fear that the rise is only temporary so they could push for the exit. As Solana is retesting the $145 to $147 range from above, it&#8217;s possible that buyers from this region could provide support to the asset and help cushion its fall. In the event that a turnaround does happen, the $155 to $157 resistance range could be of focus next. Related Reading: Bitcoin NVT Enters Reversal Zone: BTC Dangerously Overvalued? The analytics firm has also shared the CBD of another altcoin, Tron (TRX). As Glassnode explains, Cost Basis Distribution shows TRON found support in the $0.26–$0.27 range, where over 14B $TRX is held -marking the strongest cluster on the chart. Above that, the supply is relatively thin and most investor positioning remains below current price. SOL Price Solana is currently hanging right at the lower end of the support range as its price is floating around $145. Looks like the price of the coin has plunged during the last couple of days &#124; Source: SOLUSDT on TradingView Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Ethereum Stalls at $2,500, But Is a $4,000 Breakout Closer Than You Think?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-stalls-at-2500-but-is-a-4000-breakout-closer-than-you-think/",
      "summary": "Ethereum has struggled to maintain upward momentum following a brief rally that pushed its price above $2,800 last week. Currently, ETH is trading at $2,511, reflecting a 9.4% decline over the past week. This retreat comes amid a broader period of consolidation across the digital asset market, with Ethereum seeing both technical resistance levels and on-chain trends that could shape its price action in the coming weeks. Related Reading: Ethereum Golden Cross Approaching – Will History Repeat? Ethereum Faces Technical Resistance The latest analysis from İbrahim COŞAR, a contributor to CryptoQuant’s QuickTake platform, highlights the significance of the 50-week exponential moving average (EMA) as a resistance level for ETH. Historically, successful breakouts above this technical marker have been followed by substantial price gains. COŞAR notes that in prior cycles, once ETH crossed above the 50-week EMA, price increases ranged from 25% to 135%. Averaging those moves suggests a breakout could see Ethereum targeting the $4,000 range. The EMA is a trend-following indicator that places more weight on recent price action, often used to identify potential breakout or breakdown zones in asset movements. Staking and Accumulation Metrics Show Investor Conviction In parallel to price action, Ethereum’s staking metrics continue to show steady growth. On-chain analyst OnChainSchool reported that more than 500,000 ETH were staked in the first half of June, bringing the total staked to over 35 million ETH. This milestone represents the highest amount ever locked in Ethereum&#8217;s proof-of-stake contract and reflects a growing trend toward network participation and supply reduction. Staking, in ETH’s case, involves locking ETH to help secure the network and validate transactions in return for staking rewards. As the amount of ETH staked rises, the liquid circulating supply shrinks, potentially tightening available supply on exchanges. Additionally, accumulation wallets, or addresses with no history of selling, have also reached an all-time high, now holding 22.8 million ETH. Combined, these metrics point toward long-term holding behavior, rather than speculative trading. Ethereum Hits ATH in Staking: Over 35 Million ETH Locked “Alongside this, Accumulation Addresses (holders with no history of selling) have also reached an all-time high, now holding 22.8 million ETH.” – By @onchainschool Read more ⤵️https://t.co/WYoX9qpODZ pic.twitter.com/6MAlK0sCfJ — CryptoQuant.com (@cryptoquant_com) June 17, 2025 These on-chain developments coincide with ongoing interest in Ethereum-based financial products. The Ethereum ecosystem has seen renewed institutional and retail engagement, particularly after the US Securities and Exchange Commission approved the first spot ETH ETFs. Related Reading: Ethereum Price at Risk of Downside Break as Bears Test Key Support Just recently, SharpLink Gaming, a Nasdaq-listed firm, also a marketing partner to sportsbooks and online casino gaming operators, unveiled a $425M Ethereum reserve strategy led by ConsenSys. Featured image created with DALL-E, Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    },
    {
      "title": "The Trolls Are Coming: Defending Bitcoin Mining from Patent Trolls",
      "link": "https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_GenerateThe-Trolls-Are-Coming_-Defending-Bitcoin-Mining-from-Patent-Trollsd_Image_9ib8k29ib8k29ib8-fotor-20250618125328.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls\" rel=\"nofollow\"> </a></p> <p>The clash between Malikie Innovations and Bitcoin miners exemplifies a classic conflict between open innovation and legacy fiat intellectual property rights.</p> <p>"
    },
    {
      "title": "Bitdeer Raises $330M to Expand Bitcoin Mining and AI Operations",
      "link": "https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BITDEER-EXPANDS-BITCOIN-MINING.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations\" rel=\"nofollow\"> </a></p> <p>Singapore-based Bitcoin mining firm Bitdeer Technologies Group has launched a $330 million convertible notes offering, aiming to strengthen its mining operations, develop ASIC rigs, and scale its AI infrastructure.&#160; The notes, due in 2031, carry an annual interest rate of 4.875% and may be converted into Bitdeer Class A shares at a 25% premium to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Tech Booms: Lightning Data Defies Digital Gold Narrative",
      "link": "https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_a_rough_gold_rock_with_Bitcoin_logo_stampe_2.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative\" rel=\"nofollow\"> </a></p> <p>Bitcoin tech shines in 2025 with 1.5 million Lightning users, $1.5 billion trading volume, and Block’s 9.7% yield, outpacing treasury hype.</p> <p>"
    },
    {
      "title": "K33 Announces Plans To Purchase Up To 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norwegian-Public-Company-K33-AB-Purchased-10-BTC-For-Their-New-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>K33 has launched a SEK 85 million share issue at a price of SEK 0.1036 per share.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Treasury Secretary Bessent Says Stablecoins Can Bolster US Dollar 'Supremacy’",
      "link": "https://decrypt.co/326021/treasury-secretary-bessent-stablecoins-dollar-supremacy",
      "summary": "Bessent framed stablecoins as a strategic asset for U.S. influence, as lawmakers weigh whether politics will stall key legislation again."
    },
    {
      "title": "Bitcoin Scandal Fails to Topple Czech Government in No-Confidence Vote",
      "link": "https://decrypt.co/326018/bitcoin-scandal-fails-czech-government-no-confidence-vote",
      "summary": "A $45 million Bitcoin donation from a convicted darknet operator set off a political crisis and brought the Czech government to its knees."
    },
    {
      "title": "1inch Foundation Proposes User Compensation Plan Following October Hack",
      "link": "https://decrypt.co/326012/1inch-foundation-proposes-user-compensation-plan",
      "summary": "DAO members of 1inch are voting on whether to approve a reimbursement scheme for victims of a supply chain exploit last year."
    },
    {
      "title": "Civil Rights Group Gives Elon Musk's xAI 60 Days to Fix Alleged Clean Air Act Violations",
      "link": "https://decrypt.co/326005/civil-rights-elon-musks-xai-60-days-fix-alleged-clean-air-act-violations",
      "summary": "The NAACP has threatened xAI with a lawsuit over unpermitted gas turbines at Memphis AI data center, citing pollution concerns."
    },
    {
      "title": "Trump Pushes House to Pass GENIUS Act as Lawmakers Debate Crypto Oversight",
      "link": "https://decrypt.co/325996/trump-pushes-house-genius-act-lawmakers-debate-crypto",
      "summary": "The President has called on the House to approve the stablecoin bill, despite concerns over conflicts of interest and tech sector influence."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Iran restricts crypto exchange hours after massive Nobitex exploit drains BTC, ETH, XRP",
      "link": "https://cryptobriefing.com/iran-crypto-restrictions-nobitex-exploit/",
      "summary": "<p>Iran's crypto exchange restrictions may hinder financial innovation and exacerbate tensions in an already volatile geopolitical climate.</p> <p>"
    },
    {
      "title": "Bitcoin holds steady at $104K as Fed eyes inflation from tariffs before easing",
      "link": "https://cryptobriefing.com/bitcoin-stability-fed-rate/",
      "summary": "<p>Bitcoin holds at $104K as the Fed keeps rates at 4.25% to 4.50%, citing tariff-driven inflation as reason to delay cuts.</p> <p>"
    },
    {
      "title": "US DOJ seeks to forfeit $225 million in crypto from global scam network",
      "link": "https://cryptobriefing.com/crypto-scam-forfeiture-seizure/",
      "summary": "<p>The DOJ's action highlights the increasing need for robust international cooperation and advanced digital forensics in combating crypto fraud.</p> <p>"
    },
    {
      "title": "Bitcoin stays resilient ahead of Fed meeting as investors await policy signals",
      "link": "https://cryptobriefing.com/bitcoin-resilient-ahead-fed-meeting/",
      "summary": "<p>Bitcoin's resilience amid Fed uncertainty highlights its potential as a hedge, but future rate signals could impact broader market liquidity.</p> <p>"
    },
    {
      "title": "Canada’s first XRP spot ETF goes live on Toronto Stock Exchange",
      "link": "https://cryptobriefing.com/canadas-first-xrp-spot-etf/",
      "summary": "<p>The launch of Canada's first XRP spot ETF could accelerate mainstream adoption of digital assets, enhancing financial market innovation.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Crypto in war crisis? Not Bitcoin – Here’s how BTC is holding up",
      "link": "https://ambcrypto.com/crypto-in-war-crisis-not-bitcoin-heres-how-btc-is-holding-up/",
      "summary": "<img alt=\"bitcoin war crypto\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-34.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Geopolitical panic wiped out $200 billion, but ETFs and calm heads kept crypto grounded."
    },
    {
      "title": "GENIUS Act – Trump urges U.S. House to fast-track ‘incredible’ bill",
      "link": "https://ambcrypto.com/genius-act-trump-urges-u-s-house-to-fast-track-incredible-bill/",
      "summary": "<img alt=\"Stablecoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/StablecoinGeniusActTrump.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Mastercard and Visa stocks dumped after passage of the Senate's stablecoin bill."
    },
    {
      "title": "Ethereum eyes $3,237 next – But is there ONE missing factor?",
      "link": "https://ambcrypto.com/ethereum-eyes-3237-next-but-is-there-one-missing-factor/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-18T152522.056-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum forms bullish structure, but divergence in activity and valuation clouds short-term direction."
    },
    {
      "title": "Bitcoin’s fate hinges on $102K – Breakdown or breakout ahead for the price?",
      "link": "https://ambcrypto.com/bitcoins-fate-hinges-on-102k-breakdown-or-breakout-ahead-for-the-price/",
      "summary": "<img alt=\"Bitcoin’s Fate Hinges on $102K: Breakdown or Breakout Ahead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-102k.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Long-term outlook may be bullish for Bitcoin, but short-term volatility could play a role too."
    },
    {
      "title": "Shiba Inu – A 6,306% hike in inflows? It could be a breakout or a bull trap IF…",
      "link": "https://ambcrypto.com/shiba-inu-a-6306-hike-in-inflows-it-could-be-a-breakout-or-a-bull-trap-if/",
      "summary": "<img alt=\"Shiba Inu - A 6,306% hike in inflows? It could be a breakout or a bull trap IF...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-18T172712.105-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SHIB’s price action has built momentum amid whale inflows, burn spikes, and a falling wedge setup."
    }
  ]
}