{
  "CoinDesk": [],
  "Cointelegraph": [
    {
      "title": "Can you earn passive income running a Lightning node?",
      "link": "https://cointelegraph.com/explained/can-you-earn-passive-income-running-a-lightning-node?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy84MzU3MTJmNmZjYjI3YTNiNTBiNDg1ZGE4MWJlN2Y3MC5qcGc=.jpg\" /></p><p>Running a Lightning Network node in 2025 can generate passive Bitcoin income, but success depends on capital, uptime and dynamic fee strategies.</p>"
    },
    {
      "title": "Bitcoin supply is shrinking: Will Saylor’s relentless BTC buying cause a supply shock?",
      "link": "https://cointelegraph.com/explained/bitcoin-supply-is-shrinking-will-saylors-relentless-btc-buying-cause-a-supply-shock?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9kNDc2OTFmYmU3NDZjMTA4NjNiM2NhZTQ4Yjk4NTEyZC5qcGc=.jpg\" /></p><p> As Michael Saylor’s Strategy and other whales keep buying Bitcoin, the stage may be set for a historic supply shock. </p>"
    },
    {
      "title": "Bitcoin, Ether ETFs clock second-biggest day of inflows on record",
      "link": "https://cointelegraph.com/news/bitcoin-ether-etfs-record-second-biggest-day-of-inflows?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzBlZmYtZmY0Yy03Nzk1LWFhYjQtMGZlNmUzMDdhMGMx.jpg\" /></p><p>BlackRock’s Bitcoin and Ether funds were the biggest beneficiaries of Thursday’s net inflows.</p>"
    },
    {
      "title": "Tasmanian police find top 15 crypto ATM users are scam victims",
      "link": "https://cointelegraph.com/news/tasmanian-police-find-top-15-crypto-atm-users-are-scam-victims?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzMzMDYtODA1YS03YWI1LWFhNzktNDhiMjE3M2E0MGZi.jpg\" /></p><p>Tasmanian police said they found victims were being directed to crypto ATMs by scammers after regular financial institutions flagged the transactions.</p>"
    },
    {
      "title": "LIBRA token creator fights class suit, citing lack of jurisdiction",
      "link": "https://cointelegraph.com/news/libra-token-creator-seek-dismiss-class-suit?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NjljZTYtNzU4MC03Y2YxLWJjOWQtNDM1ZTgzYmQwOTI5.jpg\" /></p><p>Hayden Davis wants a New York lawsuit against him dismissed, arguing the LIBRA token was offered worldwide and didn’t specifically target the state or its residents.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin has NOT reached a new all-time high in euros and pounds amid $118k breakout",
      "link": "https://cryptoslate.com/bitcoin-has-not-reached-a-new-all-time-high-in-euros-and-pounds-amid-118k-breakout/",
      "summary": "<p>Bitcoin surged to a new all-time high against the US dollar on July 10, hitting $111,683 on Binance before closing the day even higher at $115,244. The breakout marked another milestone for dollar-based investors in Bitcoin&#8217;s 2025 bull cycle. But while the headlines celebrated a fresh record, BTC told a different story when priced in [&#8230;]</p> <p>"
    },
    {
      "title": "Ethena rockets to $290 million in revenue, seeks SEC clarity on USDe",
      "link": "https://cryptoslate.com/ethena-rockets-to-290-million-in-revenue-seeks-sec-clarity-on-usde/",
      "summary": "<p>Ethena Labs reached $290.2 million in total protocol revenue on July 9, trailing only Tether, Circle, and Sky among stablecoin issuers. Token Terminal data show that the stablecoin issuer reached $100 million in cumulative revenue 251 days after its launch, making it the second-fastest protocol to cross this threshold. Daily fees averaged $3.1 million during [&#8230;]</p> <p>"
    },
    {
      "title": "Shareholders push back against high pay for public Bitcoin miner execs after record equity grants",
      "link": "https://cryptoslate.com/shareholders-push-back-against-high-pay-for-public-bitcoin-miner-execs-after-record-equity-grants/",
      "summary": "<p>Shareholders trimmed support for executive pay packages at leading US Bitcoin (BTC) miners to an average of 64% in this year’s proxy season, far below the over 90% approval norm across the S&#38;P 500, according to a July 10 VanEck research note. VanEck reviewed filings from eight listed miners and found average named-executive-officer (NEO) compensation [&#8230;]</p> <p>"
    },
    {
      "title": "Robinhood launches ETH, SOL staking services for US users with $1 minimum",
      "link": "https://cryptoslate.com/robinhood-launches-eth-sol-staking-services-for-us-users-with-1-minimum/",
      "summary": "<p>Robinhood launched Ethereum (ETH) and Solana (SOL) staking services for U.S. customers on July 10, enabling users to earn staking rewards on their crypto holdings with as little as $1. The new feature expands Robinhood’s staking offerings beyond Europe, allowing American customers to participate in blockchain validation without directly running validators themselves. For Ethereum, Robinhood [&#8230;]</p> <p>"
    },
    {
      "title": "Tornado Cash co-founder may seek trial delay amid witness dispute",
      "link": "https://cryptoslate.com/tornado-cash-co-founder-may-seek-trial-delay-amid-witness-dispute/",
      "summary": "<p>Tornado Cash co-founder Roman Storm&#8217;s lawyers have signaled that they may request a brief delay in his upcoming criminal trial if a judge allows testimony from a hacker who allegedly used the platform, according to July 10 court filings. In a filing with the U.S. District Court for the Southern District of New York, Storm’s [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Open Interest Climbs Above December 2024 Levels, Here’s What Happened Last Time",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-open-interest-climbs/",
      "summary": "The Bitcoin open interest has risen rapidly once again, with the price pushing above previous peaks to new all-time highs. The BTC price has also stayed over the $100,000 mark for an extended period of time, triggering a new wave of confidence that the cryptocurrency has found its bottom. This has led to crypto traders making their bets and driving the open interest up, pushing it back above December 2024 levels and May 2025 peaks. Bitcoin Open Interest Crosses $70 Billion Again Back in December 2024, the Bitcoin open interest had recorded a new milestone after the volume rose to over $70 billion, marking a new all-time high at the time. The Bitcoin price had also risen sharply at this time and was able to hit $100,000 for the first time in history, triggering even more interest in the asset. Related Reading: Last Crash Before The Surge: Why Bitcoin Is Set To Drop Below $107,000 However, once both the price and the open interest hit these milestones, it wasn’t long before the shorters began to take over the market. The Bitcoin price quickly plummeted back down below $100,000, and over the next few months, open interest would crash back down to the $40 billion territory, resulting in a 40% loss by May 2025. Now, once again, the Bitcoin open interest has crossed the $70 billion mark, sitting close to the $77 billion peak recorded back in May 2025, data from Coinglass shows. In the same vein, the BTC price has been able to maintain above $100,000 and has hit a new all-time high of $117,000. Going by historical performance, it is likely that the Bitcoin price will continue to rise from here, but this break to new all-time highs could carry bearish implications. This is because it is possible that the trend from December 2024 could play out once again. If this happens, then the Bitcoin price could retrace after hitting new highs, an expected correction as shorts pile up. BTC Price Risks Another Crash As the Bitcoin open interest continues to rise and the price has already broken out to new highs, the expectations of a downtrend have become stronger. reported that crypto analyst FriendlyRox expects the Bitcoin price to crash by almost 50%, putting the target as low as $60,000 by the time it’s done. Related Reading: Pundit Says XRP’s Rise To $1,000 Will Happen A Lot Sooner Than Anticipated Crypto analyst and market expert Capo of Crypto has also joined the train, predicting a notable crash event that will send Bitcoin below $100,000 and obliterating altcoins in the process. This comes as institutions are piling into the crypto market, with Bitcoin in the lead, and Capo forecasts a possible ‘Black Swan’ event like the COVID crash. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana Breaks Out Of Symmetrical Triangle—Next Stop $164?",
      "link": "https://www.newsbtc.com/news/solana/solana-breaks-symmetrical-triangle-next-stop-164/",
      "summary": "Solana has shown a potential breakout from a Symmetrical Triangle. Here&#8217;s where the next price target could lie, according to an analyst. Solana Has Surged Above Symmetrical Triangle Resistance In a new post on X, analyst Ali Martinez has talked about how Solana has just broken a resistance line. The level in question is part of a Symmetrical Triangle, a pattern from technical analysis (TA). This pattern belongs to the class of triangles, formations that involve the asset trading within two converging trendlines. The upper line acts as a source of resistance, while the lower one as that of support. A break out of either of these levels implies a continuation of trend in that direction. A surge above the triangle is a bullish sign and a drop under it a bearish one. Since the price&#8217;s range becomes narrower as it travels within a triangle, a breakout can become more likely as it approaches the apex. Related Reading: Bitcoin Breakout Not Just Hype—$4.4B Inflows Back The Move Generally, triangle breakouts are considered to be of the same length as the height of the formation (that is, the distance between the upper and lower trendlines at their widest). There are three popular triangle types: Ascending, Descending, and Symmetrical. The first and second variants have one trendline parallel to the time-axis. In the case of the Ascending type, it&#8217;s the upper level. This means that as Solana moves inside an Ascending Triangle, its range gets narrower toward a net upside. Similarly, the Descending Triangle involves the opposite setup, with the support line being parallel to the time-axis instead. The third type, the Symmetrical Triangle, is the middle ground between the two: it has the two trendlines approaching each other at a roughly equal and opposite slope. In other words, the Symmetrical Triangle represents a period of consolidation where the range gets narrower in true sideways fashion. Due to this fact, a breakout is more-or-less equally probable to occur in either direction. In contrast, there is a bias associated in Ascending and Descending Triangles. Now, here is the chart shared by Martinez that shows the Symmetrical Triangle Solana was trading inside just earlier: As is visible in the above graph, the Solana price was nearing in on the end of the triangle and as probability would dictate, a breakout was becoming likely. The asset indeed ended up finding a break and it seems to have been in the up direction. Related Reading: Bitcoin Moving With Stocks, But Ethereum’s Correlation Is Fading So what could be next for SOL? According to the analyst, the asset might target $164. This level corresponds to the 1.272 Fibonacci Extension line. Fibonacci Extension levels are defined based on ratios found in the popular Fibonacci series. The 1.272 level, in particular, corresponds to the square root of 1.618, which is the famous &#8216;Golden Ratio.&#8217; SOL Price At the time of writing, Solana is floating around $158, up 3% in the last 24 hours. Featured image from Dall-E, charts from TradingView.com"
    },
    {
      "title": "Dogecoin (DOGE) Rockets to $0.20 — Can It Go Even Higher?",
      "link": "https://www.newsbtc.com/analysis/doge/dogecoin-doge-rockets-to-0-20/",
      "summary": "Dogecoin started a fresh increase above the $0.180 zone against the US Dollar. DOGE is now consolidating and might aim for a move above $0.20. DOGE price started a fresh increase above the $0.1750 and $0.180 levels. The price is trading above the $0.1880 level and the 100-hourly simple moving average. There is a bullish trend line forming with support at $0.1910 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could start a fresh rally if it clears the $0.1980 and $0.20 resistance levels. Dogecoin Price Eyes More Gains Dogecoin price started a fresh increase from the $0.1750 zone, like Bitcoin and Ethereum. DOGE was able to climb above the $0.180 and $0.1880 resistance levels. The bulls even pushed the price above the $0.1920 resistance. Finally, the price traded close to the $0.20 barrier. A high was formed at $0.1992 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $0.1660 swing low to the $0.1992 high. Dogecoin price is now trading above the $0.1880 level and the 100-hourly simple moving average. Besides, there is a bullish trend line forming with support at $0.1910 on the hourly chart of the DOGE/USD pair. Immediate resistance on the upside is near the $0.1980 level. The first major resistance for the bulls could be near the $0.20 level. The next major resistance is near the $0.2050 level. A close above the $0.2050 resistance might send the price toward the $0.220 resistance. Any more gains might send the price toward the $0.2320 level. The next major stop for the bulls might be $0.250. Downside Correction In DOGE? If DOGE’s price fails to climb above the $0.20 level, it could start a downside correction. Initial support on the downside is near the $0.1910 level or the trend line zone. The next major support is near the $0.1820 level or the 50% Fib retracement level of the upward move from the $0.1660 swing low to the $0.1992 high. The main support sits at $0.1780. If there is a downside break below the $0.1780 support, the price could decline further. In the stated case, the price might decline toward the $0.1750 level or even $0.1720 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1910 and $0.1880. Major Resistance Levels – $0.1980 and $0.2000."
    },
    {
      "title": "Drop NFTs Like It’s Hot: Snoop Dogg’s Telegram Collection Raises $12M In 30 Minutes",
      "link": "https://www.newsbtc.com/news/drop-nfts-like-its-hot-snoop-doggs-telegram-collection-raises-12m-in-30-minutes/",
      "summary": "Hip Hop legend Snoop Dogg released a nearly 1 million non-fungible token (NFT) collection on Telegram, which sold out in minutes. The launch created massive interest online and raised over $10 million in sales. Related Reading: Bitcoin Back In ‘Retesting Phase’ After Key Level Reclaim – The Calm Before The Storm? Snoop Dogg’s Telegram Drop Raises $12 Million On Wednesday, Snoop Dogg launched digital collectibles on Telegram, igniting an NFT frenzy on the platform. The collection offered unique NFTs inspired by the rapper’s style, including multiple marijuana-themed collectibles, anthropomorphic beagles, and vintage cars. The drop is part of Telegram’s Collectible Gifts, unique works of art on the platform that can be displayed on profiles and have special attributes. As the website explains, the collectibles can be transferred between users or auctioned on NFT marketplaces. Telegram’s founder, Pavel Durov, revealed that the Snoop Dogg drop sold out in 30 minutes, selling 996,000 NFTs for $12 million, adding that “Blockchain minting and the secondary market go live in 21 days. It’s going to be wild.” Last week, Durov shared that the 4th of July-themed Gifts also sold out within minutes, with over 800,000 collectibles selling in 10 minutes. Amid the collectibles’ launch, the rapper promoted it alongside a new track titled “Gifts” on his official Telegram Channel. He shared the link to the song’s music video and tagged Durov’s Telegram channel, saying, “time to drop it like it’s hot.” In the track, Snoop Dogg shouts out Toncoin (TON), the native token of the TON Blockchain, and Telegram. “Plug in my phone, get dressed, and then I plot my play / Critical existence, digital resistance / Shifted, gifted, and lifted / (…) / Stickers and games on Telegram, guess it&#8217;s coming soon / My privacy is not for sale,” some of the lyrics read. Notably, this isn’t the rapper’s first NFT venture, as he entered the space when the sector first gained mainstream popularity in 2021 and dropped collections in 2022 and 2023. NFT Mania Making A Comeback? On X, NFT lead at the TON blockchain, Zenith highlighted the drop’s success, as some of the supply gifts sold out in less than 2 minutes. He explained that Telegram gifts have had a peak market capitalization of over $200 million and a trading volume of $122 million since their launch. According to"
    },
    {
      "title": "XRP Price Builds Momentum — $2.50 Break Sparks Fresh Bullish Wave",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-builds-momentum-2-50/",
      "summary": "XRP price started a fresh increase above the $2.50 zone. The price is now showing positive signs and might climb above the $2.62 resistance. XRP price started a fresh increase above the $2.50 zone. The price is now trading above $2.50 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.50 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above the $2.50 zone. XRP Price Rallies Over 5% XRP price started a fresh increase after it settled above the $2.40 level, like Bitcoin and Ethereum. The price was able to climb above the $2.450 resistance level. The recent move was positive and the bulls pushed the price above the $2.50 level. A high was formed at $2.5870 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2.250 swing low to the $2.5870 high. The price is now trading above $2.50 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.50 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.5880 level. The first major resistance is near the $2.60 level. A clear move above the $2.60 resistance might send the price toward the $2.620 resistance. Any more gains might send the price toward the $2.650 resistance or even $2.6850 in the near term. The next major hurdle for the bulls might be near the $2.750 zone. Another Decline? If XRP fails to clear the $2.620 resistance zone, it could start another decline. Initial support on the downside is near the $2.50 level and the trend line zone. The next major support is near the $2.450 level. If there is a downside break and a close below the $2.450 level, the price might continue to decline toward the $2.420 support or the 50% Fib retracement level of the upward move from the $2.250 swing low to the $2.5870 high. The next major support sits near the $2.40 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.50 and $2.450. Major Resistance Levels – $2.60 and $2.620."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Hits New All Time High of $113,900 as Adoption Accelerates",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-of-113000-as-Adoption-Accelerates.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-of-113900-as-adoption-accelerates\" rel=\"nofollow\"> </a></p> <p>Bitcoin’s surge to $113,900 signals rising adoption, and Fed rate cut expectations.</p> <p>"
    },
    {
      "title": "Rumble Partners with MoonPay to Launch Bitcoin Wallet for Creators",
      "link": "https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Rumble-Partners-with-MoonPay-to-Launch-Bitcoin-Wallet-for-Creators-Today.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/rumble-partners-with-moonpay-to-launch-bitcoin-wallet-for-creators\" rel=\"nofollow\"> </a></p> <p>Today, Rumble announced an exclusive partnership with MoonPay to launch a Bitcoin and crypto wallet that will let creators handle their earnings outside traditional banking systems.&#160; The new Rumble Wallet, set to arrive in Q3 2025, will use MoonPay&#8217;s infrastructure to power all digital currency transactions on the platform. Users will be able to buy, [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Technology Increases Bitcoin Holdings to $101 Million",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-increases-bitcoin-holdings-to-101-million\" rel=\"nofollow\"> </a></p> <p>KULR now holds 1,021 BTC, reporting a 291% BTC yield year to date.</p> <p>"
    },
    {
      "title": "K Wave Media Raises $1 Billion For Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/K-Wave-Media-Raises-1-Billion-For-Bitcoin-Treasury-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k-wave-media-raises-1-billion-for-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>K Wave Media Inc. has announced a $500 million convertible note agreement with Anson Funds to support its Bitcoin treasury strategy. This financing follows an earlier $500 million standby equity purchase agreement with Bitcoin Strategic Reserve, bringing the company’s total capital capacity to $1 billion. As part of the Anson agreement, K Wave will issue [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: Sidechains",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-sidechains",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Layer-2-Sidechains.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-sidechains\" rel=\"nofollow\"> </a></p> <p>The fourth article in the Bitcoin Layer 2 series. This article covers sidechains, a concept originally proposed by the founders of Blockstream.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Florida AG Investigates Robinhood Over Crypto Pricing Claims",
      "link": "https://decrypt.co/329664/florida-ag-investigates-robinhood-crypto-pricing",
      "summary": "Florida's AG said Robinhood's payment-for-order-flow model may mislead users by hiding true crypto costs behind marketing claims."
    },
    {
      "title": "What Crypto Derivatives Say About Bitcoin's Record Price",
      "link": "https://decrypt.co/329661/crypto-derivatives-bitcoins-record-price",
      "summary": "Despite Bitcoin’s push to a new all-time high, the price outlook remains cautiously optimistic, was told."
    },
    {
      "title": "SIM Swapper Who Stole $20 Million in Crypto Resentenced to 12 Years in Prison",
      "link": "https://decrypt.co/329658/sim-swapper-20-million-crypto-resentenced-12-years-prison",
      "summary": "Truglia’s original 18-month term was dramatically increased after he failed to pay restitution to crypto investor Michael Terpin."
    },
    {
      "title": "If You Bought Ethereum When Eric Trump Said So, You’re Finally in the Green",
      "link": "https://decrypt.co/329655/ethereum-eric-trump-youre-finally-green",
      "summary": "Ethereum plunged as much as 37% after the president's son called it a buy in February. Five months later, it has slowly clawed its way back."
    },
    {
      "title": "Bitcoin Stablecoin Network Plasma Sets XPL Token Sale After Attracting $1 Billion in Deposits",
      "link": "https://decrypt.co/329578/bitcoin-stablecoin-network-plasma-token-sale-1-billion",
      "summary": "Plasma will feature several unreleased stablecoins upon its \"late summer\" mainnet launch, although it wouldn't confirm who would issue them."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "REX Shares files for 2X leveraged TRON ETF",
      "link": "https://cryptobriefing.com/2x-tron-etf-launch/",
      "summary": "<p>The filing highlights the increasing diversification in crypto investment products, potentially broadening market participation and innovation.</p> <p>"
    },
    {
      "title": "Pump.fun acquires Kolscan ahead of PUMP token launch",
      "link": "https://cryptobriefing.com/pump-fun-acquires-kolscan-onchain-wallet-tracking/",
      "summary": "<p>Pump.fun acquires wallet tracker Kolscan to boost social trading tools ahead of its PUMP token ICO on July 12.</p> <p>"
    },
    {
      "title": "Why is Bitcoin going up today? Rising US demand, strong ETF inflows, and steady corporate accumulation",
      "link": "https://cryptobriefing.com/bitcoin-price-surge-etf-corporate/",
      "summary": "<p>Bitcoin's sustained growth signals its maturation as a stable asset, attracting institutional interest amid economic and geopolitical uncertainties.</p> <p>"
    },
    {
      "title": "Aptos Labs expands leadership as tokenized real-world assets surpass $540M in value",
      "link": "https://cryptobriefing.com/aptos-real-world-assets-growth/",
      "summary": "<p>Aptos Labs' leadership expansion and strategic partnerships could accelerate institutional blockchain adoption, reshaping global financial markets.</p> <p>"
    },
    {
      "title": "Robinhood launches Ethereum and Solana staking in the US",
      "link": "https://cryptobriefing.com/robinhood-ethereum-solana-staking-us/",
      "summary": "<p>Robinhood's move into crypto staking could accelerate mainstream adoption and influence regulatory frameworks in the evolving digital asset space.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Stellar [XLM] – Here’s what traders should look for after $0.30",
      "link": "https://ambcrypto.com/stellar-xlm-heres-what-traders-should-look-for-after-0-30/",
      "summary": "<img alt=\"Stellar signals potential for a rally past $0.3- Here&#039;s what traders need to watch out for\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Stellar-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin is expected to lead the rally now that it has set a new all-time high- XLM traders could look to book profits and wait."
    },
    {
      "title": "Bitcoin hits new ATH of $118K – Can 2025 take BTC’s price to $150K?",
      "link": "https://ambcrypto.com/bitcoin-hits-new-ath-of-118k-can-2025-take-btc-prices-to-150k/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-ATH-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The latest ATH saw a strong demand from institutions as bears got sidelined after a massive liquidation."
    },
    {
      "title": "Hyperliquid to onboard 10M Phantom users – Will HYPE hit $120 now?",
      "link": "https://ambcrypto.com/hyperliquid-to-onboard-10m-phantom-users-will-hype-hit-120-now/",
      "summary": "<img alt=\"Hyperliquid to onboard 10M Phantom users - Will HYPE hit $120 now?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Benjamin-2025-07-10T173707.555.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Analysts expect HYPE to double or triple by mid-2026."
    },
    {
      "title": "Cardano [ADA] price prediction – 8% rally next, but here’s why you should be careful!",
      "link": "https://ambcrypto.com/cardano-ada-price-prediction-8-rally-next-but-heres-why-you-should-be-careful/",
      "summary": "<img alt=\"Cardano [ADA] price prediction - 8% rally next, but here&#039;s why you should be careful!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/ADA-price-prediction-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Traders and investors can expect a Cardano price move to $0.66-$0.68 this month."
    },
    {
      "title": "Ripple taps BNY to custody stablecoin reserves as RLUSD surpasses $500M",
      "link": "https://ambcrypto.com/ripple-taps-bny-to-custody-stablecoin-reserves-as-rlusd-surpasses-500m/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika-11.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is RLUSD being built to become the future backbone of traditional finance?"
    }
  ]
}