{
  "CoinDesk": [
    {
      "title": "CoinDesk 20 Performance Update: AAVE Rises 2.8% as Index Trades Higher from Tuesday",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/11/coindesk-20-performance-update-aave-rises-2-8-as-index-trades-higher-from-tuesday",
      "summary": ""
    },
    {
      "title": "Everstake Hires Grayscale, Fidelity Veteran David Kinitsky as CEO",
      "link": "https://www.coindesk.com/business/2025/06/11/everstake-hires-grayscale-fidelity-veteran-david-kinitsky-as-ceo",
      "summary": ""
    },
    {
      "title": "PayPal Brings Its Stablecoin to Stellar for Cross-Border Remittances, Payments Financing",
      "link": "https://www.coindesk.com/business/2025/06/11/paypal-brings-its-stablecoin-to-stellar-for-cross-border-remittances-payments-financing",
      "summary": ""
    },
    {
      "title": "Ondo Finance Debuts $693M Treasury Token on XRP Ledger Amid Soaring RWA Trend",
      "link": "https://www.coindesk.com/business/2025/06/11/ondo-finance-debuts-usd693m-treasury-token-on-xrp-ledger-amid-soaring-rwa-trend",
      "summary": ""
    },
    {
      "title": "Moody’s Ratings Brings Credit Rating to Solana in Real-World Asset Tokenization Trial",
      "link": "https://www.coindesk.com/business/2025/06/11/moodys-ratings-brings-credit-rating-to-solana-in-real-world-asset-tokenization-trial",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "New Bitcoin treasuries may crack under price pressure",
      "link": "https://cointelegraph.com/news/new-bitcoin-treasuries-may-crack-under-price-pressure?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzk3NTctYTkyMS03NGI0LWI0ZGEtZGI3ZTI4ZTJjYTJm.jpg\" /></p><p>Strategy has inspired a wave of copycats to join the corporate Bitcoin treasury wave, but they haven’t been battle-tested and entered at higher average prices.</p>"
    },
    {
      "title": "From ETFs to Strategic Bitcoin Reserve: Inside Trump’s crypto playbook",
      "link": "https://cointelegraph.com/news/from-etfs-to-the-strategic-bitcoin-reserve-inside-trump-s-crypto-playbook?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU5MTItYWMzYy03YjVhLWE2ZTgtNDNhMDVhY2QyYTU2.jpg\" /></p><p>Explore the latest developments in crypto regulation and macro outlook in a report by HTX Ventures.</p>"
    },
    {
      "title": "Bitcoin nears new high as Trump says US-China trade ‘deal is done’",
      "link": "https://cointelegraph.com/news/bitcoin-all-time-high-trump-us-china-trade-deal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2QwYzgtMTFmZS03NjEzLWIzNzItODJmOWJjMmY5Yjc3.jpg\" /></p><p>Bitcoin may see more upside if the world’s two largest trading nations finalize their tariff deal and end global economic uncertainty.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Connecticut lawmakers vote to prohibit crypto use in government",
      "link": "https://cointelegraph.com/news/connecticut-crypto-investment-ban-state-politicians?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVlYjgtZDViNy03MzQyLWFiODAtOTAxZWZmZmZiMDkz.jpg\" /></p><p>Connecticut has joined the growing number of US states rejecting the notion of a state Bitcoin reserve, prohibiting government entities from making crypto investments and payments.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Ukraine opens door to Bitcoin reserves as experts warn of key risks",
      "link": "https://cryptoslate.com/ukraine-opens-door-to-bitcoin-reserves-as-experts-warn-of-key-risks/",
      "summary": "<p>Ukraine is taking a significant step toward adding Bitcoin to its national reserves. On June 10, the Ukrainian parliament received a draft bill proposing an amendment to the National Bank of Ukraine&#8217;s (NBU) asset reserve policy. This change would allow the central bank to add cryptocurrencies alongside gold and foreign currencies to its reserves. Ukrainian [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin jumps near $110k after US inflation data shows signs of cooling",
      "link": "https://cryptoslate.com/insights/bitcoin-jumps-near-110k-after-us-inflation-data-shows-signs-of-cooling/",
      "summary": "<p>Bitcoin&#8217;s price increased 0.5% to $109,600 on Wednesday after United States inflation data for May came in below market expectations. The asset’s move comes after a period of sustained strength, where it has held a range between $109,000 and $110,000 over the last three days. The latest Consumer Price Index report showed year-over-year inflation of [&#8230;]</p> <p>"
    },
    {
      "title": "US states split on Bitcoin as Connecticut bans reserve while Louisiana explores blockchain growth",
      "link": "https://cryptoslate.com/us-states-split-on-bitcoin-as-connecticut-bans-reserve-while-louisiana-explores-blockchain-growth/",
      "summary": "<p>A growing divide is emerging among US states over how to approach digital assets, with some jurisdictions warming up to Bitcoin and blockchain innovation, while others are slamming the brakes. This has become particularly evident in how Connecticut and Louisiana offer contrasting responses to the evolving crypto economy through recent legislative efforts. No Bitcoin reserve [&#8230;]</p> <p>"
    },
    {
      "title": "Ripple brings Ondo Finance’s tokenized US Treasuries to XRP Ledger in push for RWA expansion",
      "link": "https://cryptoslate.com/ripple-brings-ondo-finances-tokenized-us-treasuries-to-xrp-ledger-in-push-for-real-world-asset-expansion/",
      "summary": "<p>Ripple has brought Ondo Finance&#8217;s tokenized US Treasuries product, Ondo Short-Term US Government Treasuries (OUSG), to the XRP Ledger. The launch was announced on June 11 and is seen as a move to expand the reach of institutional-grade tokenized assets across the fast-rising blockchain network. According to the statement, the integration allows institutional investors to [&#8230;]</p> <p>"
    },
    {
      "title": "Plasma raises $500 million, partners with Aave to transform stablecoin market",
      "link": "https://cryptoslate.com/plasma-raises-500-million-partners-with-aave-to-transform-stablecoin-market/",
      "summary": "<p>Plasma, a blockchain platform focused on stablecoin infrastructure, is making waves across the crypto space for raising $500 million through its XPL token offering and securing a strategic partnership with DeFi giant Aave in the last 24 hours. The Aave collaboration will see Plasma integrate the DeFi protocol&#8217;s lending and liquidity infrastructure to distribute USDT [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-to-1-million-michael-saylor-laughs-off-crypto-winter-fears/",
      "summary": "Bitcoin’s price outlook remains sky-high after Strategy founder Michael Saylor told Bloomberg on Tuesday that a market freeze won’t come back. He argued that growing demand and limited daily supply point straight to a rally toward $1 million. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Supply And Demand Pressure According to Saylor, miners release only about 450 BTC each day. That adds up to roughly $50 million at today’s price of around $109,859. He said once that $50 million is snapped up by buyers, there’s no choice but for the price to climb. His view rests on the idea that active demand now matches or exceeds what miners sell. High Price Targets Based on reports, asset manager ARK Invest recently boosted its bull case for Bitcoin from $1.5 million to $2.4 million by the end of 2030. Saylor went even further. He said that as long as Bitcoin doesn’t head to zero, it’s bound for $1 million. His own firm has picked up 582,000 BTC since 2020. That stash is worth nearly $64 billion, according to Saylor Tracker data. Institutional And Political Support Saylor pointed to big names backing Bitcoin. He mentioned US President Donald Trump, US Treasury Secretary Scott Bessent and SEC chair Paul Atkins as signs that the asset has won its toughest battles. He also noted that banks are lining up to offer custody services. And he praised Bitcoin ETFs from BlackRock and others for buying coins daily. Volatility Warning Saylor didn’t shy away from a cautionary note. He suggested that if Bitcoin hits $500,000 or $1 million, a fall to about $200,000 could follow. That’s almost a 60% drop from the peak. His point was that big price swings are part of Bitcoin’s history—and likely its future. Beyond miner sales and whale wallets, analysts say wider market moves matter too. Spot and futures trading often top $10 billion a day, so $50 million of fresh buys might only nudge the price. Regulation could swing the other way if concerns over energy use or consumer protection grow. And rival cryptocurrencies keep popping up with new features. Related Reading: Owning 10,000 XRP? You’re Among Crypto’s Elite, Expert Claims What Comes Next Reports disclose the real test will be whether steady new buyers can outpace both miner supply and selling by holders looking to bank profits. Saylor’s figures make a strong case for continued upside. But investors who build a plan around a $1 million Bitcoin should brace for big dips along the way. In the end, daily demand, political moves and how the rest of the financial world reacts will decide if those eye-popping targets really come to pass. Featured image from Getty Images, chart from TradingView"
    },
    {
      "title": "Dogecoin Faces Make-Or-Break Moment This Month, Predicts Analyst",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-make-or-break-moment-this-month/",
      "summary": "Dogecoin is changing hands near $0.198 on Wednesday afternoon in Europe, almost 20 % below its late-March high yet still clinging to an eleven-month up-trend that now converges with a formidable technical inflection, according to independent analyst “VisionPulsed.” Is This Dogecoin’s Summer Liftoff? Speaking in a 10 June video, the analyst told viewers he had been “making the case that the first two weeks of June should be when we start moving up—if we’re bullish. He conceded that “there is a chance the move has started” after Dogecoin closed a two-day candle back above the 0.618 Fibonacci retracement drawn from the December 2024 swing high. The backdrop VisionPulsed describes is notably risk-on. Bitcoin is hovering around $109,500, roughly 3% shy of its all-time high, while Ethereum has punched out a fresh twelve-month high above $2,790. In equities, the S&#38;P Small-Cap 600—an index the analyst referenced when he quipped that “the S&#38;P broke 600 yesterday”—posted its strongest five-day advance since March, a move the analyst interprets as validation of a global-liquidity gauge Global M2. Related Reading: Dogecoin Primed For Liftoff If It Can Break This Barrier: Key Price Targets Hash-ribbon signals on Bitcoin flipped positive two weeks ago, the analyst noted, historically an early marker of revived demand for risk assets. “Bitcoin at 110K says we should go up. Ethereum breaking out says we should go up. If we still don’t go up… just pick a different investment choice.” Central to VisionPulsed’s thesis is a 70-day cyclical window counted from Dogecoin’s April 1 local low. “We’re approaching that 70-day mark.… It is now the time for it to be bullish,” he said, warning that failure to rally before mid-June would all but invalidate the setup. Yet the analyst concedes that Dogecoin’s fate is tethered to the ETH/BTC pair and to Bitcoin dominance, which has remained stubbornly elevated: “When the ETH-BTC move does occur, that’s going to be when the dominance falls and we need the dominance to fall because that’s when Dogecoin goes to the moon.” Until that rotation happens, any up-ticks in DOGE may remain prone to stalling beneath long-term resistance. Related Reading: Bloodbath Incoming? Dogecoin Must Hold This Level To Survive VisionPulsed identifies three price milestones that will decide sentiment. A daily close above $0.23 would constitute the first clear break of the descending trend-line in place since December, while $0.30—the 0.618 retracement of the entire 2021–2024 bear market—marks the level at which, he says, “people will start talking about Dogecoin at your summer camp… it’s going to be euphoric.” Should time drag on, he allows that the trigger could slide to $0.27, but the message is stark: “If we just shoot up, it’s still $0.30. If we take longer, it could be lower, but it’s the same concept.” With Bitcoin firm above six figures, Ethereum printing new local highs, and global liquidity gauges flashing green, the stage is set for an upside resolution. Whether Dogecoin can convert that macro tail-wind into a decisive break above $0.23—and ignite the $0.30 euphoria line—will become evident within the next fortnight. At press time, DOGE traded at $0.197. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Solaxy Coming to Ethereum with Hyperlane, Soon to Reach $48M in Presale",
      "link": "https://www.newsbtc.com/news/solaxy-coming-to-ethereum-with-hyperlane-soon-to-reach-48m-in-presale/",
      "summary": "Solaxy ($SOLX), Solana&#8217;s newest and most faithful project yet, has come out with its latest update that could change the way Web3 apps and tokens interact across blockchains. The project announced its collaboration with Hyperlane, a Web3 infrastructure project, to make bridging faster, easier, and more seamless than it&#8217;s ever been. Keep reading to learn more about Solaxy&#8217;s Hyperlane announcement, what it means for Solana and altcoin enthusiasts, and why it could benefit the Solaxy presale and help it achieve the magical $50M mark. Solaxy Revolutionizes Cross-Chain Support with New Hyperlane Integration It&#8217;s worth noting that traditional bridging, which means transferring tokens from one blockchain to another, is a slow and complex process. That&#8217;s where Solaxy begs to differ, though. With Hyperlane&#8217;s cutting-edge modular and permissionless architecture, Solaxy will build an entirely new type of bridge that connects Solana, Solaxy, and Ethereum flawlessly. This will be a first-of-its-kind Layer 2 bridge experience for Solana users, providing low latency (better speeds), improved affordability, and enhanced user experience. For developers and users on Solana, transferring tokens between the two blockchains would be as easy as using a regular app. Solaxy Aims to Help Solana Grow Bigger and Better Solana&#8217;s development is Solaxy&#8217;s core mission. That&#8217;s what this new crypto with an Einstein-ified Pepe the Frog as its face card is all about, in fact. $SOLX&#8217;s Hyperlane integration will help Solana plug directly into Ethereum, a blockchain with deep liquidity and a vast dApp ecosystem, helping it grow beyond its limitations (solving issues like limited scalability and network congestion). The launch of the $TRUMP and $MELANIA tokens earlier this year brought in a flurry of new investors to Solana. But, despite being a meme coin-friendly blockchain, it wasn&#8217;t prepared for the sudden spike in transaction requests. Which led to numerous failed transactions and massive congestion. Solaxy plans to remedy that, however, by building the first-ever Layer 2 scaling protocol on Solana. It will bring back the network&#8217;s glory days by increasing its efficiency and scaling it to higher levels. The project will offload a significant number of transactions onto a sidechain (L2) through its roll-up technology, easing the pressure off Solana&#8217;s L1. The L2 will also implement batch processing, executing transactions in bulk, instead of one by one. This will reduce the cost per transaction, making Solana an ever more affordable blockchain for crypto and meme coin degens. By bridging to Ethereum and Solana using Hyperlane, Solaxy becomes more than just a scaling tool. It&#8217;s a full-blown interoperable hub, allowing seamless crypto transfers between the most popular blockchains in the world. One Multi-Chain Token, Several Use Cases Thanks to its compatibility with multiple chains (Solana and Ethereum), Solaxy&#8217;s scalability and speed can be used to power high-frequency dApps, too. These include: Gaming ecosystems looking for real-time interactions Meme coin and microtransaction platforms Custom-built financial applications that need low latency and improved affordability And consider the fact that Ethereum is the second-most popular blockchain for dApps after BNB, with over 5K dApps live right now (10x more than Solana). Which brings us to the kicker: Solaxy&#8217;s Hyperlane bridging between its blockchain, Solana, and Ethereum, could be much more impactful than at first glance. $SOLX, as Solaxy&#8217;s token, should receive much much of this boost and keep growing at an accelerated rate as a result. Solaxy&#8217;s Record-Breaking Presale Performance As Solaxy&#8217;s real-world application keeps growing, $SOLX investors should receive the lion&#8217;s share of the benefits. $SOLX is currently in presale, having already raised an eye-watering $47.1M in early investor funding. Each token is currently priced at just $0.001752, and given Solaxy&#8217;s wild future potential – it could explode 11,300% and reach $0.20 by 2026 – this is an almost unbelievably good deal you&#8217;re getting on Solaxy right now. If you&#8217;re interested in supporting the next big thing in DeFi, visit the official Solaxy website, connect your crypto wallet, punch in the number of tokens you want to buy, and confirm the transaction from your wallet. It&#8217;s all so simple! For further help, check out our full explainer on how to buy Solaxy. Disclaimer: A crypto token&#8217;s potential notwithstanding, kindly bear in mind that the market doesn&#8217;t guarantee any returns. This article isn&#8217;t financial advice, and we urge you to do your own research before investing."
    },
    {
      "title": "Ethereum Staging A Repeat Of Bitcoin’s 2021 Cycle? Here’s The Target",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-repeat-bitcoin-2021/",
      "summary": "With the recent Ethereum price trend, a crypto analyst has pointed out that the altcoin could be looking to stage a similar rally to what was seen with Bitcoin back in 2021. Crypto analyst TradingShot pointed out the similarities in a recent analysis and showing where the price could go if it does play out the same way. Ethereum Looks Like Bitcoin Did In 2021 In the analysis posted on TradingView, crypto analyst TradingShot showed how this Ethereum cycle movement looked similar to Bitcoin’s 2021 cycle movement. The first of this was recovery from a major price crash that led to new cycle lows for the cryptocurrency, before staging a recovery that pushed it toward new highs. Related Reading: Is Altcoin Season Still Coming? Why Bitcoin Is To Blame Despite Making ATHs For Bitcoin, the crash happened when the COVID-19 lockdown was announced. Following this, the Bitcoin price had fallen more than 50% from above $9,000 to less than $4,000 in less than one month. However, after this, the Bitcoin price rebounded from the cycle lows, crossing the 1-week MA50, and then breaking the lower high trendline, and going on to reach new all-time highs. For Ethereum, the crypto analyst pointed to the price crash triggered by Donald Trump’s tariff wars as being similar to Bitcoin’s COVID crash. After Donald Trump announced tariffs on other countries, the Ethereum price also crashed by a large margin, going from above $2,400 to below $1,500 in less than a month. This has been dubbed the ‘Trade War Crash’, and the altcoin is still reeling from the decline. Currently, the Ethereum price is stuck at the point where it is still trying to break above the 1-week MA50, which is now the major level to beat to confirm this trend. Just like Bitcoin, it has also seen the formation of major resistance at the lower highs, and this sits right at the $4,200 level. This means the Ethereum price still has around a 50% rally to complete before it confirms a similar trend to Bitcoin. How High ETH Price Could Go If It Plays Out If Ethereum does reclaim the 1W 50MA and then breaks the lower highs at $4,200, confirming this trend, then the resulting rally could be exceptional. For example, after breaking the lower highs, the Bitcoin price went on to reach new all-time highs of $69,000 in 2021. This means that the price went from below $4,000 to $69,000 in the space of a year. Related Reading: Pundit Says Do Not Ignore Ethereum Amid New All-Time Highs In Major Metric A similar rally would mean that the Ethereum price would rise above $10,000. Taking the same timelines into position, it would put ETH at this price sometime in 2026, a year from when the Trade Wars crash had occurred. A closer parabolic rally and an imitation of Bitcoin’s 1,700% rally would mean a price tag above $15,000 for the second-largest cryptocurrency in the space. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Eyes New Highs As Price Retests $109,000, But Analyst Warns Of Potential Pullback",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-eyes-new-highs-as-price-retests-109000-but-analyst-warns-of-potential-pullback/",
      "summary": "Bitcoin (BTC) is trying to reclaim a crucial area amid its recent price recovery, which could propel the flagship crypto toward new highs. Some analysts suggested that BTC is preparing for the “final resistance,” while others warned that it still risks a potential pullback to lower levels. Related Reading: Solana Triangle Formation Breakout Targets Rally To $164 – Is A Recovery Around The Corner? Bitcoin Rally Eyes Next Resistance Bitcoin has finally regained significant bullish momentum after printing a massive daily candle on Monday. The flagship crypto recently lost its post-all-time high (ATH) range of $106,800-$109,700, sparking concern among some investors. Amid the recent market pullbacks, which began in late May, the flagship crypto also registered some volatility, losing key levels as support and hitting a one-month low near the $100,000 level last week. However, BTC reclaimed the $105,000 mark over the weekend before surging above the $106,800 crucial resistance on Monday. Following this performance, analyst Rekt Capital stated that Bitcoin has successfully retested the $104,400 re-accumulation range high resistance as new support for four weeks. He highlighted that BTC was “rebounding from this new support base in an effort to transition into Price Discovery again.” Additionally, Bitcoin ended its two-week downtrend, recording a Daily Close around the $110,500 area. Per the analyst, BTC “has skipped through the $106,600-$109,443 Daily Range entirely,” and is “once again positioning itself like in late May for a retest” of the range’s high as support, which propelled the price to its ATH last month. A daily close above the $109,443 level would set up BTC for a revisit of the “final Daily resistance,” around the $111,723 mark, before a new ATH. The analyst also affirmed that reclaiming the “final weekly resistance” of $108,900 as support would also add to BTC’s momentum. BTC In A &#8216;Dangerous Area&#8217;? Analyst Crypto Jelle suggested that turning the $108,000 price area into support could send Bitcoin to the price discovery phase, potentially targeting the $120,000 mark. He noted that previous unsuccessful breakout attempts failed to reclaim this level, but that the cryptocurrency is currently holding this area. Based on a multi-month pattern, Jelle also reaffirmed its $140,000-$150,000 target for BTC’s cycle top. The analyst highlighted a major inverted Head and Shoulders pattern forming since the end of 2024. According to"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Michael Saylor: The Bear Market Is Not Coming Back And Bitcoin Is Going To $1 Million",
      "link": "https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Michael-Saylor-The-Bear-Market-Is-Not-Coming-Back-And-Bitcoin-Is-Going-To-1-Million.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million\" rel=\"nofollow\"> </a></p> <p>In a Bloomberg interview, Strategy CEO Michael Saylor announces that Bitcoin is not going to zero, it is going to $1 million.</p> <p>"
    },
    {
      "title": "Bitwise Debuts First Ever GameStop Covered Call ETF",
      "link": "https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitwise.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf\" rel=\"nofollow\"> </a></p> <p>Today, Bitwise Asset Management announced the launch of the Bitwise GME Option Income Strategy ETF (IGME), the first-ever covered call ETF centered around GameStop (GME). The fund arrives at a moment where GameStop recently made headlines for its $500 million Bitcoin treasury strategy. Led by Bitwise’s Head of Alpha Strategies Jeff Park, IGME is the [&#8230;]</p> <p>"
    },
    {
      "title": "Economic Bitcoin Nodes: Why You Need To Use Your Node For It To Matter",
      "link": "https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BitcoinEconomicNOdes.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter\" rel=\"nofollow\"> </a></p> <p>Bitcoin nodes are what makes up the Bitcoin network, but without using them to verify your economic activity, they don't impact consensus. </p> <p>"
    },
    {
      "title": "Bitcoin Officially Traded Above $100,000 For 30 Consecutive Days For The First Time",
      "link": "https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Officially-Traded-Above-100000-For-30-Consecutive-Days-For-The-First-Time.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time\" rel=\"nofollow\"> </a></p> <p>Bitcoin holds above $100K for 30 days as states, banks, and companies accelerate adoption.</p> <p>"
    },
    {
      "title": "The Trump’s American Bitcoin Merges with Gryphon, Reports 215 BTC on Balance Sheet Since Launch",
      "link": "https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ABTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch\" rel=\"nofollow\"> </a></p> <p>American Bitcoin Corp (ABTC), a newly formed private Bitcoin mining company backed by Eric Trump and Donald Trump Jr., announced in a June 10 SEC filing that it has acquired 215 Bitcoin (BTC) since launching operations on April 1, 2025. The reserve is currently valued at approximately $23 million, showing their drive and commitment to [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "HYPE Leads Altcoin Recovery as Bitcoin Price Steadies",
      "link": "https://decrypt.co/324614/hype-leads-altcoin-recovery-bitcoin-price-steadies",
      "summary": "HYPE token outperforms major cryptos with 12.4% weekly gains as Hyperliquid's DEX gains traction in perpetual futures trading."
    },
    {
      "title": "Bitcoin Climbs Slightly as US Reports Inflation Slowed in May",
      "link": "https://decrypt.co/324375/bitcoin-after-cpi",
      "summary": "Bitcoin climbs toward $110K as May inflation comes in lower than expected, boosting hopes for Fed rate cuts and crypto momentum."
    },
    {
      "title": "Dogecoin Is About to Get a Flood of Games Via DogeOS and PlaysOut",
      "link": "https://decrypt.co/324435/dogecoin-flood-games-dogeos-playsout",
      "summary": "DogeOS will facilitate the launch of approximately 15 casual games via PlaysOut, with Dogecoin rewards and Doginals-based assets."
    },
    {
      "title": "What is LIBRA? The Solana Meme Coin That Sparked a Political Scandal",
      "link": "https://decrypt.co/resources/what-is-libra-the-solana-meme-coin-that-sparked-a-political-scandal",
      "summary": "LIBRA’s collapse triggered fraud claims, insider trading accusations, and calls for Argentine President Javier Milei’s impeachment."
    },
    {
      "title": "India CBI Busts Transnational Cybercrime Ring, Seizes $327K in Crypto",
      "link": "https://decrypt.co/324588/india-cbi-transnational-cybercrime-seizes-327k-crypto",
      "summary": "The CBI’s investigation revealed advanced social engineering operations being used to exploit jurisdictional gaps to target foreign victims."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Nasdaq-listed Interactive Strength plans to invest $500M in Fetch.ai’s FET token to build an AI-focused crypto treasury",
      "link": "https://cryptobriefing.com/ai-focused-crypto-treasury-investment/",
      "summary": "<p>This move highlights a growing trend of public companies investing in AI-driven digital assets, potentially reshaping corporate finance.</p> <p>"
    },
    {
      "title": "Pro-Bitcoin Scott Bessent emerges as candidate for next Fed chair",
      "link": "https://cryptobriefing.com/fed-chair-successor-bessent-powell/",
      "summary": "<p>Bessent's potential Fed chair candidacy highlights a shift towards integrating cryptocurrency perspectives in U.S. monetary policy.</p> <p>"
    },
    {
      "title": "Solana ETFs could be approved in 3-5 weeks, SEC signals openness to staking",
      "link": "https://cryptobriefing.com/solana-etf-approval-potential-signals/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional investment in crypto, enhancing market legitimacy and innovation.</p> <p>"
    },
    {
      "title": "Wall Street’s Guggenheim Treasury brings its flagship tokenized debt instrument to XRP Ledger",
      "link": "https://cryptobriefing.com/guggenheim-treasury-launches-tokenized-commercial-paper-xrp-ledger/",
      "summary": "<p>The integration of tokenized debt on the XRP Ledger could accelerate blockchain adoption in traditional finance, enhancing liquidity and efficiency.</p> <p>"
    },
    {
      "title": "Eric Trump-backed American Bitcoin discloses 215 BTC holdings",
      "link": "https://cryptobriefing.com/american-bitcoin-btc-disclosure/",
      "summary": "<p>The strategic focus on Bitcoin accumulation by American Bitcoin could influence market dynamics and drive broader adoption and infrastructure development.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "SPX6900’s gains look strong, but THESE red flags could surprise you!",
      "link": "https://ambcrypto.com/spx6900s-gains-look-strong-but-these-red-flags-could-surprise-you/",
      "summary": "<img alt=\"Is SPX6900 unstoppable? Traders, wait, THESE 2 red flags suggest a rude wake-up!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250611_114632_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SPX has led the market with significant gains, but the sustainability of this rally is now in question."
    },
    {
      "title": "Why SEC delayed its Polkadot, Hedera ETF decisions, and what’s next",
      "link": "https://ambcrypto.com/why-sec-delayed-its-polkadot-hedera-etf-decisions-and-whats-next/",
      "summary": "<img alt=\"Why SEC delayed its Polkadot, Hedera ETF decisions, and what&#039;s next\" class=\"attachment-full size-full wp-post-image\" height=\"669\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/SEC-delays-polkadot-and-hedera-etf.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1190\" />Is the SEC's caution a permanent hurdle or just a phase?"
    },
    {
      "title": "Bitcoin fails to break $111K – Is this the end of BTC’s uptrend?",
      "link": "https://ambcrypto.com/bitcoin-fails-to-break-111k-is-this-the-end-of-btcs-uptrend/",
      "summary": "<img alt=\"Bitcoin fails to break $111K - Is this the end of BTC&#039;s uptrend?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-11T110155.178-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin nears critical resistance as whales hold back, leaving room for a breakout or pullback."
    },
    {
      "title": "Why Bitcoin’s sell-off will slow down once BTC hits $130K-$150K: Bitwise CEO",
      "link": "https://ambcrypto.com/why-bitcoins-sell-off-will-slow-down-once-btc-hits-130k-150k-bitwise-ceo/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BitcoinBitwiseWP.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Peter Brandt's 75% BTC crash projection could be far-fetched as 200-weekly SMA hovered around $48K."
    },
    {
      "title": "PENGU memecoin rebounds 14%, but traders, is there a catch?",
      "link": "https://ambcrypto.com/pengu-memecoin-rebounds-strongly-but-traders-is-there-a-catch/",
      "summary": "<img alt=\"Pudgy Penguins [PENGU]\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-14.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PENGU is up 14.1% over the past week; breaking out of a descending channel as analyst eye a rally to $0.025 ."
    }
  ]
}