{
  "CoinDesk": [
    {
      "title": "Crypto Daybook Americas: Bitcoin Shrugs Off Fed, Mideast War, but Derivatives Flash Caution",
      "link": "https://www.coindesk.com/daybook-us/2025/06/19/crypto-daybook-americas-bitcoin-shrugs-off-fed-mideast-war-but-derivatives-flash-caution",
      "summary": ""
    },
    {
      "title": "Nobitex's Source Code Released a Day After Hackers Steal Tokens Across Bitcoin, EVM, Ripple Networks",
      "link": "https://www.coindesk.com/markets/2025/06/19/nobitexs-source-code-released-a-day-after-hackers-steal-tokens-across-bitcoin-evm-ripple-networks",
      "summary": ""
    },
    {
      "title": "Return of Zero Interest Rate Policy as Swiss Central Bank Cuts Rates",
      "link": "https://www.coindesk.com/markets/2025/06/19/return-of-zero-interest-rate-policy-as-swiss-central-bank-cuts-rates",
      "summary": ""
    },
    {
      "title": "Circle Rockets After Stablecoin Bill Clears Senate, Pushes Post-IPO Rally to Over 500%",
      "link": "https://www.coindesk.com/markets/2025/06/19/circle-rockets-after-stablecoin-bill-clears-senate-pushes-post-ipo-rally-to-over-500",
      "summary": ""
    },
    {
      "title": "Dogecoin Steady But Flashing 'Oversold' in Signal for Bearish Bets",
      "link": "https://www.coindesk.com/markets/2025/06/19/dogecoin-steady-but-flashing-oversold-in-signal-for-bearish-bets",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "OKX brings DEX aggregator to MetaMask with Consensys partnership",
      "link": "https://cointelegraph.com/news/okx-consensys-dex-aggregator-metamask?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg3NjItMzY0YS03MzI5LWJiOTAtY2NlNzY4YWJmYTQ5.jpg\" /></p><p>OKX partners with Consensys to integrate its DEX aggregator into MetaMask, giving users access to more than 500 DEXs and new MEV protection via SERVO.</p>"
    },
    {
      "title": "Russia says 70% of crypto miners remain unregistered despite new laws",
      "link": "https://cointelegraph.com/news/only-30-percent-russian-crypto-miners-legal-finance-ministry?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzQ4ZGQtNDRiOS03NTdmLTljNGMtMTFhOWE3MmQ2ODQ2.jpg\" /></p><p>Russia will continue taking measures to encourage crypto mining businesses to register with the tax authority, including imposing bigger penalties for violations.</p>"
    },
    {
      "title": "Bitget secures Georgia license as part of Europe expansion",
      "link": "https://cointelegraph.com/news/bitget-expands-to-georgia-and-vietnam-with-new-licenses-and-payment-tools?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgzMjQtN2U4ZS03ZGZhLThmODQtMzFkZGY1NzVlOGQx.jpg\" /></p><p>Bitget picks Georgia for the next step of its expansion in Eastern Europe, attracted by clear regulations, tax benefits and a growing crypto user base.</p>"
    },
    {
      "title": "Bitcoin user accidentally sent $60,000 in fees—Don’t make the same mistake",
      "link": "https://cointelegraph.com/news/how-one-bitcoin-user-accidentally-paid-60k-in-fees?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdkYjItYzJjNC03NWIzLThhNjktMTJhMTkxOWI4ODJl.jpg\" /></p><p>RBF lets you resend unconfirmed transactions with higher fees, but it requires a clear understanding of fee units, wallet behavior and transaction structure.</p>"
    },
    {
      "title": "Is crypto still taxed in Australia? Major legal update explained",
      "link": "https://cointelegraph.com/news/is-crypto-still-taxed-in-australia?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg3YTMtYTc5NC03NzU1LThhNTktMzIyOWI1ZTU3ZjJh.jpg\" /></p><p>Australia now taxes crypto as property, with capital gains on swaps, DeFi and wrapped tokens, plus new ATO data sweeps targeting 1.2 million users.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Iran-based Nobitex vows user protection despite $100 million attack by Israel-linked hacktivists",
      "link": "https://cryptoslate.com/iran-based-nobitex-vows-user-protection-despite-100-million-attack-by-israel-linked-hacktivists/",
      "summary": "<p>Iranian crypto exchange Nobitex has confirmed that it lost nearly $100 million in a cyberattack by a politically motivated hacking group. The breach, which occurred on July 18, has shaken the local crypto community and triggered a government-imposed curfew on crypto trading platforms nationwide. The attack was claimed by an Israel-linked group calling itself Gonjeshke [&#8230;]</p> <p>"
    },
    {
      "title": "Open AI might kill us. Closed AI might enslave us. Choose your future.",
      "link": "https://cryptoslate.com/open-ai-might-kill-us-closed-ai-might-enslave-us-choose-your-future/",
      "summary": "<p>There’s a familiar discomfort creeping in again, something I felt in the early 2010s as I watched social media&#8217;s promises of connection and community unravel into mass manipulation. Facebook and propaganda bots were the first dominoes. Cambridge Analytica, Brexit, global elections, it all felt like a betrayal of the internet’s original dream. Now, in the [&#8230;]</p> <p>"
    },
    {
      "title": "XRP Ledger embraces decentralized governance with XAO DAO launch",
      "link": "https://cryptoslate.com/xrp-ledger-embraces-decentralized-governance-with-xao-dao-launch/",
      "summary": "<p>The XRP Ledger has entered a new phase of community participation with the upcoming launch of XAO DAO, marking the network&#8217;s first decentralized autonomous organization (DAO). This launch signals a shift toward deeper decentralized governance in XRPL&#8217;s future, offering users a structured way to engage in critical decisions, fund initiatives, and support real-world blockchain adoption. [&#8230;]</p> <p>"
    },
    {
      "title": "Ford explores decentralized legal data storage on Cardano blockchain",
      "link": "https://cryptoslate.com/ford-explores-decentralized-legal-data-storage-on-cardano-blockchain/",
      "summary": "<p>Ford Motor Company, a Fortune 500 company, has joined forces with Iagon and Cloud Court to launch a proof-of-concept (PoC) focused on decentralized legal data storage, according to a June 18 announcement. The project, built on the Cardano blockchain, will test decentralized solutions for managing sensitive legal records across large organizations. Following the news, Iagon’s [&#8230;]</p> <p>"
    },
    {
      "title": "Donald Trump urges swift GENIUS Act passage to dominate digital asset space",
      "link": "https://cryptoslate.com/donald-trump-urges-swift-genius-act-passage-to-dominate-digital-asset-space/",
      "summary": "<p>President Donald Trump, who has interests in the stablecoin USD1 via his involvement in World Liberty Financial, has called on the US House of Representatives to move quickly on the GENIUS Act, a new bill aimed at regulating stablecoins and boosting America’s role in the digital asset economy. In a June 19 post shared on [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin’s Momentum Wobbles—Analyst Predicts Correction Below $94K",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoins-momentum-wobbles-analyst-predicts-correction-below-94k/",
      "summary": "Bitcoin’s recent climb to $105,000 has done little to shake off the worries piling up around its momentum. The world’s biggest cryptocurrency eked out a 0.03% gain in the last 24 hours but still sits 3.5% lower than it did a week ago. According to analyst Captain Faibik, this mix of flat gains and fading strength could mean traders are buying Bitcoin at the top. Related Reading: Iran’s Top Crypto Hub Loses $82 Million To Hackers With Israeli Links—Details Bearish RSI Divergence Signals Weakness Based on data, the Relative Strength Index (RSI) has drifted downward after peaking near 80, even as Bitcoin’s price pushed to fresh highs. The RSI now sits at 61.88, a clear sign that buyers are losing steam. Traders often watch for this kind of mismatch—when price goes up but RSI goes down—because it can spell a coming pullback. History shows it doesn’t always lead to a crash, but it does make a correction more likely. After carving out fresh highs, it feels like Bitcoin has hit its ceiling, according to Fabik, and a pullback into the $92,000–$94,000 zone could be on the cards. This setup usually sparks a quick correction, so many traders will be watching closely and tightening up their strategies as the market could shift in a hurry. $BTC is showing a massive RSI Bearish divergence on the weekly chart..!! It looks like Bitcoin has topped out and is now Ready for a major correction toward the 92–94k Range..📉 Just like it bottomed out at 16k in November 2022, We bought the dip and now we’re selling the… pic.twitter.com/W25HCAxkIa — Captain Faibik 🐺 (@CryptoFaibik) June 18, 2025 Resistance Levels Keep Price In Check Bitcoin has bumped into stiff barriers around $108,000 and $109,000, both set on May 19. An ascending trendline from December 2024 has also been capping gains for weeks. These levels are proving tough to clear. If Bitcoin can’t break through soon, sellers may step in. Faibik points out that hitting these walls and seeing RSI divergence at the same time often marks the high point before a drop. This Activity Points To Caution The derivatives market adds another layer to the story. Trading volume in Bitcoin futures and options rose by 1.60%, taking total activity to around $100 billion. Open interest, meanwhile, slid down 1.30% to nearly $70 billion. This suggests some players are closing their bets rather than piling on new ones. In the past 24 hours, liquidations have wiped out $71 million in long positions. That kind of pain can trigger more sell‑offs if people rush to protect their profits. Related Reading: Tether Enforces Freeze On $12 Million In Tron Funds Over Illicit Activity Past Patterns Offer Mixed Lessons Looking back, Bitcoin’s rebound in 2022 followed a different playbook. Back then, price hit a low near $16,000 and built strength even as RSI climbed from oversold levels. That setup led to a strong rally. Today, though, the RSI is nowhere near oversold territory. It’s more of a warning flag than a green light. Captain Faibik reminds traders that past wins don’t guarantee future results. Conditions now include higher interest rates and deeper institutional interest, which can change how Bitcoin reacts to the same signals. Featured image from Trade Brains, chart from TradingView"
    },
    {
      "title": "‘Out of Time’: XRP Consolidation Hits Final Moment, Analyst Alerts",
      "link": "https://www.newsbtc.com/news/out-of-time-xrp-consolidation-hits-final-moment-analyst-alerts/",
      "summary": "In a post late Wednesday, independent technician CasiTrades—followed by 20,000 accounts on the platform—warned that “the market is officially out of time” and that XRP’s multi-month coil has compressed to the tipping point. Why XRP &#8216;Is Out Of Time&#8217; “After months of tightening, the XRP consolidation has finally reached its apex and something big is coming next,” she wrote. “There are only two paths from here: either the explosive breakout we’ve been waiting for begins now, or we see one final sharp drop to support that ignites the breakout we’ve all been preparing for.” CasiTrades’ roadmap turns on a single price: $2.25. XRP has probed that level repeatedly since the first week of June but has yet to close above it. “Price continues to struggle with the $2.25 level, a level I’ve talked about continuously,” she noted, arguing that every failed attempt increases the probability of a stop-hunt toward $2.01, $1.90, even $1.55. Those levels, she stressed, are “momentum zones… areas where the market grabs the liquidity it needs to build momentum for wave 3.” Related Reading: XRP To End 7-Month Consolidation After 700% Surge – Is A Major Move On his daily chart the Relative-Strength Index has been tracing a shallow upward channel while price has moved sideways, a structure the analyst calls a “guide for the end of this squeeze.” The confluence—a volatility funnel on price and a steady grind higher on momentum—mirrors the pattern that preceded XRP’s October 2023 breakout. Beyond geometry, timing is central to CasiTrades’ argument. “It’s mid-week, Wednesday—this is when sentiment tends to flip,” she wrote, invoking a playbook familiar to short-term traders: a fake-out in the back half of the week that reverses by Friday’s close, leaving late-entrants stranded. The setup, she said, is no longer purely technical. “This is not just technicals lining up, it’s the whole picture aligning. Sentiment, structure, timing, even global headlines.” Related Reading: XRP Addresses Holding 1M Coins Reach 12-Year High As Experts Predict Move Above $4 By mid-morning in Europe, XRP was quoted at $2.16, roughly three percent below the resistance that defines CasiTrades’ fork-in-the-road. Seven-day realised volatility has fallen to its lowest reading since February, underlining the sense of a market biding its time. Whether the catalyst comes from a decisive hourly close above $2.25 or from a liquidity sweep into the $1.90s, the analyst’s central claim is unchanged: the consolidation’s lifespan has effectively expired. As she signed off, CasiTrades offered a final exhortation—short, sharp, and consistent with the urgency of his chart: “Do not miss what’s next.” Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Worries Over Bitcoin Treasuries Grow — Can Solaxy 100x as First-Ever Solana Layer-2?",
      "link": "https://www.newsbtc.com/news/bitcoin-treasury-concerns-can-solaxy-100x-solana-l2/",
      "summary": "Corporate treasury strategies are entering a new era as traditional finance and crypto converge. Two standout approaches are now reshaping how institutions manage digital assets. 💡 Approach One: The well-established Bitcoin playbook – buy $BTC and hold. Borrow billions to do so if necessary. 💡 Approach Two: A bold new frontier on Solana – buy $SOL and farm yield natively through chain-on-chain treasury mechanics. Both approaches have gained significant followings in recent months, with the $SOL treasury strategy emerging more recently. And with Solaxy preparing to launch the first true Solana Layer-2, the entire Solana-native treasury model could be about to jump to light speed. Debt-Fueled Bitcoin Strategies Face Growing Scrutiny MicroStrategy,"
    },
    {
      "title": "Bitcoin Channel Break Below $105,000 Sparks Panic, Analysts Predict Further Crashes",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-channel-break/",
      "summary": "Bitcoin has been crashing with the advent of the new week, spurred on by uncertainties that surround the growing conflict in the Middle East. There has also been a lot of negativity in the crypto market, with expectations that the Bitcoin price will not make new all-time highs after failing to reclaim $111,000. Even as the market continues to bleed, crypto analysts are still predicting further crashes for the digital asset, with some expecting a break of the psychological level at $100,000. Bitcoin Price Headed For Further Breakdown Crypto analyst TehThomas had previously called the Bitcoin price crash from the $108,000 territory, suggesting that the digital asset still had to fill Fair Value Gaps (FVG) at lower levels before it could continue to soar. Then recently, the crypto analyst has once again reiterated his stance as the price had begun to fall back toward $100.000. Related Reading: XRP To End 7-Month Consolidation After 700% Surge – Is A Major Move Coming? Thomas explained that Bitcoin was already showing signs of exhaustion. Hence, the reason for the crash was due to a loss of $108,500. At this level, with the price failing to break out higher, it showed that the initial surge had been a takeout, and the right direction was actually downward. The initial bullish move was seemingly a way for an internal liquidity grab while clearing out breakout buyers at the same time. Now, the Bitcoin price has broken below an important channel at $105,000 after a successful retest. The analyst explains that this aligns with the 50% equilibrium of the high-to-low range. Naturally, this means that the asset is still bearish and could continue to decline from here. The main levels to watch were initially at $104,600, but the Bitcoin price had first broken below this level on Tuesday. Now, if the decline continues, then the next major level investors are looking at is the $102,800, where support now lies for the cryptocurrency. Below $100,000 Is Still Possible In addition to Thomas, crypto analyst Xanrox has also predicted further price crashes for Bitcoin. He points out that the formation of a bull flag does not mean the price will continue to rise, as the flag could very well break. If this happens, then the analyst sees the Bitcoin price dropping to $100,000. Related Reading: Rising Bitcoin Dominance Above 64% Dashes Hopes Of Altcoin Season, Here’s Why Unlike Thomas, Xanrox places his support levels at the much lower price of $88,000, which would suggest a major price crash from here. “When we look at the current price action, it looks like a bullish flag consolidation pattern,” the analyst said. “In this case we will probably see multiple liquidity sweeps below the previous swing lows to kick out early longs.” Another analyst, Doctor Profit, has also turned bearish, predicting a decline below $100,000. In the X post, the crypto analyst said that the Bitcoin price is likely to fall to the $94,000-$95,000 level before seeing a bounce from there. Therefore, the analyst has told investors to prepare for more red candles. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Analyst Warns: Strategy On Track For Historic Collapse, Bigger Than FTX",
      "link": "https://www.newsbtc.com/bitcoin-news/analyst-warns-strategy-on-track-for-historic-collapse-bigger-than-ftx/",
      "summary": "In a bold and alarming statement, on-chain analyst OxChain raised the possibility of a catastrophic collapse involving Strategy (formerly MicroStrategy), the Bitcoin proxy firm co-founded by Michael Saylor. According to OxChain, this potential downfall could surpass the infamous collapse of FTX. ‘Strategy&#8217;s Bitcoin Tactics Resemble Ponzi Scheme’ In a recent post on X (formerly Twitter), OxChain expressed concerns about Strategy&#8217;s aggressive Bitcoin accumulation formula, suggesting that the company&#8217;s operations resemble a Ponzi scheme. OxChain pointed out that since 2020, MicroStrategy has transformed from a traditional software company into a significant player in the Bitcoin market, currently holding around 582,000 BTC, valued at nearly $61 billion. Related Reading: Researchers Forecast Bitcoin At $4.3 Million By 2036, Citing Institutional Demand However, OxChain claims that this impressive figure is underpinned by leverage, debt, and shareholder dilution, rather than genuine conviction in the cryptocurrency. The analyst outlined Strategy&#8217;s approach as a “cyclical financial loop”: the firm raises capital through shares or bonds, purchases Bitcoin, announces these purchases to drive up stock prices, and then raises more funds. The analyst asserts that this cycle has worked as long as Bitcoin&#8217;s price continues to rise. However, with plans for a new $1 billion share sale, OxChain believes that Strategy is increasing its risk exposure. Analyst Predicts Major Liquidation Risk OxChain warns that Strategy&#8217;s average cost per Bitcoin is approximately $70,000, creating a precarious situation. The analyst adds that if Bitcoin’s price falls significantly below this level, the company&#8217;s treasury, currently valued at around $25 billion, could quickly start to suffer losses. According to the analyst, despite Saylor&#8217;s public commitment to never sell Bitcoin, the realities of accounting and risk management may force the company to act if market conditions deteriorate. In the first quarter of 2025, Strategy disclosed $5.9 billion in unrealized Bitcoin losses, revealing the volatility of its assets. Under the new accounting standard ASC 350-60, the company is required to report fair value, eliminating the ability to hide behind book value. This transparency has already led to legal repercussions, with shareholders filing a class action lawsuit alleging that Strategy concealed the risks associated with Bitcoin&#8217;s volatility while aggressively raising capital. OxChain further claimed during his social media thread that Strategy&#8217;s role as a Bitcoin access point is diminishing, especially as institutional capital flows into “more transparent and regulated options,” such as BlackRock’s iShares Bitcoin Trust (IBIT), which has amassed around $70 billion in assets under management. The analyst stressed that unlike Strategy, which reportedly faces dilution risks and operates with limited safeguards, IBIT offers a “more stable investment” for those seeking exposure to Bitcoin. Related Reading: Altcoin Alert: Expert Reveals Hottest Opportunities For The Summer Season If Strategy were to falter, the implications would be far-reaching, OxChain added. The firm holds approximately 2.77% of Bitcoin’s total supply, and a significant liquidation could send shockwaves through the market. The analyst warns that a decline in Bitcoin&#8217;s price by just 22% from its average buy price could trigger corporate liquidations, potentially leading to one of the largest liquidation events in history. Ultimately, OxChain cautions that Strategy is neither a hero nor a villain in the crypto ecosystem; instead, he said that it represents a “risk vector heavily reliant on leverage and market sentiment.” Featured image from DALL-E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    },
    {
      "title": "The Trolls Are Coming: Defending Bitcoin Mining from Patent Trolls",
      "link": "https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_GenerateThe-Trolls-Are-Coming_-Defending-Bitcoin-Mining-from-Patent-Trollsd_Image_9ib8k29ib8k29ib8-fotor-20250618125328.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls\" rel=\"nofollow\"> </a></p> <p>The clash between Malikie Innovations and Bitcoin miners exemplifies a classic conflict between open innovation and legacy fiat intellectual property rights.</p> <p>"
    },
    {
      "title": "Bitdeer Raises $330M to Expand Bitcoin Mining and AI Operations",
      "link": "https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BITDEER-EXPANDS-BITCOIN-MINING.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations\" rel=\"nofollow\"> </a></p> <p>Singapore-based Bitcoin mining firm Bitdeer Technologies Group has launched a $330 million convertible notes offering, aiming to strengthen its mining operations, develop ASIC rigs, and scale its AI infrastructure.&#160; The notes, due in 2031, carry an annual interest rate of 4.875% and may be converted into Bitdeer Class A shares at a 25% premium to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Tech Booms: Lightning Data Defies Digital Gold Narrative",
      "link": "https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_a_rough_gold_rock_with_Bitcoin_logo_stampe_2.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative\" rel=\"nofollow\"> </a></p> <p>Bitcoin tech shines in 2025 with 1.5 million Lightning users, $1.5 billion trading volume, and Block’s 9.7% yield, outpacing treasury hype.</p> <p>"
    },
    {
      "title": "K33 Announces Plans To Purchase Up To 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norwegian-Public-Company-K33-AB-Purchased-10-BTC-For-Their-New-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>K33 has launched a SEK 85 million share issue at a price of SEK 0.1036 per share.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Canadian Firm Sol Strategies Files With SEC for Nasdaq Debut",
      "link": "https://decrypt.co/326024/canadian-firm-sol-strategies-files-with-sec-for-nasdaq-debut",
      "summary": "As a foreign private issuer, the firm will follow Canadian disclosure rules while being exempt from certain U.S. reporting requirements."
    },
    {
      "title": "Treasury Secretary Bessent Says Stablecoins Can Bolster US Dollar 'Supremacy’",
      "link": "https://decrypt.co/326021/treasury-secretary-bessent-stablecoins-dollar-supremacy",
      "summary": "Bessent framed stablecoins as a strategic asset for U.S. influence, as lawmakers weigh whether politics will stall key legislation again."
    },
    {
      "title": "Bitcoin Scandal Fails to Topple Czech Government in No-Confidence Vote",
      "link": "https://decrypt.co/326018/bitcoin-scandal-fails-czech-government-no-confidence-vote",
      "summary": "A $45 million Bitcoin donation from a convicted darknet operator set off a political crisis and brought the Czech government to its knees."
    },
    {
      "title": "1inch Foundation Proposes User Compensation Plan Following October Hack",
      "link": "https://decrypt.co/326012/1inch-foundation-proposes-user-compensation-plan",
      "summary": "DAO members of 1inch are voting on whether to approve a reimbursement scheme for victims of a supply chain exploit last year."
    },
    {
      "title": "Civil Rights Group Gives Elon Musk's xAI 60 Days to Fix Alleged Clean Air Act Violations",
      "link": "https://decrypt.co/326005/civil-rights-elon-musks-xai-60-days-fix-alleged-clean-air-act-violations",
      "summary": "The NAACP has threatened xAI with a lawsuit over unpermitted gas turbines at Memphis AI data center, citing pollution concerns."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Binance co-founder calls for crypto platforms to implement ‘will function’ for asset inheritance",
      "link": "https://cryptobriefing.com/crypto-inheritance-tools-platforms/",
      "summary": "<p>Implementing a 'will function' in crypto platforms could ensure secure asset transfer, addressing inheritance challenges in digital finance.</p> <p>"
    },
    {
      "title": "Iran restricts crypto exchange hours after massive Nobitex exploit drains BTC, ETH, XRP",
      "link": "https://cryptobriefing.com/iran-crypto-restrictions-nobitex-exploit/",
      "summary": "<p>Iran's crypto exchange restrictions may hinder financial innovation and exacerbate tensions in an already volatile geopolitical climate.</p> <p>"
    },
    {
      "title": "Bitcoin holds steady at $104K as Fed eyes inflation from tariffs before easing",
      "link": "https://cryptobriefing.com/bitcoin-stability-fed-rate/",
      "summary": "<p>Bitcoin holds at $104K as the Fed keeps rates at 4.25% to 4.50%, citing tariff-driven inflation as reason to delay cuts.</p> <p>"
    },
    {
      "title": "US DOJ seeks to forfeit $225 million in crypto from global scam network",
      "link": "https://cryptobriefing.com/crypto-scam-forfeiture-seizure/",
      "summary": "<p>The DOJ's action highlights the increasing need for robust international cooperation and advanced digital forensics in combating crypto fraud.</p> <p>"
    },
    {
      "title": "Bitcoin stays resilient ahead of Fed meeting as investors await policy signals",
      "link": "https://cryptobriefing.com/bitcoin-resilient-ahead-fed-meeting/",
      "summary": "<p>Bitcoin's resilience amid Fed uncertainty highlights its potential as a hedge, but future rate signals could impact broader market liquidity.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Aerodome Finance: 3 reasons why AERO’s 20% rally may not last",
      "link": "https://ambcrypto.com/aerodome-finance-3-reasons-why-aeros-20-rally-may-not-last/",
      "summary": "<img alt=\"AERO\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250619_100316_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is AERO's big price jump going to last, or is it just a quick pump?"
    },
    {
      "title": "Blockchain Devfest: Matching potential with opportunity",
      "link": "https://ambcrypto.com/blockchain-devfest-matching-potential-with-opportunity/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/drawkit-illustrations-FjMzj5NNDws-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The Blockchain Developer Festival, a.k.a the Blockchain DevFest, is a developer-focused event, including a 3-day [&#8230;]"
    },
    {
      "title": "Solana: 386K SOL sold in 4 days – Traders, watch THESE levels next",
      "link": "https://ambcrypto.com/solana-386k-sol-sold-in-4-days-traders-watch-these-levels-next/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-29.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Why is Solana dropping despite previous gains?"
    },
    {
      "title": "Crypto in war crisis? Not Bitcoin – Here’s how BTC is holding up",
      "link": "https://ambcrypto.com/crypto-in-war-crisis-not-bitcoin-heres-how-btc-is-holding-up/",
      "summary": "<img alt=\"bitcoin war crypto\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-34.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Geopolitical panic wiped out $200 billion, but ETFs and calm heads kept crypto grounded."
    },
    {
      "title": "GENIUS Act – Trump urges U.S. House to fast-track ‘incredible’ bill",
      "link": "https://ambcrypto.com/genius-act-trump-urges-u-s-house-to-fast-track-incredible-bill/",
      "summary": "<img alt=\"Stablecoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/StablecoinGeniusActTrump.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Mastercard and Visa stocks dumped after passage of the Senate's stablecoin bill."
    }
  ]
}