{
  "CoinDesk": [
    {
      "title": "Bitcoin Bounces After War-Driven Dip, $98.2K Emerges as Key Level to Maintain Bullish Momentum",
      "link": "https://www.coindesk.com/markets/2025/06/23/bitcoin-bounces-after-war-driven-dip-usd98-2k-emerges-as-key-level-to-maintain-bullish-momentum",
      "summary": ""
    },
    {
      "title": "Bitcoin Week Ahead: Focus on Powell's Testimony, U.S. Core PCE as Tariff Deadline Looms",
      "link": "https://www.coindesk.com/markets/2025/06/23/focus-on-powell-s-testimony-u-s-core-pce-release-as-trump-s-tariff-deadline-looms",
      "summary": ""
    },
    {
      "title": "Every Bank and Fintech Wants DeFi Under the Hood: Alchemy",
      "link": "https://www.coindesk.com/business/2025/06/23/every-bank-and-fintech-wants-defi-under-the-hood-alchemy",
      "summary": ""
    },
    {
      "title": "Dogecoin Jumps After Rollercoaster Weekend Price-Action",
      "link": "https://www.coindesk.com/markets/2025/06/23/dogecoin-jumps-after-rollercoaster-weekend-price-action",
      "summary": ""
    },
    {
      "title": "Cointelegraph Hit by Front-End Exploit, Fake Phishing Airdrop Pop Up on Website",
      "link": "https://www.coindesk.com/tech/2025/06/23/cointelegraph-hit-by-front-end-exploit-fake-phishing-airdrop-pop-up-on-website",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Metaplanet adds 1,111 Bitcoin, approaches Tesla’s BTC holdings",
      "link": "https://cointelegraph.com/news/metaplanet-buys-1-111-bitcoin-approaches-tesla-s-btc-holdings?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzliYjgtZmQwZC03MzhlLTljYzUtZmVmNDA3ZWY3Njk4.jpg\" /></p><p>Metaplanet has added 1,111 BTC to its corporate treasury, bringing its total holdings to 11,111 BTC, just 398 BTC shy of Tesla’s stash.</p>"
    },
    {
      "title": "Crypto funds post $1.2B inflows despite market panic: CoinShares",
      "link": "https://cointelegraph.com/news/crypto-funds-1-2-billion-inflows-panic-markets-coinshares?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzI5OTItMjFlMi03NjRlLTg0MzktZGM4MzYzZTk4OWEw.jpg\" /></p><p>ETP sentiment cooled in the latter half of last week amid reports of US involvement in the Iran conflict.</p>"
    },
    {
      "title": "Ether whales open $100M of leveraged bets after US strikes Iran",
      "link": "https://cointelegraph.com/news/ether-whales-100m-leveraged-bets-after-us-airstrike-on-iran?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTZhYTktYWY3ZC03NTYyLTk2MTktOTM0NWM5NzZmNDgw.jpg\" /></p><p>Whales are betting hundreds of millions on Ether’s price recovery despite the industry’s most successful traders being net short amid escalating conflict in the Middle East.</p>"
    },
    {
      "title": "$92K dip vs ‘short-lived war’ — 5 things to know in Bitcoin this week",
      "link": "https://cointelegraph.com/news/92k-dip-vs-short-term-war-5-things-bitcoin-this-week?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzliZjQtMGQyZS03Nzk3LWI3MDgtYjBkNmFkYmEzNWI0.jpg\" /></p><p>Bitcoin is about to juggle a slew of geopolitcal and macroeconomic volatility triggers in a nail-biting end to June as $100,000 support hangs in the balance.</p>"
    },
    {
      "title": "How low can the Bitcoin price go?",
      "link": "https://cointelegraph.com/news/how-low-can-the-bitcoin-price-go?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvN2EwNzM2NmEtNzRmMy00NGI4LWIzYjYtZGM0ZDlmNDRkODg1.jpg\" /></p><p>Bitcoin dipped below $100,000 for the first time in six weeks, prompting predictions that BTC price would fall further to $93,000, with a possible bottom of $74,000.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Kazakhstan launches Central Asia’s first Solana Economic Zone to boost crypto hub ambitions",
      "link": "https://cryptoslate.com/kazakhstan-launches-central-asias-first-solana-economic-zone-to-boost-crypto-hub-ambitions/",
      "summary": "<p>Kazakhstan has officially launched Central Asia’s first Solana Economic Zone (SEZ), marking a major step toward its ambition to become a regional crypto and blockchain hub. The new zone was introduced during the 2025 International Forum in Kazakhstan and follows through on the country’s Memorandum of Understanding (MOU) with the Solana Foundation, the non-profit organization [&#8230;]</p> <p>"
    },
    {
      "title": "Over $1.79 billion liquidated from crypto market as Bitcoin dipped below $100k after US bombed Iran",
      "link": "https://cryptoslate.com/over-1-79-billion-liquidated-from-crypto-market-as-bitcoin-dipped-below-100k-after-us-bombed-iran/",
      "summary": "<p>The sudden escalation in Middle East tensions over the weekend triggered sharp moves across global markets, with Bitcoin plunging below the $100,000 mark for the first time since May. The drop followed a surprise U.S. airstrike on Iranian nuclear facilities and a retaliatory vote by Tehran’s parliament to authorize the closure of the Strait of [&#8230;]</p> <p>"
    },
    {
      "title": "Cointelegraph and CoinMarketCap front ends compromised with scam links over the weekend",
      "link": "https://cryptoslate.com/cointelegraph-and-coinmarketcap-front-ends-compromised-with-scam-links-over-the-weekend/",
      "summary": "<p>Cointelegraph, one of the leading crypto media platforms, has confirmed a front-end security breach that exposed its users to a malicious pop-up urging them to connect their wallets. The incident, which occurred on June 22, involved scammers promoting a fake Cointelegraph token (CTG) and a counterfeit initial coin offering (ICO) campaign. Scam Sniffer, a blockchain [&#8230;]</p> <p>"
    },
    {
      "title": "Gracy Chen, the rare but glorious woman behind Bitget’s epic growth",
      "link": "https://cryptoslate.com/gracy-chen-the-rare-but-glorious-woman-behind-bitgets-epic-growth/",
      "summary": "<p>Welcome to Slate Sundays, ’s weekly feature showcasing in-depth interviews, expert analysis, and thought-provoking op-eds that go beyond the headlines to explore the ideas and voices shaping the future of crypto. Gracy Chen leaves quite an impression. As the only female CEO among the top 10 crypto exchanges, she’s well aware of the challenges facing women [&#8230;]</p> <p>"
    },
    {
      "title": "Solana network extensions will redefine blockchain scaling",
      "link": "https://cryptoslate.com/solana-network-extensions-will-redefine-blockchain-scaling/",
      "summary": "<p>The following is a guest post and opinion from Aryan Sheikhalian, Head of Research at CMT Digital. Ethereum is betting big on a future filled with rollups. But in typical Solana fashion, the network is taking a different route—one that doesn’t just scale more blockspace, but bespoke execution environments with first-class developer control. Enter Network [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Crypto Bull Run Over? Here’s What A Top Trader Just Said",
      "link": "https://www.newsbtc.com/news/crypto-bull-run-over-what-top-trader-just-said/",
      "summary": "With Bitcoin precariously recovering above the $100,000 mark and altcoins bleeding momentum, traders are asking the obvious: Is the crypto bull run over? According to systematic trader Adam Bakay (@abetrade), the answer is not so clear-cut. In a detailed market breakdown posted June 22, Bakay offered a technically grounded, cautiously defensive assessment—one that acknowledges geopolitical risks but stays rooted in positioning and price structure. Is The Bitcoin Bull Run Over? “Looking at the monthly and weekly timeframes, we are still technically in an uptrend,” Bakay wrote, noting that “no key swing low was broken, and the 365-day rolling VWAP has been respected during the pullback in April.” Despite this, he admits that “the failure to make new all-time highs similar to the top in 2021” is a concern—especially given the accumulation by players like BlackRock, which now holds around 3.5% of Bitcoin’s total supply. It’s that divergence—between strong institutional interest and a market struggling to break higher—that has made Bakay more cautious in recent weeks. “This is why I have been very defensive and kept most of my trades short-term,” he said. Related Reading: Crypto Gets A Green Light From Spanish Banking Giant His trading view focuses on two potential technical scenarios: either a reclaim of the $100,000 support area—“likely if the conflict in the Middle East does not further escalate”—or a dip into the $97,000–$95,000 range, where strong technical support resides in the form of the 200-day moving average, local price structure, and the 90-day rolling VWAP. Still, Bakay made it clear he’s not shorting the market. “I am not currently considering any short trades due to my current positioning,” he emphasized, adding that open interest is dropping and that we are starting to see the “first signs of clear spot bid interest since the April lows.” The options market, meanwhile, is flashing early caution: the 25-delta risk reversal skew sits around -5, not yet at panic levels, but trending more negative. Crypto Bull Run In Jeopardy On Ethereum, Bakay was notably blunt. “ETH almost had its moment, but of course had to become a disappointment,” he said. He attributes the failed breakout in part to how quickly the “DeFi Summer 2025” narrative went viral. “People are getting too horny, and market made sure to punish them,” he noted, referencing his own tweet from a few days earlier. Related Reading: Crypto’s Unlikely Ally: Top Analyst Reveals War As A Surprising Bullish Force The technical picture on ETH doesn’t inspire confidence either. “During significant market moves, like we had at the beginning of May, the last thing you want to see is price retracing throughout that area,” he explained, saying the next meaningful support lies near $1,800. On the daily chart, Ethereum is sitting right at a confluence of support—both the 90-day rolling VWAP and what he calls a “pivotal level.” Still, much like Bitcoin, Bakay sees Ethereum’s short-term fate as largely dependent on developments in the Middle East. On positioning, ETH also shows signs of an oversold environment, though Bakay believes high volatility in ETH options has caused traders to use spreads instead of outright directional bets. “Positioning is now very clearly pointing towards the possible upside reversal in both perpetual and spot,” he said. Altcoins received no reprieve. “Altcoins have not been having fun for quite a while,” Bakay wrote, pointing out that “every time it starts to look better, it will almost immediately get worse.” He notes that the expected rotation from Bitcoin into altcoins hasn’t materialized, and the real rotation now seems to be into crypto-related equities, which better reflect the ETF-driven macro trade. Even strong names like Solana are fading. “SOL has almost retraced the entire rally from April,” he warned. The key level to watch is $100. “There is not much of a technical support sub-$100,” and if “shit hits the fan,” Bakay would look to bid around that round number. Bakay also briefly touched on two newer altcoins—Hype and Fartcoin—saying one offers a solid product and the other draws interest through volatility and liquidity. “Fartcoin would become attractive if it could reclaim the $1 or $0.50 area. Hype could find a bounce sub-$30.” His closing thoughts were pragmatic: “We are not in easy market conditions, with a lot of geopolitical uncertainty, and markets can be significantly affected by a single news release.” While he believes the market may be “getting too short at the moment,” he remains highly conscious of the possibility that a multi-month correction is already in play. “I don’t think there is a need to be a hero and try to catch a falling knife,” he concluded. “I would much rather wait for some positive news and signs of lower timeframe reversals.” In essence, Bakay doesn’t call the top. But his post makes one thing clear: this is not a market for bravado. It’s a time for restraint, tight risk management, and respect for volatility—especially when the bullish case no longer has momentum on its side. At press time, BTC traded at $101,847. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Crash Far From Over As Support Sits Below $90,000 – Details",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-crash-90000/",
      "summary": "The Bitcoin price crash has been spurred on by looming war events as Iran and Israel continue to go head-to-head. Naturally, the financial markets have responded negatively to this news, and the crypto market has not been left out. Interestingly, the Bitcoin price had sat above the $100,000 psychological level for the longest. However, it was only a matter of time before it lost this support and crashed further, especially as the digital asset seems to only have major support in the 5-digit territory. Analyst Says Bitcoin Price Is Headed Below $90,000 In a TradingView post, crypto analyst Master Ananda has revealed major bearish formations for the Bitcoin price. With the $100,000 support having held so far through the last week, it suggested there is still some buying going on for the cryptocurrency. However, the chart does not show enough strength to hold this level. Related Reading: XRP On-Chain Activity Down 80% In 5 Months, Experts Argue Bullish/Bearish Implications Since the market has been rocked by over $1 billion in liquidations in the last week, it has transferred some weakness to the BTC price, putting the bears in charge once again. Pointing this out, Master Ananda explains that the weekly chart, in particular, is not showing any good signs. The current Bitcoin price action seems to only be a continuation of the bearish price action that began after it hit a peak of $111,900 back on May 19, 2025. Since then, the decline has been consistent, and the crypto analyst says the market looks “terrible” right now. Given the crash, the major support for Bitcoin is no longer above $100,000, but over 10% below it. As the price has previously broken below $100,000, the first support the market could see would be at $88,888. Failure to hold at this point would trigger another 5% decline toward $82,500 before bulls are able to put up any fight. What Happens If BTC Stays Above $100,000? While the bearish trend is the most dominant at this point, there is still the possibility that the Bitcoin price could stay back above $100,000 and hold the fort there. In this case, it is likely that the bullish trend would continue. The crypto analyst highlights this in another post, forecasting a very sharp upward move if this happens. Related Reading: Bitcoin Bullish Divergence That Appeared Before The May ATH Has Returned Again In the case of a recovery, then Bitcoin could retest the upper trendline that sits right above $108,000. And as for how long all of this could take to play out, the crypto analyst believes that the entire thing shouldn’t take more than two weeks to actually unfold and pick a direction. “Do not be afraid if the market shakes, Bitcoin is going up; Crypto will grow, regardless of the short-term,” the analyst said in closing. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Dogecoin (DOGE) Eyes Upside After Crash, Yet Resistance Levels Cap Momentum",
      "link": "https://www.newsbtc.com/analysis/doge/dogecoin-doge-eyes-upside-0-1580/",
      "summary": "Dogecoin started a fresh decline from the $0.1720 zone against the US Dollar. DOGE is now consolidating losses and might recover if it clears $0.1580. DOGE price started a fresh decline below the $0.170 and $0.160 levels. The price is trading below the $0.160 level and the 100-hourly simple moving average. There was a break above a bearish trend line forming with resistance at $0.1510 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could start a fresh decline if it stays below the $0.1580 zone. Dogecoin Price Faces Resistance Dogecoin price started a fresh decline after it failed to clear the $0.1720 zone, underperforming Bitcoin and Ethereum. DOGE declined below the $0.1600 and $0.1580 levels. The bears even pushed the price below the $0.1450 level. A low was formed at $0.1427 and the price is now attempting to recover. There was a minor move above the 23.6% Fib retracement level of the downward move from the $0.1718 swing high to the $0.1427 low. Besides, there was a break above a bearish trend line forming with resistance at $0.1510 on the hourly chart of the DOGE/USD pair. Dogecoin price is now trading below the $0.1580 level and the 100-hourly simple moving average. Immediate resistance on the upside is near the $0.1550 level. The first major resistance for the bulls could be near the $0.1580 level. It is close to the 50% Fib retracement level of the downward move from the $0.1718 swing high to the $0.1427 low. The next major resistance is near the $0.1610 level. A close above the $0.1610 resistance might send the price toward the $0.1720 resistance. Any more gains might send the price toward the $0.200 level. The next major stop for the bulls might be $0.2120. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.1580 level, it could start another decline. Initial support on the downside is near the $0.1480 level. The next major support is near the $0.1440 level. The main support sits at $0.1420. If there is a downside break below the $0.1420 support, the price could decline further. In the stated case, the price might decline toward the $0.1350 level or even $0.1280 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now losing momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1440 and $0.1420. Major Resistance Levels – $0.1580 and $0.1610."
    },
    {
      "title": "XRP Price Finds Some Relief, But Faces Headwinds on The Path Up",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-finds-some-relief-2-020/",
      "summary": "XRP price started a fresh decline below the $2.00 zone. The price is now correcting losses and faces resistance near the $2.050 level. XRP price started a fresh decline below the $2.050 zone. The price is now trading below $2.020 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $2.020 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start a fresh increase if there is a close above the $2.050 resistance zone. XRP Price Faces Resistance XRP price reacted to the downside below the $2.120 support zone, like Bitcoin and Ethereum. The price declined below the $2.050 and $2.020 support levels. The pair tested the $1.920 support A low was formed at $1.910 and the price started to recover losses. There was a minor recovery wave above the 23.6% Fib retracement level of the downward move from the $2.178 swing high to the $1.910 low. The price is now trading below $2.020 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.020 level. There is also a key bearish trend line forming with resistance at $2.020 on the hourly chart of the XRP/USD pair. The first major resistance is near the $2.050 level or the 50% Fib retracement level of the downward move from the $2.178 swing high to the $1.910 low. The next resistance is $2.080. A clear move above the $2.080 resistance might send the price toward the $2.120 resistance. Any more gains might send the price toward the $2.150 resistance or even $2.20 in the near term. The next major hurdle for the bulls might be $2.250. Another Drop? If XRP fails to clear the $2.050 resistance zone, it could start another decline. Initial support on the downside is near the $1.950 level. The next major support is near the $1.920 level. If there is a downside break and a close below the $1.920 level, the price might continue to decline toward the $1.880 support. The next major support sits near the $1.840 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $1.950 and $1.920. Major Resistance Levels – $2.020 and $2.050."
    },
    {
      "title": "Bitcoin Crashed Below $100,000 Amid US Airstrikes On Iran And Market Sell-Off",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-crashed-below-100000-amid-us-airstrikes-on-iran-and-market-sell-off/",
      "summary": "The market’s leading crypto, Bitcoin (BTC), dipped below the $100,000 mark for the first time in over a month on Sunday, following US airstrikes on Iran as conflicts in the middle east continue to escalate. This decline, which saw the Bitcoin price drop approximately 4% to around $99,300, coincided with a broader market sell-off, with Ethereum (ETH) experiencing an even sharper decline of nearly 10%. Overall, the total cryptocurrency market took a significant hit, falling about 7% in just 24 hours. Geopolitical Unrest And Tariff Troubles The timing of this downturn was particularly notable, occurring just hours after the US targeted three key nuclear sites in Iran. Tensions had escalated following a United Nations report that indicated Iran was not adhering to international prohibitions against developing a military nuclear program. In response to these revelations, Israel conducted strikes against Iran, leading to further retaliation from the Islamic Republic. On Saturday, President Donald Trump declared on social media: This is an HISTORIC MOMENT FOR THE UNITED STATES OF AMERICA, ISRAEL, AND THE WORLD. IRAN MUST NOW AGREE TO END THIS WAR. THANK YOU! Related Reading: Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106 This recent plummet below the psychologically significant $100,000 threshold follows a year of substantial gains for Bitcoin. After Trump took office in January, Bitcoin reached all-time highs above $100,000 in February, buoyed by executive orders aimed at supporting the cryptocurrency sector. However, the cryptocurrency&#8217;s price soon mirrored the broader declines in financial markets, particularly after Trump announced severe tariffs in April, which saw Bitcoin fall to nearly $75,000, its lowest point in 2025. Despite this volatility, Bitcoin had seen a resurgence, particularly in May when it reached new highs as Wall Street investors returned to the cryptocurrency through US exchange-traded funds (ETFs). However, by late Sunday, there were signs of recovery, with Bitcoin trading approximately at $101,300, down only 1% over the previous day, while ETH managed to pare its losses to around $2,200. Forced Liquidations Exacerbate Bitcoin Sell-Off According to CNBC, Iran has also threatened to block the Strait of Hormuz, a crucial shipping route responsible for approximately 20% of the global oil supply, further adding to the broader financial uncertainty. JPMorgan warned that such a blockade could drive oil prices up to $130 per barrel, which would have significant implications for US inflation, potentially pushing it back toward 5%—a level not seen since March 2023. While Bitcoin has often been promoted as an inflation hedge, its recent behavior aligns more closely with that of high-beta tech stocks. Data from crypto provider Kaiko indicates that Bitcoin’s correlation with the tech-heavy Nasdaq has increased sharply in recent weeks, particularly following the surge in inflows into Bitcoin ETFs. Related Reading: $312M ETH Transfer Triggers Sell-Off Fears As Ethereum Price Crashes Below Support Institutional investment patterns have also shifted. More than $1.04 billion flowed into spot Bitcoin ETFs from Monday to Wednesday last week, but this momentum dissipated as the weekend approached, with minimal net movement on Thursday and only $6.4 million on Friday. The technical aspects of the market further exacerbated the sell-off. Research from CoinGlass revealed that Bitcoin’s drop below $99,000 triggered forced liquidations across offshore derivatives platforms, including Binance and Bybit. During this period, over $1 billion in crypto positions were liquidated within 24 hours, with more than 95% of these coming from long positions, highlighting the market&#8217;s overexposure. Featured image from DALL-E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Norway Plans to Temporarily Ban New Bitcoin & Crypto Mining Centers to Conserve Energy",
      "link": "https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/NBX-Acquires-Bitcoin-Becomes-First-Public-Bitcoin-Treasury-Company-in-Norway.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy\" rel=\"nofollow\">Norway Plans to Temporarily Ban New Bitcoin &amp; Crypto Mining Centers to Conserve Energy</a></p> <p>Norway’s government will temporarily block the development of new Bitcoin and cryptocurrency mining facilities starting this year, prioritizing energy for other industries.</p> <p>"
    },
    {
      "title": "A Seed Phrase Isn’t Self Custody, It’s A Liability.",
      "link": "https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/seedlessheader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability\" rel=\"nofollow\"> </a></p> <p>Seed phrases were an improvement a decade ago. They’re long overdue for an upgrade.</p> <p>"
    },
    {
      "title": "Is the 4-Year Bitcoin Cycle Over? Rational Root Explains Why This Time Might Not Be Different",
      "link": "https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Is-the-4-Year-Bitcoin-Cycle-Over-Rational-Root-Explains.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root\" rel=\"nofollow\"> </a></p> <p>Rational Root joins Pro to debate whether the 4-year Bitcoin cycle is breaking down in the age of ETFs, passive flows, and institutions.</p> <p>"
    },
    {
      "title": "What Happens to Bitcoin When Quantum Computers Arrive?",
      "link": "https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ChaincodeReportHeader-fotor-20250620123039.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive\" rel=\"nofollow\"> </a></p> <p>A high level overview of the recent report by Chaincode Labs on the threat quantum computing poses to Bitcoin. </p> <p>"
    },
    {
      "title": "Coinbase Secures MiCA License to Serve 450 Million Europeans",
      "link": "https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans\" rel=\"nofollow\"> </a></p> <p>Coinbase has obtained its Markets in Crypto Assets (MiCA) license from Luxembourg&#8217;s Commission de Surveillance du Secteur Financier (CSSF), marking a significant regulatory milestone that enables them to offer its complete range of services across all 27 European Union member states. The license allows Coinbase to serve approximately 450 million Europeans under a unified regulatory [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Crypto Exchange OKX Plans to Go Public in the US: Report",
      "link": "https://decrypt.co/326447/crypto-exchange-okx-public-us",
      "summary": "Broader interest in the crypto industry to capitalize on favorable U.S. market conditions is taking root, following Circle's IPO this month."
    },
    {
      "title": "Coinbase Secures MiCA License, Expanding Crypto Services Across EU",
      "link": "https://decrypt.co/326438/coinbase-mica-license-crypto-services-eu",
      "summary": "Approval from Luxembourg grants Coinbase access to 27 EU countries, raising questions about regulation shopping in smaller member states."
    },
    {
      "title": "Cointelegraph Website Hacked in Fake Airdrop Phishing Attack",
      "link": "https://decrypt.co/326435/cointelegraph-website-hacked-fake-airdrop-phishing-attack",
      "summary": "Cointelegraph is the latest in a wave of phishing attacks targeting crypto platforms via exploits that lure users with fake token rewards."
    },
    {
      "title": "Texas Joins Growing List of US States With Bitcoin Reserves",
      "link": "https://decrypt.co/326427/texas-us-states-bitcoin-reserves",
      "summary": "Texas has become the third U.S. state to approve a public Bitcoin reserve, with new legislation allowing direct crypto purchases."
    },
    {
      "title": "Bitcoin Rebounds as Markets Price in 'Short-Lived' Iran Conflict",
      "link": "https://decrypt.co/326424/bitcoin-rebounds-markets-price-short-lived-iran-conflict",
      "summary": "Bitcoin rose back above $100,000 as markets shrugged off U.S. strikes on Iran, with oil and equities remaining largely unchanged."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin crashes as Iranian Parliament approval of Hormuz Strait closure threatens oil disruption, stokes global inflation",
      "link": "https://cryptobriefing.com/bitcoin-oil-disruption-inflation/",
      "summary": "<p>The potential closure of the Strait of Hormuz could trigger global economic instability, with rising oil prices exacerbating inflationary pressures.</p> <p>"
    },
    {
      "title": "Trump announces US airstrikes on Iran’s nuclear sites, Bitcoin dumps, then pumps",
      "link": "https://cryptobriefing.com/us-iran-airstrikes-nuclear-sites/",
      "summary": "<p>The airstrikes heighten geopolitical tensions, potentially destabilizing the region and impacting global markets and cryptocurrency volatility.</p> <p>"
    },
    {
      "title": "Texas governor signs Bitcoin reserve bill into law",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-law/",
      "summary": "<p>Texas' Bitcoin reserve law could bolster financial resilience and set a precedent for other states to integrate crypto into fiscal strategies.</p> <p>"
    },
    {
      "title": "CoinMarketCap’s front-end compromised, investigation underway",
      "link": "https://cryptobriefing.com/coinmarketcap-security-breach-investigation/",
      "summary": "<p>This incident highlights the urgent need for enhanced cybersecurity measures in the crypto industry to protect user assets and data integrity.</p> <p>"
    },
    {
      "title": "Texas governor signs bill to protect state Bitcoin reserve as a permanent fund if established",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-protection-bill/",
      "summary": "<p>Texas' move to protect a potential Bitcoin reserve could set a precedent for state-level crypto asset management, influencing future fiscal policies.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin falls below $100K – Should traders brace for a deeper BTC dip?",
      "link": "https://ambcrypto.com/bitcoin-falls-below-100k-traders-are-you-in-for-a-bigger-btc-dip/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika3-1-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Geopolitical jolt hits BTC, but is the recovery built to last?"
    },
    {
      "title": "Ethereum breaks down! – THESE signals hint at more pain ahead",
      "link": "https://ambcrypto.com/ethereum-breaks-down-these-signals-hint-at-more-pain-ahead/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-17.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With rising sell-side volume and high open interest, ETH may be bracing for a deeper dip."
    },
    {
      "title": "KAIA forced to shed 10.7% in 2 days – Here’s the roadmap for traders now!",
      "link": "https://ambcrypto.com/kaia-forced-to-shed-10-7-in-2-days-heres-the-roadmap-for-traders-now/",
      "summary": "<img alt=\"KAIA forced to shed 10.7% in 2 days - Here&#039;s the roadmap for traders now!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/KAIA-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite Bitcoin's bearish price action in recent days, KAIA managed to hit a new local high."
    },
    {
      "title": "Ethereum sees $274M inflow as ETH price drops – What now?",
      "link": "https://ambcrypto.com/ethereum-sees-274m-inflow-as-eth-price-drops-what-now/",
      "summary": "<img alt=\"ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250622_172735_0000.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ETH attracts major inflows despite the price drop, but lags behind BTC and S&#038;P in year-to-date returns."
    },
    {
      "title": "TRON bulls must defend THIS support level for recovery – Can they do it?",
      "link": "https://ambcrypto.com/tron-bulls-must-defend-this-support-level-for-recovery-can-they-do-it/",
      "summary": "<img alt=\"TRON bulls must defend THIS support level for recovery - Can they do it?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/TRON-Featured-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The six-week-old range's low may be about to be tested once again."
    }
  ]
}