{
  "CoinDesk": [
    {
      "title": "Coinbase Outpaces S&P 500 With 43% June Rise as Stablecoin Narrative Grows: CNBC",
      "link": "https://www.coindesk.com/markets/2025/06/28/coinbase-outpaces-s-and-p-500-with-43-june-rise-as-stablecoin-narrative-grows-cnbc",
      "summary": ""
    },
    {
      "title": "Robinhood Launches Micro Bitcoin, Solana and XRP Futures Contracts",
      "link": "https://www.coindesk.com/markets/2025/06/28/robinhood-launches-micro-bitcoin-solana-and-xrp-futures-contracts",
      "summary": ""
    },
    {
      "title": "Why is XRP Up Today? Trio of Catalysts Sees Token Outperform Wider Crypto Market",
      "link": "https://www.coindesk.com/markets/2025/06/28/why-is-xrp-up-today-trio-of-catalysts-sees-token-outperform-wider-crypto-market",
      "summary": ""
    },
    {
      "title": "Bitcoin Treasury Corp Boosts Holdings to 771 BTC, Plans Lending After $51M Buy",
      "link": "https://www.coindesk.com/markets/2025/06/28/bitcoin-treasury-corp-boosts-holdings-to-771-btc-plans-lending-after-usd51m-buy",
      "summary": ""
    },
    {
      "title": "Ripple to Drop Cross-Appeal Against SEC, Ending Years-Long Legal Battle With SEC",
      "link": "https://www.coindesk.com/policy/2025/06/27/ripple-to-drop-cross-appeal-against-sec-ending-years-long-legal-battle-with-sec",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Stablecoins are becoming ‘default settlement layer’ for internet: Alchemy",
      "link": "https://cointelegraph.com/news/stablecoins-default-settlement-layer-internet-alchemy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2JiZjYtYjBjZi03NmFhLTk4M2ItMzUwOTkyN2I3MGFi.jpg\" /></p><p>Stablecoins are now the “default settlement layer for the internet,” surpassing Visa and Mastercard in onchain transaction volume.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Bitcoin price will make history with $109K weekly, monthly close",
      "link": "https://cointelegraph.com/news/bitcoin-price-will-make-history-with-109k-weekly-monthly-close?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2JiYjctMWU1Yi03OTQwLTllMjktY2QxY2IzMGRhMGQ1.jpg\" /></p><p>Bitcoin weekend volatility gets a late boost thanks to a familiar source with the key $109,000 BTC price closing level within easy reach.</p>"
    },
    {
      "title": "Binance ties to Kenyan crypto board raise monopoly concerns: Report",
      "link": "https://cointelegraph.com/news/kenya-binance-vasp-bill-vac-monopoly-risk?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2JhZmYtZWZhMi03MGZjLTg3ZDctMTEzYmFiOWM2MDJh.jpg\" /></p><p>Kenya’s crypto startups fear a Binance-linked lobby group could tilt new regulations in the exchange’s favor under the proposed VASP bill.</p>"
    },
    {
      "title": "27% of Koreans aged 20–50 hold crypto, 70% eye more investments: Report",
      "link": "https://cointelegraph.com/news/27-of-koreans-aged-20-50-hold-crypto-70-eye-more-investments-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2JhOGItMjY4Mi03NWY3LTlmMmMtODEyMjZkNTk5ZTFm.jpg\" /></p><p>Over 25% of Koreans in their 20s to 50s now hold crypto, with 70% looking to expand their investments as virtual assets become central to retirement planning.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US entrepreneur Hayden Davis testifies in LIBRA case in New York as legal proceedings advance",
      "link": "https://cryptoslate.com/us-entrepreneur-hayden-davis-testifies-in-libra-case-in-new-york-as-legal-proceedings-advance/",
      "summary": "<p>In the latest development for the ongoing LIBRA coin legal saga, Argentinian newspaper La Nacion reports that Hayden Mark Davis, CEO of Kelsier Ventures, submitted a voluntary statement last Monday to a federal court in New York. The case centers on a class action lawsuit brought by U.S. investors who suffered losses following the rapid [&#8230;]</p> <p>"
    },
    {
      "title": "Is Cardano’s plan to convert part of ADA treasury into Bitcoin a wise move?",
      "link": "https://cryptoslate.com/is-cardanos-plan-to-convert-part-of-ada-treasury-into-bitcoin-a-wise-move/",
      "summary": "<p>The following is a guest post and analysis from Shane Neagle, Editor In Chief fromThe Tokenist. On June 13th, Charles Hoskinson, the co-founder of Ethereum (ETH) and founder of Cardano (ADA), made a bold proposition. In order to put Cardano on the decentralized finance (DeFi) map, the blockchain ecosystem should establish a sovereign wealth fund. [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto needs to return to first principles",
      "link": "https://cryptoslate.com/crypto-needs-to-return-to-first-principles/",
      "summary": "<p>The following is a guest post and opinion of Rob Viglione, CEO of Horizen Labs. In 2009, Bitcoin was born from a radical vision: a decentralized, transparent financial system designed to empower individuals over institutions. Yet somewhere along the way, that vision was clouded by short-term profiteering, insider deals, and misaligned incentives. To reclaim its [&#8230;]</p> <p>"
    },
    {
      "title": "Billions in corporate buys can’t budge Bitcoin—5 reasons the BTC price won’t move",
      "link": "https://cryptoslate.com/billions-in-corporate-buys-cant-budge-bitcoin-5-reasons-the-btc-price-wont-move/",
      "summary": "<p>From Michael Saylor to David Bailey, Anthony Pompliano to Jack Mallers, and everyone in between, there’s a rising tide of executives buying bitcoin for their corporate treasuries. Large companies and Wall Street are vacuuming up billions of dollars’ worth of BTC every week, yet its price remains relatively untouched. One Bitcoiner took to Twitter to [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini launches tokenized US stock trading in EU starting with MSTR",
      "link": "https://cryptoslate.com/gemini-launches-tokenized-us-stock-trading-in-eu-starting-with-mstr/",
      "summary": "<p>Crypto exchange Gemini has launched tokenized Strategy (MSTR) shares for customers in the EU, marking the beginning of its rollout of tokenized U.S. equities on blockchain networks. The offering, enabled through a partnership with tokenization platform Dinari, allows Gemini users to buy fractional shares of Strategy as on-chain tokens backed by real securities. MSTR tokens [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin In Stalemate With Liquidation Traps On Both Sides Of The Market",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-in-stalemate-with-liquidation-traps-on-both-sides-of-the-market/",
      "summary": "Bitcoin prices climbed by 5.07% in the past week to hit a local peak of $108,000 before experiencing a solid rejection. Since then, the leading cryptocurrency has remained in the $106,000 &#8211; $107,000 range showing no indications of a breakout in either market direction. Amidst this market consolidation, renowned crypto analyst with X username KillaXBT has highlighted the key liquidation zones in the present Bitcoin market structure that are critical to the next significant price move. Related Reading: Bitcoin Bullishness For Q3 Grows: What Happens In Every Post-Halving Year? Bitcoin: Clustering At $103K–$106K And $108K–$111K &#8211; What Could This Mean? In a recent X post , KillaXBT shares that Bitcoin is currently at a pivotal decision zone as liquidation heatmap data from Coinglass reveals notable liquidity clusters forming on both ends of the current price range. The market expert explains that BTC is trapped between long and short liquidation zones in both low and high time frames (L/HTF) signaling a moment of market indecision On the 7-day chart (LTF), KillaXBT states there are accumulations of long positions between $103,400 and $106,000. This data suggests that a move below this price range could trigger cascading stop-losses and force liquidations, sending Bitcoin prices lower in a short-term decline. On the other hand, there are also liquidity clusters in the $108,000–$109,000 region, indicating the presence of potentially significant short positions. A breakout above $109,000 could initiate a sharp short squeeze, perhaps driving prices higher toward the current all-time high in the $111,000 price range. Using the 30-day chart (HTF), KillaXBT provides more information on the Bitcoin market stalemate. The analyst notes that more short-side liquidations are clustered between $108,300 and $109,000 than long-side liquidations between $103,000 and $106,000. However, the presence of short positions at $111,000 presents a scenario where bulls could reclaim control if they successfully push past this upper resistance. Ultimately, KillaXBT concludes the current BTC market structure suggests a delicate balance with high-leverage positions stacked both above and below current prices. The market expert warns that traders refrain from engaging the market until the highlighted liquidation zones are tested. Related Reading: Sui (SUI) Eyes Breakout With Bullish Dual Pattern: Is A Rally To $27 On? Bitcoin Market Overview At press time, Bitcoin trades at $107,451, after a slight 0.41% gain in the past day. Meanwhile, the asset’s daily trading volume is down by a staggering 36.12% suggesting a fall in market participation. Meanwhile, blockchain analytics firm Sentora reports that Bitcoin&#8217;s weekly network fees totaled $3.39 million, marking a 38.9% decline from the previous week. Despite this drop in on-chain activity, exchange outflows of $310 million suggest a strong market confidence, as investors increasingly move their assets into private wallets, typically a sign of long-term holding intent. Featured image from Pexels, chart from Tradingview"
    },
    {
      "title": "Crypto Bombshell: Developer Claims XRP Could Hit $20,000",
      "link": "https://www.newsbtc.com/altcoin/crypto-bombshell-developer-claims-xrp-could-hit-20000/",
      "summary": "A new wave of debate is sweeping through crypto circles as some analysts suggest XRP could someday trade at $20,000 per coin. The price today sits near $2. That means a 10,000× jump from current levels. Related Reading: Stablecoin Skepticism Grows As IMF Official Challenges Their Money Role According to reports, the idea first took shape in 2022, when game developer and XRP backer Chad Steingraber laid out a plan that leaned on big banks and tokenized assets. Now, that bold forecast has resurfaced on social platform X, sparking fresh talk about where this digital token might head next. “The Chad Steingraber Theory” – The Road to a $20K #XRP A Thread🧵from The Future&#8230; I’m going to tell you a story and I’ll spin it so that all you need is an interest to learn what’s in store for all of us. Grab a drink, grab a snack and let’s take a ride, shall we? — Chad Steingraber (@ChadSteingraber) August 18, 2022 Rise Of Tokenized Assets According to Steingraber, the first step involves issuing stablecoins and central bank digital currencies on the XRP Ledger. Every time a new token launches there, it would need XRP to settle transactions. That could push up daily demand. Today, only a handful of tokens sit on the XRP chain, but he sees that growing into the hundreds. If even 100 new coins adopt XRP settlements, demand could climb by billions of dollars each year. It consists of three components: 1 &#8211; Assets built on the XRP Ledger (Stablecoins are the “utility”) 2 &#8211; XRP becomes a reserve asset to power the utility 3 &#8211; XRP is removed from public supply by institutions This is how IT WILL. 😉 https://t.co/d7ysY5euXc — Chad Steingraber (@ChadSteingraber) June 28, 2025 Banks Holding XRP As Gold Based on reports, the second driver is banks treating XRP like a reserve asset. Instead of just trading it on public exchanges, financial firms would stash XRP in private ledgers to back their own digital currencies. He points to “many institutions” that have already floated plans to include XRP in their reserve piles. If each of those firms holds hundreds of millions of dollars in XRP, it could remove a large chunk of supply from open markets. Institutional Absorption Of Supply Here’s where the math gets eye‑popping. XRP’s total supply is capped at 100 billion. But Steingraber says roughly 20 billion tokens remain in public hands after accounting for locks, burns, and lost keys. If big institutions lock away most of that, circulation could shrink to under 100 million. That would set the stage for a classic supply shock. He even predicts prices could surge from cents to thousands of dollars within hours once companies dive in. Regulatory And Competition Hurdles Despite the excitement, there are clear roadblocks. XRP is still fighting the US Securities and Exchange Commission in court. A final loss could stall deals or scare off banks. At the same time, rival chains like Ethereum and Solana also host tokenized assets. Those networks already see billions in daily volume. XRP would need to prove it offers something stronger or faster to win over big players. Related Reading: The $100K Mirage: Bitcoin’s Rally Not Backed By On-Chain Strength A Long Shot With Big Ifs This forecast hinges on three big “ifs”: strong tokenization growth, banks stacking XRP as reserves, and a real supply squeeze on public markets. If any one of those doesn’t materialize, the $20,000 mark drifts further away. Still, it makes for a gripping story. For now, XRP traders will watch legal filings and ledger activity with fresh eyes, wondering if this bold theory has any chance of coming true. Featured image from Pixabay, chart from TradingView"
    },
    {
      "title": "Litecoin Could Be ‘Just Weeks Away’ From Third-Ever Golden Cross — Expert",
      "link": "https://www.newsbtc.com/news/litecoin/litecoin-weeks-away-from-third-golden-cross/",
      "summary": "The price of Litecoin didn’t end May in the best possible way, especially considering its start to the month, falling from around $95 to beneath $85 before May 31st. While the start of June was quite strong, the altcoin has failed to maintain its bullish momentum each time a rally seemed to be on. After falling beneath the $80 level on June 22, the Litecoin price seems to be back on its feet as it currently dances around the $87 mark. Interestingly, a fresh price outlook portraying an even brighter future for the cryptocurrency has emerged. How Much LTC Price Surged After First Two Golden Crosses In a recent post on the X platform, Chartered Market Technician Tony Severino shared an exciting analysis of the Litecoin price. According to the crypto expert, the price of LTC could embark on an explosive rally depending on its movement over the next few weeks. Related Reading: Cardano Price Woes To Continue? Analyst Expects ADA To Fall To $0.47 This bullish projection is based on the potential formation of a Golden Cross — the third ever — on the Litecoin weekly chart. In a crypto context, a Golden Cross occurs when a short-term moving average (50-week moving average, in this case) crosses above a longer-term moving average (200-week moving average). Typically, Golden Cross formations often precede and are associated with extended periods of bullish price movements. However, Severino believes that Litecoin is just weeks of a significant rally away from triggering its third-ever Golden Cross on the weekly price chart. Source: @TonyTheBullCMT on X Severino cited the earlier two situations where the Golden Cross occurred after a substantial price rally. In the first instance, this chart phenomenon appeared on the Litecoin weekly timeframe after a 700% surge from the local lows in 2017. Meanwhile, the LTC rallied by 450% from its local bottom before the second-ever Golden Cross in 2021. For each time the Golden Cross appeared on the chart, the price of Litecoin witnessed a significant bullish momentum. In 2017, the LTC price soared by 7,100% from around $5 to as high as $360. The altcoin jumped by more than 380% to reach its current all-time high of $410 after the Golden Cross formation in 2021. If the Golden Cross does occur and history is anything to go by, the Litecoin price could be preparing to reach a new all-time high in its next leg up. Litecoin Price At A Glance As of this writing, the price of LTC stands at around $86.26, reflecting a 1.7% increase in the past 24 hours. According to CoinGecko data, the altcoin is up by more than 7% in the last seven days. Related Reading: Crypto Analyst Predicts $10,000 ATH For Ethereum This Cycle, Here’s Why Featured image from Getty, chart from TradingView"
    },
    {
      "title": "TD Sequential Flashes Buy: Dogecoin Ready For Rebound To $0.21",
      "link": "https://www.newsbtc.com/altcoin/td-sequential-flashes-buy-dogecoin-ready-for-rebound-to-0-21/",
      "summary": "Dogecoin has spent the majority of the past five days trading within a tight range between $0.156 and $0.165. Notably, the meme coin is now showing early signs of stabilization after its steep correction earlier this month, with bulls beginning to reclaim ground after a drop below the $0.17 price barrier. Related Reading: The $100K Mirage: Bitcoin’s Rally Not Backed By On-Chain Strength Reclaiming the $0.17 level is important, according to technical analysis of Dogecoin&#8217;s price. This technical backdrop sets the stage for a projected price move to $0.21. TD Sequential Flashes Buy Signal For Dogecoin Dogecoin&#8217;s 3-day candlestick timeframe chart shows that the meme coin is currently trading just above an ascending trendline that dates back to late 2023, which has acted as a key support level across multiple correction cycles. Despite the recent volatility, the price structure appears to be ready for a possible bounce move from here due to the formation of less volatile candlesticks and higher lows just above the 0.5 Fibonacci retracement level around $0.165. Taking to the social media platform X, crypto analyst Ali Martinez revealed an interesting bullish signal taking place on the same 3-day candlestick timeframe. According to Martinez, Dogecoin has just triggered a buy signal on the 3-day TD Sequential indicator. This tool, which identifies trend exhaustion and possible reversals, has been quite useful in predicting buy and sell zones this cycle. However, the bullish outlook depends on Dogecoin reclaiming the $0.17 price level, which is now working as some sort of resistance. Martinez noted that a breakout above this price level could allow Dogecoin to rebound to $0.21. Notably, this $0.21 price target coincides with the 0.618 Fibonacci extension from Dogecoin’s October 2023 low. Image From X: @ali_charts Path To $0.21 Needs Enough Volume For Dogecoin to confirm a return to $0.21, market participation must return in a meaningful way. This is because Dogecoin&#8217;s trading volume has been notably low over the past few days. According to data from CoinMarketCap, Dogecoin&#8217;s 24-hour trading volume is currently at just $400 million, which is a 36.7% decrease from the previous day. This level of activity is significantly below Dogecoin&#8217;s usual trading volume during periods of upward momentum. Related Reading: Stablecoin Skepticism Grows As IMF Official Challenges Their Money Role Such a slowdown in volume suggests that, despite the bullish technical signal from the TD Sequential indicator, the necessary follow-through from buyers is yet to be confirmed. At the time of writing, Dogecoin is trading at $0.1637, up by 1.7% in the past 24 hours. Until volume picks up, Dogecoin may continue to consolidate or even drift sideways, regardless of the bullish indicators. Unless there&#8217;s strong interest and stronger inflows, the breakout setup could fizzle out or result in another rejection at $0.17. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Bitcoin Struggles Below ATH After Weeks Of Failed Attempts – $109K Level In Focus",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-struggles-below-ath-after-weeks-of-failed-attempts-109k-level-in-focus/",
      "summary": "Bitcoin has been consolidating in a wide range between $100,000 and $112,000, facing heightened volatility driven by rising geopolitical tensions in the Middle East and growing macroeconomic uncertainty. Despite these external pressures, Bitcoin has held strong above the six-figure mark, signaling resilience as it prepares for a decisive move. Market sentiment is cautiously optimistic, with many traders expecting a breakout in the coming weeks. Related Reading: ONDO Breaks Out Of Ascending Channel – Analyst Sets $0.29 Target Top analyst Daan shared a technical analysis highlighting that Bitcoin is now trading just below its all-time high, but continues to face strong resistance around the $109,000–$112,000 zone. Price has tested this level multiple times over the past month, but each attempt has failed to produce a confirmed breakout. During this period, altcoins have suffered sharp drawdowns, with many falling between 10% and 50%, underscoring Bitcoin’s dominance and investor focus. Despite the rejections, bullish momentum is gradually building. Bitcoin’s ability to stay elevated in such a volatile environment suggests that buyers are accumulating, waiting for the right moment to push higher. A confirmed breakout above resistance could trigger a sharp move into price discovery, while failure to hold key support may lead to deeper consolidation before the next leg up. Bitcoin Bulls Push Toward Breakout Bitcoin has gained over 15% since early May, extending a bullish trend that began in April when the price rebounded sharply from the $75,000 level. Since then, buyers have remained in control, consistently defending higher lows and reclaiming key technical levels. This steady rise in momentum has fueled speculation that Bitcoin may soon break into new all-time highs, as market sentiment improves and capital continues flowing into crypto. Analysts are now closely watching the $110,000–$112,000 resistance zone—a level that has held strong despite multiple breakout attempts. Daan noted that Bitcoin is trading just below its all-time high, but has already faced several failed moves above this barrier. Over the past month, price has hovered near resistance, yet hasn’t delivered a confirmed breakout. During this period, altcoins have struggled, with many dropping between 10% and 50%, further highlighting Bitcoin&#8217;s dominance and traders&#8217; caution. While the setup looks bullish, risks remain. A proper breakout will require not just a brief wick above $110K, but a strong weekly close or at least two consecutive daily closes above resistance. Until then, it’s wise to stay patient. Chasing before confirmation can lead to getting caught in a false breakout. Once Bitcoin breaks and holds above this level, the probability of a larger move increases significantly. In the meantime, Bitcoin’s ability to hold near highs while absorbing macro volatility and altcoin weakness is a strong sign of underlying demand. Momentum is building—but timing matters. A confirmed breakout will be the signal that the next leg up is ready to begin. Until then, smart traders are watching and waiting. Related Reading: Ethereum Holds Critical Long-Term Channel – Next Move Could Be Parabolic BTC Weekly Chart Shows Strong Structure Bitcoin is currently trading at $107,319 on the weekly chart, continuing to hover just below the crucial $109,300 resistance level. Despite multiple attempts, BTC has failed to close a weekly candle above this zone—a critical milestone needed to confirm a breakout and signal the next phase of upward momentum. The $103,600 level now serves as strong weekly support, holding firm through recent pullbacks. The long-term structure remains bullish. Price continues to trend above all major moving averages, including the 50-week SMA ($85,147), the 100-week SMA ($66,505), and the 200-week SMA ($49,239), all of which are sloping upward. This alignment reflects solid long-term strength, even as Bitcoin consolidates just below all-time highs. Volume, however, remains relatively muted compared to the breakout seen in late 2024, suggesting that traders are waiting for confirmation before committing to new positions. Until BTC can close a weekly candle above $109,300, this range will remain intact. Related Reading: Ethereum Staking Hits Record High: 29.02% Of Supply Locked Signals Long-Term Conviction If bulls succeed, the market could enter price discovery and spark renewed inflows. But if rejection continues, the $103K–$105K zone becomes critical to hold. For now, Bitcoin’s bullish structure is intact, but confirmation is still required before a larger move can begin. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Takes a Lot of Pressure Off The Dollar, Says Donald Trump",
      "link": "https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Takes-a-Lot-of-Pressure-Off-The-Dollar-Says-Donald-Trump.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump\" rel=\"nofollow\"> </a></p> <p>President Donald Trump is backing Bitcoin, calling it a vital American asset that the US must continue to dominate.</p> <p>"
    },
    {
      "title": "How The IMF Prevents Global Bitcoin Adoption (And Why They Do It)",
      "link": "https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/IMF-Blocking-Bitcoin-Adoption.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it\" rel=\"nofollow\"> </a></p> <p>IMF loans halt nation-state Bitcoin plans—only debt-free countries like Bhutan push forward. Grassroots use still thrives.</p> <p>"
    },
    {
      "title": "Lnfi Network Integrates RGB Protocol to Enhance Lightning Network",
      "link": "https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_A_futuristic_digital_dashboard_glowing_wit_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network\" rel=\"nofollow\"> </a></p> <p>Lnfi Network adopts RGB for Bitcoin’s Lightning, enabling secure asset trading. Nostr’s encryption stops manipulation.</p> <p>"
    },
    {
      "title": "If Institutions Are Buying Why Isn’t The Bitcoin Price Going Up?",
      "link": "https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/If-Institutions-Are-Buying-Why-Isnt-The-Bitcoin-Price-Going-Up.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up\" rel=\"nofollow\"> </a></p> <p>Bitcoin price not soaring despite institutional billions? Uncover why profit-taking and derivatives hold it back, with a breakout looming!</p> <p>"
    },
    {
      "title": "Tahini’s Bitcoin Treasury: How a Family Chain Outsmarted Inflation",
      "link": "https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/tahini-bitcoin-2020-treasury-playbook.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation\" rel=\"nofollow\"> </a></p> <p>Tahini’s, a Canadian fast-casual chain, embraced Bitcoin in 2020, leveraging it to compete with giants like McDonald’s. Here’s their treasury playbook.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Ripple vs SEC: Why the XRP Legal Battle Still Isn't Officially Over",
      "link": "https://decrypt.co/327521/ripple-vs-sec-why-xrp-legal-battle-still-not-over",
      "summary": "It hasn't been an easy road to resolution for Ripple and the SEC in the long-running legal fight over XRP sales. Here's why."
    },
    {
      "title": "Can China's MiniMax-M1 AI Topple US Rivals? We Put It to the Test",
      "link": "https://decrypt.co/327569/can-china-minimax-m1-ai-topple-us-rivals-review",
      "summary": "We break down China’s new open-source reasoning model, MiniMax-M1: real benchmarks, hidden tradeoffs, and how it stacks up against competitors."
    },
    {
      "title": "Bybit Ethereum Heist Propels Record $2.1 Billion in Crypto Stolen by Hackers So Far in 2025",
      "link": "https://decrypt.co/327416/record-2-1-billion-crypto-stolen-hackers-2025-bybit-ethereum",
      "summary": "Around 70% of the $2.1 billion in crypto stolen by hackers in the first six months of 2025 was traced back to North Korea, a new report says."
    },
    {
      "title": "'FIFA Rivals' Review: Should You Play This NFT Soccer Game?",
      "link": "https://decrypt.co/327247/fifa-rivals-review-should-you-play-nft-soccer-game",
      "summary": "Following the success of NFL Rivals, Mythical Games is back with FIFA Rivals on iOS and Android. Here's our take on the NFT soccer game."
    },
    {
      "title": "How Much Bitcoin Has Iran Mined? It's Complicated",
      "link": "https://decrypt.co/327381/how-much-bitcoin-iran-mined-complicated",
      "summary": "Individuals, schools, and mosques in Iran are illegally mining Bitcoin to avoid high bills, making it difficult to estimate BTC holdings."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "REX-Osprey Ethereum, Solana staked ETFs may launch soon as SEC raises no objections",
      "link": "https://cryptobriefing.com/staking-etf-launch-eth-sol/",
      "summary": "<p>The potential launch of staked ETH and SOL ETFs could enhance crypto market liquidity and signal regulatory openness to innovative financial products.</p> <p>"
    },
    {
      "title": "Ripple drops cross-appeal as SEC set to follow, closing XRP case",
      "link": "https://cryptobriefing.com/ripple-sec-agreement-ends/",
      "summary": "<p>Ripple and SEC end their prolonged legal dispute as both sides drop appeals, marking a pivotal ripple sec agreement in crypto regulation.</p> <p>"
    },
    {
      "title": "Robinhood rolls out micro XRP, Solana futures following token relisting",
      "link": "https://cryptobriefing.com/micro-futures-contracts-xrp-solana/",
      "summary": "<p>Robinhood's expansion into micro crypto futures could democratize access to digital asset trading, potentially increasing market participation.</p> <p>"
    },
    {
      "title": "Trump backs Bitcoin adoption amid claims it could ease pressure on the dollar",
      "link": "https://cryptobriefing.com/trump-bitcoin-adoption-dollar/",
      "summary": "<p>Trump's endorsement of Bitcoin could accelerate its mainstream adoption, potentially reshaping global financial dynamics and US economic policy.</p> <p>"
    },
    {
      "title": "The power of crypto journaling: how tracking your trades can transform your success",
      "link": "https://cryptobriefing.com/crypto-trading-journal-success/",
      "summary": "<p>A crypto trading journal helps track trades, refine strategies, manage emotions, and boost discipline for better results.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Dogecoin consolidates – Is DOGE setting up a bear trap for $0.20?",
      "link": "https://ambcrypto.com/dogecoin-consolidates-is-doge-setting-a-bear-trap-for-0-20/",
      "summary": "<img alt=\"DOGE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-25.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Are DOGE bulls quietly setting the stage for a textbook bear trap?"
    },
    {
      "title": "BONK surges 98% in volume, but the odds of reversal loom, IF…",
      "link": "https://ambcrypto.com/bonk-surges-98-in-volume-but-the-odds-of-reversal-loom-if/",
      "summary": "<img alt=\"Bonk Coin [BONK]\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-19-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is this fresh demand, or just a fakeout dressed like conviction?"
    },
    {
      "title": "BNB: 85% dip in developer activity could mean trouble! – Analyzing…",
      "link": "https://ambcrypto.com/bnb-85-dip-in-developer-activity-could-mean-trouble-analyzing/",
      "summary": "<img alt=\"BNB\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-38.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Price is steady, but the builders seem to have bowed out - and DeFi might not be enough to save it."
    },
    {
      "title": "Bitcoin: Despite 10% retail dip, whales could lead BTC to $111K – How?",
      "link": "https://ambcrypto.com/bitcoin-despite-10-retail-dip-whales-could-lead-btc-to-111k-how/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-28T161837.314-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can Bitcoin pierce the $111K resistance and trigger a massive short squeeze?"
    },
    {
      "title": "SYRUP slips, $1.85M in profits taken – Yet 85% of bulls hold strong: Why?",
      "link": "https://ambcrypto.com/syrup-slips-1-85m-in-profits-taken-yet-85-of-bulls-hold-strong-why/",
      "summary": "<img alt=\"SYRUP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250628_141404_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Profitable SYRUP holders are adding fear to the market."
    }
  ]
}