{
  "CoinDesk": [
    {
      "title": "Solana Holds Above $152 as Second Round of US-China Talks Raise Hopes for Market Calm",
      "link": "https://www.coindesk.com/markets/2025/06/09/solana-holds-above-usd152-as-second-round-of-us-china-talks-raise-hopes-for-market-calm",
      "summary": ""
    },
    {
      "title": "Shiba Inu's Downtrend Intact as Daily Burn Rate Tanks by 63%",
      "link": "https://www.coindesk.com/markets/2025/06/09/shiba-inu-s-downtrend-intact-as-daily-burn-rate-tanks-by-63",
      "summary": ""
    },
    {
      "title": "Argentine President Milei Cleared of Misconduct Over LIBRA Promotion: Report",
      "link": "https://www.coindesk.com/policy/2025/06/09/argentine-president-milei-cleared-of-misconduct-over-libra-promotion-report",
      "summary": ""
    },
    {
      "title": "The Blockchain Group Starts 300M-Euro ATM Share Sale to Expand Bitcoin Holdings",
      "link": "https://www.coindesk.com/markets/2025/06/09/the-blockchain-group-starts-300m-euro-atm-share-sale-to-expand-bitcoin-holdings",
      "summary": ""
    },
    {
      "title": "Sony’s Layer-2 Blockchain Soneium Unveils Gaming Incubator",
      "link": "https://www.coindesk.com/business/2025/06/09/sony-s-layer-2-blockchain-soneium-unveils-gaming-incubator",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Ether crypto funds see $296M inflows in best week since Trump election",
      "link": "https://cointelegraph.com/news/ether-funds-296m-inflows-largest-week-trump-election?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU0MGItMjY5YS03ZjI3LWFhYmQtOTA4MTFhMjZhMjMw.jpg\" /></p><p>Ether investment products saw $296 million in inflows last week despite a market slowdown, as investors await clarity from the US Fed’s June rate decision.</p>"
    },
    {
      "title": "Bitcoin price will see ‘short-term correction’ before $140K: Analysts",
      "link": "https://cointelegraph.com/news/bitcoin-price-will-see-short-term-correction-before-140k-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjFiMGMtZGRjYi03NTlkLTg0MmItZDkyYzZlYzUzYmUw.jpg\" /></p><p>Bitcoin analysts say BTC price could drop in the short term before initiating a rally to all-time highs above $140,000.</p>"
    },
    {
      "title": "Tether USDT stablecoin seen on Bolivian store price tags",
      "link": "https://cointelegraph.com/news/tether-usdt-prices-goods-bolivia?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzUzOTMtNzc4Mi03MGFjLTg3YTgtNjVlMjRjMzJmYzg1.jpg\" /></p><p>Tether CEO Paolo Ardoino shared images of Bolivian duty-free goods priced in USDt, suggesting the stablecoin's growing role as a reference currency in a struggling economy.</p>"
    },
    {
      "title": "MapleStory revives Avalanche, tops 1M daily transactions twice in a week",
      "link": "https://cointelegraph.com/news/maplestory-avalanche-tops-daily-transactions?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzUzZDktY2JiMC03NWNlLWI0ZWUtMTgyOTEwYjM3ZGI1.jpg\" /></p><p>Avalanche’s blockchain activity has increased dramatically since classic online game MapleStory got a Web3 makeover on the network.</p>"
    },
    {
      "title": "Illegal crypto mining surges in Malaysia amid unclear policies",
      "link": "https://cointelegraph.com/news/malaysia-crypto-mining-growth-electricity-theft?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzUzYjctMTkxNS03MGE0LWFhMGEtMmJjNjEzMmYxMmRk.jpg\" /></p><p>Illegal mining and a lack of regulation limit Malaysia from tapping into the crypto mining revenue.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Blockchain Group stock up 1,400% in 6 months, bets €342M on European Bitcoin treasury",
      "link": "https://cryptoslate.com/blockchain-group-stock-up-1400-in-6-months-now-bets-e342m-on-its-european-bitcoin-treasury/",
      "summary": "<p>The Blockchain Group (ALTBG) has inked a headline-grabbing deal with French asset manager TOBAM to raise up to €300 million (≈ $342M) in an &#8220;ATM-style&#8221; equity program aimed squarely at bolstering its Bitcoin reserves. The announcement, paired with a 624 BTC buy last week, marks Europe’s largest single corporate initiative to convert equity into Bitcoin [&#8230;]</p> <p>"
    },
    {
      "title": "Millions in short positions now cluster above $106k after leverage flush",
      "link": "https://cryptoslate.com/insights/millions-in-short-positions-now-cluster-above-106k-after-leverage-flush/",
      "summary": "<p>Bitcoin futures have returned to parity with spot prices following a steep 5% drawdown earlier this week that liquidated more than $4 million in leveraged long positions. Price action on Binance’s BTC-USDT perpetual contract shows a reversal from a June 5 low of $100,700 to $105,499, nearing the prior high of $106,775 reached on June [&#8230;]</p> <p>"
    },
    {
      "title": "Ripple boosts Japanese startups with $200,000 XRP Ledger (XRPL) grants",
      "link": "https://cryptoslate.com/ripple-boosts-japanese-startups-with-200000-xrp-ledger-xrpl-grants/",
      "summary": "<p>Ripple plans to offer up to $200,000 in grants to Japanese startups building on the XRP Ledger (XRPL). The initiative, announced on June 9, is part of the company&#8217;s broader effort to foster blockchain innovation in Japan. According to the statement, the funding is tied to a new partnership with Web3 Salon, a program supported [&#8230;]</p> <p>"
    },
    {
      "title": "OpenSea’s OS2 launch brings 44% increase in user activity amid 2 million NFT sales",
      "link": "https://cryptoslate.com/openseas-os2-launch-brings-44-increase-in-user-activity-amid-2-million-nft-sales/",
      "summary": "<p>OpenSea’s rollout of its OS2 platform has driven its highest user growth in over two years, suggesting that the long-dormant NFT market may be flickering back to life. Monthly active users on OpenSea jumped to roughly 467,000 in May, marking a 44% increase from April and the most since April 2023. While sales volumes remain [&#8230;]</p> <p>"
    },
    {
      "title": "Argentine Anti-Corruption Office clears President Milei of ethics violation over LIBRA promotion",
      "link": "https://cryptoslate.com/argentine-anti-corruption-office-clears-president-milei-of-ethics-violation-over-libra-promotion/",
      "summary": "<p>Argentina’s Anti-Corruption Office has determined that President Javier Milei did not violate any ethics laws when he promoted the Solana-based LIBRA memecoin in February. In a resolution issued on Friday, the office declared that Milei’s Feb. 14 X post constituted a personal statement rather than an official announcement as a public servant. Therefore, Milei’s post [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ignore The Trump–Musk Noise: Bitcoin’s Backbone Stays Solid",
      "link": "https://www.newsbtc.com/bitcoin-news/ignore-the-trump-musk-noise-bitcoins-backbone-stays-solid/",
      "summary": "A sudden slide in Bitcoin’s dollar value rattled traders this week after US President Donald Trump and Elon Musk tangled in public comments. The drop was sharp, and it raised questions about whether BTC can keep its upward momentum. According to market data, prices dipped quickly before finding a floor, leaving some investors on edge while others looked to on-chain figures for clues. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Exchange Reserves Slip Based on reports from CryptoQuant, the amount of Bitcoin held on centralized exchanges fell from 2,435,600 BTC to 2,365,400 BTC over seven days. That’s a nearly 3% decline. When coins leave exchanges it often means people want to hold them in private wallets. Fewer coins available to sell can tighten supply. In turn, that may help prices recover. Realized Cap Hits New High According to the same data, Bitcoin’s Realized Capitalization recently hit $935 billion. It’s the highest level on record. Realized Cap tracks the value of all coins at the price when they last moved on-chain. A rising number shows fresh capital flowing into Bitcoin. It suggests both small traders and large institutions are still betting on BTC’s long-term value. Netflow Shows Accumulation Based on the flow of deposits and withdrawals, Bitcoin’s netflow has been negative. That means more coins have left exchanges than have been deposited. Withdrawals beat deposits in trading volume. In simple terms, holders aren’t looking to sell right now. It’s a classic sign that buyers outnumber sellers—at least in the on-chain arena. UTXO Bands Point To Holder Confidence CryptoQuant’s UTXO Value Bands also reveal growing activity across multiple coin-age groups. UTXO stands for Unspent Transaction Outputs. It measures the age and value of coins that haven’t moved. When you see more coins in older bands and steady movement in newer ones, it tells you a variety of investors—from long-term holders to recent buyers—are staying active. That pattern tends to shore up market support. Related Reading: Blank Pi Network Wallets Spark Outcry—What’s The Network Hiding? Looking Ahead Even if Bitcoin’s price can swing wildly day to day, these on-chain signals hint at solid backing underneath. Less supply on exchanges, a record realized cap of $934.88 billion, ongoing negative netflow and rising UTXO activity all point toward patient investors holding their ground. Short-term dips may still occur, especially when big names trade barbs on social media. But for many in the market, the long-term story remains intact. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "XRP Bull Trap Incoming? Analyst Sees $2.40 Fakeout Before Painful Crash",
      "link": "https://www.newsbtc.com/xrp-news/xrp-bull-trap-analyst-2-40-fakeout-before-crash/",
      "summary": "Pseudonymous analyst CryptoInsightUK has warned that the next major move for XRP could be a trap. In a video published on June 8, the analyst outlined a scenario where XRP surges toward $2.30–$2.40 in the short term—only to reverse violently into a sharp liquidity flush before any sustainable breakout occurs. XRP Bull Trap Looming? “I think XRP goes to sub-$2.0. I really do,” he said, adding: “It could come and sweep the highs here… could come up to like what, $2.30, and then push us down. That would be more pain for everyone, ‘cause everyone’s going to think we’re going to the upside.” The setup he describes is based on market structure and liquidity dynamics, particularly the buildup of resting orders beneath XRP’s current range. “This here is a concern, a real concern for me,” he said, referring to the growing pool of liquidity below current prices. According to his internal models, such liquidity zones are statistically touched “80% of the time.” Related Reading: XRP Must Crash First—Then Comes The $10 Rally, Says Analyst “Someone’s trying to trick someone here,” he warned. “I’m cautious.” Despite his near-total XRP allocation—he states he&#8217;s “95%+, probably more like 98%” positioned in XRP—CryptoInsightUK emphasized that he’s not rooting for a correction. “I don’t want it to come down,” he said. “I’m just showing you what I see.” The analyst proposed multiple structural paths: one in which XRP immediately breaks out, and another where it briefly rallies to sweep local highs before flushing downward to form a bullish divergence. “We’re in a range right now,” he said. “Do we come up, sweep the highs, then take the lows and go?” He elaborated on the bullish divergence pattern he is watching, where price forms a lower low while the RSI (Relative Strength Index) prints a higher low—a setup he uses to identify bottoming structures. “That’s what I would like to see,” he explained. Broader Macro Conditions Still Supportive Despite the bearish tactical setup, the video struck an upbeat macro tone. Will cited four near-term catalysts: the Genius Act on stablecoin oversight, the imminent filing deadline in the SEC’s remedies phase against Ripple, the July decision window for a spot-XRP ETF proposal, and a renewed expectation of accommodative fiscal policy sparked by last week’s televised Trump-Musk dialogue. “What this really tells us is there’s going to be money printing,” he argued. “Assets all over are going to explode to the upside and, for the other specific reasons, XRP probably does even better.” Turning to Bitcoin, the analyst observed an ongoing decline in trading volume, suggesting indecision or exhaustion. “There’s been no volume. There’s been nothing,” he said of recent BTC price action. Related Reading: XRP Wave Structure Predicts Wild Fluctuations On Its Way To $4 ATH He highlighted a CME futures gap around $92,000–$93,000 and added that fixed range volume analysis points to a possible pullback zone at $96,000–$97,000. “It’s probably coming imminently, maybe this week,” he said of a potential correction, projecting a scenario where BTC dips into this range before resuming its upward trajectory. “Does this mean we squeeze to the upside or come down and take this low and put in that bullish divergence structure?” he asked, noting a similar divergence setup at $75,000 earlier this year. XRP Spot Activity Raises Red Flags In the final hour before the video, XRP had “squeezed up with some volume,” but the analyst urged caution. While open interest had risen sharply, funding remained green—suggesting net long positioning—and aggregate premium had turned red. “This indicates to me that even though there are still some shorts coming in, more longs than shorts have entered,” he said. He warned that this imbalance could cause a sharp move lower if the market fails to hold current levels. “If we do now come down and lose this low, expect a more aggressive, faster move to the downside,” he said, pointing to the risk of liquidating leveraged positions. XRP’s relative performance against ETH and BTC also came under review. While it had begun testing resistance zones, neither the XRP/ETH nor the XRP/BTC charts had decisively broken out. “We could still be in this range chopping about,” he cautioned. “Could lose strength until we start to see some confirmations to the upside.” At press time, XRP traded at $2.23. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Risks Crash To $31,000 Amid 5-Wave Impulse Completion",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-risks-crash-31000/",
      "summary": "Over the last few weeks, the Bitcoin price has been on an upward trajectory, propelled forward mainly by institutional adoption and buying. This has seen the Bitcoin price rally to new all-time highs at $111,900, and has remained above $100,000 despite a turn in market sentiment toward the negative. However, this support has not bolstered confidence, with one analyst predicting that the leading cryptocurrency has seen the end of this bull cycle. Bitcoin Price Completes Elliot Wave Theory The Elliot Wave Theory is a chart pattern that has been widely used as Bitcoin has become more mainstream in an effort to predict where the price may be headed next. The theory consists of five full waves, at the end of which lies a bearish trend for the digital asset. So far, the Bitcoin price has been moving through different waves according to different analysts. But Sniper Academy on the TradingView platform has revealed that the five waves have been completed. Related Reading: Ethereum Head &#38; Shoulders Pattern Breakdown: Can Bulls Reclaim Control? Using the 1-month Bitcoin price chart, the crypto analyst shows that there have been five different waves completed. The latest all-time high peak above $111,900 is shown to have been the fifth and final wave, suggesting that this bullish impulse is complete. Given that the Bitcoin price has now completed this theory, the crypto analyst explains that this means that the cryptocurrency has now hit the upper boundary of a long-term ascending channel. Simply put, this is very bearish for the digital asset as this means an end to its upward trajectory. Right now, the analyst showed that the Bitcoin price is already forming divergence after the completion of the fifth wave. This has triggered a weakness in the momentum and has come as a result of resistance forming between $76,000 and $111,000. This trend shows that a potential double top has been created, and that means that there is nowhere for the Bitcoin price to go now but down. BTC Price Targets $31,000 Bottom Given the fact that the crypto analyst believes that the Elliot Wave Theory has played out and the five waves have been completed, the next expectation is a sharp drop in the Bitcoin price. The first move is expected toward $66,000, which would be an almost 50% decline in price from here. Related Reading: Dogecoin’s Growth Pattern Hints At Massive June–July Rally After 5-Month Pullback However, this is not the worst of it, as the crypto analyst sees the cryptocurrency still breaking down to $53,000. Then, if this level does fail to hold, then a fall all the way down to as low as $31,000, serving as the bottom of the channel. This also coincides with the 0.618 Fibonacci retracement. Once the Bitcoin price is back at $31,000, the crypto analyst believes that accumulation would begin at this key zone. This will then serve as the important level that will drive the start of the next major bull cycle. Featured image from Dall.E, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Bounces Past 105K: Is a Full-Blown Rally Back on the Cards?",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-bounces-past-105k/",
      "summary": "Bitcoin price started a recovery wave above the $105,000 zone. BTC is now consolidating and might attempt to clear the $106,500 resistance. Bitcoin started a recovery wave above the $105,000 zone. The price is trading above $105,000 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $105,350 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh decline if it breaks the $104,000 support zone. Bitcoin Price Restarts Increase Bitcoin price started a fresh decline and traded below the $102,500 support zone. BTC even traded close to the $100,000 zone before the bulls appeared. A low was formed and the price recovered above the $103,500 resistance. The bulls even pushed the price above the $105,000 resistance. A high was formed at $106,426 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $100,400 swing low to the $106,426 high. Bitcoin is now trading above $105,000 and the 100 hourly Simple moving average. There is also a bullish trend line forming with support at $105,350 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $106,200 level. The first key resistance is near the $106,500 level. The next key resistance could be $107,600. A close above the $107,600 resistance might send the price further higher. In the stated case, the price could rise and test the $108,800 resistance level. Any more gains might send the price toward the $110,000 level. Another Decline In BTC? If Bitcoin fails to rise above the $106,200 resistance zone, it could start another decline. Immediate support is near the $105,200 level and the trend line. The first major support is near the $103,500 level and the 50% Fib retracement level of the upward move from the $100,400 swing low to the $106,426 high. The next support is now near the $102,000 zone. Any more losses might send the price toward the $100,500 support in the near term. The main support sits at $100,000, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $105,200, followed by $103,500. Major Resistance Levels – $106,200 and $107,600."
    },
    {
      "title": "Blank Pi Network Wallets Spark Outcry—What’s The Network Hiding?",
      "link": "https://www.newsbtc.com/altcoin/blank-pi-network-wallets-spark-outcry-whats-the-network-hiding/",
      "summary": "Pi Network members are becoming increasingly agitated after they found zero balances of their tokens in their wallets. They went through KYC verifications and switched to mainnet as directed. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says However, numerous users find nothing in their accounts. The problem has caused a wave of complaints on the internet and a call for concrete explanations. Users Report Missing Pi Balances According to community reports, hundreds of posts show zero tokens even after following every step. Some users say they waited days. Others say they’ve waited weeks. All of them finished KYC and locked in their accounts on mainnet. Yet their wallets still read “0.00 Pi.” The lack of visible tokens has left many feeling shut out. Stop talking nonsense. I don&#8217;t want to hear it. Give me back that damn $Pi. I&#8217;ve worked hard for six years. You still haven&#8217;t mapped it for me until now. What&#8217;s your reason for constantly delaying? Mapping is the right of every pioneer. Hurry up and map it #Pinetwork Oh my god. pic.twitter.com/FBQiWAPtwF — HaiFeng Chen (@haifeng8283) June 5, 2025 Wallet Confusion Deepens Concern Based on reports, some accounts now link to more than one wallet address. That has users scratching their heads. One person found two wallets under the same profile. Another spotted three. It’s raising questions over how safe the system is. Users are worried they might lose tokens or fall into a trap. Foundation Moves 277 Million Pi Coins Blockchain data shows that the Pi Foundation’s wallet ending in “ODM” transferred 276,500,000 Pi coins recently. A withdrawal of 7,380,000 Pi by the same address happened today. According to on-chain records, weekly withdrawals of large amounts have taken place from OKX exchange. The purpose of these moves remains unexplained by the Pi Core Team. Community Demands Clear Answers Community members note it’s been three months without a detailed update from the project’s leaders. They want dates, explanations, and plans. Some posts urge the team to post a public timeline. Others demand live Q&#38;A sessions. The calls are loud enough to push the topic onto the trending list on social media. Team Issues Wallet Safety Tips Pi Network&#8217;s support channels recently posted a list of wallet safety tips. They discussed good practices for passwords and how to identify phishing. But they failed to address why tokens are concealed. The tips also failed to discuss the sudden emergence of numerous wallets per user. Related Reading: Bitcoin To Hit $180,000 In 2025? Analyst Highlights The Trigger What Happens Next Based on user feedback, the project will likely face pressure in the coming days. Some community members say they will pause mining until they see their balances. Others say they’ll shift their attention to rival projects. Nothing has been confirmed by the Pi Core Team beyond the safety note. It remains unclear when users will see their Pi tokens or receive a full breakdown of those massive transfers. The situation will be one to watch as the network works to rebuild trust. Featured image from Unsplash, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin 2025 Las Vegas: Here’s What Went Down",
      "link": "https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-2025_ig.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down\" rel=\"nofollow\"> </a></p> <p>My name is Jenna Montgomery, and maybe you’ve read some of my news articles here before, or seen me on the TikTok. But today, I wanted to switch it up and give you an inside look at the Bitcoin 2025 Conference in Las Vegas through my eyes as an intern, hired just one [&#8230;]</p> <p>"
    },
    {
      "title": "TakeOver Successfully Hosts Second Annual BitGala Celebrating Bitcoin in Las Vegas",
      "link": "https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/TakeOver-Successfully-Hosts-Second-Annual-BitGala-Celebrating-Bitcoin-in-Las-Vegas.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas\" rel=\"nofollow\"> </a></p> <p>LAS VEGAS, NV, May 26, 2025 &#8211; TakeOver, Magic Eden, Spark, and Stacks successfully hosted their second annual BitGala on May 26th at the Wynn in Las Vegas. The celebration brought together over 200 Bitcoin industry leaders and community members for an evening dedicated to celebrating Bitcoin. The BitGala was designed as a curated gathering [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini Files Draft With The SEC For Proposed IPO",
      "link": "https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini-Files-Draft-With-The-SEC-For-Proposed-IPO.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo\" rel=\"nofollow\"> </a></p> <p>Gemini has confidentially filed a draft registration statement with SEC for a proposed IPO of its Class A common stock.</p> <p>"
    },
    {
      "title": "‘MicroStrategy of Asia’ Metaplanet Aims To Acquire Over 210,000 BTC By the End of 2027",
      "link": "https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘MicroStrategy-of-Asia-Metaplanet-Aims-To-Acquire-Over-210000-BTC-By-the-End-of-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027\" rel=\"nofollow\"> </a></p> <p>Metaplanet Inc. plans to acquire over 210,000 BTC by the end of 2027, which is equivalent to 1% of Bitcoin’s total supply.</p> <p>"
    },
    {
      "title": "Know Labs, Inc. Announces Adopting a Bitcoin Treasury Strategy, Starting with 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Know-Labs-Inc.-Announces-Adopting-a-Bitcoin-Treasury-Strategy-Starting-with-1000-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>Know Labs, Inc. announces making a Bitcoin Treasury Strategy, holding 1,000 Bitcoin and placing Greg Kidd as the CEO of the company.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Australia Charges Four Over $123M Crypto Money Laundering Ring",
      "link": "https://decrypt.co/324182/australia-charges-four-over-123m-crypto-money-laundering-ring",
      "summary": "Crypto, cash, and property were seized after raids on a Gold Coast firm accused of running a laundering network via fake businesses."
    },
    {
      "title": "This Week in Crypto Games: Bonk 'Kill-to-Earn' Solana Launch, 'FIFA Rivals' Nears Release",
      "link": "https://decrypt.co/324169/this-week-crypto-games-bonk-solana-fifa-rivals",
      "summary": "Solana meme coin game Bonk Arena goes live, FIFA Rivals is just days away, Flappy Bird swoops back towards crypto, and more."
    },
    {
      "title": "'Dogecoin Millionaire' Is Now a Pepe Millionaire—And He’s Stacking These Meme Coins Next",
      "link": "https://decrypt.co/324050/dogecoin-millionaire-pepe-stacking-meme-coins-next",
      "summary": "\"Dogecoin Millionaire\" Glauber Contessoto still hasn't sold his DOGE, but now he's amassed enough Pepe to take on another title."
    },
    {
      "title": "To Reap Tokenization's Benefits, Accredited Investor Rules Should Be Revamped: Robinhood Crypto GM",
      "link": "https://decrypt.co/324074/tokenization-benefits-accredited-investor-rules-revamped-robinhood-crypto-gm",
      "summary": "Robinhood Crypto's Johann Kerbrat said that tokenization could eliminate “middlemen” to the advantage of startup founders."
    },
    {
      "title": "AI Is Coming for Your Job, Much Faster Than Anyone Thought",
      "link": "https://decrypt.co/323916/ai-coming-jobs-faster-anyone-though",
      "summary": "White-collar workers are facing displacement due to AI—and AGI hasn't even arrived yet. Here's why experts are raising alarms."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Circle rejected Ripple’s $5 billion buyout — now valued at over $20 billion after NYSE debut",
      "link": "https://cryptobriefing.com/circles-21-billion-valuation/",
      "summary": "<p>Circle's successful IPO highlights the growing legitimacy of stablecoins, potentially accelerating regulatory clarity and institutional adoption.</p> <p>"
    },
    {
      "title": "VanEck, 21Shares, and Canary urge SEC to revert to ‘first to file, first to approve’ standard for crypto ETFs",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec-standard/",
      "summary": "<p>The shift from a \"first-to-file\" to simultaneous approval for crypto ETFs may hinder innovation and favor larger firms, impacting market fairness.</p> <p>"
    },
    {
      "title": "Best way of staking USDT in 2025: Loopring AI-powered staking platform",
      "link": "https://cryptobriefing.com/ai-powered-staking-usdt-loopring/",
      "summary": "<p>Loopring's AI-powered staking platform offers up to 20% daily on USDT, leveraging AI &#38; Ethereum Layer 2 for optimal returns.</p> <p>"
    },
    {
      "title": "Elon Musk’s X names Polymarket as official prediction market partner",
      "link": "https://cryptobriefing.com/elon-musks-prediction-markets/",
      "summary": "<p>This partnership could enhance the accuracy of public sentiment analysis, potentially influencing decision-making in politics and finance.</p> <p>"
    },
    {
      "title": "Apple, X, and Google hold talks with crypto firms on stablecoin integration",
      "link": "https://cryptobriefing.com/stablecoin-integration-tech-discussions/",
      "summary": "<p>The integration of stablecoins by major tech firms could revolutionize global payment systems, enhancing efficiency and reducing costs.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Explaining why Bitcoin’s recent price dip won’t break BTC’s stride",
      "link": "https://ambcrypto.com/bitcoin-explaining-why-the-recent-dip-wont-break-btcs-stride/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Overall demand for Bitcoin has declined in June after an aggressive accumulation in early Q2."
    },
    {
      "title": "PEPE whale dumps $11.65M – Traders, is this a warning sign for…",
      "link": "https://ambcrypto.com/pepe-whale-dumps-11-65m-traders-is-this-a-warning-sign-for/",
      "summary": "<img alt=\"PEPE whale exits with $11.65M deposit: Is it bracing for more pain?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-09T112614.488-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PEPE faces sell pressure as whale moves, leverage data, and key levels converge."
    },
    {
      "title": "Bitcoin: June could make or break BTC – It all hinges on THIS…",
      "link": "https://ambcrypto.com/bitcoin-june-could-make-or-break-btc-it-all-hinges-on-this/",
      "summary": "<img alt=\"bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-3-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BTC faces LTH selling, but historical June trends suggest a possible recovery ahead."
    },
    {
      "title": "Cardano joins Nasdaq Crypto Index – A major milestone for Wall Street exposure?",
      "link": "https://ambcrypto.com/cardano-joins-nasdaq-crypto-index-a-major-milestone-for-wall-street-exposure/",
      "summary": "<img alt=\"Cardano joins Nasdaq Crypto Index - A major milestone for Wall Street exposure?\" class=\"attachment-full size-full wp-post-image\" height=\"637\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Cardanos-Nasdaq-Index-Inclusion.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1132\" />What does Nasdaq’s expanded crypto index mean for Cardano’s Wall Street future?"
    },
    {
      "title": "Art of the Con – Trumps’ memecoin moves and what do they mean exactly?",
      "link": "https://ambcrypto.com/art-of-the-con-trumps-memecoin-moves-and-what-do-they-mean-exactly/",
      "summary": "<img alt=\"Art of the Con - Trumps&#039; memecoin moves and what do they mean exactly?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-2-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />From dinners to botched wallet launches, every questionable move has been a moneymaker for the first family."
    }
  ]
}