{
  "CoinDesk": [
    {
      "title": "Public Companies Buy More Bitcoin Than ETFs for Third Consecutive Quarter",
      "link": "https://www.coindesk.com/markets/2025/07/02/public-companies-buy-more-bitcoin-than-etfs-for-third-consecutive-quarter",
      "summary": ""
    },
    {
      "title": "Deutsche Bank’s DWS, Galaxy, Flow Traders Venture to Introduce German-Regulated Stablecoin",
      "link": "https://www.coindesk.com/business/2025/07/02/deutsche-bank-s-dws-galaxy-flow-traders-venture-introduces-german-regulated-stablecoin",
      "summary": ""
    },
    {
      "title": "Dogecoin Rebounds After Forming 'Double Bottom'",
      "link": "https://www.coindesk.com/markets/2025/07/02/dogecoin-rebounds-after-forming-double-bottom",
      "summary": ""
    },
    {
      "title": "Bitcoin CME Futures Premium Slides, Suggests Waning Institutional Appetite",
      "link": "https://www.coindesk.com/markets/2025/07/02/bitcoin-cme-futures-premium-slides-to-suggest-waning-institutional-appetite",
      "summary": ""
    },
    {
      "title": "DOJ’s $225M Seizure Puts Human Cost of Crypto Scams in Focus, Former Acting U.S. Attorney Says",
      "link": "https://www.coindesk.com/policy/2025/07/02/dojs-225m-seizure-puts-human-cost-of-crypto-scams-in-focus-former-acting-us-attorney-says",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin profit-taking makes $140K key BTC price point: New research",
      "link": "https://cointelegraph.com/news/bitcoin-profit-taking-makes-140k-key-btc-price-point-new-research?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2NhMzktZGFlNy03OTlkLTg2YzYtYWExYzdhYTlkYzEz.jpg\" /></p><p>Bitcoin realized profits have yet to match 2024 levels this year, and BTC price action would notionally need to rise 30% as a result, says research from CryptoQuant.</p>"
    },
    {
      "title": "Judge lets Celsius $4B Bitcoin lawsuit against Tether move forward",
      "link": "https://cointelegraph.com/news/celsius-tether-lawsuit-4b-bitcoin-sale?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWRiZDktNzcwZC03MWU1LTgzNGYtMTI4MTJmMjA2NjU0.jpg\" /></p><p>A US judge has allowed Celsius’s lawsuit over Tether’s $4 billion Bitcoin liquidation to move forward, rejecting key parts of Tether’s dismissal bid.</p>"
    },
    {
      "title": "Binance CEO on how Bhutan’s happiness philosophy aligns with crypto",
      "link": "https://cointelegraph.com/news/bhutan-binance-ceo-crypto-happiness?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M5YzctNWMxMy03ZmNhLTgwMTUtYmUxMWUzMDA5ODcz.jpg\" /></p><p>Binance CEO Richard Teng said crypto aligns with Bhutan’s happiness-first policy, highlighting financial freedom and innovation during a visit to the Himalayan kingdom.</p>"
    },
    {
      "title": "Design app Figma discloses $70M Bitcoin ETF holdings in IPO filing",
      "link": "https://cointelegraph.com/news/design-firm-figma-discloses-70m-bitcoin-etf-holdings-in-ipo-filing?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M5MGItOTFjMC03ZTZlLTg4NzctMTllMTIwYmExNmE2.jpg\" /></p><p>Figma has filed to go public in the US, disclosing it holds $69.5 million worth of Bitcoin ETFs and has $30 million in USDC ready to purchase Bitcoin.</p>"
    },
    {
      "title": "5 ‘insidious’ crypto scams to watch out for this year",
      "link": "https://cointelegraph.com/news/slowmist-uncovers-5-emerging-crypto-scams-q2?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmMyNjEtYzdlOS03OWE5LTk1MWQtOTdmNmM1MDVjY2Fh.jpg\" /></p><p>Crypto hacking techniques haven’t advanced much, but they’ve become far more cunning, warns SlowMist’s head of operations.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin holder unlocks $10 million from rare Casascius bar bought for $500",
      "link": "https://cryptoslate.com/bitcoin-holder-unlocks-10-million-from-rare-casascius-bar-bought-for-500/",
      "summary": "<p>A long-time Bitcoin holder has finally cracked open one of the rarest physical Bitcoin collectibles in existence—a Casascius bar loaded with 100 BTC. The collector, who goes by the name John Galt on the Bitcoin Talk forum, originally bought the bar in 2012 for just $500. 13 years later, he redeemed it when the top [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum dev Zack Cole launches initiative to fund ‘tokenless’ projects, promote ETH burning mechanisms",
      "link": "https://cryptoslate.com/ethereum-dev-zack-cole-launches-initiative-to-fund-tokenless-projects-promote-eth-burning-mechanisms/",
      "summary": "<p>Ethereum developer Zak Cole is spearheading a new initiative called the Ethereum Community Foundation (ECF), which will primarily work to enhance the digital asset&#8217;s economic value. The initiative was announced during the Ethereum Community Conference in Cannes, France. Founded by Cole and a group of ecosystem supporters, the ECF has reportedly already raised &#8220;millions&#8221; and [&#8230;]</p> <p>"
    },
    {
      "title": "Figma discloses $70M Bitcoin exposure via Bitwise ETF in IPO filing, plans another $30M buy",
      "link": "https://cryptoslate.com/figma-discloses-70m-bitcoin-exposure-via-bitwise-etf-in-ipo-filing-plans-another-30m-buy/",
      "summary": "<p>Figma’s initial public offering (IPO) prospectus reveals that the design software company holds approximately $69.5 million of the Bitwise Bitcoin ETF (BITB). According to a July 1 filing, a table lists the ETF under level-1 marketable securities at $69.533 million. The document also stated that the board authorized a $55 million purchase on March 3, [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin holders exhibit ‘diamond hands’ as unrealized profits swell past $1 trillion",
      "link": "https://cryptoslate.com/bitcoin-holders-exhibit-diamond-hands-as-unrealized-profits-swell-past-1-trillion/",
      "summary": "<p>Bitcoin (BTC) investors have kept their coins off exchanges in recent weeks, even as market-wide profitability climbed to levels that typically trigger distribution, according to a July 1 report from Glassnode. Bitcoin fell from $106,000 to $99,000 during last week’s Israel-Iran flare-up, but buyers defended the short-term holder cost basis at $98,300 and pushed the [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin dips to $105k on Q3 open despite record monthly close",
      "link": "https://cryptoslate.com/bitcoin-dips-to-105k-on-q3-open-despite-record-monthly-close/",
      "summary": "<p>The crypto market saw significant declines on July 1 despite Bitcoin&#8217;s record monthly close the day prior amid continued institutional and corporate accumulation. Bitcoin (BTC) managed to maintain its footing above the $105,000, but altcoins experienced drastic declines, with some posting double-digit percentage losses for the day. Bitcoin fell nearly 2% to a low of [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Altcoin Season Starting Soon? Analyst Predicts 37% Crash In Bitcoin Dominance",
      "link": "https://www.newsbtc.com/altcoin/altcoin-season-bitcoin/",
      "summary": "The Bitcoin dominance remaining on the high side has been one of the major hindrances for the altcoin season. Going by past performances, the Bitcoin dominance would have to crash for altcoins to have a chance to rally, but with the dominance still climbing, the chances of an altcoin season remain slim. As this trend continues, a crypto analyst has predicted a possible turn in the tide for the Bitcoin dominance, predicting a crash that could give altcoins a chance. Bitcoin Dominance Rejection From Trendline Is Key Over the years, the Bitcoin dominance has been following a trendline that has often marked the point of resistance. This trendline rises from 2017 and has sloped down past 2021 and now into the year 2025. The significance behind this is the breakdown from the trendline and the Bitcoin dominance receding sharply from here. Related Reading: Pundit Warns Bitcoin Is Setting Up Liquidity Traps As It Campaigns For New ATHs Presently, the Bitcoin dominance is still sitting high above 65% at the time of this writing, but this recent rise has seen it touch the resistance trendline. According to crypto analyst CoreCrypto, this is a critical inflection point, especially on the weekly chart. More importantly, this is usually the point where dominance recedes, giving rise to altcoin dominance. Some major developments that the analyst tells investors to watch on the dominance chart include a rejection from the resistance trendline, where the dominance currently lies above 65%. There is also support for the dominance, as shown by the yellow line in the chart below. A break below this support is critical for the fall in the dominance. Another development to watch out for is for rising Ethereum strength. In the past, the Ethereum price starting to outperform the Bitcoin price has often signaled the start of the altcoin season. So, as the ETHBTC chart begins to strengthen and Bitcoin succumbs to sideways movement, it opens the door for altcoins to rally into the next altcoin season. Related Reading: Bitcoin Price At $145,000 In September? Bullish Dojis Suggest Upward Move In the event of a break from the resistance trendline, the analyst sees the possibility of a sharp decline. CoreCrypto predicts a 36.91% drop to the 42%-45% levels. This is lower compared to previous altcoin seasons, but follows the declining trend of a 50.79% drop in 2017 compared to a 45.10% drop in 2021. “If BTC.D gets rejected from this resistance again, it could mark the start of the long-awaited Altseason 2025,” the crypto analyst explained. “A breakdown from this wedge would likely result in capital rotation from BTC into altcoins — just like in previous cycles.” Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana (SOL) at Crossroads — Bounce Likely If $142 Remains Intact",
      "link": "https://www.newsbtc.com/analysis/solana-sol-at-crossroads-142/",
      "summary": "Solana started a fresh decline and retested the $145 support zone. SOL price is now recovering and might aim for a fresh increase above the $150 zone. SOL price started a fresh decline after it failed to clear $160 against the US Dollar. The price is now trading below $150 and the 100-hourly simple moving average. There was a break above a key bearish trend line with resistance at $147 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could start a fresh increase if it clears the $152 resistance zone. Solana Price Trims Gains Solana price struggled to continue higher above $160 and started a fresh decline, like Bitcoin and Ethereum. SOL declined below the $155 and $152 support levels. It even dipped below $150 and tested the $145 zone. A low was formed at $144 and the price is now correcting some losses. There was a move above the 23.6% Fib retracement level of the downward move from the $160 swing high to the $144 low. Besides, there was a break above a key bearish trend line with resistance at $147 on the hourly chart of the SOL/USD pair. Solana is now trading below $150 and the 100-hourly simple moving average. On the upside, the price is facing resistance near the $150 level. The next major resistance is near the $152 level. It is close to the 50% Fib retracement level of the downward move from the $160 swing high to the $144 low. The main resistance could be $155. A successful close above the $155 resistance zone could set the pace for another steady increase. The next key resistance is $160. Any more gains might send the price toward the $165 level. Another Decline in SOL? If SOL fails to rise above the $150 resistance, it could start another decline. Initial support on the downside is near the $145 zone. The first major support is near the $142 level. A break below the $142 level might send the price toward the $136 zone. If there is a close below the $136 support, the price could decline toward the $125 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $145 and $142. Major Resistance Levels – $152 and $155."
    },
    {
      "title": "Bitcoin Holds Key Level Amid $108,000 Rejection, But Analysts Suggest Caution This Quarter",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-holds-key-level-amid-108000-rejection-but-analysts-suggest-caution-this-quarter/",
      "summary": "Bitcoin (BTC) attempted to reclaim the $108,000 resistance level again but faced rejection as the third quarter (Q3) started, leading some market watchers to suggest caution for the upcoming months. Related Reading: Solana Summer Loading? SOL Eyes $180 Following Staked ETF-Fueled Breakout Bitcoin Holds Crucial Range Bitcoin&#8217;s price ended the second quarter with a retest of the $108,000 barrier before being rejected and closing Q2 and June around the $107,140 area, its highest monthly close in history. Despite the positive performance, the flagship crypto started July with a pullback toward the $105,000, hitting a one-week low of $105,623. Analyst Rekt Capital affirmed that this suggested BTC’s post-breakout retest is in progress, which would strengthen the cryptocurrency’s case for another leg up. The analyst previously explained that Bitcoin needed a weekly close above the $104,400 support after losing it, as reclaiming this area would solidify its price recovery and position the cryptocurrency for a retest and confirmation of this level. Additionally, it would continue building its base around this area to transition into BTC’s second Discovery Uptrend. According to the Tuesday analysis, the new weekly close suggests Bitcoin is positioned for another post-breakout retest. The analyst also noted that, in the past 40 days, BTC broke out of two 2-week downtrends but was rejected from the crucial 6-week downtrend, around the $108,000 mark, during the same timeframe. Sjuul from AltCryptoGems noted the rejection from this level, affirming that “it is mandatory for bulls to step in quickly and not allow the price to have too big of a dip.” The flagship crypto needs a “strong bounce from the most important support and resistance level, just at $106-104K,” which it has momentarily held. To the analyst, failing to hold this area would open the door for a bigger pullback, risking a drop to the Macro support between $101,000 and $102,000. He highlighted a big gap between the current support area and the Macro support, which formed on the recent price recovery. BTC Risks Massive Drop In Q3 Sjuul pointed out that below the $101,000 support, “there is not much to defend the price from falling much lower,” adding that the “historical quarterly return of BTC for Q3 has not been great, so this adds some extra caution to the picture we have taken from the chart.” Similarly, Daan Crypto Trades asserted that historical data shows that Q3 is generally the slowest period for Bitcoin and Ethereum (ETH) due to the decreasing activity, volume, and liquidity during the summer months. He added that, as a new quarter and month begin, BTC will likely see a “choppy start,” but Bitcoin is still consolidating within its current range and descending channel, suggesting that investors should give it time to “play out and watch for confirmations” of the direction it will take for the rest of the month. Related Reading: BitMine Stock Soars 700% After $250 Million Raise For Ethereum Treasury Nonetheless, analyst Ali Martinez gave a warning signal, as an indicator that had predicted “every major Bitcoin crash” has just appeared. Per Martinez, the Tom Demark Sequential indicator, a rare warning that has historically preceded violent pullbacks, flashed a sell signal in the quarterly timeframe. Notably, the same signal appeared in 2015 and 2018, with BTC retracing over 75% and 85% after the indicator flashed. If it follows its historical performance, the analyst forecasted that BTC could drop to the $40,000 mark this quarter. As of this writing, Bitcoin is trading at $105,901, a 1.16% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "XRP Price Retreats From Highs — Is The Rally In Jeopardy?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-retreats-from-highs-2-20/",
      "summary": "XRP price started a fresh decline from the $2.320 zone. The price is now correcting gains and might find bids near the $2.120 zone. XRP price started a fresh decline from the $2.320 zone. The price is now trading below $2.220 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $2.20 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could extend losses if it fails to clear the $2.220 resistance zone. XRP Price Dips Further XRP price failed to extend gains above the $2.320 resistance and started a fresh decline, like Bitcoin and Ethereum. The price declined below the $2.250 and $2.220 support levels. Besides, there was a break below a key bullish trend line with support at $2.20 on the hourly chart of the XRP/USD pair. The pair even spiked below the $2.150 level. A low was formed at $2.148 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $2.327 swing high to the $2.148 low. The price is now trading below $2.220 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.20 level. The first major resistance is near the $2.220 level. The next resistance is $2.2380. It is close to the 50% Fib retracement level of the downward move from the $2.327 swing high to the $2.148 low. A clear move above the $2.2380 resistance might send the price toward the $2.2850 resistance. Any more gains might send the price toward the $2.30 resistance or even $2.320 in the near term. The next major hurdle for the bulls might be $2.40. Fresh Decline? If XRP fails to clear the $2.220 resistance zone, it could start another decline. Initial support on the downside is near the $2.150 level. The next major support is near the $2.120 level. If there is a downside break and a close below the $2.120 level, the price might continue to decline toward the $2.050 support. The next major support sits near the $2.020 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.150 and $2.120. Major Resistance Levels – $2.220 and $2.2850."
    },
    {
      "title": "TRON Defies Market Dip as USDT Activity and Drawdown Metric Signal Growth",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-defies-market-dip-as-usdt-activity-and-drawdown-metric-signal-growth/",
      "summary": "While the broader crypto market experienced a downturn with a 2.7% decline in total market cap over the past 24 hours, TRON (TRX) managed to move in the opposite direction. TRX recorded a 0.6% gain during the same timeframe, bringing its current trading price to $0.2788. Zooming out to a weekly view, TRON has posted a 2.4% increase, standing out among major assets amid an otherwise lukewarm market. This movement has caught the attention of on-chain analysts tracking deeper signals in the TRON ecosystem. According to CryptoQuant analyst Darkfost, TRON’s long-term price behavior reveals increasing resilience and a diminishing susceptibility to extreme volatility. Related Reading: Tron’s 374% Profit-Taking Spree Uncovered—Here’s Who Was Behind It Reduced Drawdowns Point to Market Maturity In a recent post titled “TRX Drawdowns Highlight Growing Resilience,” Darkfost shared drawdown analysis as evidence that TRON has become structurally more stable over time. He explained that drawdown metrics, which measure the peak-to-trough decline in an asset’s price, can serve as a reliable tool for identifying strategic market entry points. Darkfost highlighted four major TRX drawdown periods since 2020: a 61% drop in March 2020, a 70% fall in June 2021, a 55% decline in January 2022, and a 40% decrease in January 2025. Each of these correction phases was followed by significant recoveries. However, the drawdown depth has consistently decreased with each cycle, a development the analyst interprets as a sign of increasing investor confidence and capital retention in the TRON network. “With TRX now trading around $0.27, each of these drawdowns has proven to be profitable in hindsight,” Darkfost noted. He added that the trend suggests that TRON is evolving into a more stable asset class with stronger market positioning. Contributing to this stability is the ongoing flow of capital and growing ecosystem usage, particularly for stablecoin transactions. TRON has become a dominant layer for Tether (USDT) transfers, and data from CryptoQuant analyst Maartunn supports this view. TRON Surpasses Ethereum in Stablecoin Settlement In a separate post, Maartunn reported that TRON processed a record $23.4 billion in daily USDT transfers on June 25, 2025, an all-time high for the network. This figure significantly surpasses the $9.9 billion handled by Ethereum on the same day, highlighting the divergence between the two blockchains. Maartunn pointed out that TRON has outperformed Ethereum in USDT transfer volume since mid-2022, noting that the gap between the two networks continues to widen. “The chart doesn’t just show a record; it highlights the growing gap between TRON and Ethereum,” he wrote. While Ethereum’s USDT activity has declined roughly 39% since its November 2024 peak, TRON remains in an upward trend. This transition signals a growing role for TRON as the main settlement layer for Tether transactions, while Ethereum appears to be shifting toward other use cases. Featured image created with DALL-E, Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Wallet of Satoshi Partners With Spark To Offer Self-Custodial Bitcoin Lightning Experience",
      "link": "https://bitcoinmagazine.com/news/wallet-of-satoshi-partners-with-spark-to-offer-self-custodial-bitcoin-lightning-experience",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Wallet-of-Satoshi-Partners-With-Spark-To-Offer-Self-Custodial-Bitcoin-Lightning-Experience.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/wallet-of-satoshi-partners-with-spark-to-offer-self-custodial-bitcoin-lightning-experience\" rel=\"nofollow\"> </a></p> <p>Wallet of Satoshi will be in a beta version, bringing self-custody lightning wallets to Spark platform.</p> <p>"
    },
    {
      "title": "Figma Reveals $70M Bitcoin ETF Holdings, Plans to Buy $30M More",
      "link": "https://bitcoinmagazine.com/news/figma-reveals-70m-bitcoin-etf-holdings-plans-to-buy-30m-more",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Figma-Reveals-70M-Bitcoin-ETF-Holdings-Plans-to-Buy-30M-More.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/figma-reveals-70m-bitcoin-etf-holdings-plans-to-buy-30m-more\" rel=\"nofollow\"> </a></p> <p>The design software company invested $55M in a Bitwise Bitcoin ETF and got board approval to convert $30M USDC into Bitcoin.</p> <p>"
    },
    {
      "title": "DDC Enterprise Finalizes $528 Million Financing to Accelerate Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/DDC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DDC Enterprise Limited (NYSE: DDC) has officially closed its $528 million financing deal to expand its corporate Bitcoin strategy. The funding, led by Anson Funds with participation from Animoca Brands, Kenetic Capital, and others, is one of the largest Bitcoin-focused capital raises by a NYSE-listed company.&#160; “This maximum aggregate $528 million capital commitment marks a [&#8230;]</p> <p>"
    },
    {
      "title": "Eric Trump’s American Bitcoin Raises $220 Million in Private Stock Sale To Buy More BTC",
      "link": "https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Gryphon-to-Merge-with-Eric-Trumps-American-Bitcoin-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc\" rel=\"nofollow\"> </a></p> <p>The Hut 8 sold over 11 million shares to investors, securing $215 million in net proceeds to expand its Bitcoin holdings and mining operations.</p> <p>"
    },
    {
      "title": "The One Big Beautiful Act Passes in the U.S. Senate — Without Bitcoin Tax Amendment",
      "link": "https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/One-Big-Beautiful-Act-Bitcoin-Magazine.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment\" rel=\"nofollow\"> </a></p> <p>Despite a push from Senator Cynthia Lummis (R-WY), an amendment regarding de minimus capital gains exemption on crypto spending was not included in the version of the One Big Beautiful Act that passed in the Senate.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "OFAC Sanctions Russian Hosting Provider for Enabling Crypto Theft",
      "link": "https://decrypt.co/328139/ofac-sanctions-russian-hosting-provider-crypto-theft",
      "summary": "The U.S. Treasury has targeted a Russian firm linked to ransomware, infostealers, and darknet drug markets involving crypto."
    },
    {
      "title": "Why On-Chain Metrics Miss the Full Picture of Institutional Bitcoin Buying",
      "link": "https://decrypt.co/328136/chain-metrics-miss-full-picture-institutional-bitcoin-buying",
      "summary": "Bitcoin hit a record monthly close in June, but experts say on-chain data is missing the scale of institutional demand via ETFs and OTC desks."
    },
    {
      "title": "Arizona Governor Yet Again Rejects Bitcoin Reserve Using Seized Crypto",
      "link": "https://decrypt.co/328133/arizona-governor-rejects-bitcoin-reserve-seized-crypto-again",
      "summary": "Mounting crypto-related vetoes point to the state's cautious approach, but a future governor could hold an opposing view, was told."
    },
    {
      "title": "Figma Eyes Further Bitcoin Exposure in Run-Up to Hopeful NYSE Debut",
      "link": "https://decrypt.co/328130/figma-bitcoin-exposure-nyse-debut",
      "summary": "Figma’s $69.5 million Bitcoin ETF holding now accounts for 4.5% of its cash and securities portfolio, the company revealed Tuesday."
    },
    {
      "title": "Paging Dr. Algorithm: Microsoft’s AI Diagnoses Like House, Bills Like Costco",
      "link": "https://decrypt.co/328095/microsofts-ai-diagnoses-like-house-bills-like-costco",
      "summary": "In head-to-head tests, Microsoft’s virtual medical council diagnosed correctly four times more often than human doctors, and at a lower cost."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Arizona governor rejects Bitcoin reserve bill HB 2324, says it hurts asset forfeiture cooperation",
      "link": "https://cryptobriefing.com/arizona-bitcoin-reserve-bill-veto/",
      "summary": "<p>The veto highlights ongoing tensions between state innovation in digital finance and traditional law enforcement funding priorities.</p> <p>"
    },
    {
      "title": "Kraken elected as Super Representative on the TRON network",
      "link": "https://cryptobriefing.com/tron-super-representative-kraken-election/",
      "summary": "<p>Kraken's role as a Super Representative on TRON enhances network security and efficiency, boosting institutional trust and blockchain adoption.</p> <p>"
    },
    {
      "title": "Figma IPO filing shows $70M in BTC ETFs, gets board nod for $30M more",
      "link": "https://cryptobriefing.com/bitcoin-corporate-treasury-figma/",
      "summary": "<p>Figma's S-1 reveals $70M in Bitcoin ETFs and board approval for $30M BTC via USDC, highlighting its Bitcoin corporate treasury strategy.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus inks $100M funding deal with Ripple Strategy Holdings to support XRP reserve strategy, stock jumps 130% intraday",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy-funding/",
      "summary": "<p>Webus' strategic funding deal could enhance its market position in crypto mobility, potentially influencing blockchain adoption in related sectors.</p> <p>"
    },
    {
      "title": "SEC approves Grayscale’s proposal to convert BTC, ETH, XRP, ADA large-cap fund into a spot ETF",
      "link": "https://cryptobriefing.com/crypto-spot-etf-sec-approval/",
      "summary": "<p>The SEC's approval signals growing acceptance of crypto assets in traditional finance, potentially boosting market legitimacy and investor access.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "BCH outperforms BTC: Can Bitcoin Cash continue its bull run beyond $600?",
      "link": "https://ambcrypto.com/bch-outperforms-btc-can-bitcoin-cash-continue-its-bull-run-beyond-600/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-Cash-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BCH broke $448, then charged up. With $600 in sight, will resistance fold or fight back?"
    },
    {
      "title": "SPX6900 crashes 10% as buyers vanish, but a breakout can still happen IF…",
      "link": "https://ambcrypto.com/spx6900-crashes-10-as-buyers-vanish-but-a-breakout-can-still-happen-if/",
      "summary": "<img alt=\"SPX6900 crashes 10% as buyers vanish, but a breakout can still happen IF...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250701_153547_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will spot buyers step in again near the $1.08 level?"
    },
    {
      "title": "Michael Saylor’s Strategy adds $531 mln BTC – Why Bitcoin barely moved",
      "link": "https://ambcrypto.com/michael-saylors-strategy-adds-531-mln-btc-why-bitcoin-barely-moved/",
      "summary": "<img alt=\"Michael Saylor&#039;s Strategy adds $531 mln BTC - Why Bitcoin barely moved\" class=\"attachment-full size-full wp-post-image\" height=\"713\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/MichaelSaylor.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1267\" />Is Bitcoin losing its sensitivity to big buys like Strategy?"
    },
    {
      "title": "Ethereum Community Foundation raises millions, aims for $10K ETH: ‘You deserve better!’",
      "link": "https://ambcrypto.com/ethereum-community-foundation-raises-millions-aims-for-10k-eth-you-deserve-better/",
      "summary": "<img alt=\"Ethereum Community Foundation raises millions, aims for $10K ETH: &#039;You deserve better!&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ethereum-Community-Foundation.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Price appreciation of ETH is the key mandate for the Ethereum Community Foundation, declared Zak Cole."
    },
    {
      "title": "Solana wallet activity hits ATH: Can growing demand help SOL reach $184?",
      "link": "https://ambcrypto.com/solana-wallet-activity-hits-ath-can-growing-demand-help-sol-reach-184/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/B4584F92-B118-415B-AFE7-F48288F8C4B6.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Are top traders seeing something retail hasn’t yet?"
    }
  ]
}