{
  "CoinDesk": [
    {
      "title": "XRP Early Buyers Accelerate Profit-Taking as Regulatory Wins Bolster XRP Ecosystem",
      "link": "https://www.coindesk.com/markets/2025/06/20/xrp-early-buyers-accelerate-profit-taking-as-regulatory-wins-bolster-xrp-ecosystem",
      "summary": ""
    },
    {
      "title": "Bitcoin Cash Stages Surprise Run to Near $500 as Volumes Spike 500%",
      "link": "https://www.coindesk.com/markets/2025/06/20/bitcoin-cash-stages-surprise-run-to-near-500-as-volumes-spike-500",
      "summary": ""
    },
    {
      "title": "Bitcoin Steady Above $104K as Traders Eye Historically Bullish Second Half",
      "link": "https://www.coindesk.com/markets/2025/06/20/bitcoin-steady-above-104k-as-traders-eye-historically-bullish-second-half",
      "summary": ""
    },
    {
      "title": "Asia Morning Briefing: CryptoQuant Warns of $92K BTC Drop as Analyst Views Diverge",
      "link": "https://www.coindesk.com/markets/2025/06/19/asia-morning-briefing-cryptoquant-warns-of-92k-btc-drop-as-analyst-views-diverge",
      "summary": ""
    },
    {
      "title": "NEAR Protocol Surges 5% as Buyers Dominate Amid Middle East Tensions",
      "link": "https://www.coindesk.com/markets/2025/06/19/near-protocol-surges-5-as-buyers-dominate-amid-middle-east-tensions",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "South Korea’s central bank won’t oppose stablecoin: Report",
      "link": "https://cointelegraph.com/news/south-korea-central-bank-wont-oppose-stablecoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhiNWQtYWUwMi03MWEyLWFkMGUtNjcxN2Y4YTg0MWI1.jpg\" /></p><p>The head of South Korea’s central bank reportedly said he isn't against the issuance of a won-pegged stablecoin, but was wary of possible foreign exchange issues.</p>"
    },
    {
      "title": "Texas cops cut open crypto ATM to recover $25K lost to scam",
      "link": "https://cointelegraph.com/news/texas-police-open-crypto-atm-family-scam-funds-bitcoin-community-question-decision?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY3YTMtODAyYy03YzI4LWE4M2ItMmM1ZDgyZDQzZDIx.jpg\" /></p><p>Pictures show a Texas sheriff’s department taking a power-cutting tool to a crypto ATM after a family reportedly used it to pay a scammer.</p>"
    },
    {
      "title": "Politicians’ memecoins, dropped court cases fuel crypto ‘crime supercycle’",
      "link": "https://cointelegraph.com/news/crypto-crime-supercycle-memecoins-scams-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhiY2QtYjllZC03Y2M5LWEyODQtZGI2ZjdjM2IwMTQw.jpg\" /></p><p>Blockchain sleuths ZachXBT and Taylor Monahan say crypto scammers have been emboldened with US regulators dropping crypto-related court cases and politicians endorsing memecoins.</p>"
    },
    {
      "title": "Apple eyes generative AI to speed up custom chip design: Report",
      "link": "https://cointelegraph.com/news/apple-mulls-ai-quickly-design-chips-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzUyODgtZTZlOS03YjYzLWEwYTAtN2U0YWI5NGVhYTQ0.jpg\" /></p><p>Apple may use generative AI to streamline chip design, building on years of AI-driven workflows with help from key EDA partners, Reuters reports.</p>"
    },
    {
      "title": "Arizona Senate revives Bitcoin reserve bill after reconsideration vote",
      "link": "https://cointelegraph.com/news/arizona-senate-revives-bitcoin-reserve-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjQ2MWItMzNmYy03Mjc5LTllODAtMWZlZTgyNmNkMDAx.jpg\" /></p><p>The Arizona Senate has voted to revive House Bill 2324, a Bitcoin reserve bill that initially failed in the House.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Jupiter halts governance voting to tackle burnout and refocus on innovation",
      "link": "https://cryptoslate.com/jupiter-halts-governance-voting-to-tackle-burnout-and-refocus-on-innovation/",
      "summary": "<p>Solana’s largest decentralized exchange aggregator, Jupiter, has decided to halt all community voting through next year and keep its governance Treasury sealed until 2027, citing community burnout and a need to prioritize building new products. The move temporarily disables one of the main utilities for Jupiter’s native token, JUP, which powers governance proposals and decisions [&#8230;]</p> <p>"
    },
    {
      "title": "Circle approaches $50B valuation amid evolving regulatory landscape in the US",
      "link": "https://cryptoslate.com/insights/circles-stock-rally-propels-valuation-to-nearly-50-billion/",
      "summary": "<p>Circle, the issuer of the USD Coin (USDC) stablecoin, is edging closer to a $50 billion valuation after a major rally in its stock price. Since debuting at $31, Circle&#8217;s shares (CRCL) have climbed over 540%, now trading around $200, according to Yahoo Finance. This surge has helped push Circle&#8217;s valuation to approximately $48.4 billion [&#8230;]</p> <p>"
    },
    {
      "title": "Elon Musk’s X accelerates fintech pivot with plans for in-app payments and trading",
      "link": "https://cryptoslate.com/elon-musks-x-accelerates-fintech-pivot-with-plans-for-in-app-payments-and-trading/",
      "summary": "<p>X (formerly known as Twitter) is ramping up efforts to integrate financial services directly into its ecosystem and moving beyond its roots in social networking, the Financial Times reported on June 19. According to the report, the social media giant is preparing to let users carry out a wide range of financial transactions within the [&#8230;]</p> <p>"
    },
    {
      "title": "Trump family cuts stake in World Liberty Financial by 20%",
      "link": "https://cryptoslate.com/trump-family-cuts-stake-in-world-liberty-financial-by-20/",
      "summary": "<p>President Donald Trump&#8217;s family has reduced its stake in World Liberty Financial (WLFI) in the last couple of weeks, Forbes reported on June 20. DT Marks DEFI LLC, the Trump family’s main holding company for the project, has trimmed its ownership from 75% in December 2024 to about 60% by January and further down to [&#8230;]</p> <p>"
    },
    {
      "title": "Tether CEO Paolo Ardoino unveils PearPass as response to record 16 billion password leak",
      "link": "https://cryptoslate.com/tether-ceo-paolo-ardoino-unveils-pearpass-as-response-to-record-16-billion-password-leak/",
      "summary": "<p>Tether CEO Paolo Ardoino announced a new open-source password manager, PearPass, after an unprecedented 16 billion passwords were leaked in what experts now call the largest credential breach ever recorded. Ardoino wrote: “The cloud has failed us. Again. 16 billion passwords just leaked. It’s time to ditch the cloud.&#8221; He pledged that PearPass will work [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana Correction About To End? Analyst Forecasts $130 Retest Before Next Wave Up",
      "link": "https://www.newsbtc.com/news/solana-correction-about-to-end-analyst-forecasts-130-retest-before-next-wave-up/",
      "summary": "Amid the geopolitical turmoil, Solana (SOL) has retraced 10% in the past week. Some analysts believe that the altcoin’s correction is about to end, but warned that a dip below a key support level might come first. Related Reading: SUI Preparing For New Highs As Falling Wedge Breakout Targets $5 Solana Eyes Key Retest Before Breakout After retesting the $168 resistance last Wednesday, Solana has fallen back to a key level fueled by the recent market pullback. The cryptocurrency has seen a 15% retracement from its monthly highs, trading around the $140 zone for the past three days. SOL has been hovering between the $145-$180 price range since its May breakout, falling to the range lows during the June market shakeouts. Since then, the altcoin has struggled to reclaim the $160-$170 mid-zone. Nonetheless, market watcher Lluciano considers that Solana “may dip a bit more, but the ultimate target is seriously huge.” The analyst highlighted SOL’s performance since April, noting that it ended its multi-month downtrend after breaking above its descending resistance at the end of March. After this price action, SOL retested the $100-$120 demand zone before breaking out to its current range in the following weeks. Now, the altcoin’s chart displays a one-month falling wedge pattern, with the upper boundary sitting around the $155-$160 area. To the analyst, a breakout from this pattern could send the cryptocurrency toward May’s $187 high resistance before propelling the price to retest the $240 mark. Similarly, trader Rose noted that SOL has been consolidating above the key $145 resistance and 50-day Moving Average (MA), signaling a potential breakout. “If confirmed, the price could rise toward targets at $165, $183, and $220,” they suggested. SOL To Underperform In Coming Months? Market watcher Crypto Bullet suggested that Solana’s correction is coming to an end. The analyst forecasted that SOL could soon lose its current range and retest the April consolidation range, around the $125-$135 area, to complete the correction. This would be followed by a bounce back into the current range before surging past the $200 barrier toward the $220-$250 targets, for “one more wave up” this cycle. Meanwhile, Altcoin Sherpa affirmed Solana won’t outperform like it did during the first half of the cycle. According to the analyst, the cryptocurrency won’t outperform Bitcoin (BTC) on any long-term timeframe “other than a few blips here and there.” Related Reading: Bitcoin Setting Up For ‘Large Move’ Amid $103,000 Retest – Key Levels To Watch He explained that the cycle’s leading altcoin isn’t “dead,” but that he doesn’t “see it having a run like it did in 2021/2024.” Notably, SOL is currently retesting its late November 2023 support levels against BTC, which previously sent it to yearly lows after failing to hold them. Altcoin Sherpa concluded that Solana will likely continue to climb against its USDT pair but continue to bleed in its SOL/BTC chart. As of this writing, Solana is trading at $145, a 12.1% decline in the monthly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Bitcoin Cash (BCH) Pops 8% Higher — Can The Momentum Continue?",
      "link": "https://www.newsbtc.com/analysis/bch/bitcoin-cash-bch-pops-500/",
      "summary": "Bitcoin Cash price started a major increase above the $475 resistance. BCH is consolidating and might aim for more gains above the $500 resistance. Bitcoin cash price started a fresh increase above the $480 level. The price is trading above $480 and the 100-hour simple moving average. There was a break above a key bearish trend line with resistance at $472 on the hourly chart of the BCH/USD pair (data feed from Kraken). The pair could start another increase if it clears the $500 resistance zone. Bitcoin Cash Price Starts Fresh Surge After forming a base above the $440 level, Bitcoin Cash price started a fresh increase. BCH outpaced Bitcoin and Ethereum to gain over 8%. There was a clear move above the $470 resistance zone. The price even surpassed $480 and tested the $495 resistance zone. Besides, there was a break above a key bearish trend line with resistance at $472 on the hourly chart of the BCH/USD pair. A high was formed near $505 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $455 swing low to the $502 high. Bitcoin cash price is now trading above $485 and the 100-hour simple moving average. Immediate resistance on the upside sits near the $500 level. A clear move above the $500 resistance might start a decent increase. The next major resistance is $505, above which the price might accelerate higher toward the $520 level. Any further gains could lead the price toward the $535 resistance zone. Are Dips Supported In BCH? If Bitcoin Cash price fails to clear the $500 resistance, it could start a fresh decline. Initial support on the downside is near the $490 level. The next major support is near the $480 level or the 50% Fib retracement level of the upward move from the $455 swing low to the $502 high. If the price fails to stay above the $480 support, the price could test the $470 support. Any further losses could lead the price toward the $450 zone in the near term. Technical indicators 4-hour MACD – The MACD for BCH/USD is losing pace in the bullish zone. 4-hour RSI (Relative Strength Index) – The RSI is currently above the 60 level. Key Support Levels – $490 and $480. Key Resistance Levels – $500 and $505."
    },
    {
      "title": "Bitcoin Forming Inverse Head And Shoulders Pattern – Is $150,000 The Next Target?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-forming-inverse-head-and-shoulders-pattern-is-150000-the-next-target/",
      "summary": "Although Bitcoin’s (BTC) momentum has stalled over the past week due to escalating geopolitical tensions in the Middle East, the flagship cryptocurrency appears to be forming a bullish inverse head and shoulders pattern on the three-day chart &#8211; significantly increasing the likelihood of a new all-time high (ATH) in the coming months. Bitcoin Eyeing New ATH Soon? In an X post published today, crypto analyst Mister Crypto highlighted that BTC is forming an inverse head and shoulders pattern on the three-day chart. The analyst shared the following chart, noting that a successful breakout could propel Bitcoin’s price as high as $150,000. For the uninitiated, the inverse head &#38; shoulders is a bullish chart pattern that signals a potential reversal from a downtrend to an uptrend. It consists of three troughs, a lower low &#8211; called the &#8220;head&#8221; &#8211; between two higher lows &#8211; called the &#8220;shoulders.&#8221; This is followed by a breakout above the &#8220;neckline&#8221; resistance, indicating rising buying pressure. Related Reading: Bitcoin Hash Ribbons Indicating Prime Buying Opportunity, Analyst Says Despite ongoing uncertainty in the market, analysts remain largely optimistic. For example, noted analyst Jelle pointed out that BTC has formed a major bullish pennant above previous highs &#8211; another positive technical signal. BTC is also poised to benefit from shrinking supply on trading platforms. In an X post shared earlier today, crypto commentator Master of Crypto noted that Bitcoin balances on exchanges are about to fall below two million &#8211; the lowest level since 2017. Depleting BTC balances on exchanges suggest that investors are moving their Bitcoin to long-term storage, reducing the amount available for immediate sale. This supply constraint can create upward pressure on price, especially if demand continues to rise. Meanwhile, another Bitcoin analyst, apsk32, highlighted BTC’s ongoing alignment with the power curve cycle. Remarkably, Bitcoin has followed this cycle consistently for 15 years, and if the trend holds, the next cycle top could occur in November or December 2025. BTC Quantity More Important Than Price In a separate X post, Rich Dad Poor Dad author Robert Kiyosaki emphasized that the number of BTC one holds is more important than its current price. In a detailed thread, he predicted that Bitcoin could reach as high as $1 million by 2030. Related Reading: Bitcoin On-Chain Warning: Short-Term Holder Selling Accelerates Amid Price Correction While a $1 million price target may seem ambitious, other analysts also forecast new highs in the near term. For example, CryptoQuant analyst Carmelo Aleman recently projected that BTC could top out at $205,000 by the end of 2025. In addition, exchange data suggests an impending supply crunch, as whales continue withdrawing large amounts of BTC while exchange inflows remain subdued. At press time, BTC is trading at $104,359, down 0.1% in the past 24 hours. Featured image from Unsplash, charts from X and TradingView.com"
    },
    {
      "title": "XRP Price Action Tightens — Breakout Looms to The Upside",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-action-tightens-2-20/",
      "summary": "XRP price started a fresh decline below the $2.20 zone. The price is now consolidating losses and might recover if it clears the $2.20 hurdle. XRP price started a fresh decline below the $2.150 zone. The price is now trading below $2.20 and the 100-hourly Simple Moving Average. There is a contracting triangle forming with resistance at $2.170 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start a fresh increase if there is a close above the $2.20 resistance zone. XRP Price Eyes Upside Break XRP price reacted to the downside below the $2.20 support zone, like Bitcoin and Ethereum. The price declined below the $2.180 and $2.150 support levels. The pair tested the $2.120 support A low was formed at $2.120 and the price started to trade in a range. There was a minor recovery wave above the 23.6% Fib retracement level of the downward move from the $2.335 swing high to the $2.120 low. The price is now trading below $2.20 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.170 level. There is also a contracting triangle forming with resistance at $2.170 on the hourly chart of the XRP/USD pair. The first major resistance is near the $2.20 level. The next resistance is $2.2280 or the 50% Fib retracement level of the downward move from the $2.335 swing high to the $2.120 low. A clear move above the $2.2280 resistance might send the price toward the $2.250 resistance. Any more gains might send the price toward the $2.2850 resistance or even $2.320 in the near term. The next major hurdle for the bulls might be $2.350. Another Drop? If XRP fails to clear the $2.20 resistance zone, it could start another decline. Initial support on the downside is near the $2.1450 level. The next major support is near the $2.120 level. If there is a downside break and a close below the $2.120 level, the price might continue to decline toward the $2.050 support. The next major support sits near the $2.00 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.1450 and $2.120. Major Resistance Levels – $2.170 and $2.20."
    },
    {
      "title": "Dogecoin Gears Up For 60% Move—Will It Be Up Or Down?",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-gears-60-move-will-it-be-up-or-down/",
      "summary": "An analyst has explained how Dogecoin could be primed for a 60% price move. Here&#8217;s the range that could end up deciding the direction of the break. Dogecoin Is Nearing The End Of A Triangle Pattern In a new post on X, analyst Ali Martinez has talked about how Dogecoin is currently looking from a technical analysis (TA) perspective. Below is the chart shared by the analyst that shows the trend in the 1-day price of DOGE. As displayed in the graph, the daily Dogecoin price has been trading inside what appears to be a triangular channel. A triangle is a TA pattern that forms whenever an asset&#8217;s price observes consolidation between two converging trendlines. Related Reading: Solana Plunges 13%: Can Key On-Chain Support Stop The Fall? The upper line of the pattern is likely to provide resistance to the price, while the lower one support. A break out of either of the lines can signal a continuation of trend in that direction. There are a few different types of triangles, with a few popular ones being the Symmetrical, Ascending, and Descending variations. The orientation of the trendlines decides the type of the triangle. In a Symmetrical Triangle, the lines converge at a roughly equal and opposite slope. This means that as the price travels inside the pattern, both upward and downward volatility shrinks in an even manner. For the Ascending and Descending versions, however, there is a bias to the upside or downside. In the former, the upper trendline is parallel to the time-axis and the price progressively makes higher lows. Similarly, the latter involves lower highs with a flat support level. From the chart, it&#8217;s apparent that the Triangle that Dogecoin has been moving inside for the past few months is similar to a Symmetrical Triangle, but it has a slight tilt toward the downside. It&#8217;s also visible that DOGE is nearing in on the end of the triangle. Generally, triangle breakouts become more likely to occur as the asset approaches the apex, as the consolidation range squeezes tight in this region. Related Reading: These Altcoins Are Bucking The Trend—But Can They Keep It Up? Considering that Dogecoin may be in this zone now, it&#8217;s possible that its spring may be ready to uncoil. Based on the pattern forming in the daily price, the analyst has noted that DOGE looks primed for a 60% move. As for which way a break would happen, that naturally comes down to which line the memecoin exits the triangle from. &#8221; All you need to do is wait for a daily close outside of the $0.16 to $0.22 range to determine the direction of the trend,&#8221; notes Martinez. DOGE Price At the time of writing, Dogecoin is floating around $0.168, down more than 11% over the last seven days. Featured image from Dall-E, charts from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Semler Scientific Appoints Joe Burnett as Director of Bitcoin Strategy, Targets 105,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/semler-scientific-appoints-joe-burnett-as-director-of-bitcoin-strategy-targets-105000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Semler-Scientific-Appoints-Joe-Burnett-as-Director-of-Bitcoin-Strategy-Targets-105000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/semler-scientific-appoints-joe-burnett-as-director-of-bitcoin-strategy-targets-105000-btc-by-2027\" rel=\"nofollow\"> </a></p> <p>Semler Scientific, the second U.S. publicly traded company to adopt Bitcoin as its primary treasury reserve asset, has appointed Joe Burnett as Director of Bitcoin Strategy while announcing a Bitcoin accumulation plan. The healthcare technology company targets holding 10,000 Bitcoin by year end 2025, 42,000 by 2026, and 105,000 by 2027.&#160; The announcement comes as [&#8230;]</p> <p>"
    },
    {
      "title": "President Donald Trump: America Will Show The World How To Win With Digital Assets Like Never Before",
      "link": "https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/President-Trump-Says-22We-Are-Going-to-Show-the-World-How-to-WIN-with-Digital-Assets-Like-Never-Before22.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before\" rel=\"nofollow\"> </a></p> <p>President Donald Trump posted on Truth Social Tuesday evening regarding recent Senate legislation, stating the U.S. will &#8220;show the World how to WIN with Digital Assets like never before.&#8221;"
    },
    {
      "title": "3 Misconceptions About US Debt",
      "link": "https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FRED-chart.png\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt\" rel=\"nofollow\"> </a></p> <p>This newsletter explores three common misconceptions about U.S. federal debt and deficits.</p> <p>"
    },
    {
      "title": "The Smarter Web Company Acquires £8.1M in Bitcoin For Treasury Holdings",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Smarter-Web-Company-Acquires-8.1M-in-Bitcoin-For-Treasury-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings\" rel=\"nofollow\"> </a></p> <p>The London listed firm now holds 346.63 Bitcoin worth £27.2 million, reinforcing its long-term strategy to integrate Bitcoin into corporate finance through its \"10 Year Plan.\"</p> <p>"
    },
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "SEC Thailand Opens Public Consultation on Crypto Listing Criteria",
      "link": "https://decrypt.co/326194/sec-thailand-public-consultation-crypto-listing-criteria",
      "summary": "Thailand's SEC has opened public feedback on new rules letting exchanges list self-issued tokens, with stronger disclosure requirements."
    },
    {
      "title": "South Korean Regulators Prepare for Spot Crypto ETFs This Year",
      "link": "https://decrypt.co/326191/south-korean-regulators-spot-crypto-etfs-this-year",
      "summary": "The country's financial regulator has submitted plans to launch crypto ETFs and won-based stablecoins by the second half of this year."
    },
    {
      "title": "North Korea Targets Crypto Professionals With New Malware in Hiring Scams",
      "link": "https://decrypt.co/326187/new-malware-crypto-job-scams-north-korea",
      "summary": "Hackers linked to Pyongyang are posing as Coinbase and Uniswap recruiters to deploy \"PylangGhost,\" a Python-based trojan."
    },
    {
      "title": "Semler Scientific Targets Hefty Bitcoin Stash Over Next 2 Years",
      "link": "https://decrypt.co/326183/semler-scientific-bitcoin-stash-2-years",
      "summary": "Once a cautious believer in crypto, Semler Scientific is now racing to become the second-largest corporate holder of Bitcoin."
    },
    {
      "title": "Arizona Senate Passes Bitcoin Reserve Bill for Seized Crypto, Heads to House For Debate",
      "link": "https://decrypt.co/326175/arizona-senate-passes-bitcoin-reserve-bill-for-seized-crypto-heads-to-house-for-debate",
      "summary": "The bill seeks to establish a state-managed digital asset fund using crypto seized through criminal forfeiture."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Arizona revives Bitcoin reserve bill and passes it in Senate",
      "link": "https://cryptobriefing.com/arizona-bitcoin-reserve-fund-bill/",
      "summary": "<p>Arizona's legislative actions on digital assets could set a precedent for integrating cryptocurrencies into state financial systems, despite political challenges.</p> <p>"
    },
    {
      "title": "Trump-affiliated company cuts stake in World Liberty Financial to 40%",
      "link": "https://cryptobriefing.com/world-liberty-stake-reduction/",
      "summary": "<p>The reduced stake may signal a strategic shift in investment focus, potentially impacting the company's influence in the crypto sector.</p> <p>"
    },
    {
      "title": "Seamless Protocol launches plug and play Leverage Tokens as ERC-20 assets on Base",
      "link": "https://cryptobriefing.com/launch-leveraged-defi-tokens/",
      "summary": "<p> Seamless Protocol debuts Leverage Tokens on Base, packaging passive DeFi strategies into tradable ERC-20s for one-click exposure.</p> <p>"
    },
    {
      "title": "Only 30% of crypto miners comply with Russia’s new rules, finance ministry official says",
      "link": "https://cryptobriefing.com/crypto-mining-compliance-russia/",
      "summary": "<p>The low compliance rate among crypto miners in Russia highlights challenges in enforcing regulations, potentially impacting energy policies and economic oversight.</p> <p>"
    },
    {
      "title": "Elon Musk’s X will soon launch investment and trading features as part of ‘everything app’ vision",
      "link": "https://cryptobriefing.com/financial-services-expansion-elon-musk-x/",
      "summary": "<p>Musk's X expansion into finance could redefine digital ecosystems, merging social media with financial services, impacting user engagement.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Scaramucci backs Solana to surpass Ethereum in market cap – Here’s why",
      "link": "https://ambcrypto.com/scaramucci-backs-solana-to-surpass-ethereum-in-market-cap-heres-why/",
      "summary": "<img alt=\"Scaramucci backs Solana to surpass Ethereum in market cap - Here’s why\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Editors-1-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SkyBridge Capital founder and manager Anthony Scaramucci expects Solana to flip the Ethereum market cap- but is this realistic?"
    },
    {
      "title": "Bitcoin stalls near $105K amid steady Fed rates – Sign of a correction?",
      "link": "https://ambcrypto.com/bitcoin-stalls-near-105k-amid-steady-fed-rates-sign-of-a-correction/",
      "summary": "<img alt=\"Bitcoin stalls near $105K amid steady Fed rates - Sign of a correction? \" class=\"attachment-full size-full wp-post-image\" height=\"745\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Fed-Keeps-Rates-Unchanged.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1324\" />Bitcoin isn’t moving, but with calm Fed rates, are we on the edge of another crypto storm?"
    },
    {
      "title": "Bitcoin’s market is cooling, but why the $100K support remains crucial",
      "link": "https://ambcrypto.com/bitcoins-market-is-cooling-but-why-the-100k-support-remains-crucial/",
      "summary": "<img alt=\"Bitcoin&#039;s market is cooling, but why the $100K support remains crucial\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-7.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As long as the price remains above $100k, bulls have some control."
    },
    {
      "title": "Could a nuclear war kill crypto? AI predicts Bitcoin’s fate in doomsday scenario",
      "link": "https://ambcrypto.com/could-a-nuclear-war-kill-crypto-ai-predicts-bitcoins-fate-in-doomsday-scenario/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-nuclear-war.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Polymarket odds of a nuclear bomb being dropped in 2025 was 18% - But can BTC survive?"
    },
    {
      "title": "Tron: $0.30 in sight for TRX, but only if bulls clear THIS level",
      "link": "https://ambcrypto.com/tron-0-30-in-sight-for-trx-but-only-if-bulls-clear-this-level/",
      "summary": "<img alt=\"Tron\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-19T121527.815-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TRX defends $0.27 support as whales accumulate and address activity rebounds."
    }
  ]
}