{
  "CoinDesk": [
    {
      "title": "Spot Ethereum ETFs Could See Explosive Growth in H2 2025, Says Bitwise CIO",
      "link": "https://www.coindesk.com/markets/2025/07/02/spot-ethereum-etfs-could-see-explosive-growth-in-h2-2025-says-bitwise-cio",
      "summary": ""
    },
    {
      "title": "SEC Halts Grayscale Large Cap Fund Conversion for 'Review' a Day After Staff Approval",
      "link": "https://www.coindesk.com/policy/2025/07/02/sec-halts-grayscale-large-cap-fund-approval-for-review",
      "summary": ""
    },
    {
      "title": "BONK Surges 10% as Tuttle Capital Sets July 16 as Earliest Launch Date for Its 2X Leveraged ETF",
      "link": "https://www.coindesk.com/markets/2025/07/02/bonk-surges-10-as-tuttle-capital-sets-july-16-as-earliest-launch-date-for-its-2x-leveraged-etf",
      "summary": ""
    },
    {
      "title": "JPMorgan’s Blockchain Arm Kinexys Tests Tokenized Carbon Credits With S&P Global",
      "link": "https://www.coindesk.com/business/2025/07/02/jpmorgans-blockchain-arm-kinexys-tests-tokenized-carbon-credits-with-sp-global",
      "summary": ""
    },
    {
      "title": "Ripple Expands Stablecoin Infrastructure Partnership as It Seeks Bank License",
      "link": "https://www.coindesk.com/business/2025/07/02/ripple-expands-stablecoin-infrastructure-partnership-as-it-seeks-bank-license",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "SEC ends ‘regulation through enforcement,’ calls tokenization &#039;innovation&#039;",
      "link": "https://cointelegraph.com/news/sec-chair-paul-atkins-tokenization-crypto-regulation-shift?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NWZiZmYtZDExMy03ODA5LTgwMDMtZTQ0YmRhMTYxZDNl.jpg\" /></p><p>In a media interview, Chair Paul Atkins pledged to empower businesses to innovate through tokenization.</p>"
    },
    {
      "title": "BNB news update: Bulls target $719 after successful Maxwell upgrade",
      "link": "https://cointelegraph.com/news/bnb-news-update-bulls-target-dollar719-after-successful-maxwell-upgrade?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2NiZGUtZjI3YS03ZmJhLWEzMjctZDk1NjFiYTBjOWVm.jpg\" /></p><p>BNB Smart Chain’s Maxwell upgrade has ignited the bulls, opening the door for a rally toward new year-to-date highs.</p>"
    },
    {
      "title": "Cake Wallet onboards dEURO decentralized stablecoin, offers 10% yield on collateral",
      "link": "https://cointelegraph.com/news/decentralized-euro-stablecoin-deuro-launches-cake-wallet?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2NiZmUtOWM5My03MGU0LWFhYzMtMTM4YWE4YjljODIy.jpg\" /></p><p>The dEURO is overcollateralized by other digital assets such as Bitcoin, Ether and Monero.</p>"
    },
    {
      "title": "Will Bitcoin benefit from ‘Big Beautiful Bill’ passage and US debt ceiling increase?",
      "link": "https://cointelegraph.com/news/will-bitcoin-benefit-from-big-beautiful-bill-passage-and-us-debt-ceiling-increase?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzRlYzEtOWNkOC03OGFmLTgwNTQtMThkMmIwOTc3YTdl.jpg\" /></p><p>Traders say Bitcoin will benefit from the proposed $5 trillion increase to the US debt ceiling, but data could suggest otherwise.</p>"
    },
    {
      "title": "SOL news update: REX Shares Solana ETF boosts price, but for how long?",
      "link": "https://cointelegraph.com/news/sol-news-update-rex-shares-solana-etf-boosts-price-but-for-how-long?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzMwZWYtYTE1Yy03MzA5LWJkZDYtOWRlZWEwOWIwYTVk.jpg\" /></p><p>SOL rallied after the launch of the REX Shares Solana ETF, but bulls need to hold the price above $160.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "SEC temporarily halts Grayscale’s multi-asset crypto ETF debut despite conversion greenlight",
      "link": "https://cryptoslate.com/sec-temporarily-halts-grayscales-multi-asset-crypto-etf-debut-despite-conversion-greenlight/",
      "summary": "<p>Grayscale’s conversion of its Digital Large Cap Fund (GDLC) into an exchange-traded fund (ETF) has been frozen by a stay order, despite receiving approval from the Securities and Exchange Commission (SEC) on July 1. Bloomberg ETF analyst James Seyffart said in a social media post on July 2 that the stay blocks the conversion “for now” [&#8230;]</p> <p>"
    },
    {
      "title": "StanChart predicts Bitcoin’s new cycle may defy past patterns with ETF and policy tailwinds",
      "link": "https://cryptoslate.com/stanchart-predicts-bitcoins-new-cycle-may-defy-past-patterns-with-etf-and-policy-tailwinds/",
      "summary": "<p>Bitcoin (BTC) could see its strongest half-year performance ever in late 2025, driven by record ETF inflows, policy risks to the Federal Reserve, and broadening sovereign adoption, according to Geoffrey Kendrick, head of digital assets research at Standard Chartered. In a July 2 research note, Kendrick forecasted that ETF inflows and corporate treasury purchases will [&#8230;]</p> <p>"
    },
    {
      "title": "CleanSpark’s Tennessee expansion boosts stock 11% amid local unrest",
      "link": "https://cryptoslate.com/cleansparks-tennessee-expansion-boosts-stock-11-amid-local-unrest/",
      "summary": "<p>Bitcoin miner CleanSpark has reportedly received approval to build a new mining facility in Mountain City, Tennessee, local media outlet WCYB reported on July 2. According to the report, the Mountain City Board of Mayor and Aldermen approved the mine&#8217;s development after a 3-1 vote to rezone the targeted 50-acre site. The land will shift [&#8230;]</p> <p>"
    },
    {
      "title": "Canadian fintech Mogo’s $50M Bitcoin reserve plan ignites 140% share surge at market opening",
      "link": "https://cryptoslate.com/canadian-fintech-mogos-50m-bitcoin-reserve-plan-ignites-140-share-surge-at-market-opening/",
      "summary": "<p>Canadian fintech Mogo announced on July 2 that its board had cleared up to $50 million for staged Bitcoin purchases as a long-term treasury reserve, prompting its shares to jump 140% at market opening on the Toronto Stock Exchange. MOGO closed July 1 priced at 1.74 Canadian dollars, worth roughly $1.28. It opened on July [&#8230;]</p> <p>"
    },
    {
      "title": "Ripple seeks a national bank charter approval to place RLUSD under state and federal oversight",
      "link": "https://cryptoslate.com/ripple-seeks-a-national-bank-charter-approval-to-place-rlusd-under-state-and-federal-oversight/",
      "summary": "<p>Ripple applied for a national bank charter with the Office of the Comptroller of the Currency (OCC) on July 2, CEO Brad Garlinghouse wrote in a post on X. The filing would place Ripple USD (RLUSD) under federal supervision while maintaining its existing oversight by the New York Department of Financial Services, creating a “new [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Tron DeFi Activity Expands: SunSwap Hits $3B+ Monthly Swaps In 2025",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-defi-activity-expands-sunswap-hits-3b-monthly-swaps-in-2025/",
      "summary": "Tron (TRX) is currently navigating a prolonged consolidation phase that began in December 2024, with prices oscillating between key levels and no clear breakout direction in sight. Despite this range-bound action, Tron remains firmly in the spotlight as fundamental developments capture market attention. The most significant news came two weeks ago, when reports revealed that Tron is preparing to go public via a reverse merger with Nasdaq-listed SRM Entertainment. This potential listing could mark a major milestone for the blockchain platform, potentially making it the first major crypto network to enter US public markets directly. Related Reading: Solana Hits New Milestone: Wallets Holding 0.1+ SOL Reach Record High At the same time, on-chain data signals growing momentum beneath the surface. According to insights from CryptoQuant, DeFi activity on the Tron network has been steadily expanding. Rising transaction volumes, increasing deposits in JustLend, and record swap activity on SunSwap point to deepening liquidity and user engagement. These developments highlight a maturing ecosystem, but the market has yet to price in a breakout move. As consolidation continues, traders and investors are closely watching for the next major catalyst. Whether Tron’s public listing or accelerating DeFi traction triggers it remains to be seen, but momentum is quietly building. Tron DeFi Growth Signals Underlying Strength Tron is testing critical price levels after months of sideways movement, consolidating between $0.211 and $0.295. This range has acted as a structural base since late 2024, and a clean break in either direction could determine Tron’s next major trend. A breakout above $0.295 would likely trigger fresh momentum toward new local highs, while failure to hold support could expose the asset to deeper corrections. While the broader crypto market anticipates upward expansion—supported by the rally in US equities and a more stable macro backdrop—Tron remains trapped in this tight band. Volatility persists, and without a decisive breakout, market participants remain cautious. Still, underlying fundamentals suggest TRX may be quietly gathering strength. According to CryptoQuant data, DeFi activity on the Tron network is rising rapidly. SunSwap has surpassed $3 billion in monthly swap volume consistently throughout 2025, with May setting a record at $3.8 billion. Meanwhile, JustLend deposits have more than tripled year-to-date, peaking at $740 million. These developments point to deepening liquidity and growing demand across Tron’s DeFi ecosystem. Stablecoin inflows and increasing borrowing activity further reinforce Tron’s expanding utility, suggesting the network is becoming a robust settlement layer. While the price remains range-bound for now, the fundamentals hint at a strong foundation for future upside, once the technical breakout finally materializes. Related Reading: Tron Shows Adoption Strength As Volume Still Led By Big Transfers – Details TRX Price Consolidates Near Resistance TRX is currently trading around $0.2813, maintaining its position near the upper boundary of the long-standing consolidation range that began in December 2024. The asset has shown resilience above the 50-day, 100-day, and 200-day moving averages, all of which are trending upward, supporting the bullish outlook. The 50-day SMA at $0.2508 and the 100-day SMA at $0.2289 are providing dynamic support, indicating strong buyer interest on dips. Price action throughout June remained sideways, with low volatility and volume consistent with a classic consolidation phase. Despite multiple rejections below the $0.295 resistance, TRX has not shown any signs of structural weakness, holding firmly above $0.26–$0.27 and gradually building pressure toward a breakout. Related Reading: Bitcoin Dominance Shows Bearish Divergence – Altseason Could Be Near Volume has remained stable, though not yet signaling the kind of breakout momentum that would confirm a move into higher price discovery. Traders are watching closely for a clean candle close above $0.295 to validate a bullish continuation. If successful, TRX could rally toward the $0.32–$0.35 zone, with minimal overhead resistance. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "AI Founder Puts XRP Price As High As $20-$30",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-as-high-as-20-30/",
      "summary": "An AI startup founder and vocal XRP supporter on the social media platform X has offered his long-awaited price prediction for the cryptocurrency. XRP&#8217;s price action in recent days has been highlighted by a quick surge to $2.30 on June 30, in what looks like the bulls trying to close the month of June above $2.20. That momentum, however, was short-lived, as the cryptocurrency has slipped back below this level in the most recent two days. Although momentum has not yet returned in full, bullish predictions are still active, and this latest prediction adds another confident voice to the growing chorus of those expecting a significant breakout. XRP Price As High As $20 To $30 Taking to the social media platform, Vincent Van Code, an AI startup founder, offered his personal price outlook for XRP. He explained that while he rarely comments on specific targets, he believes the asset has the potential to reach between $30 and $50. Related Reading: Analyst Reveals Rational Behind XRP Price Reaching $9.5 And $37.5 However, it is important to note that this reasoning is not rooted in technical analysis, but rather in belief and long-term conviction based on XRP&#8217;s current price trajectory. Furthermore, he noted that his investment in XRP is shaped by this personal view of a $20 to $30 price target and admitted he cannot predict the timing of such a rally. The details of how the journey plays out to this price target are far less important than the eventual outcome. It is clear that the ultra-bullish price prediction is not intended to persuade or convince others. However, it shows the confidence some traders have in XRP&#8217;s future price. It also resonates with many predictions from other crypto participants regarding XRP, both in terms of technical and fundamental analysis. Familiar Price Predictions Within The Altcoin&#8217;s Circle This prediction aligns with a broader sense of optimism often found among XRP supporters. Although some critics continue to argue that price targets of $30 or more are unrealistic, especially due to its huge circulating supply, many in the XRP community continue to see such price targets as attainable. Related Reading: Deaton Says Ripple IPO Could Trigger $100B Valuation, How High Will The XRP Price Be? The beliefs of extravagant XRP price targets are often based on its fundamentals, mostly on expectations of widespread adoption in cross-border payments and institutional adoption of the cryptocurrency. In fact, one analyst pointed to this as the reason why the XRP price will surge above $1,000, stabilize at this level, and eventually become very expensive. Technical analysis from crypto analyst JackTheRippler pointed to an incoming price target above $30 for XRP. In a similar vein, a recent technical analysis by popular crypto analyst EGRAG CRYPTO shows that the altcoin is on track to climb above $9.5 and reach as high as $37.5. XRP rallied to as high as $2.30 on June 30, and then reversed to an intraday low of $2.15 in the past 24 hours. At the time of writing, XRP is trading at $2.19. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Finds Support Above 50-Day SMA, But Next Direction Remains Uncertain",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-next-direction-uncertain/",
      "summary": "Bitcoin is holding steady above its 50-day Simple Moving Average (SMA), showing signs of underlying strength despite a lack of clear directional momentum. With rising trading volume and mixed technical indicators, the next move could swing either way, keeping the market on edge. RSI Holds Neutral As Bitcoin Awaits A Clearer Signal According to Shaco AI, in a recent update on X, Bitcoin is currently hovering around $107,264.17, positioning itself just above two key moving averages. It’s nudging the 25-day SMA at $107,229.82 and holding slightly above the 50-day SMA, which sits at $107,040.81. This positioning reflects a mild bullish bias in recent sessions, keeping both bulls and bears on alert. Related Reading: Bitcoin Price Risks Market Crash After Closing Below Final Weekly Resistance Looking at momentum indicators, the Relative Strength Index (RSI) is resting at 53.36—firmly in neutral territory. This suggests that Bitcoin is neither overbought nor oversold at the moment, offering no strong directional clues as it keeps the market guessing. Furthermore, the Average Directional Index (ADX) adds to this indecisive mood, coming in at a soft 20.44. This low reading signals a weak trend, meaning there’s not enough force from bulls or bears to drive a clear breakout just yet. In other words, the market isn’t leaning heavily in either direction. Meanwhile, the Moving Average Convergence Divergence (MACD) remains in negative territory at -137.33. Although it isn’t signaling any strong downward momentum, traders may want to stay cautious and alert for any sudden shift in the current tone. Despite the technical indecision, market activity is picking up. Bitcoin&#8217;s recent trading volume has surged to 1903.51, well above the average of 1522.43. This uptick signals a rise in interest and participation, indicating that traders are actively positioning themselves in anticipation of Bitcoin’s next move. Critical Zones At Play As Market Prepares For A Directional Push Looking at key levels, Shaco AI highlighted that resistance is at $108,789.99, which seems to be a strong level to overcome. The level marks a significant ceiling for Bitcoin, and any attempt to push higher will need solid momentum to break through. On the other hand, support lies at $104,622.02. This support level will be critical in case the price begins to retreat, as a breakdown here could open the door for further downside. Related Reading: Bitcoin Price At $110,000: Why BTC Must Break Out Of This Wedge Based on current indicators, the analyst suggests it’s wise to keep an eye out for potential movement in either direction. With volume picking up, Bitcoin may soon test either the resistance above or fall back to support, depending on how momentum develops in the coming sessions. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Bounces Off Key Demand Level – Price Discovery On The Menu?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-bounces-off-key-demand-level-price-discovery-on-the-menu/",
      "summary": "Bitcoin has experienced heightened volatility over the past few days, moving between critical levels as market participants await a clear breakout or breakdown. After testing $105,000 as support, BTC rebounded strongly and pushed back toward the $109,000 resistance zone—an area that has capped upward momentum for several weeks. While bulls remain in control of the broader structure, price action continues to show hesitation just below the all-time high, leaving the market in a state of uncertainty. Related Reading: Solana Hits New Milestone: Wallets Holding 0.1+ SOL Reach Record High To confirm the next leg of the long-term trend, Bitcoin needs to break into price discovery territory above $112,000 with strong volume and follow-through. Until that happens, the current range-bound conditions could persist, especially as traders weigh macro factors and profit-taking activity increases. Top analyst Jelle shared a technical analysis pointing to another strong bounce from the 50-day moving average and exponential moving average (MA/EMA) cluster, key dynamic support levels that have repeatedly triggered bullish reactions. This bounce reinforces the underlying strength in the current trend, suggesting that buyers continue to step in at crucial levels. As long as BTC holds above this support zone, the path toward a breakout remains intact—but confirmation is still needed. Bitcoin Prepares For Expansion Phase Bitcoin appears poised to enter a new expansive phase, with a breakout above its all-time high potentially triggering a fresh wave of bullish momentum, not just for BTC, but for the broader crypto market. After weeks of grinding just below the $112,000 resistance level, Bitcoin has struggled to push decisively higher. However, the structure remains bullish, and buyers have consistently defended key demand zones around $105,000. This ability to maintain higher lows during a period of consolidation signals strong market control by the bulls. According to Jelle, Bitcoin has just seen another powerful bounce from the 50-day moving average and exponential moving average (MA/EMA) cluster—an area that has historically acted as a dynamic support zone. Each time BTC has touched this cluster in recent months, it has rebounded with renewed strength, and the latest bounce is no exception. Jelle believes this reaction confirms the uptrend remains intact, with conditions aligning for a breakout. “The trend is up—new all-time highs are very much on the menu this week,” Jelle noted, emphasizing the importance of sustained momentum above current resistance. If Bitcoin can close decisively above $112K, it would likely ignite a surge in altcoins, many of which have lagged during BTC’s dominance-driven phase. With bulls maintaining control and technical support holding firm, the market is now watching for confirmation that Bitcoin is ready to enter price discovery once again. A successful breakout could mark the beginning of the next major leg in the crypto cycle. Related Reading: Tron Shows Adoption Strength As Volume Still Led By Big Transfers – Details BTC Tests Resistance Again After Volatile Bounce Bitcoin is once again pushing toward the critical $109,300 resistance level after bouncing strongly from the $105,000 support zone. The 12-hour chart shows a series of failed breakouts above the $109K level in recent weeks, highlighting the strength of this resistance zone. However, bulls have continued to defend higher lows, maintaining overall market structure and preventing deeper corrections. The latest candle shows a 1.93% surge, reclaiming the 50- and 100-period moving averages around $106,000, a key short-term cluster that previously acted as support. Volume also picked up during this bounce, suggesting renewed buying interest as Bitcoin tries to establish bullish momentum. Related Reading: Strong Ethereum Accumulation Detected: LTH Buying Heavy During June Consolidation Still, the rejection just below $109,300 remains a concern. If BTC fails to break and close above this range soon, the risk of a return to the $103,600 demand zone increases, especially in the face of rising volatility and profit-taking across the network. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "The ‘MicroStrategy’ Of Ethereum Emerges: Tom Lee And Joe Lubin Raise $675M To Stack ETH",
      "link": "https://www.newsbtc.com/news/ethereum/the-microstrategy-of-ethereum/",
      "summary": "The ‘MicroStrategy’ of Ethereum has emerged, with Fundstrat’s Tom Lee and Joe Lubin making moves to advance their respective ETH treasuries. Tom Lee has emerged as the Chairman of BitMine, which will hold ETH, while Lubin is already the Chairman of SharpLink Gaming. Lee and Lubin Raise $675 Million for Ethereum Treasury Strategy Tom Lee and Joe Lubin have already advanced their plans to create the ‘MicroStrategy’ of Ethereum. On Tom Lee’s end, BitMine announced a $250 million private placement to raise capital for its Ethereum strategy. The Bitcoin mining company stated that the net proceeds of the offering will be used to acquire ETH, which will become the firm’s primary reserve asset. Related Reading: Crypto Analyst Predicts $10,000 ATH For Ethereum This Cycle, Here’s Why BitMine plans to close this private placement on or about July 3, as it aims to become one of the largest publicly traded ETH holders with Tom Lee as the Chairman of the Board. On the other hand, SharpLink Gaming, with Joe Lubin’s help, is already the largest publicly traded Ethereum holder. The company earlier launched its Ethereum treasury with a $425 million ETH purchase. SharpLink Gaming recently announced that it has increased its total ETH holdings to 198,167 ($475 million), further establishing its position as the ‘MicroStrategy’ of Ethereum. Between June 23 and 30, it acquired 9,468 ETH for $22.8 million at an average price of $2,411 per ETH. During that same period, SharpLink Gaming also raised an additional $24.4 million through its At-The-Market (ATM) facility, selling $2.5 million shares. The company revealed that most of the proceeds will go toward further Ethereum acquisitions. As of June 30th, 100% of its ETH is staked, and the firm has earned 222 ETH in rewards since it began an ETH treasury company. Plans To Mirror Saylor’s Strategy In an X post, crypto commentator Eric Conner commented on how Ethereum is getting its own MicroStrategy era thanks to Lee and Lubin’s experiments. He highlighted BitMine’s proposed KPI of ‘ETH per share,’ which mirrors Saylor’s playbook, except that ETH earns yield in this instance through staking. Related Reading: These Companies Are Following Saylor’s Strategy Into The Bitcoin Battleground With Over $2 Billion Slated To Buy BTC Conner further remarked that BitMine’s mining DNA lets it spin up validators and tap DeFi rails, turning a once-capital-intensive operation into a cash-flow engine secured by Ethereum. On the other hand, he noted that Joe Lubin and SharpLink Gaming’s move is bigger. SharpLink is already staking its ETH holdings and plans to explore other DeFi strategies. With this move, the crypto commentator declared that ETH becomes the reserve while yielding bankroll growth. Lubin also recently raised the possibility of adding leverage to SharpLink Gaming’s Ethereum strategy, which will mirror Saylor’s strategy. He stated that they may do convertible equity and issue bonds at low rates, without putting the strategy at risk. At the time of writing, the Ethereum price is trading at around $2,444, down in the last 24 hours, according to data from CoinMarketCap. Featured image from iStock, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "H100 Group Increases Bitcoin Holdings With New Bitcoin Purchase",
      "link": "https://bitcoinmagazine.com/news/h100-group-increases-bitcoin-holdings-with-new-bitcoin-purchase",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/H100-Group-Increases-Bitcoin-Holdings-With-New-Bitcoin-Purchase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/h100-group-increases-bitcoin-holdings-with-new-bitcoin-purchase\" rel=\"nofollow\"> </a></p> <p>Swedish firm purchases 47.33 BTC, bringing total holdings to 247.54 BTC.</p> <p>"
    },
    {
      "title": "Bitcoin Mining Has Huge Role In Energy Production Expansion",
      "link": "https://bitcoinmagazine.com/bitcoin-mining/bitcoin-mining-has-huge-role-in-energy-production-expansion",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Power-Grid-and-Mining.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bitcoin-mining/bitcoin-mining-has-huge-role-in-energy-production-expansion\" rel=\"nofollow\"> </a></p> <p>The most beneficial aspect of bitcoin mining is the most important for electric utilities, and the most overlooked.</p> <p>"
    },
    {
      "title": "BlackRock’s Bitcoin ETF Drives More Revenue Than Its S&P 500 Fund",
      "link": "https://bitcoinmagazine.com/news/blackrocks-bitcoin-etf-drives-more-revenue-than-its-sp-500-fund",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/BlackRocks-Bitcoin-ETF-Drives-More-Revenue-Than-Its-SP-500-Fund-1.png\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blackrocks-bitcoin-etf-drives-more-revenue-than-its-sp-500-fund\" rel=\"nofollow\">BlackRock’s Bitcoin ETF Drives More Revenue Than Its S&amp;P 500 Fund</a></p> <p>The 18 month old iShares Bitcoin Trust (IBIT) has surpassed BlackRock’s S&#038;P 500 ETF in annual fee revenue.</p> <p>"
    },
    {
      "title": "Investment Holding Company Belgravia Hartford Capital Completes Fourth Bitcoin Acquisition",
      "link": "https://bitcoinmagazine.com/news/investment-holding-company-belgravia-hartford-capital-completes-fourth-bitcoin-acquisition",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Investment-Holding-Company-Belgravia-Hartford-Capital-Makes-First-Bitcoin-Purchase-as-Part-of-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/investment-holding-company-belgravia-hartford-capital-completes-fourth-bitcoin-acquisition\" rel=\"nofollow\"> </a></p> <p>Company now holds 15.75 BTC worth $1.66 million, funded through a $5 million facility from Round13 Digital Asset Fund to support its long term Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Tech Billionaires Launch Erebor Bank to Serve Bitcoin and Crypto Startups",
      "link": "https://bitcoinmagazine.com/news/tech-billionaires-launch-erebor-bank-to-serve-bitcoin-and-crypto-startups",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Tech-Billionaires-Launch-Erebor-Bank-to-Serve-Bitcoin-and-Crypto-Startups.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/tech-billionaires-launch-erebor-bank-to-serve-bitcoin-and-crypto-startups\" rel=\"nofollow\"> </a></p> <p>Backed by Palmer Luckey, Joe Lonsdale, and Peter Thiel, Erebor aims to become the U.S. bank for digital currencies, AI, defence and manufacturing.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "SEC Hits Pause on Grayscale's XRP, Solana and Cardano ETF Conversion",
      "link": "https://decrypt.co/328305/sec-pause-grayscale-xrp-solana-cardano-etf-conversion",
      "summary": "Though the agency greenlit the partially altcoin-exposed ETF this week, it also paused the approval until further notice."
    },
    {
      "title": "This App Alerts You to ICE Raids—Now Trump's DOJ Wants It Gone",
      "link": "https://decrypt.co/328233/app-alerts-you-ice-raids-trump-doj-wants-gone",
      "summary": "ICE-tracking app ICEBlock has sparked backlash from the DOJ and DHS, along with legal threats over federal agents' safety concerns."
    },
    {
      "title": "Solana Treasury Firm DeFi Development Corp. Boosts Convertible Notes Offering to $112 Million",
      "link": "https://decrypt.co/328281/solana-treasury-firm-defi-dev-boosts-convertible-notes-offering",
      "summary": "Shares of DeFi Development Corp. (DFDV) finished the day down by 3% following its upsized convertible notes offering to buy more Solana."
    },
    {
      "title": "Crypto Billionaire Bit Off Attacker’s Finger in Attempted Kidnapping: Report",
      "link": "https://decrypt.co/328268/crypto-billionaire-bit-off-attackers-finger-attempted-kidnapping",
      "summary": "Billionaire investor and entrepreneur Tim Heath shared his experience amid a growing trend of “wrench attacks” against crypto holders."
    },
    {
      "title": "Bitcoin and Ethereum Bounce, But This Meme Coin Is Stealing the Show: Analysis",
      "link": "https://decrypt.co/328232/bitcoin-ethereum-price-bounce-meme-coin-analysis",
      "summary": "Bitcoin and Ethereum prices are showing signs of life, but for traders with high-risk appetites, an underdog meme coin is flashing bullish signs."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "OpenAI denies involvement in Robinhood’s tokenized equity launch on Arbitrum",
      "link": "https://cryptobriefing.com/tokenized-equity-launch-arbitrum/",
      "summary": "<p>OpenAI's disavowal highlights potential regulatory and trust challenges in the burgeoning tokenized equity market on blockchain platforms.</p> <p>"
    },
    {
      "title": "SEC delays Grayscale’s large-cap crypto ETF launch despite approval order",
      "link": "https://cryptobriefing.com/grayscale-crypto-etf-sec-approval/",
      "summary": "<p>The SEC's delay highlights regulatory caution, potentially impacting the timeline for broader crypto ETF adoption and market integration.</p> <p>"
    },
    {
      "title": "Ripple applies for US banking license, eyes mainstream finance",
      "link": "https://cryptobriefing.com/crypto-banking-license-ripple/",
      "summary": "<p>Ripple's banking license bid signals a potential shift towards deeper integration of crypto into mainstream finance amid evolving regulations.</p> <p>"
    },
    {
      "title": "Ripple CEO denies ties with investment platform Linqto amid fraud probe, bankruptcy concerns",
      "link": "https://cryptobriefing.com/ripple-linqto-relationship-fraud-probe/",
      "summary": "<p>The situation highlights the risks of secondary market investments and underscores the need for stringent regulatory oversight to protect investors.</p> <p>"
    },
    {
      "title": "Coinbase acquires web3 startup Liquifi after $2.9B Deribit deal",
      "link": "https://cryptobriefing.com/token-management-services-coinbase-liquifi/",
      "summary": "<p>Coinbase's acquisition of Liquifi could significantly streamline token management, enhancing blockchain project efficiency and compliance.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Arizona Governor blocks bill to create crypto reserve fund from seized assets – Here’s why",
      "link": "https://ambcrypto.com/arizona-governor-blocks-bill-to-create-crypto-reserve-fund-from-seized-assets-heres-why/",
      "summary": "<img alt=\"Arizona Governor blocks bill to create crypto reserve fund from seized assets - Here’s why\" class=\"attachment-full size-full wp-post-image\" height=\"648\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Arizona-govt.-vetoed-HB-2324.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1152\" />Other U.S. states like Texas and New Hampshire have taken more assertive steps with Bitcoin reserves."
    },
    {
      "title": "TRX revenue hits 4-year low as $185 mln exits TRON – Is a deeper dump underway?",
      "link": "https://ambcrypto.com/trx-revenue-hits-4-year-low-as-185-mln-exits-tron-is-a-deeper-dump-underway/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/E7F125EF-7852-4D41-90FD-1BD50C6DB090.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TRON activity remains sluggish and could negatively impact the token's price."
    },
    {
      "title": "MicroStrategy-led public firms outpace ETFs in BTC buys: What it means for Bitcoin",
      "link": "https://ambcrypto.com/microstrategy-led-public-firms-outpace-etfs-in-btc-buys-what-it-means-for-bitcoin/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/BitcoinFIIII.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BTC price momentum has weakened into Q3 despite massive demand from public companies in H1."
    },
    {
      "title": "Solana’s on-chain strength vs. a bearish SOL: What does the future hold?",
      "link": "https://ambcrypto.com/solanas-rising-on-chain-metrics-vs-a-bearish-sol-what-does-the-future-hold/",
      "summary": "<img alt=\"Solana’s rising on-chain metrics vs. a bearish SOL: What does the future hold?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />While the market sleeps on Solana, smart money is rotating in."
    },
    {
      "title": "Arbitrum jumps 5% on Robinhood news – But THIS can ruin ARB’s breakout",
      "link": "https://ambcrypto.com/arbitrum-jumps-5-on-robinhood-news-but-what-can-ruin-arbs-breakout/",
      "summary": "<img alt=\"Arbitrum jumps 5% on Robinhood news - But what can ruin ARB&#039;s breakout\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-02T143856.606_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Robinhood’s ARB adoption, $2.2M outflows, and a chart breakout—will ARB hit $0.50 next?"
    }
  ]
}