{
  "CoinDesk": [
    {
      "title": "Chart of the Week: Wall Street Has Claimed Bitcoin—Now What?",
      "link": "https://www.coindesk.com/markets/2025/07/06/chart-of-the-week-wall-street-has-claimed-bitcoin-now-what",
      "summary": ""
    },
    {
      "title": "Ethereum Touted as ‘Foundational Layer for Global Finance’ by Firm With $500M ETH Bet",
      "link": "https://www.coindesk.com/markets/2025/07/05/ethereum-touted-as-foundational-layer-for-global-finance-by-firm-with-usd500m-eth-bet",
      "summary": ""
    },
    {
      "title": "Crypto, Cash, and Condos: Singapore Ends $2.2B Laundering Case With Fines",
      "link": "https://www.coindesk.com/policy/2025/07/05/crypto-cash-and-condos-singapore-ends-22b-laundering-case-with-fines",
      "summary": ""
    },
    {
      "title": "Bitcoin Cash Rally Accelerates on Whale Activity and Bullish Technical Signals",
      "link": "https://www.coindesk.com/markets/2025/07/05/bitcoin-cash-rally-accelerates-on-whale-activity-and-bullish-technical-signals",
      "summary": ""
    },
    {
      "title": "U.S. Exceptionalism Is Alive and Well as Nasdaq Outperforms Global Peers: Macro Markets",
      "link": "https://www.coindesk.com/markets/2025/07/05/the-u-s-exceptionalism-is-alive-and-well-as-nasdaq-outperforms-global-peers-macro-markets",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin &#039;cup and handle&#039; breakout gives $230K target as SOL eyes 2800% gain",
      "link": "https://cointelegraph.com/news/bitcoin-cup-and-handle-breakout-230k-target-sol-2800-gain?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2RmYmEtOTkwOS03MWYxLWJkNDYtYzdkMGY3N2IzMWZi.jpg\" /></p><p>Bitcoin and Solana are in for astronomical upside if they both complete a cup and handle breakout pattern, monthly chart analysis concludes.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Vitalik proposes gas cap to enhance Ethereum security, stability",
      "link": "https://cointelegraph.com/news/vitalik-ethereum-gas-cap-eip-7983?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDdhNjItMWY1Ny03YmZhLWJmZjYtNWZmMjA2YzIxZWYz.jpg\" /></p><p>Vitalik Buterin proposes EIP-7983 to cap transaction gas at 16.77 million, aiming to boost Ethereum security, stability, and zkVM compatibility.</p>"
    },
    {
      "title": "TON offers 10-year UAE golden visa for $100K in staked Toncoin",
      "link": "https://cointelegraph.com/news/toncoin-uae-golden-visa-staking-offer?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2RmNTMtMTU1My03MTk5LWE1NWEtNjcwNGYwZDQ5OTcw.jpg\" /></p><p>TON launches UAE Golden Visa program requiring just $100,000 in staked TON, cutting the usual entry cost by 80%.</p>"
    },
    {
      "title": "Secret Service seizes $400M in crypto, cold wallet among world’s largest",
      "link": "https://cointelegraph.com/news/secret-service-seizes-400m-crypto-cold-wallet?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2RlODQtNmJmMi03MzQzLTllZGMtZWE0YTczYzM5MDVm.jpg\" /></p><p>Secret Service quietly amasses one of the world’s largest crypto cold wallets with $400 million seized, exposing scams through blockchain sleuthing and VPN missteps.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Mainland China chipmaking capacity set to outpace Taiwan by 2030",
      "link": "https://cryptoslate.com/mainland-china-chipmaking-capacity-set-to-outpace-taiwan-by-2030/",
      "summary": "<p>Mainland China chipmaking capacity is accelerating, now poised to become the world’s leading semiconductor foundry hub by 2030, and overtaking Taiwan in total capacity, according to the latest projections from Yole Group. Chinese dominance in this field is fueled by the country’s push to manufacture its own tech as U.S. export restrictions continue to ramp [&#8230;]</p> <p>"
    },
    {
      "title": "Suspicion surrounds mysterious $8.6 billion Bitcoin move",
      "link": "https://cryptoslate.com/suspicion-surrounds-mysterious-8-6-billion-bitcoin-move/",
      "summary": "<p>Conor Grogan, Head of Product at Coinbase, believes that there is a “small possibility” that the transfer of $8.6 billion worth of Bitcoin (BTC) on July 4 was a hack. Calling his claim “extreme speculation” in an X post on Friday, Grogan said he found the transaction movements to be “extremely odd.” He added: “If [&#8230;]</p> <p>"
    },
    {
      "title": "Why loyalty is becoming web3 gaming’s next essential layer",
      "link": "https://cryptoslate.com/why-loyalty-is-becoming-web3-gamings-next-essential-layer/",
      "summary": "<p>The following is a guest post and opinion of Neil Mullins, CEO at Mojito Web3 gaming is growing rapidly, but loyalty systems haven’t kept pace. In the last year, blockchain gaming didn’t just grow: it leveled up. According to the 2024 DappRadar Games Report, the space hit 7.4 million daily active wallets and added over [&#8230;]</p> <p>"
    },
    {
      "title": "DeFi Is outpacing Bitcoin’s maximalist mindset",
      "link": "https://cryptoslate.com/defi-is-outpacing-bitcoins-maximalist-mindset/",
      "summary": "<p>The following is a guest post and opinion of Jeff Garzik, Co-founder of Hemi Labs. Ever since Bitcoin stopped being the one and only crypto, a group of its stalwart devotees emerged called “Bitcoin maximalists,” arguing that BTC is the only “true” digital asset. As the crypto industry moves toward all-pervading decentralized finance (DeFi) interoperability, [&#8230;]</p> <p>"
    },
    {
      "title": "U.S. House of Representatives declares July 14th “Crypto Week”",
      "link": "https://cryptoslate.com/u-s-house-of-representatives-declares-july-14th-crypto-week/",
      "summary": "<p>The U.S. House of Representatives has designated the week starting July 14 as “Crypto Week,” as lawmakers consider three landmark bills: the CLARITY Act, the Anti-CBDC Surveillance State Act, and the Senate’s GENIUS Act, in a comprehensive push to establish the United States as a global leader in digital assets. Prominent crypto trader and influencer [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Must Hold $106,000 And $98,000 To Avoid Breakdown",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-must-hold-106000-and-98000-to-avoid-breakdown/",
      "summary": "Bitcoin is currently holding just above the $108,000 level and bulls are maintaining momentum after a volatile start to July. However, a closer look at on-chain data shows how fragile that position might be. Interestingly, two support levels, $106,738 and $98,566, are now the most important zones for bulls to defend. These levels represent clusters of addresses holding large amounts of Bitcoin, and losing them could trigger a deeper correction. Related Reading: XRP’s Time Is Now, Says Pundit—Don’t Snooze On The ‘Biggest Transfer Of Wealth’ Bitcoin’s Support Clusters Around $106,000 And $98,000 Taking to the social media platform X, crypto analyst Ali Martinez pointed to two major support levels based on data showing Bitcoin&#8217;s purchase clusters. This data is based on Sentora’s (previously IntoTheBlock) In/Out of the Money Around Price metric among addresses that bought Bitcoin close to the current price. As shown by the metric, the most important current zones of purchase are at $106,738 and $98,566. These two zones are where massive buying activity has occurred in the past few weeks, and they could act as support in case of a Bitcoin price crash. The first zone, between $104,982 and $108,190, contains 1.68 million addresses with a total volume of 1.28 million BTC at an average price of $106,738. Below the first zone, a larger group of 1.71 million addresses holds a greater volume of 1.25 million BTC within the price range of $95,248 to $98,566, with an average price of $98,566. As long as Bitcoin continues to trade above these levels, the ongoing rally could continue to push upward. However, if these pockets of demand are broken with enough selling pressure, the leading cryptocurrency could enter into an uncertain price zone with little buying interest to provide support. Speaking of selling pressure, on-chain data shows a slowing sell pressure among large holders. According to data from on-chain analytics platform Sentora, Bitcoin recorded its fifth straight week of net outflows from centralized exchanges. The past week alone saw more than $920 million worth of BTC moved into self-custody or institutional products, mostly Spot Bitcoin ETFs. Bitcoin Needs To Break Weekly Resistance For New Highs Even with solid demand zones beneath, Bitcoin’s path to new highs is not yet confirmed. Analyst Rekt Capital weighed in with his analysis, noting that Bitcoin is currently facing a strong weekly resistance band just under $109,000. Particularly, Bitcoin is at risk of a lower high structure on the weekly candlestick timeframe chart. Rekt Capital noted that a weekly close above the red horizontal resistance line must be achieved in order for Bitcoin to reclaim a more bullish stance. That resistance, which is currently around $108,890, is acting as a ceiling for Bitcoin’s upward rally. Related Reading: Dogecoin Social Surge: Rising Buzz And Network Use Spark New Interest As such, Bitcoin would need to make a weekly close above $108,890 to position itself for new all-time highs. Unless there is a convincing break of that level, the price action of Bitcoin could be erratic and susceptible to a retracement to $106,000. At the time of writing, Bitcoin is trading at $108,160. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Bitcoin’s True Value Is Higher Than $110,000, Expert Warns",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoins-true-value-is-higher-than-110000-expert-warns/",
      "summary": "Bitcoin’s climb past $110,000 this week has reignited a fresh round of bullish calls. Prices hit $110,150 on July 3 and traded a little past $108,000 level at last check, showing a small 0.41% dip in 24 hours but a 1.20% rise over seven days. Related Reading: Dogecoin Social Surge: Rising Buzz And Network Use Spark New Interest This steady move higher has drawn voices from social media, stirring debate on whether Bitcoin is truly underpriced or in danger of slipping back below key levels. Undervalued At $110K According to Altcoin Daily, Bitcoin at $110,000 is “undervalued,” with the analysts arguing there’s plenty of room to run. That bold claim has fans cheering, and some even dream of $1,000,000 down the road. Bitcoin at $110k is undervalued! [screenshot this] — Altcoin Daily (@AltcoinDaily) July 3, 2025 Other users have pushed back, asking what on‑chain data or metrics back up this view. They point out that until Bitcoin clears resistance at $110,500, a real breakout isn’t confirmed. Based on reports from market trackers, global liquidity is on the rise. Market observers picked up on that, saying more cash floating around can push Bitcoin higher. Rising liquidity often fuels big moves in risk assets. Still, traders keep an eye on futures funding rates and miner sell‑pressure, looking for clues if a pullback is brewing. Global Liquidity just hit a new ATH. Bitcoin will follow! pic.twitter.com/gH1Kl2D1Zw — Crypto Rover (@rovercrc) July 3, 2025 Mixed Views Online Some followers argue that inflation and new tariffs could dampen Bitcoin’s rally. Others note that central banks are still buying time before any rate hikes, which may give crypto another boost. The back‑and‑forth on social media reads like a mini war room, with short comments and deep threads floating around. Plenty of voices, but few hard answers. Past Bull Runs Altcoin Daily wasn’t shy about past calls either. Just days earlier, they said that once Bitcoin tops $150,000, investors would wish they’d bought more at lower prices. That kind of hindsight talk can be stirring, but it doesn’t change the here‑and‑now charts or the macro calendar. Exec Calls For Hedge Based on remarks by Matt Hougan, Chief Investment Officer at Bitwise, now could be a good time to buy Bitcoin. Hougan pointed to Ray Dalio’s warnings about US debt, which has swelled past $7 trillion in annual spending against $5 trillion in revenue. With each household on the hook for roughly $230,000, Dalio says holding Bitcoin can act as a hedge against future money‑print risks. Related Reading: Ethereum Network Awakens—Massive On-Chain Moves Signal What’s Coming Price Action On Crosshair Investors will be watching both price action and big‑picture events. A solid break above $110,500 might pull in more buyers. But if inflation surprises on the upside or tariffs hit harder, odds could shift quickly. For now, Bitcoin’s story is still unfolding—and the next few days could tell us a lot about where it’s headed. Featured image from Meta, chart from TradingView"
    },
    {
      "title": "Bitcoin Consolidation Continues: 2 Key Support Levels To Watch",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-consolidation-continues-2-key-support-levels-to-watch/",
      "summary": "Bitcoin (BTC) prices showed a sideways movement in the past day producing no significant changes. Following the recent rejection at the $110,000 price range, the maiden cryptocurrency failed to break out of a descending consolidatory channel; therefore, fears on the current status of the bull market remain intact. Amidst the current mood of uncertainty, prominent market analyst Ali Martinez has identified two important support levels in the advent of a price downturn. Related Reading: Bitcoin Investor Sentiment Back To ‘Very Bullish’ — What This Means On-Chain Data Reveals Strong Bitcoin Support At $106,500 And $98,500 In an X post on July 5, Ali Martinez shares a potentially impactful on-chain insight on the Bitcoin market. Using data from the In/Out Money Around Price (IOMAP) Chart from Sentora, the analyst shares that major support zones have emerged that could play a crucial role in shaping the BTC&#8217;s short-term price direction. The IOMAP chart analyzes Bitcoin wallet addresses and the average prices at which they acquired BTC, giving insights into potential zones of buying or selling pressure. Essentially, it shows where holders are currently in profit i.e. in the money&#8221; or at a loss i.e. out of the money. From the chart, it is observed that 1.68 million addresses bought 1.28 million BTC between $104,982 and $108,190, with an average acquisition price of $106,738. Historically, such large concentrations of buying activity tend to form strong support zones, as holders may defend their positions from slipping into loss. Therefore, this development makes the $106,700 range a formidable near-term support level. A second significant support level is identified in the $95,247 to $98,566 range, where 1.7 million addresses acquired 1.25 million BTC at an average price of $96,901. Should Bitcoin lose its footing above $106,000, this lower range would act as the next major cushion, potentially absorbing downward momentum. However, a decisive price close below $96,901 would confirm significant bearish intent by the Bitcoin market. Related Reading: Crypto Market Cap On Track To $4.5 Trillion As Q3 Unfolds – Details Bitcoin Market Overview According to data from the IOMAP chart, around 89.36% of all BTC addresses are “in the money,” meaning their holdings were purchased at a lower price than the current market value. This is generally considered a bullish signal, suggesting the majority of market participants are in profit and thus less pressured to sell. Meanwhile, only 10.36% of addresses are “out of the money,” highlighting the relatively low risk of widespread panic selling, unless Bitcoin were to break below these critical levels highlighted above. At press time, the premier cryptocurrency continues to trade at $108,154 reflecting a 0.24% gain in the past day. Meanwhile, it&#8217;s daily trading volume is down by 27.09% and valued at $31.04 billion. Featured image from Pexels, chart from Tradingview"
    },
    {
      "title": "Altcoins Set A Higher Low – Bulls Target 2024 High To Trigger Altseason",
      "link": "https://www.newsbtc.com/altcoin/altcoins-set-a-higher-low-bulls-target-2024-high-to-trigger-altseason/",
      "summary": "Altcoins have spent the past few years under the shadow of Bitcoin’s dominance, struggling to reclaim relevance as capital and attention largely concentrated on BTC. But the tide may be turning. Since April, the Total 2 — a metric representing the market capitalization of all cryptocurrencies excluding Bitcoin — has climbed 35%, signaling a potential shift in momentum toward altcoins. This recovery marks one of the strongest altcoin performances in recent years and has reignited hopes of a broader market expansion beyond Bitcoin. Related Reading: No Room For Bears: Bitcoin Bullish MACD, Monthly Close Fuel Bullish Outlook Top analyst Daan has weighed in on this development, highlighting a key technical formation: a higher low on the Total 2 chart during the recent market bounce. This structure is often seen as a bullish signal, suggesting that investors are stepping in to accumulate altcoins at increasingly higher price levels. If confirmed with a higher high in the coming days or weeks, this could mark the start of a sustainable altseason. As macroeconomic conditions stabilize and risk appetite returns, altcoins could see renewed interest from traders and investors. The next key test will be whether bulls can reclaim higher levels and flip the broader altcoin market structure definitively back to bullish. Altcoins Prepare For A Breakout Altcoins remain about 50% below their all-time highs, but bulls are setting the stage for what could be an expansive move in the coming weeks. After months of underperformance, the broader altcoin market is beginning to show early signs of structural recovery. Ethereum — the market’s leader among altcoins — has been consolidating between $2,400 and $2,700 since early May, and many analysts believe that a breakout in ETH could serve as the catalyst for a broader altcoin rally. Daan recently highlighted a key technical development: the Total 2 Altcoin Market Cap has made a higher low during the latest bounce, a structure that often precedes bullish continuation. This higher low suggests growing demand and reduced downside pressure, both of which are critical to establishing a sustainable uptrend. The key area to watch is the 2024 high setback in May. If bulls can push Total 2 above that level, it would confirm a higher high — the final piece needed to flip the high timeframe structure decisively back to bullish. That breakout would likely usher in renewed momentum across mid- and small-cap tokens, fueling what many hope will be the long-awaited altseason. For now, the market remains in a holding pattern, but signs of accumulation are growing stronger. If Ethereum can break out of its multi-month range, the altcoin market could rapidly reprice, erasing months of losses and opening the door to a new wave of capital rotation out of Bitcoin dominance. As long as key levels hold and risk appetite improves, the foundation is in place for altcoins to make a significant move higher. Related Reading: Solana Tests Rising Channel Support – Breakdown Could Send Price To $128.50 Level ETH/BTC Chart Signals Turning Point The ETH/BTC chart reveals a critical moment for the altcoin market. After a prolonged downtrend that began in late 2022, Ethereum has stabilized near the 0.023 BTC level, forming a potential bottom. While the pair remains well below the 50-week, 100-week, and 200-week moving averages—indicating continued bearish pressure—momentum appears to be shifting. Since bottoming out in mid-June, ETH/BTC has held its ground and is attempting to build a base, with early signs of accumulation. However, without a clear breakout above resistance zones, particularly around the 0.025–0.027 BTC range, bulls will struggle to confirm a trend reversal. A decisive move above these levels would be the first major confirmation of strength for Ethereum relative to Bitcoin. Related Reading: Ethereum Forms Rising Wedge Pattern – $2,200 Support Back In Focus? This breakout is essential for altseason. Historically, altcoin rallies are triggered when ETH outperforms BTC, drawing capital into mid- and small-cap tokens. Without ETH leading, altcoins tend to lag as Bitcoin dominance remains high. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "DOGE Bulls Hold The Line At $0.15 — Is The Rally Still Alive?",
      "link": "https://www.newsbtc.com/news/dogecoin/doge-bulls-hold-the-line-at-0-15-is-the-rally-still-alive/",
      "summary": "Dogecoin (DOGE) prices have crashed by over 4% in the past month indicating a slightly dominant bearish influence in recent weeks. Similar to the crypto market leader (Bitcoin), the prominent altcoin and memecoin has registered significant market corrections since attaining a local peak of $0.249 on May 22. However, recent revelations by top analyst Ali Martinez has shown a bullish market condition that supports a price rebound for the DOGE market. Related Reading: Analyst Shares Bitcoin Cheat Sheet Showing When The Bull Run Begins DOGE Bulls Eye Return To $0.22 In an X post on July 5, Martinez provides some technical insights into the DOGE market highlighting an important requisite for the altcoin to rediscover its bullish form. Using the daily trading DOGEUSDT chart, the renowned analyst identifies an ascending trendline that stretches to 2023. At multiple instances of a retest, this trendline has acted as an efficient support consistently rejecting a further price decline. According to Martinez&#8217;s analysis, Dogecoin is trading around this trendline which presently runs through the $0.150 price level. The analyst explains market bulls must defend this price zone which not only fuels the chances of a price rebound, but essentially prevents a breakdown and complete transition to a bearish market. Interestingly, all retest of the highlighted trendline has always produced a price bounce resulting in a parabolic rally. This event is seen in price surges of $0.059 to $0.210 (≈255% gain) between 2023-2024, and $0.095 to $0.470 (≈395%) in 2024. However, Ali Martinez presents a conservative price target, stating a defence of $0.15 support level supports a quick bullish return to at least $0.220. Nevertheless, in the presence of a strong bullish pressure as seen in previous rallies, DOGE investors may expect a further rise to around $0.24 with a potential to return to the local market peak of $0.47. Related Reading: Litecoin Fate Tied To Bitcoin – Will $96 Resistance Crack? DOGE Price Overview At the time of writing, DOGE trades at $0.164 reflecting a modest price gain of 0.91% and 0.56% on the daily chart and weekly chart, respectively. Meanwhile, the memecoin has recorded a 56.81% crash in its daily trading volume indicating a significant fall in market interest. According to data from price prediction site Coincodex, general sentiment in the DOGE market is bearish. However, investors retain an healthy market demand as evidenced by a Fear &#38; Greed Index of 67 i.e. significant amount of greed. For the short-term, Coincodex analysts expects DOGE to still maintain a price around $0.160 in the next five days while projecting a price gain to $0.193 in a month. Meanwhile, their long-term forecasts show little expected price growth in the far future as indicated by price targets of $0.197 in three months, and $0.169 in six months. Featured image from Pexels, chart from Tradingview"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Treasury Companies Are Bubbles",
      "link": "https://bitcoinmagazine.com/bigread/the-bitcoin-treasury-companies-bubble",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/BM-Big-Read-07-04-25.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bigread/the-bitcoin-treasury-companies-bubble\" rel=\"nofollow\"> </a></p> <p>BM Big Read: You are the yield that the bitcoin treasury companies are chasing. Their earnings stem not from revenue but from new investors.</p> <p>"
    },
    {
      "title": "Why Liquidity Matters More Than Ever For Bitcoin",
      "link": "https://bitcoinmagazine.com/markets/why-liquidity-matters-for-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Why-Liquidity-Matters-More-Than-Ever-For-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/why-liquidity-matters-for-bitcoin\" rel=\"nofollow\"> </a></p> <p>Global M2 vs. BTC: A key chart showing how liquidity drives Bitcoin's price, with historical rallies tied to M2 expansions.</p> <p>"
    },
    {
      "title": "Senator Lummis’ New Bill Enables Tax-Exempt Bitcoin Spending — But Thresholds Are Too Low",
      "link": "https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Senator-Lummis-at-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start\" rel=\"nofollow\"> </a></p> <p>Long-time Bitcoin advocate Senator Cynthia Lummis (R-WY) has drafted a bill that allows Bitcoin enthusiasts to spend small amounts of bitcoin without incurring capital gains taxes (which is very cool), but many — including myself — feel that the spending limits in the bill are too low.</p> <p>"
    },
    {
      "title": "Senator Lummis Introduces Digital Asset Tax Legislation",
      "link": "https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/US-Senator-Cynthia-Lummis-Discusses-Bitcoin-Reserve-Stablecoin-Legislation-and-Market-Structure-Bill-at-Bitcoin-2025-Conference.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation\" rel=\"nofollow\"> </a></p> <p>The bill proposes a $300 exemption for small Bitcoin and crypto transactions, defers taxes on mining and staking until assets are sold.</p> <p>"
    },
    {
      "title": "Bitcoin Miner Riot Produces 450 Bitcoin In June",
      "link": "https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Miner-Riot-Produces-450-Bitcoin-In-June.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june\" rel=\"nofollow\"> </a></p> <p>The company saw a 76% year-over-year increase in production, earned $5.6 million in power credits, and ended the month holding 19,273 Bitcoin.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Gold Explorer Joins Bitcoin Treasury Bandwagon",
      "link": "https://decrypt.co/328707/gold-explorer-joins-bitcoin-treasury-bandwagon",
      "summary": "The early-stage gold explorer’s Bitcoin reserve strategy has become a familiar playbook among financially pressured firms."
    },
    {
      "title": "Bitcoin Dives on OG Whale FUD, But Charts Remain Bullish: Analysis",
      "link": "https://decrypt.co/328731/bitcoin-price-dives-og-whale-fud-charts-bullish-analysis",
      "summary": "A dormant Bitcoin whale woke up and chose violence—by spooking skittish BTC traders with an $8 billion move. The charts though? They tell a different story."
    },
    {
      "title": "Russian Arms Maker Wants Its Own Stablecoin Too—On Tron",
      "link": "https://decrypt.co/328715/russia-military-rostec-stablecoin-tron",
      "summary": "Russian state-owned manufacturing firm Rostec has said it will roll out a ruble-pegged token called RUBx on Tron. And a payments platform to boot."
    },
    {
      "title": "Another Solo Bitcoin Miner Beats the Odds, Winning $350K Jackpot",
      "link": "https://decrypt.co/328699/solo-bitcoin-miner-beats-odds-350k-jackpot",
      "summary": "The lucky solo Bitcoin miner processed a block with a reward of 3.137 BTC, or $349,028, late Thursday night."
    },
    {
      "title": "How a Hacker Spent Only $2.7K to Steal $140 Million From Brazilian Banks",
      "link": "https://decrypt.co/328700/hacker-spent-2k-steal-140-million-brazil-central-bank",
      "summary": "The hackers laundered roughly $40 million worth of the stolen funds using Bitcoin, Ethereum, and Tether, according to a blockchain investigator."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "TON introduces UAE Golden Visa program through crypto staking, Toncoin soars 13%",
      "link": "https://cryptobriefing.com/ton-golden-visa-uae-crypto/",
      "summary": "<p>TON's crypto-based UAE Golden Visa program could revolutionize residency pathways, enhancing digital asset utility and global mobility options.</p> <p>"
    },
    {
      "title": "Elon Musk declares ‘America Party’ is born after Trump enacts $3.3 trillion bill",
      "link": "https://cryptobriefing.com/america-party-musk-announcement/",
      "summary": "<p>Musk's \"America Party\" proposal highlights growing dissatisfaction with the two-party system, potentially reshaping U.S. political dynamics.</p> <p>"
    },
    {
      "title": "Dormant Bitcoin whale activates after 14 years and moves 60,000 BTC",
      "link": "https://cryptobriefing.com/ancient-bitcoin-whale-movement/",
      "summary": "<p>The reactivation of dormant Bitcoin could signal market volatility or strategic repositioning, impacting investor sentiment and market dynamics.</p> <p>"
    },
    {
      "title": "Russia’s military-industrial powerhouse Rostec to launch ruble-backed token on Tron",
      "link": "https://cryptobriefing.com/ruble-backed-token-rostec-tron/",
      "summary": "<p>Rostec's ruble-backed token on Tron could enhance Russia's digital finance landscape, fostering innovation and integration with global systems.</p> <p>"
    },
    {
      "title": "cheqd and ASI Alliance team up to address AI identity crisis with verifiable credentials",
      "link": "https://cryptobriefing.com/cryptographic-verification-ai-impersonation/",
      "summary": "<p>The collaboration could significantly enhance trust and security in AI systems, mitigating risks of fraud and manipulation in a rapidly growing market.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Hyperliquid’s price struggles as whale offloads 215K HYPE: Is a drop coming?",
      "link": "https://ambcrypto.com/hyperliquids-price-struggles-as-whale-offloads-215k-hype-is-a-drop-coming/",
      "summary": "<img alt=\"Hyperliquid&#039;s price struggles as whale offloads 215K HYPE: Is a drop coming?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-30.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />How low does HYPE need to fall before bargain hunters step in again?"
    },
    {
      "title": "Toncoin explodes 12% in 2 hours on the back of UAE’s Golden Visa rules",
      "link": "https://ambcrypto.com/toncoin-explodes-12-in-2-hours-on-the-back-of-uaes-golden-visa-rules/",
      "summary": "<img alt=\"Toncoin explodes 12% in 2 hours on the back of UAE&#039;s Golden Visa rules\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Toncoin-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Repeated retests of the $2.7 support over the past month failed to drive prices lower, showing bullish resilience."
    },
    {
      "title": "Inside Ethereum’s hidden liquidity imbalance that can break its economic model",
      "link": "https://ambcrypto.com/inside-ethereums-hidden-liquidity-imbalance-that-can-break-its-economic-model/",
      "summary": "<img alt=\"Inside Ethereum&#039;s hidden liquidity imbalance that can break its economic model\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika-1-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />When stablecoins call the shots, Ethereum’s decentralization becomes structurally compromised."
    },
    {
      "title": "‘I hope Bitcoin crashes’ – Why Robert Kiyosaki wants a BTC spiral",
      "link": "https://ambcrypto.com/i-hope-bitcoin-crashes-why-robert-kiyosaki-wants-a-btc-spiral/",
      "summary": "<img alt=\"&#039;I hope Bitcoin crashes&#039; - Why Robert Kiyosaki wants a BTC spiral\" class=\"attachment-full size-full wp-post-image\" height=\"972\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Kiyosaki-predicting-a-BTC-crash.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1728\" />Kiyosaki wants a crash. On-chain data says strength. Will Bitcoin's next move crush the skeptics?"
    },
    {
      "title": "Binance stacks Ethereum at yearly high, U.S. funds buy more: So why isn’t ETH moving?",
      "link": "https://ambcrypto.com/binance-stacks-ethereum-at-yearly-high-u-s-funds-buy-more-so-why-isnt-eth-moving/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-8-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Binance is swimming in ETH, U.S. investors are buying big, and prices are barely budging - something’s got to give."
    }
  ]
}