{
  "CoinDesk": [
    {
      "title": "Hashed Research CEO Appointed Chief Policy Officer at Korea's Presidential Office",
      "link": "https://www.coindesk.com/policy/2025/06/06/hashed-research-ceo-appointed-chief-policy-officer-at-koreas-presidential-office",
      "summary": ""
    },
    {
      "title": "Billionaire Winklevoss Twins-Backed Exchange Gemini Files With SEC For Planned IPO",
      "link": "https://www.coindesk.com/business/2025/06/06/billionaire-winklevoss-twins-backed-exchange-gemini-files-with-sec-for-planned-ipo",
      "summary": ""
    },
    {
      "title": "Weekly Recap: Circle Scores Big on IPO Fever",
      "link": "https://www.coindesk.com/news-analysis/2025/06/06/circle-scores-big-on-ipo-fever",
      "summary": ""
    },
    {
      "title": "HIVE Digital Capacity Crosses 10 EH/s in May, Aims to More Than Double That by Year-End",
      "link": "https://www.coindesk.com/markets/2025/06/06/hive-digital-capacity-crosses-10-ehs-in-may-aims-to-more-than-double-that-by-year-end",
      "summary": ""
    },
    {
      "title": "House Dems Get Bonus Hearing on Crypto Market Structure, Assail Trump Conflicts",
      "link": "https://www.coindesk.com/policy/2025/06/06/house-dems-get-bonus-hearing-on-crypto-market-structure-assail-trump-conflicts",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Spot Ether ETFs 15-day inflow streak accumulates $837.5M inflows",
      "link": "https://cointelegraph.com/news/spot-ether-etfs-inflow-streak-large-portion-net-flows?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTg2YTQtMmE0My03ODA2LWE3N2EtMmNjOGQzNjk2ZmJi.jpg\" /></p><p>The current streak of three consecutive trading weeks of inflows has accounted for approximately 25% of the total net inflows since the spot Ether ETFs launched in July 2024.</p>"
    },
    {
      "title": "‘Full porting Bitcoin’ could be Musk&#039;s Trump card in feud: Bitcoiners",
      "link": "https://cointelegraph.com/news/full-porting-bitcoin-could-be-musk-s-trump-card-in-feud-bitcoiners?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTIzZjYtZjFiOS03ODgxLWEzM2UtMmZkNTVjMjE1YTJi.jpg\" /></p><p>JAN3 founder Samson Mow says Elon Musk should go all in on Bitcoin before “they freeze his fiat assets.”</p>"
    },
    {
      "title": "TRUMP memecoin ‘hasn’t pumped’ after Eric Trump says WLF will buy big stack",
      "link": "https://cointelegraph.com/news/official-trump-memecoin-price-eric-trump-world-liberty-financial?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ3YzEtMGRkZS03MTBhLTg3MmYtNzliMmQ4N2ZkM2Q2.jpg\" /></p><p>The price of Official Trump coin briefly spiked 6% before pulling back, following Eric Trump saying the team \"remain focused on building the most exciting MEME on earth.\"</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Reality show to pit Twitch streamers against each other to win 1 BTC",
      "link": "https://cointelegraph.com/news/reality-show-twitch-streamers-win-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ5MWItNzI0ZS03ZWJmLWIxYzItYmM3ZDNmMGQyNTlj.jpg\" /></p><p>The series’ website issued a notice in May warning of a “fraudulent cryptocurrency scheme” using its branding to lure investors.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Song A Day creator recounts ‘tax nightmare’ after making millions from NFT sale",
      "link": "https://cryptoslate.com/song-a-day-creator-recounts-tax-nightmare-after-making-millions-from-nft-sale/",
      "summary": "<p>Singer-songwriter Jonathan Mann recently shared the story of how earning millions in Ethereum (ETH) during a one-hour sale of his NFTs eventually became a &#8220;tax nightmare.&#8221; Mann has published one song a day over the past 17 years and released his 6,000th song on June 5, which was about the purported nightmare resulting from the [&#8230;]</p> <p>"
    },
    {
      "title": "Trump–Musk feud becomes memecoin meta, leads to surge in trading volume",
      "link": "https://cryptoslate.com/trump-musk-feud-becomes-memecoin-meta-leads-to-surge-in-trading-volume/",
      "summary": "<p>President Donald Trump and Elon Musk&#8217;s fallout caused a major spikes in memecoin launches and trading, with the largest tokens by trading activity generating over $355 million in volume over the past 24 hours, according to DEX Screener data. As traders seized on the pair’s high-profile social media clash using Solana&#8217;s ecosystem, Official Trump (TRUMP) [&#8230;]</p> <p>"
    },
    {
      "title": "Eric Trump says WLFI will acquire TRUMP for treasury, unofficial wallet project nixed",
      "link": "https://cryptoslate.com/eric-trump-says-wlfi-will-acquire-trump-for-treasury-unofficial-wallet-project-nixed/",
      "summary": "<p>Eric Trump announced that World Liberty Financial, the DeFi platform linked to President Donald Trump and his family, will take a significant treasury stake in the Official TRUMP memecoin. He also confirmed that the controversial Trump-branded wallet recently unveiled by the team behind the memecoin would not continue development. Wallet project nixed The announcement comes [&#8230;]</p> <p>"
    },
    {
      "title": "Spot Ethereum ETFs post 14-day inflow run, lifting year-to-date haul above $3B",
      "link": "https://cryptoslate.com/spot-ethereum-etfs-post-14-day-inflow-run-lifting-year-to-date-haul-above-3b/",
      "summary": "<p>Spot Ethereum (ETH) exchange-traded funds (ETFs) notched a 14-session streak of net inflows as of June 5, fueled by investment advisors and hedge fund managers. According to Bloomberg data shared by ETF Store CEO Nate Geraci, Ethereum ETFs since May 20 added roughly $812 million. This movement resulted in total net inflows of over $3 [&#8230;]</p> <p>"
    },
    {
      "title": "Senator Lummis says new Fed vice chair appointment signals ‘brighter future’ for crypto",
      "link": "https://cryptoslate.com/senator-lummis-says-new-fed-vice-chair-appointment-signals-brighter-future-for-crypto/",
      "summary": "<p>US Senator Cynthia Lummis said the confirmation of Michelle “Miki” Bowman as Vice Chair for Supervision at the Federal Reserve marks a critical shift in the regulatory approach toward digital assets. According to Lummis, the appointment is a “turning point” for crypto policy, and she expects a &#8220;brighter future&#8221; for the industry ahead. The Senate [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Recovers From $100K Dip While On-Chain Data Shows Rising Miner Activity",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-recovers-from-100k-dip-while-on-chain-data-shows-rising-miner-activity/",
      "summary": "Bitcoin is showing signs of recovery after a brief but sharp dip triggered by recent market turbulence linked to public tensions between Donald Trump and Elon Musk. The price of BTC had dropped to nearly $100,000 during the height of the reaction, but has since rebounded. At the time of writing, Bitcoin is trading at $104,891, marking a steady recovery from the 24-hour low. While the broader crypto market continues to digest the fallout, new data suggests that another force, miner activity, is beginning to shape the near-term outlook. Related Reading: Bitcoin Pullback or Setup? On-Chain Metrics Hint at What’s Coming Next Bitcoin Surge in Miner Inflows Could Pressure Price Action According to on-chain analytics published by CryptoQuant contributor CryptoOnchain, Bitcoin miners have dramatically increased the volume of BTC transferred to exchanges. Between May 19 and May 28, miner-to-exchange inflows exceeded $1 billion per day, levels not seen in previous market cycles. These inflows are often viewed as a proxy for miners&#8217; intent to sell, which could influence short-term supply dynamics and introduce added volatility to BTC’s spot market performance. The rise in realized inflows from miners to exchanges is interpreted as a sign of growing sell-side pressure. Since miners are key liquidity providers in the Bitcoin ecosystem, large-scale transfers to exchanges are typically seen as preparations to offload BTC. Historically, spikes in miner outflows have preceded periods of downward price pressure, particularly when they occur alongside fragile market conditions. CryptoOnchain emphasizes that while miner selling isn’t inherently negative, it can impact short-term price stability. As a result, traders and investors often monitor these flows to better assess potential risks. When miner inflows surge, it reflects the sector’s sentiment regarding profitability, operational stress, or anticipated price changes. CryptoOnchain noted: Paying close attention to these inflows—especially during historical peaks like the current phase—can help with risk management and more informed trading decisions. Hash Ribbon Signal Suggests Longer-Term Opportunity Amid rising sell pressure, another indicator is flashing a potential opportunity. CryptoQuant analyst Darkfost noted that Bitcoin’s Hash Ribbons indicator, a metric derived from comparing 30-day and 60-day moving averages of network hashrate, has recently produced a new buy signal. This metric is used to evaluate miner stress and recovery phases, and is generally interpreted as a signal that miners have gone through a period of capitulation and are now stabilizing or recovering. This signal has historically aligned with favorable long-term entry points, except in unique events like China’s 2021 mining ban. While the short-term effects of mining stress may contribute to price weakness, analysts suggest that these periods often set the stage for longer-term rallies. When miner capitulation resolves, it can clear excess supply from the market and establish stronger support levels. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin To Hit $180,000 In 2025? Analyst Highlights The Trigger",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-to-hit-180000-in-2025-analyst-highlights-the-trigger/",
      "summary": "Bitcoin dipped to $103,450 yesterday, wiping out about $1 billion in leveraged bets over the past 24 hours. Many traders hurried to sell, but the fall was short-lived. Related Reading: Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge Bitcoin found its footing and climbed back to $104,400 by the time this report was filed. According to a recent analysis by crypto researcher Klarch, this pullback was expected and might just be a pit stop before another run to fresh highs. Recurring Cycle Patterns Based on examination by Klarch, Bitcoin tends to follow a familiar path after each halving. One year after the 2016 halving, it rose about 280%. After the 2020 halving, it jumped roughly 550% in 367 days. Right now, Bitcoin has only moved up around 70% in the 416 days since the last halving. Klarch points out that in past cycles, these numbers picked up speed after a slow start. So, he says, there’s still room for more growth. Bitcoin cycles are identical&#8230; &#8211; In 2016, $BTC grew by 280%, 365 days after Halving &#8211; In 2020, $BTC grew by 550%, 367 days after Halving &#8211; Now, 416 days post-Halving, $BTC +70% — growth ahead&#8230; History repeats, here’s $BTC’s near future🧵👇 pic.twitter.com/wshX4egwbC — Klarck (@0xklarck) June 5, 2025 These percentages matter because they hint at what might come next. If Bitcoin’s history repeats, the best gains could be just around the corner. Information from blockchain data supports this too. For example, trading volume and on-chain addresses hit new highs in recent weeks. That fits the pattern Klarch described—after the initial rise, there’s often a bigger rally. Signs Of The Next Surge Bitcoin set a record of $112,100 on January 20, then edged up to $111,980 on May 22. Rather than signaling an end, Klarch believes these milestones mark the start of a higher peak. He sees those moves as part of the cycle’s build-up, not its climax. Based on his chart work, each cycle has multiple tops before it finally tops out. Klarch didn’t offer an exact date for a new peak, but he did suggest that Bitcoin has not yet hit its ceiling. He notes that a series of all-time highs usually happens when sentiment is still turning positive. Once more traders feel FOMO, the price often accelerates rapidly. Related Reading: Bitcoin Network Activity Booming Despite A Quiet Market—Data Demand And Liquidity Driving Price Liquidity pouring into the crypto market has been a key talking point. Klarch says that steady buys from institutions and US Bitcoin spot ETFs have made Bitcoin scarcer on exchanges. Michael Saylor&#8217;s Strategy and other big money players keep buying, which pushes supply lower. Based on figures presented by Klarch, this trend could lift Bitcoin to around $180,000—a rise of about 75% from current levels. VanEck, an asset manager, has shared a similar target. That makes Klarch’s outlook feel less like a lone voice. If big funds keep moving in and retail interest stays high, Bitcoin’s price might stay on the upswing. However, any pause in ETF inflows or a sudden shift in global markets could change that story. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "XRP Must Crash First—Then Comes The $10 Rally, Says Analyst",
      "link": "https://www.newsbtc.com/xrp-news/xrp-must-crash-first-then-10-rally/",
      "summary": "Crypto Insight UK has doubled down on a forecast that XRP must endure one last, violent shakeout before launching toward a long-awaited $10 milestone. In his latest video, the British analyst warned that “the most dense liquidity I’ve seen in a long time for XRP” still sits uncollected beneath current spot prices. Until that pool is swept, he argues, the market will not unlock the upside move he ultimately expects to carry the token into double-digit territory. XRP Needs One Last Flush “XRP didn’t come down as low as we wanted,” he told viewers. “It did hit the first key area of liquidity, but it didn’t take it all. That makes me think we’ve got continued downside.” In his own trading plan, the analyst has resting bids at roughly $2.01 and $1.95—a zone he believes will be tested once leveraged longs capitulate. Only after that “final flush,” he contends, can a rally toward $10 begin in earnest. The call comes amid broader cross-asset strength that has so far failed to translate into a sustained altcoin breakout. Silver is challenging decade-old highs near $36 an ounce, uranium contracts are pressing their recent peaks, and the Nasdaq Composite remains within sight of its all-time high. Yet despite what he calls “a broad-based commodities rally,” the analyst maintains that crypto still needs one more washout to clear residual excess. Related Reading: What Happens To The XRP Price If The 2017 Fractal Plays Out Again? Macro-political drama, he suggests, is only accelerating that process. He cited the public clash between Elon Musk and US president Donald Trump—sparked by Trump’s proposal for a four-trillion-dollar spending bill and Musk’s claim that Trump’s name appears in sealed Epstein files—as a narrative that briefly rattled risk markets. “If it brings the price to where I want it to go, fantastic,” he said dryly. “That’s all we’re looking at here.” On Ethereum he sees a similar dynamic. Open interest in ETH futures remains at all-time highs, a sign in his view that institutions are accumulating spot while shorting derivatives to hedge—a trade that could unwind violently should ETH pierce the $2,800 level. “When we get this squeeze to the upside,” he predicted, “we’ll see a fast move back toward all-time highs for ETH, probably toward $4,500 before you know it.” Related Reading: The Worst Case For XRP This Cycle? Just A Giga Rally To $19, Says Analyst Bitcoin, for its part, has already waded into the analyst’s preferred liquidity zone just above $100,000. Whether the flagship asset needs another dip, he said, is less important than what happens to its dominance. A brief surge in bitcoin market share toward 65.5% would, in his model, coincide with an XRP capitulation and set the stage for “crazy season,” his shorthand for a full-blown altcoin cycle. The hinge is XRP liquidity. Viewers were shown heat-map snapshots highlighting concentrated stop-loss orders beneath the May swing low. “People came long here after they thought, ‘Oh, the bottom’s in.’ That’s added to this liquidity below us,” he said. Until that layer is removed, he remains “80% sure” that price will probe lower—even though his own portfolio is almost entirely in spot XRP. “I’m on the side of wanting it to go,” he acknowledged. “If it goes up now, I’m happy. But I’d be highly surprised if we don’t get that push down.” Still, his end-point is unequivocally bullish. Once the liquidity has been harvested, he foresees a textbook bullish divergence on the daily relative-strength index—“lower low on price, higher low on RSI”—that would ignite what he calls the “next big push.” In that scenario, XRP would not merely revisit its 2021 peak near $3.80; it would overshoot to the analyst’s long-standing $10 target. “Let it send,” he concluded. At press time, XRP traded at $2.17. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Sees Negative Funding On Binance – A Classic Setup For A Short Squeeze?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-sees-negative-funding-on-binance-a-classic-setup-for-a-short-squeeze/",
      "summary": "As political tensions between US President Donald Trump and Elon Musk escalated yesterday, the Bitcoin (BTC) market experienced a sharp shift in sentiment, with the funding rate on Binance flipping from positive to negative within hours. Bitcoin Funding Rates Turn Negative On Binance According to a CryptoQuant Quicktake post by contributor Darkfost, BTC funding rates on Binance have once again turned negative, even as the top cryptocurrency continues to trade above the $100,000 mark at the time of writing. Related Reading: Bitcoin Upward Momentum ‘Highly Likely’ To Continue, On-Chain Data Shows The analyst attributed the sudden reversal in funding &#8211; from +0.003 to -0.004 &#8211; to the public spat between Trump and Musk on social media. This rapid shift reflects growing fear among market participants amid heightened uncertainty. Following the sentiment shift, BTC fell from the mid-$100,000 range to a low of $100,984, according to CoinGecko. Over the past two weeks, the asset has declined by 4.1%. That said, the current dip may offer a prime buying opportunity to investors. If Bitcoin rebounds strongly, it could result in a strong resurgence in buying pressure, leading to a short squeeze that may propel BTC’s price further up. Darkfost highlighted that there have been three instances during the current market cycle when BTC witnessed such deep negative funding. Notably, each of these instances were followed by a strong upward move in the cryptocurrency. For example, on October 16, 2023, BTC dipped into negative funding territory before rallying from $28,000 to $73,000. A similar pattern played out on September 9, 2024, when the asset surged from $57,000 to $108,000. The most recent case was on May 2, 2025, when BTC jumped from $97,000 to a new all-time high (ATH) of $111,000. If history repeats, then the market may see a new ATH for BTC in the coming weeks. Darkfost noted: Such extreme readings often mark moments of maximum pessimism, precisely the kind of sentiment that can precede a strong bullish reversal when the short term negativity is gone. Large Investors Increase BTC Exposure Meanwhile, Bitcoin whales &#8211; wallets holding large amounts of BTC &#8211; continue to accumulate at a rapid pace. Notably, new whales have acquired BTC worth $63 billion, reflecting strong confidence in the asset’s near-term prospects. Related Reading: Bitcoin Hash Ribbons Indicating Prime Buying Opportunity, Analyst Says Supporting this bullish outlook, recent analysis by QCR Capital indicates that large investors expect BTC to surge to as high as $130,000 by the end of Q3 2025. Additionally, the realized cap held by long-term holders has surpassed $20 billion, reinforcing positive sentiment. That said, some analysts urge caution, expecting BTC to crash below $100,000 before resuming its bullish momentum. At press time, BTC trades at $104,069, down 0.5% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Traders Turn Bearish on Bitcoin Following High-Profile Political Tensions, Data Shows",
      "link": "https://www.newsbtc.com/bitcoin-news/traders-turn-bearish-on-bitcoin-following-high-profile-political-tensions-data-shows/",
      "summary": "Bitcoin (BTC) dropped sharply over the past 24 hours, nearing the $100,000 mark with an intraday low of $100,984. This price movement reflects increased volatility across the crypto market following a public exchange on social media between US President Donald Trump and Tesla CEO Elon Musk. Their clash appears to have triggered a wave of risk-off sentiment among traders. In response, the global crypto market cap slipped 4%, falling from over $3.4 trillion yesterday to $3.33 trillion. Meanwhile, the broader market correction has not gone unnoticed in derivatives data. Related Reading: Crypto Analyst Warns: This Bitcoin Bull Cycle Looks Nothing Like 2017 or 2021 Derivative Metrics Reveal Bearish Sentiment Spike According to CryptoQuant analyst Darkfost, the Binance net taker volume, a metric that measures the difference between aggressive longs and shorts, fell dramatically from $20 million to -$135 million in under eight hours. This signals a sharp pivot in sentiment, as traders rushed to hedge or speculate on downside risk in response to the unfolding news. Darkfost emphasized that this was the largest intraday net taker volume reversal observed on Binance this year. The abrupt shift reflects how quickly sentiment can change when macro-level narratives or influential figures dominate headlines. In this case, the market responded swiftly to perceived uncertainty, leading to a concentration of short positions and significant selling pressure. The situation also led to a notable change in BTC perpetual futures funding rates. Funding on Binance turned negative after briefly trending toward positive territory, dropping from +0.003 to below -0.004. This indicates that short sellers were willing to pay a premium to maintain bearish positions, underscoring rising fear and potentially overextended downside bets. 🔔When Funding rates turns negative. 🔹 Buying or considering a long position is often wise when funding rates turn highly negative, especially if the price starts to trend upward. This typically signals a disbelief sentiment among traders, creating strong contrarian… pic.twitter.com/LGyHU9uNNK — Darkfost (@Darkfost_Coc) June 6, 2025 Bitcoin Past Patterns Suggest Potential for Reversal Historically, deeply negative funding rates have been followed by strong recoveries in Bitcoin’s price. Darkfost noted three previous events where similar funding shifts led to large rallies: October 2023 (BTC surged from $28,000 to $73,000), September 2024 (from $57,000 to $108,000), and May 2025 (from $97,000 to $111,000). Related Reading: Bitcoin’s Key Investors Double Down, Buy Another 79,000 BTC While not guaranteed, these patterns suggest that extreme pessimism can sometimes signal market turning points. The only recent exception occurred in March 2025 following trade tariff announcements, which led to a continued decline. Still, many traders are watching closely for signs of a short squeeze, where price rebounds force short sellers to cover, amplifying upward momentum. Featured image created with DALL-E, Chart from TreadingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin 2025 Las Vegas: Here’s What Went Down",
      "link": "https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-2025_ig.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down\" rel=\"nofollow\"> </a></p> <p>My name is Jenna Montgomery, and maybe you’ve read some of my news articles here before, or seen me on the TikTok. But today, I wanted to switch it up and give you an inside look at the Bitcoin 2025 Conference in Las Vegas through my eyes as an intern, hired just one [&#8230;]</p> <p>"
    },
    {
      "title": "TakeOver Successfully Hosts Second Annual BitGala Celebrating Bitcoin in Las Vegas",
      "link": "https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/TakeOver-Successfully-Hosts-Second-Annual-BitGala-Celebrating-Bitcoin-in-Las-Vegas.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas\" rel=\"nofollow\"> </a></p> <p>LAS VEGAS, NV, May 26, 2025 &#8211; TakeOver, Magic Eden, Spark, and Stacks successfully hosted their second annual BitGala on May 26th at the Wynn in Las Vegas. The celebration brought together over 200 Bitcoin industry leaders and community members for an evening dedicated to celebrating Bitcoin. The BitGala was designed as a curated gathering [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini Files Draft With The SEC For Proposed IPO",
      "link": "https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini-Files-Draft-With-The-SEC-For-Proposed-IPO.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo\" rel=\"nofollow\"> </a></p> <p>Gemini has confidentially filed a draft registration statement with SEC for a proposed IPO of its Class A common stock.</p> <p>"
    },
    {
      "title": "‘MicroStrategy of Asia’ Metaplanet Aims To Acquire Over 210,000 BTC By the End of 2027",
      "link": "https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘MicroStrategy-of-Asia-Metaplanet-Aims-To-Acquire-Over-210000-BTC-By-the-End-of-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027\" rel=\"nofollow\"> </a></p> <p>Metaplanet Inc. plans to acquire over 210,000 BTC by the end of 2027, which is equivalent to 1% of Bitcoin’s total supply.</p> <p>"
    },
    {
      "title": "Know Labs, Inc. Announces Adopting a Bitcoin Treasury Strategy, Starting with 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Know-Labs-Inc.-Announces-Adopting-a-Bitcoin-Treasury-Strategy-Starting-with-1000-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>Know Labs, Inc. announces making a Bitcoin Treasury Strategy, holding 1,000 Bitcoin and placing Greg Kidd as the CEO of the company.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Trump-Elon feud Erupts, Crypto falls, Coinbase to list Fartcoin",
      "link": "https://decrypt.co/videos/interviews/kV6cxbIC/trump-elon-feud-erupts-crypto-falls-coinbase-to-list-fartcoin",
      "summary": "FOMO HOUR EP373 FOMO HOUR brings you the biggest daily news, updates and events from inside and outside of the crypto and macro spheres! Join hosts Farokh, Mando and Tyler as they cover some of the biggest topics at present with some of the biggest names in the ecosystem. Streaming live 5 days per week, Monday to Friday 10:00 AM EST to 11:00 AM EST on YouTube and X. Crypto drops then rebounds after Trump-Elon feud. DOGE, ADA & ETH lead decline in top 20 coins. Circle stock spikes 200% post IPO, trading halted. Strategy increases preferred stock issuance to $1bn. Metaplanet to issue $5.4b equity to buy BTC. Trump earned $1bn from crypto in last 9 months. Trump Media to raise up to $12bn to buy BTC. Robinhood flips Coinbase in market cap. Truth Social BTC, ETH ETF registered in Nevada. Uber evaluates accepting stablecoins for payments. CoinFlip exploring $1bn sales. Tether invests in Shiga Digital. Singapore to remove unlicensed blockchain firms. European APS buys $3.4m tokenized real estate. Taiwan’s BitoPro hacked for $11m+. Posta Romana to install BTC, crypto terminals. JOIN YEET = https://yeet.com/register?aff=fomohour PLAYLIST = https://www.youtube.com/playlist?list=PLGSgoImPFTiVpkHhLXF78cE_Z3uG7VNGL PODCAST = https://x.com/i/spaces/1kvKpydgqMQGE LIVE SPACE = https://x.com/i/spaces/1DXxyqYyDRVxM Links: https://linktr.ee/fomohour https://twitter.com/fomohour https://www.rug.fm/ https://x.com/rugradio Hosts: https://twitter.com/farokh https://twitter.com/rektmando https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets #bitcoin #crypto #podcast"
    },
    {
      "title": "Bitcoin stable, global stocks hit ATH, SPX leads memes",
      "link": "https://decrypt.co/videos/interviews/n6bzcD16/bitcoin-stable-global-stocks-hit-ath-spx-leads-memes",
      "summary": "FOMO HOUR EP372 BTC stable, alts mixed with SOL underperforming. JP Morgan to offer financing against crypto ETFs. $800m ETH waiting in validator activation queue. Hong Kong to allow crypto derivatives trading. ‘Unclaimed BTC’ in California could be seized. ETH Foundation publishes its treasury policy. Bluebird Mining to adopt BTC reserve. Whale buys $320m ETH from Galaxy Digital. K Wave Media raises $500m to buy BTC. Treasure Global launches $100m crypto strategy. Circle IPO raises $1.1b at $6bN valuation. Circle IPO more than 25x oversubscribed. China’s Webus files to raise $300m to buy XRP. NY grants Moonpay money transmitter license. Moscow Exchange launches BTC Futures. FOMO HOUR brings you the biggest daily news, updates and events from inside and outside of the crypto and macro spheres! Join hosts Farokh, Mando and Tyler as they cover some of the biggest topics at present with some of the biggest names in the ecosystem. Streaming live 5 days per week, Monday to Friday 10:00 AM EST to 11:00 AM EST on YouTube and X. JOIN YEET = https://yeet.com/register?aff=fomohour PLAYLIST = https://www.youtube.com/playlist?list=PLGSgoImPFTiVpkHhLXF78cE_Z3uG7VNGL PODCAST = https://x.com/i/spaces/1kvKpydgqMQGE LIVE SPACE = https://x.com/i/spaces/1vAxRDEzLpZGl Links: https://linktr.ee/fomohour https://twitter.com/fomohour https://www.rug.fm/ https://x.com/rugradio Hosts: https://twitter.com/farokh https://twitter.com/rektmando https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets #bitcoin #crypto #podcast"
    },
    {
      "title": "PumpFun plans token, ETH leads again, Trumps deny wallet",
      "link": "https://decrypt.co/videos/interviews/emLfmdzF/pumpfun-plans-token-eth-leads-again-trumps-deny-wallet",
      "summary": "FOMO HOUR EP371 ETH leads again as BTC stable around $106k. PumpFun plans $1bn token sale at $4bn valuation. Trump Jr denies TRUMP wallet involvement. US military supports BTC reserve: Lummis. Trump’s Truth Social files for BTC ETF. Vanadi to invest $1.1bn in BTC. BTC to replace USD if debt grows: Coinbase CEO. WLFI airdrops stablecoin to token holders. RLUSD approved by Dubai’s regulator. XRP ETF approval odds hit 98% on Polymarket. MARA reports record BTC production. Tether invests in Chile’s Orionx. Meta’s AI related energy deal boon for BTC miners. US residents eligible for Sonic airdrop. Czech govt could collapse on BTC scandal. FOMO HOUR brings you the biggest daily news, updates and events from inside and outside of the crypto and macro spheres! Join hosts Farokh, Mando and Tyler as they cover some of the biggest topics at present with some of the biggest names in the ecosystem. Streaming live 5 days per week, Monday to Friday 10:00 AM EST to 11:00 AM EST on YouTube and X. JOIN YEET = https://yeet.com/register?aff=fomohour PLAYLIST = https://www.youtube.com/playlist?list=PLGSgoImPFTiVpkHhLXF78cE_Z3uG7VNGL PODCAST = https://x.com/i/spaces/1kvKpydgqMQGE LIVE SPACE = https://x.com/i/spaces/1lPKqMkgBndKb Links: https://linktr.ee/fomohour https://twitter.com/fomohour https://www.rug.fm/ https://x.com/rugradio Hosts: https://twitter.com/farokh https://twitter.com/rektmando https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets #bitcoin #crypto #podcast"
    },
    {
      "title": "UNDER EXPOSED EP 28 - Macro, Summer Crypto Outlook & InfoFi Overheats",
      "link": "https://decrypt.co/videos/interviews/lNOEhI2j/under-exposed-ep-28-macro-summer-crypto-outlook-infofi-overheats",
      "summary": "UNDER EXPOSED brings you coverage of the biggest macro news of the week impacting crypto and broader markets, with a focus on the newest trends, trades and narratives. Join hosts TylerD, Deeze, Geebz and Peter Jennings as they have longer conversations on the hottest sectors in crypto and NFTs, what is moving markets and what they’re buying and selling. Streaming live every Tuesday from 12:00 PM EST to 1:00 PM EST on YouTube and X. Links: https://www.rug.fm/ https://x.com/rugradio https://linktr.ee/rugradio Hosts: https://twitter.com/deeze https://twitter.com/CSURAM88 https://twitter.com/artgeebz https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets https://www.instagram.com/myriadmarkets #bitcoin #crypto #podcast"
    },
    {
      "title": "ETH Foundation restructures, HYPE hits ATH, China tariffs delayed",
      "link": "https://decrypt.co/videos/interviews/KUKYKJX8/eth-foundation-restructures-hype-hits-ath-china-tariffs-delayed",
      "summary": "FOMO HOUR EP370 BTC reclaims $105k, ETH leads crypto gains. ETH Foundation restructures, shares new targets. ETH ETF inflows begin to outpace BTC. Robinhood acquires Bitstamp. Strategy to sell equity to raise $250m to buy BTC. HK’s Reitar Logtech to buy $1.5bn BTC. HYPE hits ATH, to get Binance US listing. NBX’s stock up 140% on BTC reserve policy. Tether sends 37k BTC to Twenty One Capital. Metaplanet buys $114m BTC. Blockchain Group buys $68m BTC. Sberbank to issue bonds tied to BTC. Coinbase delayed data breach reveal. Coinbase adds Ethena to listing roadmap. Sharplink down 30%, after 2000% surge. Public co. Classover to raise $500m to buy SOL. SOL signs MOU with Dubai to collab on crypto. Consensys acquires Web3Auth. Sberbank offers structured bonds linked to BTC. FOMO HOUR brings you the biggest daily news, updates and events from inside and outside of the crypto and macro spheres! Join hosts Farokh, Mando and Tyler as they cover some of the biggest topics at present with some of the biggest names in the ecosystem. Streaming live 5 days per week, Monday to Friday 10:00 AM EST to 11:00 AM EST on YouTube and X. JOIN YEET = https://yeet.com/register?aff=fomohour PLAYLIST = https://www.youtube.com/playlist?list=PLGSgoImPFTiVpkHhLXF78cE_Z3uG7VNGL PODCAST = https://x.com/i/spaces/1kvKpydgqMQGE LIVE SPACE = https://x.com/i/spaces/1ypKdZmqVjoJW Links: https://linktr.ee/fomohour https://twitter.com/fomohour https://www.rug.fm/ https://x.com/rugradio Hosts: https://twitter.com/farokh https://twitter.com/rektmando https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets #bitcoin #crypto #podcast"
    }
  ],
  "CryptoBriefing": [
    {
      "title": "VanEck, 21Shares, and Canary urge SEC to revert to ‘first to file, first to approve’ standard for crypto ETFs",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec-standard/",
      "summary": "<p>The shift from a \"first-to-file\" to simultaneous approval for crypto ETFs may hinder innovation and favor larger firms, impacting market fairness.</p> <p>"
    },
    {
      "title": "Best way of staking USDT in 2025: Loopring AI-powered staking platform",
      "link": "https://cryptobriefing.com/ai-powered-staking-usdt-loopring/",
      "summary": "<p>Loopring's AI-powered staking platform offers up to 20% daily on USDT, leveraging AI &#38; Ethereum Layer 2 for optimal returns.</p> <p>"
    },
    {
      "title": "Elon Musk’s X names Polymarket as official prediction market partner",
      "link": "https://cryptobriefing.com/elon-musks-prediction-markets/",
      "summary": "<p>This partnership could enhance the accuracy of public sentiment analysis, potentially influencing decision-making in politics and finance.</p> <p>"
    },
    {
      "title": "Apple, X, and Google hold talks with crypto firms on stablecoin integration",
      "link": "https://cryptobriefing.com/stablecoin-integration-tech-discussions/",
      "summary": "<p>The integration of stablecoins by major tech firms could revolutionize global payment systems, enhancing efficiency and reducing costs.</p> <p>"
    },
    {
      "title": "Coinzilla fuels 80 million+ impressions for Solidus Ai Tech in landmark crypto ad campaign",
      "link": "https://cryptobriefing.com/crypto-ad-campaign-record-impressions/",
      "summary": "<p>The campaign's success highlights the transformative potential of strategic advertising in rapidly scaling crypto and AI ventures.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Wall Street floods into Bitcoin Futures as CME trader count hits all-time high",
      "link": "https://ambcrypto.com/wall-street-floods-into-bitcoin-futures-as-cme-trader-count-hits-all-time-high/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"529\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Wall-Street-Floods-Into-Bitcoin-Futures.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"940\" />Is Bitcoin on the verge of breaking free from volatility to dominate mainstream finance?"
    },
    {
      "title": "Everything you need to know about the $3.8B in Bitcoin, Ethereum Options expiry",
      "link": "https://ambcrypto.com/everything-you-need-to-know-about-the-3-8b-in-bitcoin-ethereum-options-expiry/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-2-2.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Could more volatility be in store for the crypto markets?"
    },
    {
      "title": "Ethereum ETFs attract $11M inflows amid volatility – Will it help ETH’s chances?",
      "link": "https://ambcrypto.com/ethereum-etfs-attract-11m-inflows-amid-volatility-will-it-help-eths-chances/",
      "summary": "<img alt=\"Ethereum ETFs attract $11M inflows amid volatility - Will it help ETH&#039;s chances?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/EthereumETF.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ETH traders have been cautious lately, hedging heavily into the weekend."
    },
    {
      "title": "Will stablecoins move closer to real-world adoption with Uber? Exploring…",
      "link": "https://ambcrypto.com/will-stablecoins-move-closer-to-real-world-adoption-with-uber-exploring/",
      "summary": "<img alt=\"Will stablecoins move closer to real-world adoption with Uber? Exploring...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_37_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Uber’s stablecoin interest highlights growing crypto adoption and hints at a potential DeFi’s mainstream integration."
    },
    {
      "title": "Ethereum whale moves $159M in 1 mysterious transfer – Dump incoming?",
      "link": "https://ambcrypto.com/ethereum-whale-moves-159m-in-1-mysterious-transfer-dump-incoming/",
      "summary": "<img alt=\"Ethereum whale moves $159M in 1 mysterious transfer - Dump incoming?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum whales slow accumulation amid tightening profits. Is capitulation next?"
    }
  ]
}