{
  "CoinDesk": [
    {
      "title": "Crypto Lenders Hold Nearly $60B of Assets as New Wave of DeFi Adoption Sweeps In: Report",
      "link": "https://www.coindesk.com/markets/2025/06/18/crypto-lenders-hold-nearly-60b-of-assets-as-new-wave-of-defi-adoption-sweeps-in-report",
      "summary": ""
    },
    {
      "title": "SUI Reverses After Wild Swings; Trading Volume Spikes 11% Above 30-Day Average",
      "link": "https://www.coindesk.com/markets/2025/06/18/sui-reverses-sharply-after-24-hour-trading-volume-surges-11-above-30-day-average",
      "summary": ""
    },
    {
      "title": "We Need to Fix the So-Called GENIUS Bill",
      "link": "https://www.coindesk.com/opinion/2025/06/18/we-need-to-fix-the-so-called-genius-bill",
      "summary": ""
    },
    {
      "title": "UNI Rallies 70% From April Lows With Bullish Pattern Taking Shape, Up 24% in Past 30 Days",
      "link": "https://www.coindesk.com/markets/2025/06/18/uni-rallies-70-from-april-lows-with-bullish-pattern-taking-shape",
      "summary": ""
    },
    {
      "title": "Fed Leaves Rates Steady, Expects Weaker Growth, Sticky Inflation",
      "link": "https://www.coindesk.com/markets/2025/06/18/fed-leaves-rates-steady-expects-weaker-growth-sticky-inflation",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Pavel Durov warns France is experiencing societal collapse",
      "link": "https://cointelegraph.com/news/telegram-durov-warns-france-societal-collapse?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTljZmQtZTI5Ny03NTVkLTk1MzAtYzM1ZTM5ZjcxYTBm.jpg\" /></p><p>According to the Telegram founder, France’s political leaders continue to make poor choices regarding censorship.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "US DOJ files to seize $225M in crypto tied to pig butchering schemes",
      "link": "https://cointelegraph.com/news/justice-department-seize-crypto-pig-butchering?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg0ODYtOTg4Mi03N2QxLWFhYTItZWMwYTNiZjFlNGUz.jpg\" /></p><p>Justice Department officials did not go into great detail regarding the investment scam, but said that more than 400 suspected victims had lost millions of dollars.</p>"
    },
    {
      "title": "Bitdeer to offer $330M convertible notes to expand operations",
      "link": "https://cointelegraph.com/news/bitdeer-offer-330m-convertible-notes-to-expand-operations?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg0ZDQtODBhNy03Y2FhLTljYzMtMzZhYmYzNGJmMzY5.jpg\" /></p><p>The fundraising comes as the company faces declining revenue and seeks to expand in the US to hedge against potential trade tensions.</p>"
    },
    {
      "title": "New York authorities freeze $300K linked to crypto scammers",
      "link": "https://cointelegraph.com/news/new-york-freeze-crypto-scam?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjViOTEtMjJhMS03MjRiLWExODktMjc2MzUzNDRiOTVl.jpg\" /></p><p>Officials reported that scammers had used crypto to pay for fake digital asset investment ads on social media platforms, leading to more than $1 million in losses for victims.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "10-year Bitcoin holdings grow faster than daily issuance, marking scarcity signal after 2024 halving",
      "link": "https://cryptoslate.com/10-year-bitcoin-holdings-grow-faster-than-daily-issuance-marking-scarcity-signal-after-2024-halving/",
      "summary": "<p>On-chain data shows that Bitcoin’s (BTC) “ancient supply” is increasing faster than new BTC daily issuance, according to a June 18 research by Fidelity Digital Assets. The report treats ancient supply as Bitcoins that have remained unmoved for at least a decade, and it counted an average of 566 BTC entering the 10-year-plus cohort daily [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase launches stablecoin payment stack with USDC checkout targeting commerce giants",
      "link": "https://cryptoslate.com/coinbase-launches-stablecoin-payment-stack-with-usdc-checkout-targeting-commerce-giants/",
      "summary": "<p>Coinbase officially launched Coinbase Payments on June 18, a three-layer platform that enables commerce providers to add USDC checkout without running their blockchain infrastructure. The stack begins with Stablecoin Checkout, a wallet-native interface that supports hundreds of wallets, delivers gas-free transactions, and records payments in USDC. Beneath it, an E-commerce Engine exposes application programming interfaces [&#8230;]</p> <p>"
    },
    {
      "title": "Circle stock leaps to $200 record after 34% daily gain",
      "link": "https://cryptoslate.com/circle-stock-leaps-to-200-record-after-34-daily-gain/",
      "summary": "<p>Circle’s CRCL shares climbed 34% and closed at $199.59 on June 18 after registering a new all-time high at $200.90. The new price peak is roughly 6.5x the company’s initial public offering price of $31 set on June 5. The price leap came one day after the Senate advanced the Guiding and Establishing National Innovation [&#8230;]</p> <p>"
    },
    {
      "title": "Distribution or death: Arthur Hayes says only exchange-backed or bank-linked stablecoins can thrive",
      "link": "https://cryptoslate.com/distribution-or-death-arthur-hayes-says-only-exchange-backed-or-bank-linked-stablecoins-can-thrive/",
      "summary": "<p>Arthur Hayes said that stablecoin issuers who cannot immediately tap a large exchange, a Web2 platform, or a legacy bank will struggle to survive. In a June 16 blog post, the BitMEX co-founder recounted how the banking shutdowns in the 2010s in Hong Kong and Mainland China drove traders toward Tether. Bitfinex and Tether allowed [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin holds ground as Fed leaves interest rates unchanged",
      "link": "https://cryptoslate.com/bitcoin-holds-ground-as-fed-leaves-interest-rates-unchanged/",
      "summary": "<p>The Federal Reserve left its key interest rate steady on June 18, choosing caution as it monitors persistent inflation and global uncertainties. Bitcoin (BTC) remained largely stable, continuing to hold recent gains despite broader market jitters. The flagship crypto was trading at $104,110 as of press time, down 0.66% over the past 24 hours. Rates [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Addresses Holding 1M Coins Reach 12-Year High As Experts Predict Move Above $4",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-1m-wallets-at-12-year-high/",
      "summary": "The XRP Ledger (XRPL) is witnessing increased network activity, which is bullish for its native token’s price. On-chain data also shows that whales are actively accumulating XRP, with the addresses holding one million coins recently reaching a new high. XRP Ledger Records Massive Growth In Past Week In an X post, on-chain analytics platform Santiment revealed that the XRP Ledger is showing signs of growth, from both a usage and key stakeholder perspective. The platform revealed that there are now over 2,700 whale and shark wallets holding at least 1 million XRP for the first time in the token’s 12-year history. Related Reading: Is There A “Secret XRP Ledger” And Is The Price Really At $1,000? Additionally, Santiment stated that the number of active XRP addresses has averaged over 295,000 daily over the past week. This is notable as the normal daily average over the past three months was between 35,000 and 40,000. It is worth mentioning that the XRPL recorded some major developments last week. One is the launch of Circle’s USDC stablecoin on the XRP Ledger. This is expected to boost network activity given the increasing demand for stablecoins. Crypto analyst Moon Lambo predicted that this would increase the total value locked (TVL) on the network. He also noted how this was bullish for the XRP price, since users will need the token for every USDC transaction. Furthermore, Ondo Finance launched its tokenized US treasury fund (OUSG) on the XRP Ledger last week, which could have also contributed to the surge in network activity. The BlackRock-backed fund will be mintable and redeemable using the RLUSD stablecoin. Meanwhile, Guggenheim also recently partnered with Ripple to launch the first Digital Commercial Paper on the XRPL. Expert Predicts Price Rally Above $4 Amid the surge in network activity on the XRPL, crypto analyst Javon Marks has predicted that the XRP price could rally above $4 and even reach as high as $8. He stated that the altcoin is holding a clear breakout and is getting ready for a major bullish continuation. Marks added that the targets are at $4.80 and $8, marking new all-time highs (ATHs) for XRP. Related Reading: These Factors Will Drive XRP Price To $25-$75 In June – Analyst Crypto analyst Dark Defender recently alluded to a previous analysis in which he stated that the XRP price could make a decision within two weeks. The analyst is confident that the altcoin could rally to as high as $6 on this Wave 5 impulsive move to the upside. He has also previously predicted that XRP would reach double digits in this market cycle. On the other hand, it is worth mentioning that the XRP price has again dropped below the $2.25 level. Crypto analyst CasiTrades had warned that the support levels at $2.01, $1.90, and $1.55 could be in play if the $2.25 level holds as resistance. At the time of writing, the XRP price is trading at around $2.16, down over 3% in the last 24 hours, according to data from CoinMarketCap. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "Tron Shows Real Growth: Transaction Volume Soars While Success Rate Stays Above 96%",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-shows-real-growth-transaction-volume-soars-while-success-rate-stays-above-96/",
      "summary": "Tron has captured renewed attention following a major development: its planned entry into public markets. Justin Sun, Tron&#8217;s founder, has reached a deal with Nasdaq-listed SRM Entertainment (SRM.O), under which SRM will acquire Tron-related tokens, rebrand as Tron Inc., and appoint Sun as an adviser. This move marks a significant step in bridging the gap between blockchain projects and traditional finance, potentially making Tron one of the first major public blockchain entities. Related Reading: Ethereum Golden Cross Approaching – Will History Repeat? Meanwhile, rising geopolitical tensions in the Middle East have sparked volatility across the broader crypto market, including Tron. Despite this uncertain macro environment, Tron’s on-chain fundamentals remain strong. Top analyst Darkfost shared data showing that Tron’s daily transaction volume has surged from 2.5 million in 2021 to over 9 million today. This exponential growth underscores a sharp rise in user activity and developer engagement across the network. The sustained increase in transaction volume also reflects growing confidence in Tron’s infrastructure as a scalable and reliable alternative to other high-throughput blockchains. With both institutional exposure via SRM and strong on-chain growth, Tron finds itself at a pivotal moment in its evolution—one that could reshape its trajectory in the months ahead. Tron Retraces After Public Listing Surge: Network Fundamentals Remain Strong Tron is currently trading around key demand levels after a sharp retrace from Monday’s breakout rally. The surge—triggered by the announcement that Tron would go public via a deal with Nasdaq-listed SRM Entertainment—briefly sent TRX up over 9%, generating widespread attention. However, escalating tensions between Israel and Iran have weighed on market sentiment, dragging the price back to pre-announcement levels. Despite short-term volatility, Tron’s fundamentals continue to paint a bullish picture. According to Darkfost, the Tron blockchain has demonstrated strong and consistent growth since 2021. Daily transaction volumes have risen from 2.5 million to over 9 million, reflecting increasing adoption and sustained demand for its infrastructure. This activity surge signals heightened investor interest and developer confidence in the network. Yet, high volume alone doesn’t guarantee quality. What sets Tron apart is its impressive transaction success rate, which has remained above 96% throughout this growth phase. This reliability counters criticisms often aimed at other high-throughput chains like Solana, where failed or spammy transactions can inflate metrics. Additionally, Tron’s block production has remained stable and linear, showcasing its operational consistency. Even amid rising global transaction fees, Tron continues to attract usage, suggesting that users still view it as a cost-effective, scalable solution. This blend of high performance, strong demand, and network resilience positions Tron as one of the most technically mature blockchains in the current market cycle. If macro conditions stabilize, Tron’s public listing and robust on-chain metrics could reignite bullish momentum. Related Reading: Bitcoin Holds Strong Despite Israel-Iran Tensions – Weekly Resistance Begins To Crack TRX Price Analysis: Key Support Levels Hold Tron (TRX) is currently trading at approximately $0.273, consolidating just above the 50-day simple moving average (SMA), which sits around $0.268. After a sharp spike on Monday that pushed the price toward $0.30 following the announcement of Tron going public, the price retraced back to pre-announcement levels amid escalating geopolitical tensions in the Middle East. Despite this pullback, TRX remains in a bullish structure on the daily chart. The 100-day and 200-day SMAs, currently around $0.252 and $0.253, respectively, continue to trend upward and act as solid dynamic support, confirming that the medium- to long-term trend remains intact. Volume surged on the breakout but has since cooled, which is expected during periods of consolidation. Technically, TRX is forming a higher low structure while staying within a broader uptrend that began in late March. As long as the price holds above the $0.268 support level, bulls may attempt another push toward $0.285 and potentially retest the recent high near $0.30. Related Reading: Ethereum Consolidation Continues – Altseason May Follow A Clean Break Above Resistance A break below $0.268 could invalidate the bullish momentum and trigger a move toward the $0.252–$0.255 zone. For now, price action remains constructive as TRX holds above all major moving averages and key structural support. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "$8 XRP Breakout Brewing — SEC No Longer A Roadblock, Bullish Analyst Says",
      "link": "https://www.newsbtc.com/news/8-xrp-breakout-brewing-sec-no-longer-a-roadblock-bullish-analyst-says/",
      "summary": "Interest is building among XRP investors after Crypto Beast, a well‑known analyst, put forward a bold forecast. He sees a minimum breakout level of $8 on the horizon. With the US Securities and Exchange Commission no longer posing a roadblock, Crypto Beast believes XRP has a clear path ahead. Related Reading: Record‑High Ethereum Open Interest Signals Institutional Confidence His view rests on the idea that the market still hasn’t fully priced in XRP’s cleared status with regulators. Short‑term traders and long‑term holders alike are tuning in. Regulatory Milestone And Market Reaction According to court records, XRP won a key victory in July 2023 when Judge Analisa Torres ruled that it’s not a security under US law. That moment sent XRP from about $0.48 to $0.93 very fast. But prices slipped back over the next few weeks, bringing it down to the $0.50 area again. Then, after US President Donald Trump won re‑election and signaled a shake‑up at the SEC, XRP marched into a new range around $2.00. Despite that climb, Crypto Beast argues the legal win hasn’t been fully valued by the wider market. XRP is about to explode. I’m eyeing at least $8, and the market still hasn’t caught up to the fact that the SEC doesn’t consider it a security.$XRP holders are about to PRINT. I’ll drop the signal to exit right here when the moment is right. You’ll regret not following. pic.twitter.com/oiE8INoy7F — Crypto Beast (@cryptobeastreal) June 16, 2025 Technical Pattern Points To Upside Crypto Beast pointed to a bull flag chart pattern that starts with a rally from $0.40 up to $3.40. A flag pattern formed when XRP pulled back into the $2.00–$3.00 zone. He marked the breakout level at $3.37. By measuring the height of that $3.00 pole and adding it to the low of the flag, he arrived at a target near $10.69. In another post, he set a more conservative floor of $8.80, a roughly 4x gain from today’s price around $2.20. That kind of move would push XRP’s market cap above $500 billion, putting it in league with big firms like Oracle, Netflix and Mastercard. Broader Crypto Trends And Correlation Based on reports from his channel, Crypto Beast isn’t just upbeat on XRP price about to &#8220;explode&#8221;. He’s looking for a 3x rise in Solana, a 2x pop in Ethereum and a 5x run in SUI. Even more, he’s penciled in potential 40x gains for select smaller tokens. Still, these forecasts rest on a growing crypto mood—mostly led by Bitcoin. When BTC stalls or dips, large altcoins often follow suit. So any rally in XRP may need fresh money flowing into the whole market. Related Reading: Tether Enforces Freeze On $12 Million In Tron Funds Over Illicit Activity Risks And Exit Strategy Crypto Beast says he’ll flag when it’s time to sell. He reminded followers that patterns do fail and charts alone can’t guarantee gains. A sudden market shift or a change in macro sentiment could spoil the setup. He advises setting stop‑loss levels and watching BTC for hints. His trust in XRP’s future is strong, but he wants traders to be ready for any twist. Featured image from Pexels, chart from TradingView"
    },
    {
      "title": "Is Ethereum Price Set To Repeat History As 2017 Playbook Returns? Why This Time Could Be Bigger",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-2017-playbook-returns/",
      "summary": "The Ethereum price action is showing remarkable similarities to its 2017 market cycle, with analysts pointing to a near-identical technical setup and market behaviour. Crypto analyst Merlijn the Trader, who shared a side-by-side weekly chart comparison of 2025 and 2017 on X (formerly Twitter), suggests that Ethereum is now following the same breakout pattern that once led to a historic rally. This time, however, the analyst believes that the move could be even more significant. Ethereum Price Mirrors Historic Breakout Pattern In the current 2025 chart, Ethereum has reportedly claimed the 50-week Moving Average (MA) after months of downward pressure and range-bound movement. Following a decisive breakout from support levels near $2,250, the price of the cryptocurrency is now consolidating below the 50 MA, forming a tight sideways pattern. Related Reading: The 5 Bullish Cases That Says Ethereum Price Could Reach $10,000 In 2025 According to Merlijn the Trader, this structure is visually and technically similar to price movements that occurred in late 2016 and early 2017, just before Ethereum began a powerful upward surge. The analyst’s 2017 Ethereum chart shows the altcoin breaking above the 50 MA, followed by a brief period of sideways action under resistance. Once momentum was built, the price launched into a parabolic rally that marked the beginning of its major bull cycle. Notably, the 2025 chart situated on the right panel displays an almost identical playbook to the 2017 setup, with Ethereum moving out of a prolonged accumulation phase and into a zone of consolidation beneath key resistance levels. However, this time, market conditions are significantly different. The analyst notes that the crypto space is far more developed, with increased institutional involvement, broader retail adoption, and growing infrastructure supporting Ethereum’s ecosystem. While the technical patterns align closely with the 2017 breakout, the scale and context suggest that the potential upside could even be greater. The similarities between Ethereum’s 2017 and 2025 price action lie in the timing of the 50 MA reclaim and the tight range of consolidation that follows. If ETH can maintain this trajectory and break above the current resistance zone, it could mark the beginning of a fresh macro rally, which the analyst predicts will not just repeat history but possibly amplify it. Ethereum Eyes $4,000 As 2017 Pattern Repeats Based on Merlijn The Trader’s comparable chart analysis, Ethereum may be on the verge of a major breakout, with technical patterns pointing to a potential price target above $4,000. In the 2017 setup, Ethereum skyrocketed past $28 from a low between $6 and $7.5 after reclaiming the 50 MA. Related Reading: Ethereum Staging A Repeat Of Bitcoin’s 2021 Cycle? Here’s The Target If history is any guide, Ethereum’s next move could propel it from its current price of $2,541 to $4,000, which aligns with the upper red horizontal line on the 2025 price chart or above the line to fresh all-time highs, with no ceiling in sight, according to the analyst. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Price Pressure Builds: Can BNB Punch Through The Ceiling Or Will 640 Catch The Fall?",
      "link": "https://www.newsbtc.com/analysis/bnb/bnb-price-pressure-builds/",
      "summary": "BNB finds itself at a pivotal moment as price action tightens between two critical technical zones. After a period of consolidation, the cryptocurrency is testing resistance near the 200-period moving average, hovering around the $653 mark. Meanwhile, support around the $640 level continues to hold firm, acting as a safety net for bulls trying to defend the current structure. 200 MA Acts As A Ceiling Against BNB Uptrend According to Thomas Anderson in a recent X post, the M15 BNB chart reveals that the price is currently testing resistance around the $651.50 level, marked by a horizontal yellow line. Related Reading: BNB Coils For Impact: Will $670 Crack Under Pressure? This move follows a recent bounce off the ascending white trendline support, indicating that buyers are still defending the short-term uptrend. However, price action remains just beneath the 200-period moving average (red line), which is acting as a dynamic resistance zone near the $653 mark. Momentum indicators are offering mixed signals at the moment. The MACD continues to print negative values, showing that bearish pressure hasn’t fully dissipated, while the RSI has started recovering from previously oversold conditions. This combination suggests the potential for a short-term bounce within the ascending channel. M30 And H1 Charts Are Aligning In an updated post, the analyst also went further to examine the BNB M30 chart, where price is currently trading at $650.10 and appears to be consolidating just below the 200-period moving average (red line) situated around the $653 level. This area is acting as a key short-term resistance zone, and price action has shown hesitation around it, reflecting a battle between buyers and sellers. Interestingly, the H1 chart mirrors this behavior, showing a broader ascending channel structure that suggests an underlying bullish bias, though still unconfirmed. Related Reading: BNB Price Reclaims $600 — Is This the Start of a Major Upside Move? The immediate resistance to watch remains near the $653 mark, aligned with the 200 MA on both the M30 and H1 timeframes. If bulls can muster enough strength to break and sustain above this level, it could trigger a fresh wave of upward momentum for BNB toward the next resistance at $657. This would represent a potential continuation of the ascending channel&#8217;s structure and hint at growing bullish control in the short term. On the flip side, if price fails to push above the $653 resistance, consolidation may begin to lose steam. In such a scenario, a retreat toward the previous swing low near the $640 level becomes likely. This support area has already proven its strength and could be the next level of defense if bearish pressure increases. Traders are watching closely, as these levels may determine BNB&#8217;s next directional move. Featured image from Adobe Stock, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    },
    {
      "title": "The Trolls Are Coming: Defending Bitcoin Mining from Patent Trolls",
      "link": "https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_GenerateThe-Trolls-Are-Coming_-Defending-Bitcoin-Mining-from-Patent-Trollsd_Image_9ib8k29ib8k29ib8-fotor-20250618125328.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls\" rel=\"nofollow\"> </a></p> <p>The clash between Malikie Innovations and Bitcoin miners exemplifies a classic conflict between open innovation and legacy fiat intellectual property rights.</p> <p>"
    },
    {
      "title": "Bitdeer Raises $330M to Expand Bitcoin Mining and AI Operations",
      "link": "https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BITDEER-EXPANDS-BITCOIN-MINING.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations\" rel=\"nofollow\"> </a></p> <p>Singapore-based Bitcoin mining firm Bitdeer Technologies Group has launched a $330 million convertible notes offering, aiming to strengthen its mining operations, develop ASIC rigs, and scale its AI infrastructure.&#160; The notes, due in 2031, carry an annual interest rate of 4.875% and may be converted into Bitdeer Class A shares at a 25% premium to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Tech Booms: Lightning Data Defies Digital Gold Narrative",
      "link": "https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_a_rough_gold_rock_with_Bitcoin_logo_stampe_2.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative\" rel=\"nofollow\"> </a></p> <p>Bitcoin tech shines in 2025 with 1.5 million Lightning users, $1.5 billion trading volume, and Block’s 9.7% yield, outpacing treasury hype.</p> <p>"
    },
    {
      "title": "K33 Announces Plans To Purchase Up To 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norwegian-Public-Company-K33-AB-Purchased-10-BTC-For-Their-New-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>K33 has launched a SEK 85 million share issue at a price of SEK 0.1036 per share.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "How Far Would You Go to Pump Your Meme Coin?",
      "link": "https://decrypt.co/325960/how-far-would-you-go-pump-meme-coin",
      "summary": "Leland King Fawcette aims to make it across all 50 U.S. states in time to break a record—and pump his Solana meme coin in the process."
    },
    {
      "title": "Bitdeer Stock Falls as Bitcoin Miner Aims to Raise $330 Million",
      "link": "https://decrypt.co/325884/bitdeer-stock-falls-bitcoin-miner-raise-330-million",
      "summary": "Singapore-based Bitcoin miner Bitdeer is raising funds, but not to buy up BTC. The firm's shares continued falling following the move."
    },
    {
      "title": "Crypto Prime Brokerage FalconX in Early Talks for IPO in 2025: Sources",
      "link": "https://decrypt.co/325918/crypto-prime-brokerage-falconx-early-talks-ipo",
      "summary": "FalconX is considering a public listing amid a broader crypto IPO boom, three sources told ."
    },
    {
      "title": "A Lawyer and His Wiener Doge Must Be Separated, Phantom Argues in Meme Coin Lawsuit",
      "link": "https://decrypt.co/325919/lawyer-wiener-doge-seperated-phantom-meme-coin-lawsuit",
      "summary": "Phantom’s attorneys say you can’t create a dog-themed meme coin, and then represent plaintiffs in a lawsuit over it. The litigator-turned-degen in question disagrees."
    },
    {
      "title": "Bitcoin Might Be Flat, But Traders Have Their Eyes on This Shiny New Token: Analysis",
      "link": "https://decrypt.co/325904/bitcoin-flat-traders-eyes-new-token-aero-analysis",
      "summary": "As Bitcoin clings to support levels and geopolitical shocks ripple across risk assets, there's an altcoin keeping things interesting."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin holds steady at $104K as Fed eyes inflation from tariffs before easing",
      "link": "https://cryptobriefing.com/bitcoin-stability-fed-rate/",
      "summary": "<p>Bitcoin holds at $104K as the Fed keeps rates at 4.25% to 4.50%, citing tariff-driven inflation as reason to delay cuts.</p> <p>"
    },
    {
      "title": "US DOJ seeks to forfeit $225 million in crypto from global scam network",
      "link": "https://cryptobriefing.com/crypto-scam-forfeiture-seizure/",
      "summary": "<p>The DOJ's action highlights the increasing need for robust international cooperation and advanced digital forensics in combating crypto fraud.</p> <p>"
    },
    {
      "title": "Bitcoin stays resilient ahead of Fed meeting as investors await policy signals",
      "link": "https://cryptobriefing.com/bitcoin-resilient-ahead-fed-meeting/",
      "summary": "<p>Bitcoin's resilience amid Fed uncertainty highlights its potential as a hedge, but future rate signals could impact broader market liquidity.</p> <p>"
    },
    {
      "title": "Canada’s first XRP spot ETF goes live on Toronto Stock Exchange",
      "link": "https://cryptobriefing.com/canadas-first-xrp-spot-etf/",
      "summary": "<p>The launch of Canada's first XRP spot ETF could accelerate mainstream adoption of digital assets, enhancing financial market innovation.</p> <p>"
    },
    {
      "title": "Iran’s largest crypto exchange appears to have been exploited, suspected Israeli hackers threaten to leak source code and user data",
      "link": "https://cryptobriefing.com/nobitex-cyberattack-iran-exchange/",
      "summary": "<p>The breach highlights vulnerabilities in Iran's financial systems, potentially escalating geopolitical tensions and impacting regional cybersecurity.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "What happens to Bitcoin if the U.S. joins the Iran-Israel war?",
      "link": "https://ambcrypto.com/what-happens-to-bitcoin-if-the-u-s-joins-the-iran-israel-war/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BitcoinIsrael-Iranwar.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />There is bullish short-term market positioning, but uncertainty remains."
    },
    {
      "title": "Story’s 12% profits wiped out in 24 hours – Is IP’s hype fading?",
      "link": "https://ambcrypto.com/storys-12-profits-wiped-out-in-24-hours-is-ips-hype-fading/",
      "summary": "<img alt=\"ip\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-9.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The $3 zone will likely play the most important role in IP's future price movement."
    },
    {
      "title": "Dogecoin drops 20% – But 3 signals point to a BIG move for DOGE!",
      "link": "https://ambcrypto.com/dogecoin-drops-20-but-3-signals-hint-at-big-move-for-doge/",
      "summary": "<img alt=\"DOGE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-18T152117.570_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Dogecoin’s key support at $0.167 sparks optimism, with experts predicting an 18% surge to $0.20."
    },
    {
      "title": "Examining why Bitcoin’s bull run may have more room – MVRV ratio reveals…",
      "link": "https://ambcrypto.com/examining-why-bitcoins-bull-run-may-have-more-room-mvrv-ratio-reveals/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-18T135728.171-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin’s fundamentals remain strong, with holding behavior and undervaluation metrics supporting continued upside."
    },
    {
      "title": "All about Thailand’s new crypto policy – 5-year tax break, $30.7M boost & more…",
      "link": "https://ambcrypto.com/all-about-thailands-new-crypto-policy-5-year-tax-break-30-7m-boost-more/",
      "summary": "<img alt=\"Thailand crypto tax\" class=\"attachment-full size-full wp-post-image\" height=\"561\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Thailand-crypto-tax.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"998\" />Could Thailand’s crypto tax strategy challenge Dubai and Singapore?"
    }
  ]
}