{
  "CoinDesk": [
    {
      "title": "Bitcoin DeFi Project Elastos Debuts BTC-Backed Stablecoin BTCD",
      "link": "https://www.coindesk.com/business/2025/06/18/bitcoin-defi-project-elastos-debuts-btc-backed-stablecoin-btcd",
      "summary": ""
    },
    {
      "title": "How the Next Wave of RWAs is Becoming Crypto’s Real Edge",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/17/how-the-next-wave-of-rwas-is-becoming-crypto-s-real-edge",
      "summary": ""
    },
    {
      "title": "Why CoinDesk's Top 50 Women in AI and Web3 List Points to a Unified Future",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/18/why-coindesk-s-top-50-women-in-ai-and-web3-list-points-to-a-unified-future",
      "summary": ""
    },
    {
      "title": "AVAX Stages Short-Term V-Shaped Recovery, Struggles to Maintain Momentum",
      "link": "https://www.coindesk.com/markets/2025/06/18/avax-stages-short-term-v-shaped-recovery-struggles-to-maintain-momentum",
      "summary": ""
    },
    {
      "title": "Polkadot's DOT Drops as Much as 5% After Failed Breakout Triggers Selling Wave",
      "link": "https://www.coindesk.com/markets/2025/06/18/polkadots-dot-drops-as-much-as-5-after-failed-breakout-triggers-selling-wave",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "The empire strikes out: Institutionalists failed to kill the stablecoin bill",
      "link": "https://cointelegraph.com/news/institutionalists-stablecoin-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdkNDEtYzZmMy03MDNkLWJhN2ItODE4OGI0ZGZlZmUw.jpg\" /></p><p>Despite a relentless campaign from institutional powerbrokers like Senator Elizabeth Warren, the US Senate advanced the GENIUS Act, marking a watershed moment for stablecoin regulation and exposing the limits of establishment resistance.</p>"
    },
    {
      "title": "Bitcoin eyes $105K pre-FOMC as Trump reveals Iran asked for dialogue",
      "link": "https://cointelegraph.com/news/bitcoin-eyes-105k-pre-fomc-trump-reveals-iran-asked-for-dialogue?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgzODEtMDcxNS03YWY4LWI4OWYtYWNhYmVhYjU3NTVi.jpg\" /></p><p>Trump offers light relief for Bitcoin price action while calling Fed Chair Jerome Powell a \"stupid person\" with interest-rate cut hopes absent.</p>"
    },
    {
      "title": "How a fake tweet from Paraguay pushed Bitcoin to $110K",
      "link": "https://cointelegraph.com/explained/how-a-fake-tweet-from-paraguay-pushed-bitcoin-to-110k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9hODQ0MGU5YWE1ZTg5ZmRjYTExMzZjZDhmZTk0NzUzOC5qcGc=.jpg\" /></p><p>A fake post from the Paraguayan president’s X account claimed Bitcoin was now legal tender, triggering a sharp 4% price spike. </p>"
    },
    {
      "title": "Circle’s USDC to become eligible collateral for US futures trading",
      "link": "https://cointelegraph.com/news/coinbase-nodal-circle-usdc-eligible-collateral-us-futures?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgzNDMtZDcyNC03NmQyLTgwNmItNGMzODdlYTNkMWEz.jpg\" /></p><p>USDC, a US dollar-pegged stablecoin by Circle and Coinbase, is set to become a collateral for US futures trading as part of a joint effort by Coinbase Derivatives and Nodal Clear.</p>"
    },
    {
      "title": "Senate passes GENIUS stablecoin bill amid concerns over systemic risk",
      "link": "https://cointelegraph.com/news/senate-genius-stablecoin-bill-concerns-systemic-risk?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzgzNTUtMDU1My03MDFmLWE0NjMtOGZlODFjOGRhMjRm.jpg\" /></p><p>The US Senate voted to pass the GENIUS Act, a bill regulating stablecoins, but observers believe lawmakers may have ignored stability concerns in Treasury markets.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "North Korea’s hackers could have laundered as much as $1.5 billion in stolen crypto",
      "link": "https://cryptoslate.com/north-koreas-hackers-laundered-1-5-billion-in-stolen-crypto/",
      "summary": "<p>North Korea’s hackers has reportedly stolen nearly $2 billion from centralized crypto exchanges over the past year. Blockchain security researcher Tay Monahan attributes a significant portion of those funds, around $1.8 billion, to a series of major hacks targeting centralized crypto trading platforms like Bybit, DMM Bitcoin, WazirX, Phemex, and BingX. Despite setbacks such as [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini accuses CFTC of unfair legal campaign in formal complaint",
      "link": "https://cryptoslate.com/gemini-accuses-cftc-of-unfair-legal-campaign-in-formal-complaint/",
      "summary": "<p>Crypto exchange Gemini has filed a formal complaint against the Commodity Futures Trading Commission’s (CFTC) Division of Enforcement (DOE), accusing it of pursuing a prolonged and unjustified legal campaign. On June 17, Gemini co-founder Tyler Winklevoss revealed that the firm submitted the complaints to the CFTC’s Office of the Inspector General on June 13. According [&#8230;]</p> <p>"
    },
    {
      "title": "Ark Invest sells nearly $100M in Circle shares in the last 2 days",
      "link": "https://cryptoslate.com/insights/ark-invest-sells-nearly-100m-in-circle-shares-in-the-last-2-days/",
      "summary": "<p>Cathie Wood’s Ark Invest has continued reducing its exposure to Circle, selling another sizable batch of shares as the stablecoin firm recorded a market pullback. On June 17, Ark sold 300,108 CRCL shares across three of its exchange-traded funds (ETFs), according to the firm’s daily trade filing. The sale totaled approximately $44.7 million based on [&#8230;]</p> <p>"
    },
    {
      "title": "Ohio passes blockchain bill allowing $200 tax-free Bitcoin payments",
      "link": "https://cryptoslate.com/ohio-passes-blockchain-bill-allowing-200-tax-free-bitcoin-payments/",
      "summary": "<p>Ohio is making a bold push to become a leader in Bitcoin and digital asset regulation with its latest regulatory effort. On July 17, the state’s House Technology Committee unanimously passed the Ohio Blockchain Basics Act (HB 116), advancing the bill to the next stage of legislative review. According to advocacy group Satoshi Action Fund, [&#8230;]</p> <p>"
    },
    {
      "title": "Chinese Bitcoin mining giants move production to US amid tariff tensions",
      "link": "https://cryptoslate.com/chinese-bitcoin-mining-giants-move-production-to-us-amid-tariff-tensions/",
      "summary": "<p>China&#8217;s top three Bitcoin mining rig manufacturers, Bitmain, Canaan, and MicroBT, are reportedly shifting parts of their production to the United States, Reuters reported on June 18. The move comes as a response to intensifying trade tensions triggered by President Donald Trump&#8217;s renewed tariff policies. These tariffs, aimed at reducing US reliance on foreign technology, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Altcoin Alert: Expert Reveals Hottest Opportunities For The Summer Season",
      "link": "https://www.newsbtc.com/altcoin/altcoin-alert-expert-reveals-hottest-opportunities-for-the-summer-season/",
      "summary": "As geopolitical tensions in the Middle East continue to impact cryptocurrency prices, with Bitcoin (BTC) recently dipping below the $105,000 mark, market analyst VirtualBacon has shared insights suggesting that altcoins are gearing up for a potentially robust summer. Emerging AI Memecoins In a recent update on social media platform X (formerly Twitter), he highlighted several promising developments within the altcoin space. VirtualBacon pointed to an emerging wave of AI-focused Layer-1 blockchain projects, many backed by prominent figures in both the cryptocurrency and traditional finance sectors. He mentioned several names to watch, including Sahara Labs, Sentient AGI, and Gaianet, among others. While these projects have yet to release tokens, many are expected to conduct airdrops or early access rounds, presenting opportunities for early investors. Related Reading: On-Chain Analyst Warns: Bitcoin Peak Expected, Altcoins Facing -95% Plunge For those seeking “higher-risk, high-reward investments,” VirtualBacon noted the impressive performance of artificial intelligence (AI) agent memecoins. He cited the launch of IRIS, which skyrocketed from a $220,000 fully diluted valuation (FDV) to $120 million, representing a 600x return. Platforms such as Virtuals, CreatorBid, and SeedifyFund are turning user engagement into allocation opportunities, likening this phenomenon to a form of airdrop farming on steroids. In addition, VirtualBacon highlighted a relatively overlooked area: Bittensor subnet tokens. He mentioned that seasoned investors can now acquire early-stage subnets directly on Bittensor’s chain, with projects like SN65_TPN and inference_labs raising capital through token auctions at valuations below $4 million. Stablecoins Take Center Stage Turning to real-world assets (RWAs), VirtualBacon advised focusing on mid-cap infrastructure projects with tangible revenue streams. He pointed to CHEX and CPOOL, which has shown consistent upward movement, as examples of promising investments. Another emerging narrative is the merger and acquisition activity involving public companies and crypto projects. VirtualBacon noted that Tron is set to go public through a Nasdaq reverse merger, while Mixie has been acquired by Netcapital, which boasts a team that includes notable figures like Tim Draper and a co-founder of Helium. A particularly intriguing development is World Liberty Financial (WLF), co-founded by Eric and Donald Jr. Trump, which aims to become a major player in the decentralized finance (DeFi) space. With plans for its own stablecoin, USD1, and expected to launch in October, the token could have an estimated FDV of $10–15 billion, a conservative projection given its potential. VirtualBacon also pointed out that stablecoins are becoming central to macroeconomic strategies. Tether now ranks as the fifth-largest holder of US Treasuries, highlighting the increasing need for buyers in the market. The analyst urged investors to keep an eye on stablecoin projects that integrate artificial intelligence technology and yield generation, such as USD1, Circle’s USDC, and others. Liquidity Shifts To Altcoin Platforms In the gaming sector, liquidity is coalescing around BlackholeDex, a decentralized exchange (DEX) backed by the AVAX Foundation. With a fee-sharing model similar to Aerodrome and Shadow, BlackholeDex has launched veNFT staking, aligning long-term incentives for users. Related Reading: Ethereum Slows Down In June: Historical Data Says More Losses To Come Lastly, in the Solana ecosystem, Saros DLMM is emerging as a strong competitor to existing platforms like Jupiter and Meteora, utilizing similar bucket-based liquidity pools but with lower fees. It also plans a RADY meme airdrop for SAROS stakers, which could attract early adopters and fuel rapid growth, thus closing the list of highlighted altcoins. As of this writing, Ethereum, the market’s leading altcoin, is trading at $2,521. It has consolidated above this level after dropping sharply from its two-week high of $2,878. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Crypto Gets A Green Light From Spanish Banking Giant",
      "link": "https://www.newsbtc.com/crypto/crypto-gets-a-green-light-from-spanish-banking-giant/",
      "summary": "Since late 2024, BBVA’s private‑banking arm in Switzerland has been quietly advising clients to add Bitcoin and Ether to their holdings. According to Philippe Meyer, who leads digital and blockchain solutions at BBVA Switzerland, wealthy customers should allocate between 3% and 7% of their portfolios to crypto. Based on reports, this advice aims to boost returns without exposing investors to outsized risk. Related Reading: Tether Enforces Freeze On $12 Million In Tron Funds Over Illicit Activity Early Adoption Timeline BBVA began executing crypto trades in 2021 for a handful of clients. By September 2024, Meyer says the bank had started formally recommending a 3% Bitcoin stake in balanced portfolios. Now, risk‑tolerant clients can move up to 7% into digital assets, reflecting BBVA’s growing confidence in crypto as a mainstream option. Philippe Meyer recently delivered a presentation at a blockchain conference in Lugano, Switzerland. Source: BBVA Switzerland. Client Reaction And Risk Views Many clients have responded well so far. Meyer notes that even a small 3% allocation “already boosts the performance” of a diversified portfolio and “you are not taking a huge risk” at that level. Short‑term swings still occur—crypto markets can drop 20% in a week—but private clients seem ready to ride those waves in pursuit of higher gains. According to Reuters, BBVA, Spain’s second-largest bank, has been advising its private banking clients since September 2024 to allocate 3% to 7% of their portfolios to cryptocurrencies based on their risk appetite. The guidance currently applies to Bitcoin and Ether, with plans… — Wu Blockchain (@WuBlockchain) June 17, 2025 Regulatory And Market Context Europe’s Markets in Crypto‑Assets regulation (MiCA) took full effect at the end of December 2024. This rulebook governs token issuers and service providers across the EU. Yet the European Securities and Markets Authority reports that 95% of EU banks avoid crypto activities entirely. BBVA stands out: in March 2025, Spain’s securities regulator gave it formal approval to offer Bitcoin and Ether trading in the country. Related Reading: Record‑High Ethereum Open Interest Signals Institutional Confidence Next Steps For App And Investors BBVA plans to roll out buy, sell, and portfolio management features inside its existing mobile app over the coming months. The launch will begin with select clients before expanding more broadly. As rival banks like Santander explore their own stablecoins—pegged to dollars and euros—BBVA’s move could spur a wave of mainstream crypto services. For now, only high‑net‑worth clients hear this crypto advice. But if allocations deliver solid returns and BBVA weathers any market crashes, other banks may follow. That would give more investors the chance to include crypto alongside stocks, bonds, and real estate. The real test will come if Bitcoin or Ether plunge sharply. If BBVA’s cautious plan holds up under stress, it may reshape how mainstream finance treats digital assets. Featured image from ESG News, chart from TradingView"
    },
    {
      "title": "Much Ado About Something? JPMorgan Launches USD Deposit Token – Not Stablecoin",
      "link": "https://www.newsbtc.com/news/jpmorgan-launches-usd-deposit-token-not-stablecoin/",
      "summary": "After days of rumors around the identity of the mysterious ‘JPMD’ token filed by JPMorgan, widely supposed to be a stablecoin, the truth has finally emerged. JPMD isn’t a stablecoin after all – it’s a deposit token on the Base blockchain (Coinbase’s own blockchain). With JPMD, institutions have a round-the-clock method of making deposits, incorporating established banking systems with blockchain technology. It’s one more step along the path towards crypto as a normal part of everyday life, alongside core crypto projects like Best Wallet token. Time to learn more about why JPMorgan thinks deposit tokens are part of the future of crypto. Not a Surprise After All: JPMorgan Champions Deposit Tokens Perhaps everyone should have guessed what JPMD was. After all, one of the largest banks in the US is hardly likely to do anything without a lot of research and preparation. And in this case, JPMorgan has been championing blockchain-powered deposit tokens since at least 2022. That was when the company published an extensive report on the utility and function of proposed deposit tokens. Calling them ‘a foundation for stable digital money,’ JPMorgan outlined a number of core advantages a deposit token could offer to traditional banks: ✔️ Digital form of commercial bank money – deposit token fills the role of existing deposit claims ✔️ Blockchain-native programmability – with deposit tokens, banks can access smart contracts, an atomic settlement option, and automated processing ✔️ Payment efficiency and cost reduction – on-chain deposit tokens provide real-time transfers; no more waiting for deposits to settle after-hours ✔️ Seamless integration with banking – established use cases, existing support networks, and even clear legal status; there’s little to prevent immediate use of deposit tokens within the current banking infrastructure That last point is critical. Even while stablecoins draw increased attention, deposit tokens like JPMD hold one clear advantage: they fit neatly into existing rules and regulations. Trademark Filed, JPMorgan Builds Base for Crypto-Finance Integration JPMorgan filed the trademark application on June 15, 2025. As it turns out, the deposit token will be built on the Base blockchain and will leverage that chain to provide round-the-clock crypto access for its clients (Coinbase is one). If JPMD takes off – and it should, since JPMorgan has a market cap of roughly $738B – it could be the next step in the growing conjunction between crypto and finance. Institutions have led crypto adoption in recent months, but there are growing signs that retail adoption won’t be far behind. Success in a fully integrated crypto-financial world will rest partly on the power of your crypto wallet. Best Wallet app is a leading non-custodial crypto wallet, and now the Best Wallet Token launch takes the wallet to the next level. Best Wallet Token ($BEST) – Upgrade Your Crypto Wallet to be Future-Proof Best Wallet Token ($BEST) takes the power of the Best Wallet app up a notch. $BEST token holders gain: ✅ Exclusive crypto presale access ✅ Reduced trading fees ✅ Increased staking rewards ✅ Governance rights and participation Best Wallet is the only crypto presale wallet, offering an Upcoming Tokens feature where you can research and invest in the best crypto presales. It’s all part of a growing crypto ecosystem where Best Wallet, Best Wallet Token, and the upcoming Best Card work together to equip you to navigate a brave new crypto world. That gives $BEST unique utility, even among other crypto presales. Currently, tokens cost $0.025195, and early investors can stake them for a 104% variable APY. Our price prediction sees the token price potentially reaching $0.035215 by the end of the year, delivering 40% returns to anyone who buys in now. Learn how to buy Best Wallet token, and don’t forget to visit the Best Wallet Token presale page today. JPMorgan, Best Wallet Show Path Forward for Crypto Together, the launch of both $BEST and $JPMD highlights the way forward for crypto. Traditional finance and crypto are no longer separate things – they’re two sides of the same coin, and crypto wallets connect them. Before purchasing $BEST, do your own research. This isn’t financial advice."
    },
    {
      "title": "Researchers Forecast Bitcoin At $4.3 Million By 2036, Citing Institutional Demand",
      "link": "https://www.newsbtc.com/bitcoin-news/researchers-forecast-bitcoin-at-4-3-million-by-2036-citing-institutional-demand/",
      "summary": "In a striking forecast, two academic researchers, Murray Rudd and Dennis Porter, have predicted that Bitcoin (BTC) could soar to an astonishing $4.3 million by 2036 if institutional buying trends continue. This prediction was highlighted by market expert Giovanni Incasa, who emphasized the significance of applying rigorous supply-demand theories to Bitcoin&#8217;s unique economic structure. Supply Shock Warning Rudd and Porter have employed pure mathematical modeling to analyze Bitcoin&#8217;s market dynamics, warning that the impending supply shock could lead to price fluctuations ten times more severe than anything seen to date. Their findings suggest that the effects of this supply shock will result in permanent wealth redistribution, fundamentally altering the landscape of digital assets. Related Reading: On-Chain Analyst Warns: Bitcoin Peak Expected, Altcoins Facing -95% Plunge According to their conservative estimates, the Bitcoin price could reach $2.2 million per coin by 2036, a projection rooted in what they describe as &#8220;economic physics.&#8221; The researchers note that the current liquid supply of Bitcoin stands at only 11.2 million coins, with an estimated 4 million Bitcoin lost forever due to lost keys and Satoshi Nakamoto&#8217;s unspent stash. Their analysis reveals that only half of BTC’s total supply is actively liquid, meaning that even modest institutional purchases could lead to significant supply shortages. Evidence of this trend can be seen in the daily buying habits of US exchange-traded funds (ETFs), which have averaged 285 Bitcoin per day since their launch, and the actions of Bitcoin treasury companies that are removing thousands of coins from circulation through debt financing. Senator Cynthia Lummis has also proposed a strategic reserve of one million Bitcoin, which would involve an acquisition of approximately 550 coins per day over five years. The researchers calculate that if 2,000 Bitcoin are removed from circulation daily, the price could reach $106,000—a figure that is already close to today&#8217;s trading price of $104,800, suggesting that their mathematical framework is holding true. The crux of the researchers&#8217; findings is that traditional supply curves are not applicable to BTC. Its perfectly inelastic supply creates significant bottlenecks as demand rises, leading to dramatic price increases. They emphasize that institutions that delay their investments risk becoming permanently priced out of the market. Three Scenarios For Bitcoin Rudd and Porter outline three potential scenarios for Bitcoin&#8217;s future. In a conservative scenario, with a 20-fold increase in demand and continued institutional adoption leading to 2,000 daily Bitcoin withdrawals, prices could reach $2.2 million by 2036. Their bullish scenario posits a 30-fold demand growth, where Bitcoin could hit $5 million by early 2031. The most extreme, hyperbolic scenario anticipates a 40-fold demand increase, with daily withdrawals escalating to 4,000 Bitcoin, potentially driving prices to $4.3 million by 2036 and valuing Bitcoin at six times the current market cap of gold. Related Reading: Ethereum Slows Down In June: Historical Data Says More Losses To Come The implications of Rudd and Porter’s research extend beyond mere speculation. It highlights a transformative period for BTC and the broader financial landscape, where strategic positioning and early adoption could mean the difference between thriving and merely surviving in the digital economy. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "How Low Can Cardano Go? Analyst Maps Final Crash Before Resolution",
      "link": "https://www.newsbtc.com/news/cardano/how-low-can-cardano-go-final-crash/",
      "summary": "After more than five weeks of unrelenting downside pressure, Cardano (ADA) finds itself approaching a potentially decisive juncture. In a new analysis published June 18, crypto analyst Quantum Ascend (@quantum_ascend) offered a fresh take on ADA’s price structure, warning that the final leg of a downward five-wave Elliott pattern may now be unfolding—with a critical resolution point drawing near. How Low Can Cardano Crash? “We dropped down into that second wave&#8230; and had it highlighted, it bounced from there. So we did call that correctly,” the analyst began, referencing earlier predictions. But despite the brief bounce, he now sees a more extended impulse playing out. “It does look like we&#8217;re turning this into more of a five-wave move down. So one, two, three, four, and working on a fifth wave now,” he explained while analyzing the one-day chart of ADA. Related Reading: Whales Dump Over 270 Million Cardano In One Week – Bearish Signal Or Shakeout? At the core of the bearish outlook is Fibonacci confluence. Quantum Ascend pointed out that ADA currently hovers around the 0.702 retracement level, with the 0.786 level lying just beneath it—both key zones often associated with deeper corrections in Elliott Wave theory. “Makes complete sense for us to go ahead and drop in right to this area at the very minimum,” he noted. Yet despite the grim technicals, the analyst maintains that no structural damage has occurred—at least not yet. “As long as we hold the 51 cent level, nothing&#8217;s broken, it&#8217;s not a problem, right?” he reassured. The broader context, however, is less encouraging: “We need Bitcoin to catch a little bit of a bid or Ethereum or something. We need some kind of good news to come in to alleviate a little bit of this because the market’s just pretty much been bleeding… for over a month now.” ADA has underperformed relative to its peers since early May, with sentiment sliding alongside price. But Quantum Ascend encouraged viewers not to overreact to the current downtrend. “All it is is an opportunity to dollar cost average,” he said, before addressing the exhaustion many long-term holders are feeling. “I know what you&#8217;re saying, QA. I&#8217;ve been dollar cost averaging for seven months. I get it. I&#8217;ve been there.” Related Reading: Nasdaq Says Yes To Cardano: ADA Earns A Spot Among Crypto Giants Rather than panic-sell or obsess over day-to-day moves, the analyst recommended mental distance and patience. “Go do something fun, it’s beautiful, it’s summer. Go do something else, anything else. But this thing is gonna resolve itself and alt season is around the corner,” he said. Despite short-term bearishness in the chart, his long-term conviction remains intact. “World War III is not starting. I could not have more conviction in all those things.” With ADA potentially entering the final leg of a corrective structure and broader markets searching for a catalyst, all eyes are now on whether support zones hold—or if Cardano is headed even lower before the long-awaited resolution finally arrives. At press time, ADA traded at $0.6158. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Tech Booms: Lightning Data Defies Digital Gold Narrative",
      "link": "https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_a_rough_gold_rock_with_Bitcoin_logo_stampe_2.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative\" rel=\"nofollow\"> </a></p> <p>Bitcoin tech shines in 2025 with 1.5 million Lightning users, $1.5 billion trading volume, and Block’s 9.7% yield, outpacing treasury hype.</p> <p>"
    },
    {
      "title": "K33 Announces Plans To Purchase Up To 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norwegian-Public-Company-K33-AB-Purchased-10-BTC-For-Their-New-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>K33 has launched a SEK 85 million share issue at a price of SEK 0.1036 per share.</p> <p>"
    },
    {
      "title": "The Blockchain Group Buys $20 Million Worth Of Bitcoin",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-buys-20-million-worth-of-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/10.4B-Bitcoin-Firm-Unchained-Announces-First-Regulated-Bitcoin-Native-Trust-Company-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-buys-20-million-worth-of-bitcoin\" rel=\"nofollow\"> </a></p> <p>European Bitcoin treasury company acquires 182 BTC through convertible bonds and warrant conversions, bringing total holdings to 1,653 BTC worth $172 million.</p> <p>"
    },
    {
      "title": "Prenetics Becomes First Healthcare Firm to Launch Bitcoin Treasury Strategy With $20M BTC Purchase",
      "link": "https://bitcoinmagazine.com/news/prenetics-becomes-first-healthcare-firm-to-launch-bitcoin-treasury-strategy-with-20m-btc-purchase",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Prenetics-Buys-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/prenetics-becomes-first-healthcare-firm-to-launch-bitcoin-treasury-strategy-with-20m-btc-purchase\" rel=\"nofollow\"> </a></p> <p>Prenetics Global Limited, a health sciences company, announced today that it has purchased $20 million worth of Bitcoin as part of a newly approved corporate treasury strategy. The company acquired 187.42 BTC at an average price of $106,712 and stated that its board has approved allocating the majority of its $117 million balance sheet to [&#8230;]</p> <p>"
    },
    {
      "title": "Swiss Bitcoin Platform Relai & Casa Partner to Offer Multisig Bitcoin Security",
      "link": "https://bitcoinmagazine.com/news/swiss-bitcoin-platform-relai-casa-partner-to-offer-multisig-bitcoin-security",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Swiss-Bitcoin-Platform-Relai-Casa-Partner-to-Offer-Multisig-Bitcoin-Security.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/swiss-bitcoin-platform-relai-casa-partner-to-offer-multisig-bitcoin-security\" rel=\"nofollow\">Swiss Bitcoin Platform Relai &amp; Casa Partner to Offer Multisig Bitcoin Security</a></p> <p>Relai teams up with Casa to launch a new feature combining Bitcoin accumulation with multisignature security and inheritance planning.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "'Global Response' to Crypto Regulation Needed as US Advances GENIUS Act: FCA",
      "link": "https://decrypt.co/325790/global-response-crypto-regulation-fca",
      "summary": "Lord Chris Holmes argued \"right-size regulation\" benefits innovation, adding that only \"grifters and chancers\" want a regulatory-free environment."
    },
    {
      "title": "Bitcoin Falls as Trump Calls Powell ‘Stupid’ Amid Flaring Middle East Tensions",
      "link": "https://decrypt.co/325807/bitcoin-falls-as-trump-calls-powell-stupid-amid-flaring-middle-east-tensions",
      "summary": "The U.S. central bank is expected to hold interest rates steady, but a post-decision press conference could contain linguistic pivots."
    },
    {
      "title": "SENATE PASSES GENIUS ACT, FED DECISION TODAY, US-IRAN THREATS GROW",
      "link": "https://decrypt.co/videos/interviews/SzrQCw0z/senate-passes-genius-act-fed-decision-today-us-iran-threats-grow",
      "summary": ". FOMO HOUR LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. Crypto slides on escalating Israel-Iran war. US Senate passes GENIUS Act. Genius Act extends Dollar dominance: Sacks. Stablecoins can reduce debt costs: Bessent. Stablecoins $3.7T market by 2030: Bessent. DDC Enterprise to raise $528m to buy BTC. Norway’s K33 to issue SEK 85m equity to buy BTC. JP Morgan to pilot stablecoin JPMD on Base. JD com to apply for stablecoin licenses globally. Eyenovia to buy $50m HYPE for treasury. Coinbase seeks SEC approval for tokenised equities. DEXs account for ATH 20% of trading volumes. Cantor Fitzgerald promotes SOL focused stocks. BBVA tells clients to invest in BTC, ETH. Thailand exempts crypto cap gains tax for 5yrs. Iran’s crypto exchange Nobitex hacked for $73m. 00:00 - Intro 05:00 - Tylers breakdown 09:00 - Markets and top stories 16:30 - Blackrock news 17:30 - JP Morgan collaborating with US crypto task force 19:00 - \"Last Cycle\" talk and tech bubbles 21:10 - HyperLiquid \"Hype\" news 25:00 - Iran/Israel Conflict 29:15 - Iran Crypto Exchange hacked by Israeli hacker group 41:00 - Tylers big \"AI Only Fans\" News \"Lily token\" 45:00 - Kraken/INK Token launch news 46:40 - Myriad News from Farokh 49:45 - Giveaway LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    },
    {
      "title": "Washington City Bans Bitcoin ATMs Amid Surge in Crypto Scams",
      "link": "https://decrypt.co/325791/washington-city-bans-bitcoin-atms-amid-surge-in-crypto-scams",
      "summary": "Spokane’s city council has passed an ordinance targeting crypto kiosks used in a billion-dollar nationwide fraud scheme."
    },
    {
      "title": "AI Can Help the Crypto Industry, CFTC Commissioner Johnson Says—But Also Boost Fraud",
      "link": "https://decrypt.co/325759/ai-help-crypto-industry-cftc-commissioner-johnson-boost-fraud",
      "summary": "Outgoing CFTC Commissioner Kristin Johnson is pushing for fraudsters who use AI to receive harsher penalties."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin stays resilient ahead of Fed meeting as investors await policy signals",
      "link": "https://cryptobriefing.com/bitcoin-resilient-ahead-fed-meeting/",
      "summary": "<p>Bitcoin's resilience amid Fed uncertainty highlights its potential as a hedge, but future rate signals could impact broader market liquidity.</p> <p>"
    },
    {
      "title": "Canada’s first XRP spot ETF goes live on Toronto Stock Exchange",
      "link": "https://cryptobriefing.com/canadas-first-xrp-spot-etf/",
      "summary": "<p>The launch of Canada's first XRP spot ETF could accelerate mainstream adoption of digital assets, enhancing financial market innovation.</p> <p>"
    },
    {
      "title": "Iran’s largest crypto exchange appears to have been exploited, suspected Israeli hackers threaten to leak source code and user data",
      "link": "https://cryptobriefing.com/nobitex-cyberattack-iran-exchange/",
      "summary": "<p>The breach highlights vulnerabilities in Iran's financial systems, potentially escalating geopolitical tensions and impacting regional cybersecurity.</p> <p>"
    },
    {
      "title": "US Senate passes GENIUS stablecoin bill, advancing it to the House for final approval",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house/",
      "summary": "<p>US Senate passes the GENIUS stablecoin bill, advancing it to the House for a vote in 3 weeks with rules on backing, audits, and oversight.</p> <p>"
    },
    {
      "title": "JPMorgan Chase to pilot stablecoin-like JPMD for institutional clients on Base",
      "link": "https://cryptobriefing.com/jpmorgan-jpmd-deposit-token/",
      "summary": "<p>JPMorgan's pilot of JPMD tokens could accelerate institutional adoption of blockchain technology, influencing future financial systems.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin & HYPE set to soar? U.S. firms pour $844 mln into crypto treasuries",
      "link": "https://ambcrypto.com/bitcoin-hype-set-to-soar-u-s-firms-pour-844-mln-into-crypto-treasuries/",
      "summary": "<img alt=\"Bitcoin &amp; HYPE set to soar? U.S. firms pour $844 mln into crypto treasuries\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-4-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whales going aggressively long on BTC and HYPE amid $844M inflow into crypto treasuries."
    },
    {
      "title": "SEC delays Solana ETFs despite 90% approval odds: ‘Timeline unknown’",
      "link": "https://ambcrypto.com/sec-delays-solana-etfs-despite-90-approval-odds-timeline-unknown/",
      "summary": "<img alt=\"SEC delays Solana ETFs despite 90% approval odds: &#039;Timeline unknown&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Solana-ETF-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Market focus has shifted to July or October for a likely U.S spot SOL ETF approval."
    },
    {
      "title": "Iran’s Nobitex crypto exchange hit by $81 mln hack – Israel group claims responsibility",
      "link": "https://ambcrypto.com/irans-nobitex-crypto-exchange-hit-by-81-mln-hack-israel-group-claims-responsibility/",
      "summary": "<img alt=\"Iran&#039;s Nobitex crypto exchange hit by $81 mln hack - Israel group claims responsibility\" class=\"attachment-full size-full wp-post-image\" height=\"659\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Nobitex-Exploited-for-over-80-Million.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1171\" />Another week, another $80 million lost - Are centralized crypto exchanges becoming the weakest link in Web3?"
    },
    {
      "title": "BlackRock’s $638 mln Bitcoin buy: Ultimate hedge, confirmed?",
      "link": "https://ambcrypto.com/blackrocks-638-mln-bitcoin-buy-ultimate-hedge-confirmed/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_49_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BlackRock buys 6,088 BTC, triggering major short liquidations and fueling Bitcoin’s role as digital gold."
    },
    {
      "title": "Analysts Warn Against Early Selling: FUNToken’s Big Move May Still Be Ahead",
      "link": "https://ambcrypto.com/analysts-warn-against-early-selling-funtokens-big-move-may-still-be-ahead/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1024\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/AMB_CRYPTO_COVER_IMAGE.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1536\" />FUNToken has shown strong growth in early June 2025, climbing over 27% in just two [&#8230;]"
    }
  ]
}