{
  "CoinDesk": [
    {
      "title": "Circle Has USDC Revenue Sharing Deal With Second-Largest Crypto Exchange ByBit: Sources",
      "link": "https://www.coindesk.com/business/2025/07/09/circle-has-usdc-revenue-sharing-deal-with-second-largest-crypto-exchange-bybit-sources",
      "summary": ""
    },
    {
      "title": "Bitcoin Starts Surging Toward $110K After Trump Says 'Fed Rate' Is 300 Basis Points Too High",
      "link": "https://www.coindesk.com/markets/2025/07/09/bitcoin-starts-surging-toward-usd110k-after-trump-says-fed-rate-is-300-basis-points-too-high",
      "summary": ""
    },
    {
      "title": "Filecoin Rises 4%, Heavy Volume Suggests Institutional Investors Buying",
      "link": "https://www.coindesk.com/markets/2025/07/09/filecoin-rises-4-heavy-volume-suggests-institutional-investors-buying",
      "summary": ""
    },
    {
      "title": "Cronos Jumps 18% After Trump Media ETF Proposal Lists Token Among Holdings",
      "link": "https://www.coindesk.com/markets/2025/07/09/cronos-jumps-18-after-trump-media-etf-proposal-lists-token-among-holdings",
      "summary": ""
    },
    {
      "title": "The Protocol: Vitalik Buterin's Latest Proposal – Transaction Gas Cap",
      "link": "https://www.coindesk.com/tech/2025/07/09/the-protocol-vitalik-buterin-s-latest-proposal-transaction-gas-cap",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "GMX halts trading, token minting following $40 million exploit",
      "link": "https://cointelegraph.com/news/gmx-v1-exchange-exploited-40-million-drained?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VmZjgtZmRhYy03MjI0LTk0YzMtOWIxMzgyMmM4ZWI4.jpg\" /></p><p>The exploit of the GMX V1 decentralized exchange is the latest in a string of attacks targeting crypto firms and users in 2025.</p>"
    },
    {
      "title": "US CLARITY bill could allow Tesla and Meta to evade SEC rules — Senator Warren",
      "link": "https://cointelegraph.com/news/elizabeth-warren-clarity-bill-tech-companies-evade-sec?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MmZmMmYtNjI4Ny03MWI0LWJkNWMtY2I4NDliMjM2YzBk.jpg\" /></p><p>The legislation to establish crypto market structure is one of three bills the US House of Representatives is expected to consider starting next week.</p>"
    },
    {
      "title": "Robinhood stock nears record high as tokenization strategy gains traction",
      "link": "https://cointelegraph.com/news/robinhood-stock-rises-crypto-tokenization?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VmZDUtMGM5Yy03NTYyLThjOTAtNTA2YjI1NmYyNDYx.jpg\" /></p><p>Robinhood is trading near all-time highs as its expanded push into crypto and blockchain continues to pay off.</p>"
    },
    {
      "title": "Germany’s top banks managing $4.5 trillion+ in assets are going crypto—Here’s what to watch",
      "link": "https://cointelegraph.com/explained/germanys-top-banks-managing-45-trillion-in-assets-are-going-cryptoheres-what-to-watch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy80NWQxNDg5ZjhmZGU3NjYzYmE1YjA5OGY0ZWVjYzM2OS5qcGc=.jpg\" /></p><p>Germany’s top banks, including Deutsche Bank and Sparkassen, are entering crypto with regulated trading and custody services by 2026.</p>"
    },
    {
      "title": "LetsBonk overtakes Pump.fun: Are Solana memecoins back for good?",
      "link": "https://cointelegraph.com/news/letsbonk-overtakes-pumpfun-solana-memecoins?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzExNDUtNzZjZS03YjZjLWFjNGYtNTJjMjU3YmY1MDg0.jpg\" /></p><p>Key metrics on Solana remain flat despite LetsBonk’s recent surge, but supporting data suggests memecoins may be staging a comeback.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Pump.fun faces scrutiny over PUMP token distribution in upcoming ICO",
      "link": "https://cryptoslate.com/pump-fun-faces-scrutiny-over-pump-token-distribution-in-upcoming-ico/",
      "summary": "<p>Solana-based memecoin launchpad Pump.fun has confirmed that its native PUMP token will debut through an Initial Coin Offering (ICO) on July 12. The token will have a total supply of 1 trillion and a structured allocation designed to serve institutional, community, and internal stakeholders. PUMP&#8217;s ICO details About 33% of the total PUMP token supply [&#8230;]</p> <p>"
    },
    {
      "title": "The Graph Brings Real Time Data Streaming to TRON, Providing Builders with Advanced Blockchain Insights",
      "link": "https://cryptoslate.com/the-graph-brings-real-time-data-streaming-to-tron-providing-builders-with-advanced-blockchain-insights/",
      "summary": "<p>SAN FRANCISCO, July 9, 2025 – The Graph, the open, universal data layer for web3, announced today a strategic integration with the TRON blockchain network. This integration leverages Substreams, a powerful streaming product developed by StreamingFast, a core developer team for The Graph, and marks a significant expansion in blockchain data accessibility by offering developers [&#8230;]</p> <p>"
    },
    {
      "title": "Kraken expands xStocks to BNB Chain enabling global access to tokenized equities",
      "link": "https://cryptoslate.com/kraken-expands-xstocks-to-bnb-chain-enabling-global-access-to-tokenized-equities/",
      "summary": "<p>Kraken has announced the expansion of its xStocks product to Binance-backed BNB Chain, marking a significant step toward making tokenized US equities more accessible globally. According to a July 9 statement, Kraken&#8217;s users outside the United States will soon be able to deposit and withdraw tokenized stocks, such as AAPLx, TSLAx, SPYx, and NVDAx, via [&#8230;]</p> <p>"
    },
    {
      "title": "GMX suffers $42M hack, issues 10% bounty offer to hacker",
      "link": "https://cryptoslate.com/gmx-suffers-42m-hack-issues-10-bounty-offer-to-hacker/",
      "summary": "<p>A major security incident struck the decentralized exchange GMX, siphoning approximately $42 million from its Arbitrum-based v1 perpetual platform. In response, GMX has sent an on-chain message to the hacker offering a 10% white-hat bounty. The platform stated that no legal action will be pursued if the remaining funds are returned within 48 hours. This [&#8230;]</p> <p>"
    },
    {
      "title": "Ripple appoints BNY Mellon as custodian for RLUSD reserves as supply tops $500M",
      "link": "https://cryptoslate.com/ripple-appoints-bny-mellon-as-custodian-for-rlusd-reserves-as-supply-tops-500m/",
      "summary": "<p>According to a July 9 announcement, Ripple has appointed BNY Mellon as the official reserve custodian for its enterprise-focused stablecoin, Ripple USD (RLUSD). According to a July 9 announcement, BNY Mellon was selected based on its extensive experience in digital asset infrastructure and its role as a trusted provider of transaction banking services in the US. The [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Is Dogecoin Prepping For Takeoff? Fib Reaction And Trend Support Say Yes",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-prepping-for-takeoff/",
      "summary": "Dogecoin may be gearing up for its next breakout. After holding firm near $0.17 on the weekly chart, DOGE recently bounced off key Fibonacci and trendline support, hinting at renewed bullish potential. With its 200‑week moving average offering steady support and price comfortably above the ascending channel, technicals suggest the setup is aligning. If the recent dip toward the 200 MA on the M15 chart proves to be a low-risk entry, this could set the stage for a retest of the $0.16490 resistance, and possibly more. Rejection At Resistance, But Technicals Still Favor Bulls In a recent analysis shared on X, Thomas Anderson presented a detailed breakdown of DOGE/USD price action across the M15 and M30 timeframes. According to the expert, Dogecoin is currently trading at $0.17043, and the price is facing rejection at the yellow horizontal resistance line around $0.16490. The price action shows consolidation just below this key level, signaling indecision among traders. Related Reading: Analysts Predict Major Dogecoin Price Rally After Breaking 50-Day Trendline Anderson pointed out that the 200 MA (red line) is acting as dynamic support from below, helping to anchor the price during the current consolidation phase. This moving average support provides bulls the foundation to regain control if momentum shifts in their favor. On the M30 chart, Anderson noted that the broader bullish structure remains intact, with DOGE price holding above the ascending trendline. This technical pattern suggests continued optimism for upward movement, provided the price does not break below key support areas. Thomas Anderson concluded that any pullback toward the 200 MA on the M15 timeframe could offer a buying opportunity, particularly for traders eyeing a retest of the $0.16490 resistance. Dogecoin Weekly Chart Echoes Elliott Theory’s Bullish Blueprint Taking a closer look at Dogecoin’s weekly chart, crypto analyst Andrew observed a notable long-term wave structure unfolding. He explained that over the past three years, DOGE has completed a five-wave impulse to the upside, which was followed by a typical ABC correction, consistent with Elliott Wave theory. Related Reading: Dogecoin (DOGE) Eyes Breakout — Can Bulls Unleash the Next Surge? Andrew further noted that price found a strong reaction at the 0.786 Fibonacci level, marked by a light blue line, which traces the retracement from the entire upward move. This reaction suggests that DOGE may have reached a critical support area, where buyers could begin stepping in. With this in mind, Andrew believes the current structure appears to be forming a larger 1-2 setup, which could lead to a powerful Wave 3 advance. If this pattern plays out, it may signal the start of a new bullish phase with the potential to break beyond previous highs. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "Ledger Offers a 30% Discount on Most Colors for Nano S Plus and Nano X Until July 15",
      "link": "https://www.newsbtc.com/crypto/30-discount-on-ledgers-nano-s-plus-and-nano-x-until-july-15/",
      "summary": "Ledger has announced a limited-time 30% discount on nearly all color models of its popular Nano S Plus and Nano X hardware wallets, valid through July 15. The promotion has drawn fresh attention to the company’s flagship products, widely regarded as industry benchmarks for secure crypto storage. Together, the Nano S Plus and Nano X boast 13,345 reviews, the majority of which are positive, underscoring the strong trust and satisfaction among users worldwide. But what makes Ledger such a popular hardware wallet? Ledger Wallet’s Blend of Security, Comfort, and Style – this is what makes them so attractive to its loyal fanbase and newbies alike. Ledger excels in the areas of security, comfort level, and overall style, but it’s the wallet’s security features that attract users. Ledger relies on a multi-layered security profile, with several noticeable features, like: ✅ The PIN code that secures the actual device to prevent unauthorized access is required to complete any transaction ✅ The 24-word phrase, which acts as the master key, secures your funds against any malicious access ✅ The trademark Blockchain Open Ledger Operating System (BOLOS), which isolates any installed apps from one another and the 24-word phrase from all apps and the operating system itself ✅ Secure Element Chip, the hardware component that keeps the private keys offline for a higher level of security Plus, Ledger’s Donjon team, which consists of seasoned hackers, is constantly testing the products’ security to identify any potential vulnerabilities. Their efforts are part of Ledger’s Bug Bounty program, which rewards anyone who finds security weaknesses in Bitcoin, showcasing the team’s commitment to continuous improvements in the security department. While security is the most important aspect, other features matter as well, like the comfort level associated with carrying and using the wallet. Ledger’s Nano S Plus and Nano X are the sleekest and most comfortable to use and wear, thanks to their slim builds. Nano S Plus consists of steel and plastic, weighing only 0.74 ounces, while Nano X is slightly larger, thanks to the lithium battery, reaching 1.19 ounces. The slim format makes them comfortable to wear, even as keychains if you always insist on having them with you. Finally, the color palette offers a final touch to the already unique style, imbuing the wallets with a modern vibe. Colors like emerald-green, sapphire-blue, and amethyst-purple come with a plus of personality and X factor. The Massive 30% Discount Ends on July 15 Ledger’s flash promotion (offering a 30% discount on its Nano S Plus and Nano X wallets) is set to end on July 15, giving buyers less than a week to take advantage. The deal aims to spotlight two of Ledger’s most widely used products, with a combined user base of around 7 million worldwide. Most color options are eligible, with only onyx-black and BTC-orange for the Nano X, and matte-black and BTC-orange for the Nano S Plus excluded from the promotion. Should You Buy the Ledger Wallet? Nobody can answer that for you, but if you’ve decided that the Ledger wallet meets your expectations in terms of security, style, and ease of use, and you want to buy it, buy it today. Or, at the very least, until July 15, when the current 30% promotion ends, because discounts like these don’t come often. Also, go to Ledger’s website and scroll through their offers. You’ll find a lot of products and accessories, based on your needs. Remember, this is not financial advice. Do your own research before buying any product."
    },
    {
      "title": "Elon Musk Drops Epstein ‘Peanut’ Bomb — PNUT Coin Explodes 10%",
      "link": "https://www.newsbtc.com/altcoin/elon-musk-drops-epstein-peanut-bomb-pnut-coin-explodes-10/",
      "summary": "A sudden social media jab sent Solana’s Peanut the Squirrel token soaring this week. In a Tuesday post, billionaire Elon Musk criticized US authorities for ignoring names on the Jeffrey Epstein &#8220;client list&#8221;, quipping that “more squirrels and raccoons have been arrested” than any Epstein affiliates. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 A nod to a squirrel named Peanut—said to have been “arrested (and killed)”—coincided with a sharp pop in the PNUT token’s value. According to on‑chain data, PNUT climbed over 10% in 24 hours, touching $0.23 at one point. Elon Musk Highlights Justice Concerns Based on reports, Musk’s post racked up more than 13.7 million views within hours. Traders quickly linked “Peanut” to the PNUT ticker. Almost immediately, PNUT price rose from about $0.22 to $0.23. Peanut price up in the last 24 hours. Source: Coingecko The token’s 24‑hour trading volume jumped roughly 80%, crossing $215 million. Market watchers estimate PNUT’s market cap now sits near $224 million, out of a total supply approaching 1 billion tokens. Market Reaction Follows Viral Meme Meme tokens often depend on hype, and PNUT was no exception. After Musk’s message spread, order books filled fast. Buy orders outnumbered sells, driving price momentum. Crypto bots and retail traders piled in, hoping to catch the wave. Some investors told reporters they moved funds into PNUT within minutes of seeing Musk’s post. They arrested (and killed) Peanut, but have not even tried to file charges against anyone on the Epstein client list. Government is deeply broken. pic.twitter.com/YndRadQUBE — Elon Musk (@elonmusk) July 8, 2025 Token Jump Drives Trading Frenzy Solana’s speedy network helped too. Transactions cleared in seconds, letting traders react without delay. That low‑fee environment amplifies meme coin rallies: when hype hits, people can buy or sell without worrying about high gas costs. In this case, volume spiked from around $120 million to $214 million in under a day. Related Reading: 2% Of All XRP Is In His Hands — But Who Is He? Looking Ahead, Caution Advised Despite the rush, crypto veterans warn that PNUT’s gains could reverse just as fast. Meme tokens lack fundamentals, and hype fades quickly. Traders could face losses if views shift or if Musk moves on to the next joke. For now, Musk’s satirical jab has put Peanut the Squirrel on center stage. Whether PNUT can hold its gains may depend on more viral moments—and on whether investors remember to take profits before the next twist. No &#8216;Client List&#8217; Meanwhile, according to a memo obtained by Axios, the Justice Department and FBI under US President Donald Trump found no evidence that convicted sex offender Jeffrey Epstein blackmailed powerful individuals, kept a “client list,” or was murdered. Featured image from Meta, chart from TradingView"
    },
    {
      "title": "Analyst Predicts 50% “Moonshot” For XRP Price If This Line Breaks",
      "link": "https://www.newsbtc.com/analysis/xrp/50-moonshot-for-xrp-price/",
      "summary": "Crypto analyst Jaydee has predicted a 50% rally for the XRP price. He highlighted a resistance level, which the altcoin needs to break above on its BTC pair to record this massive uptrend. XRP Price Eyes 50% Rally With Break Above $2.20 In an X post, Jaydee predicted that the XRP price will record a 50% “moonshot” rally once it breaks above the $0.00002 resistance level on its Bitcoin pair. XRP has since broken above this resistance level, suggesting that this moonshot rally may be imminent, with the altcoin surging to as high as $3.35. Related Reading: Analyst Reveals Rational Behind XRP Price Reaching $9.5 And $37.5 A rally to $3.35 will bring the XRP price close to its current all-time high (ATH) of $3.84 and also mark a new yearly high for the altcoin. In a subsequent analysis, Jaydee confirmed that XRP could rally to new ATHs with a successful break above this resistance level. On the other hand, he warned that the altcoin could crash to as low as $1.60 if it fails to hold this level on at least the 3-day timeframe. Crypto analyst Guy also recently predicted that the XRP price could rally to a new ATH of $5.30. The analyst indicated that the $2.33 level is the key to kickstarting this uptrend for the altcoin. Once XRP breaks above, he predicts that it will rally to $2.55. A break above this $2.55 level would then pave the way for another rally to the current ATH and the Fibonacci extension at $5.30. Possible Scenarios Following Break Above $2.30 In an X post, crypto analyst CasiTrades outlined three potential scenarios that could unfold following the XRP price break above $2.30. The first scenario is the cleanest move, in which she predicts that XRP could run towards $2.45, then flips $2.30 into support on a backtest. CasiTrades remarked that this gives the altcoin a solid base for a move to $2.69 and beyond. Related Reading: Will XRP Dethrone Ethereum To Lead This Altcoin Season? For the second scenario, the crypto analyst described this as a more aggressive move. In this case, she predicts that the XRP price could record a sharp breakout through $2.30 and head straight to $2.69. From there, she added that the altcoin could pull back to $2.45 as the mid-way support zone before continuing its uptrend. The third scenario is the most bullish for the XRP price. CasiTrades predicts that the altcoin could break through $2.69, confirm this price level as support, and then clear the way towards $3 and above. This would then put the current ATH in sight for the altcoin. At the time of writing, the XRP price is trading at around $2.32, up over 2% in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Price Action Signals Momentum Shift: BTC Sleeps And ETH Moves",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-price-action-signals-momentum-shift-btc-sleeps-and-eth-moves/",
      "summary": "Ethereum has finally pushed above the critical $2,600 level after weeks of range-bound trading, marking a potential turning point in its price structure. This breakout comes as bullish momentum builds, with Ethereum now preparing for a possible expansion toward the $2,800 resistance level—a zone that has repeatedly rejected upward attempts since early May. The coming days will be decisive in shaping Ethereum’s short-term trajectory, especially if bulls manage to drive the price beyond this key barrier. Related Reading: ERC-20 Stablecoin Supply Hits All-Time High At $121B – Liquidity On The Rise A breakout above $2,800 would not only signal renewed strength in Ethereum but could also catalyze a broader altcoin rally. Market sentiment is gradually shifting, with traders growing more optimistic amid easing macroeconomic pressures and signs of renewed risk appetite. Top analyst Ted Pillows recently shared an Ethereum chart showing a clear upward breakout from compression. This technical pattern typically precedes strong directional moves, and in this case, it favors the bulls. Pillows suggests that Ethereum is taking the lead while Bitcoin remains in consolidation, indicating that ETH may be setting the pace for the next phase of the crypto cycle. All eyes are now on the $2,800 level, which could unlock significant upside if breached. Ethereum Leads the Charge: Major Move Ahead Since early May, Ethereum has traded within a tight consolidation range between $2,400 and $2,700, unable to break out despite several attempts. This extended period of sideways action has built up pressure, and market participants widely expect the next move to be significant. Bulls have shown resilience, defending demand levels and keeping ETH above the $2,500 mark for several weeks. However, a clear breakout above critical resistance is still needed to confirm a broader bullish trend. Altcoins continue to struggle, with most still trading below key resistance levels. Many analysts agree that a sustained Ethereum breakout is the missing trigger for the long-awaited altseason. Market leadership from ETH has historically marked the start of major altcoin rallies, and the current setup could be no different. Top analyst Ted Pillows shared a 4-hour chart highlighting an upward breakout from a compression pattern just above $2,600. According to Pillow’s analysis, Ethereum is leading the market while Bitcoin remains in a holding pattern below all-time highs. This leadership role for ETH could signal a shift in capital toward altcoins, especially if Ethereum follows through and breaks the $2,800 resistance level. Related Reading: Ethereum Turns Key Resistance Into Support – Momentum Builds For Range Breakout ETH Price Analysis: Upward Momentum Builds Above $2,600 Ethereum (ETH) is showing renewed strength after breaking above the key $2,600 level. The 12-hour chart reveals a bullish structure forming, with ETH currently trading at $2,612.61. This move follows a sustained period of consolidation between $2,400 and $2,600, where buyers consistently defended lower levels. Now, Ethereum is printing higher lows and gradually reclaiming its moving averages. Price is now trading above the 50-period and 100-period simple moving averages (SMAs), currently positioned at $2,483.37 and $2,536.77, respectively. This alignment is bullish and suggests ETH is building momentum for a potential retest of the $2,700–$2,800 resistance zone. A successful break above this area would confirm the breakout from compression and open the door for a more significant rally. Related Reading: Ethereum Range Tightens – Liquidity Looms At $2,800 And $2,350 Volume remains moderate, but recent green candles show growing buyer interest as ETH pushes upward. The 200-period SMA sits lower at $2,221.56, reflecting Ethereum’s longer-term bullish trend and acting as a strong base of support. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "KULR Expands Bitcoin Mining Operations to 750 PH/s, Targets 1.25 EH/s by Late Summer",
      "link": "https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Expands-Bitcoin-Mining-Operations-to-750-PHs-Targets-1.25-EHs-by-Late-Summer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer\" rel=\"nofollow\"> </a></p> <p>KULR Technology Group, Inc., a Bitcoin-first company focused on sustainable energy solutions, announced today the successful deployment of 3,570 Bitmain S19 XP 140T mining machines in Asuncion, Paraguay. This new infrastructure brings KULR’s total Bitcoin mining capacity to 750 petahash per second (PH/s), with a goal of reaching 1.25 exahash per second (EH/s) by late [&#8230;]</p> <p>"
    },
    {
      "title": "White Noise: Anonymous Nostr DMs and Encrypted Group Chat",
      "link": "https://bitcoinmagazine.com/news/white-noise-anonymous-nostr-dms-and-encrypted-group-chat",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Privacy-by-Design-Not-by-Policy-Horizontal.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/white-noise-anonymous-nostr-dms-and-encrypted-group-chat\" rel=\"nofollow\"> </a></p> <p>White Noise launches public alpha, integrating top of the line privacy encryption with Bitcoin powered messaging tech.</p> <p>"
    },
    {
      "title": "Bitdeer Boosts Hashrate and Prepares New SEALMINER as Global Expansion Continues",
      "link": "https://bitcoinmagazine.com/news/bitdeer-boosts-hashrate-and-prepares-new-sealminer-as-global-expansion-continues",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitdeer-Boosts-Hashrate-and-Prepares-New-SEALMINER-as-Global-Expansion-Continues.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-boosts-hashrate-and-prepares-new-sealminer-as-global-expansion-continues\" rel=\"nofollow\"> </a></p> <p>Bitdeer Technologies Group has released its unaudited operations update for June 2025, showing continued momentum in its self-mining expansion, hardware manufacturing, and infrastructure development.&#160; In June, Bitdeer mined 203 BTC, a 4% increase from May, driven by higher self-mining hashrate, which rose 21% to 16.5 EH/s. “In June, we increased our self-mining hashrate by 21% [&#8230;]</p> <p>"
    },
    {
      "title": "H100 Group Increases Bitcoin Holdings With Purchase of 46.93 BTC",
      "link": "https://bitcoinmagazine.com/news/h100-group-increases-bitcoin-holdings-with-purchase-of-46-93-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/H100-Group-Increases-Bitcoin-Holdings-With-Purchase-of-46.93-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/h100-group-increases-bitcoin-holdings-with-purchase-of-46-93-btc\" rel=\"nofollow\"> </a></p> <p>The SEK 49.5 million Bitcoin purchase comes as H100 raises SEK 516 million through share and convertible debenture issues to expand its Bitcoin focused treasury strategy.</p> <p>"
    },
    {
      "title": "Apple Approves First-Ever iOS Game Integrating Bitcoin Microtransactions, Powered by ZBD",
      "link": "https://bitcoinmagazine.com/news/apple-approves-first-ever-ios-game-integrating-bitcoin-microtransactions-powered-by-zbd",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Apple-Approves-First-Ever-iOS-Game-Integrating-Bitcoin-Microtransactions-Powered-by-ZBD.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/apple-approves-first-ever-ios-game-integrating-bitcoin-microtransactions-powered-by-zbd\" rel=\"nofollow\"> </a></p> <p>Apple has approved the first iOS game to feature native Bitcoin microtransactions, according to a press release sent to . The game, SaruTobi, now enables real-money in-app payments using ZBD’s Bitcoin Lightning technology—marking a shift in Apple’s historically closed approach to alternative payment systems.&#160; This approval follows regulatory pressure from the EU’s Digital Markets [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Crypto Exchange GMX Drained of Bitcoin, Ethereum in $40 Million Exploit",
      "link": "https://decrypt.co/329363/crypto-exchange-gmx-drained-bitcoin-ethereum-40-million-exploit",
      "summary": "GMX has offered the attacker a 10% \"white-hat\" bounty after some $40 million worth of assets were swiped from the crypto protocol."
    },
    {
      "title": "Bye-Bye 'MechaHitler': Elon Musk's xAI Quietly Fixed Grok by Deleting a Line of Code",
      "link": "https://decrypt.co/329365/bye-bye-mechahitler-elon-musk-xai-quietly-fixed-grok-deleting-line-code",
      "summary": "Grok's Nazi-sympathizing responses sparked backlash this week, but the fix reveals how a single prompt instruction can shape an AI's entire political worldview."
    },
    {
      "title": "PUMP.FUN TOKENOMICS, $HYPE, BONKGUY META",
      "link": "https://decrypt.co/videos/interviews/7FsiPiBQ/pumpfun-tokenomics-hype-bonkguy-meta",
      "summary": "ETH leads crypto majors higher, BTC dominance falls. US House taking steps for US to be crypto capital. Sharplink to buy $20m ETH, stock pops 12%. GameSquare raises $8m to buy ETH, stock +60%. Bit Digital stock keeps pumping on ETH pivot. BioSig, StreamEx to tokenise commodities on SOL. Phantom intros perps powered by Hyperliquid. GMX faces $40m exploit. Tether reveals $8b gold stock pile in Swiss vault. Expect us to be largest BTC miner this year: Tether. OpenAI stock tokens backed by SPV: Robinhood. Aevo offers 1000x lev on tokenised stocks. DoJ charges OmegaPro founders with $650m fraud. Tether is a money launderer’s dream: The Economist. EIGEN announces 25% reduction in staff"
    },
    {
      "title": "Why Are Bitcoin, Ethereum and Solana Prices Still Rangebound? Experts Weigh In",
      "link": "https://decrypt.co/329328/bitcoin-ethereum-xrp-solana-price-rangebound-experts",
      "summary": "The crypto market remains rangebound as President Trump again revisits tariff negotiations with U.S. trading partners."
    },
    {
      "title": "Detroit Man Admits Sending Crypto Intended for ISIS",
      "link": "https://decrypt.co/329332/detroit-man-admits-sending-crypto-intended-for-isis",
      "summary": "Jibreel Pratt used encrypted tools to send Bitcoin he thought would support ISIS, but undercover agents were already tracking his moves."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Linda Yaccarino steps down as CEO of Elon Musk’s X ahead of Grok 4 launch",
      "link": "https://cryptobriefing.com/x-ceo-transition-grok-launch/",
      "summary": "<p>Yaccarino's departure may impact X's strategic direction, especially as it expands into AI and financial services, potentially altering its market position.</p> <p>"
    },
    {
      "title": "The Graph brings real time data streaming to TRON, providing builders with advanced blockchain insights",
      "link": "https://cryptobriefing.com/real-time-data-streaming-tron/",
      "summary": "<p>The Graph and TRON integration introduces real-time data streaming, enabling developers access to live blockchain insights and analytics.</p> <p>"
    },
    {
      "title": "Top perps DEX GMX hacked for over $40m, $GMX token plunges",
      "link": "https://cryptobriefing.com/gmx-exchange-exploit-incident/",
      "summary": "<p>The exploit highlights vulnerabilities in DeFi platforms, potentially undermining trust and prompting stricter security measures industry-wide.</p> <p>"
    },
    {
      "title": "Ripple taps BNY to secure RLUSD stablecoin with institutional-grade custody",
      "link": "https://cryptobriefing.com/enterprise-stablecoin-custody-rlusd/",
      "summary": "<p>Ripple's partnership with BNY Mellon could accelerate institutional crypto adoption, enhancing trust and bridging traditional finance with digital assets.</p> <p>"
    },
    {
      "title": "Airline giant Emirates to accept Bitcoin and crypto payments for flights, services",
      "link": "https://cryptobriefing.com/emirates-crypto-payments-flights/",
      "summary": "<p>Emirates' crypto payment integration could accelerate digital currency adoption in global travel, aligning with Dubai's financial innovation goals.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum projections shift bullish: Is $3K in Q3 possible?",
      "link": "https://ambcrypto.com/ethereum-projections-shift-bullish-is-3k-in-q3-possible/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika-8.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bull trap or breakout? Ethereum's about to pick a side."
    },
    {
      "title": "Compound: ai16Z moves $34.59M in COMP – Will prices dip below $40?",
      "link": "https://ambcrypto.com/compound-ai16z-moves-34-59m-in-comp-will-prices-dip-below-40/",
      "summary": "<img alt=\"COMP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-09T103518.492-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whale activity, rising inflows, and limited network engagement suggest continued downside risk for COMP."
    },
    {
      "title": "Top 7 VPNs of July 2025",
      "link": "https://ambcrypto.com/top-7-vpns-of-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1248\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/hazel-z-FocSgUZ10JM-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Virtual Private Networks, or VPNs, have become an essential part of the online experience. They [&#8230;]"
    },
    {
      "title": "Bitcoin’s price rally may just be starting – All the details!",
      "link": "https://ambcrypto.com/bitcoins-price-rally-may-just-be-starting-all-the-details/",
      "summary": "<img alt=\"Bitcoin&#039;s price rally may just be starting - All the details!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-FI-risk.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin's long-term remained bullish, but analysts cautioned against the August volatility."
    },
    {
      "title": "Cardano whales move 120M tokens – But ADA could rally ONLY IF…",
      "link": "https://ambcrypto.com/cardano-whales-move-120m-tokens-but-ada-could-rally-only-if/",
      "summary": "<img alt=\"ADA\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will ADA break past $0.6566 and trigger a sustained rally or stall just short of liftoff?"
    }
  ]
}