{
  "CoinDesk": [
    {
      "title": "Dogecoin Holds 16 Cent Support as Bulls Defend Multi-Week Floor",
      "link": "https://www.coindesk.com/markets/2025/07/05/dogecoin-holds-16-cent-support-as-bulls-defend-multi-week-floor",
      "summary": ""
    },
    {
      "title": "XRP Traders Eye $10 as Ripple’s U.S. Banking Bid Builds Market Optimism",
      "link": "https://www.coindesk.com/markets/2025/07/05/xrp-traders-eye-10-as-ripples-us-banking-bid-builds-market-optimism",
      "summary": ""
    },
    {
      "title": "Eight Bitcoin Wallets Move 80,000 BTC in Largest Ever ‘Satoshi Era’ Transfers",
      "link": "https://www.coindesk.com/markets/2025/07/05/eight-bitcoin-wallets-move-80000-btc-in-largest-ever-satoshi-era-transfers",
      "summary": ""
    },
    {
      "title": "NEAR Protocol Plunges 5% as Resistance Holds, Bitwise ETP Launches",
      "link": "https://www.coindesk.com/markets/2025/07/04/near-protocol-plunges-5-as-resistance-holds-bitwise-etp-launches",
      "summary": ""
    },
    {
      "title": "Bank of Canada Identifies Technical Path for Retail CBDC in New Research Paper",
      "link": "https://www.coindesk.com/business/2025/07/04/bank-of-canada-identifies-technical-path-for-retail-cbdc-in-new-research-paper",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Hong Kong prepares third batch of tokenized bonds, eyes more offerings",
      "link": "https://cointelegraph.com/news/hongkong-tokenized-bonds-digital-asset-strategy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5Mzc1ZjgtYzZiNi03NjViLTg1ZmEtY2U4M2RmMWM3YzFh.jpg\" /></p><p>Hong Kong prepares third batch of tokenized bonds and unveils a sweeping digital asset strategy to solidify its role as Asia’s crypto finance leader.</p>"
    },
    {
      "title": "Robinhood’s 24/7 tokenization push threatens NYSE revenues: Galaxy Digital",
      "link": "https://cointelegraph.com/news/robinhood-tokenization-nyse-liquidity-shift?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTA1ZDMtZmFkNi03OGNhLTg5ODQtYmQ1NTc4ZjU4YzMw.jpg\" /></p><p>Galaxy Digital warns Robinhood’s plan to tokenize stocks on its new chain could divert liquidity from NYSE and other major exchanges.</p>"
    },
    {
      "title": "OKX CEO apologizes after ‘false positives’ lock users out of accounts",
      "link": "https://cointelegraph.com/news/okx-ceo-star-xu-apology-false-positives-user-compliance?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NGE3NzAtODQ4Zi03YmI3LWIwMzMtMjkzODY3YzExMTg4.jpg\" /></p><p>The CEO of OKX says that \"false positives\" are among the biggest challenges the crypto exchange faces in ensuring global compliance.</p>"
    },
    {
      "title": "‘Small possibility’ $8.6B Bitcoin transfer was a hack: Coinbase exec",
      "link": "https://cointelegraph.com/news/bitcoin-whale-transfer-hack-possibility-coinbase-exec-speculates?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Q4OGQtNjYxMC03YTNjLThlNzYtMDM5YWI3ZjA2NWIx.jpg\" /></p><p>The Coinbase executive says he is “speculating on straws,” but if it is true, it would be “by far the largest heist in human history.”</p>"
    },
    {
      "title": "Bitcoin treasury playbook faces ‘far shorter lifespan’ — Analyst",
      "link": "https://cointelegraph.com/news/bitcoin-treasury-strategy-plan-limited-lifespan-forecast-crypto-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzUwNzYtYmZjMi03MTY5LTljY2YtODliMzc3ZGMyMDVm.jpg\" /></p><p>Crypto analyst James Check says the Bitcoin treasury strategy is getting to a point where new entrants will find it hard to gain momentum “without a serious niche.”</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Hackers steal $140M from Brazilian central bank reserve accounts via partner breach",
      "link": "https://cryptoslate.com/hackers-steal-140m-from-brazilian-central-bank-reserve-accounts-via-partner-breach/",
      "summary": "<p>Hackers siphoned about R$800 million ($140 million) from six reserve accounts connected to Brazil’s central bank after breaching São Paulo-based software vendor C&#38;M Software on June 30, according to blockchain investigator ZachXBT and reports from local news outlets. Police said C&#38;M employee João Nazareno Roque sold his corporate login for R$15,000 ($2,770) and later developed [&#8230;]</p> <p>"
    },
    {
      "title": "Turkey blocks access to PancakeSwap, 45 crypto websites in regulatory crackdown",
      "link": "https://cryptoslate.com/turkey-blocks-access-to-pancakeswap-45-crypto-websites-in-regulatory-crackdown/",
      "summary": "<p>Turkish financial regulators have blocked access to decentralized exchange PancakeSwap and 45 other crypto-related websites as part of a broader crackdown on unauthorized digital asset services. In a July 3 bulletin, the Capital Markets Board (SPK) announced legal action against the websites, citing provisions of Turkey’s Capital Markets Law. The regulator said the targeted platforms [&#8230;]</p> <p>"
    },
    {
      "title": "Investor poll shows 73% approval for Trump’s crypto policy, bullish views on prices increase",
      "link": "https://cryptoslate.com/investor-poll-shows-73-approval-for-trumps-crypto-policy-bullish-views-on-prices-increase/",
      "summary": "<p>Over 70% of US crypto investors approve of President Donald Trump&#8217;s administration&#8217;s approach to crypto policy, according to a recent survey conducted by research firm HarrisX. HarrisX polled 1,096 adults online from June 18 to June 19, including 230 self-identified crypto investors. Among that cohort, 81% said they follow the administration&#8217;s crypto actions, 73% approved of the [&#8230;]</p> <p>"
    },
    {
      "title": "Russian defense conglomerate Rostec to launch ruble-pegged stablecoin on TRON",
      "link": "https://cryptoslate.com/russian-defense-conglomerate-rostec-to-launch-ruble-pegged-stablecoin-on-tron/",
      "summary": "<p>Rostec, the Russian defense and technology conglomerate, announced on July 3 that it will introduce a ruble-pegged stablecoin and a linked payment network this year, utilizing Tron infrastructure. According to the Russian news agency TASS, Rostec named the token RUBx and set a one-to-one exchange rate with the ruble. Deputy General Director Alexander Nazarov stated that the corporation [&#8230;]</p> <p>"
    },
    {
      "title": "Trump-backed World Liberty Financial seeks community vote on token mobility",
      "link": "https://cryptoslate.com/trump-backed-world-liberty-financial-seeks-community-vote-on-token-mobility/",
      "summary": "<p>World Liberty Financial, the decentralized finance platform linked to U.S. President Donald Trump’s family, has unveiled a proposal that would allow its WLFI governance token to become transferable and tradeable across the wider crypto market. Currently confined within its own protocol, the WLFI token cannot be traded externally, restricting price discovery and limiting participation in [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Chainlink Price Continues To Struggle Below $15 — Levels To Watch",
      "link": "https://www.newsbtc.com/news/chainlink/chainlink-price-to-struggle-below-15-levels-to-watch/",
      "summary": "The Chainlink price has impressed at times this year, but it has struggled to mount a sustained bullish run over the past few months. Most recently, the altcoin demonstrated a strong resurgence by moving from around $13 to just beneath $16 in the first half of June. However, the Chainlink price soon suffered a severe downturn, reaching as low as $11.2 by June 22. While the price of the LINK token has recovered above the $13 level, below are two of the critical levels investors should watch out for over the coming weeks. If Resistance Is At $15, Where Is LINK’s Next Support? In a recent post on the social media platform X, prominent crypto analyst Ali Martinez shared an interesting on-chain insight into the current setup of the Chainlink price. According to the market pundit, the altcoin could be approaching a critical resistance level around the $15 region. Related Reading: Whales Are Loading Up on Chainlink (LINK), But Retail Investors Are Still Missing the Signal This on-chain revelation is based on the average cost basis of several LINK investors. For context, cost-basis analysis examines a level’s capacity to function as support or resistance based on the volume of tokens last acquired by investors in the price region. As depicted in the chart above, the size of the dot represents the amount of LINK tokens purchased within each price region and its corresponding strength. The bigger the dot, the larger the volume of purchased tokens, and the stronger the support or resistance. It is worth noting that the green dots are the support levels, as they are below the current price, while the red dots refer to resistance, as they are above the current price. According to data highlighted by Martinez, the Chainlink price faces a major supply barrier around the $14.88 – $15.32 region, where 10,440 addresses bought 89.63 million LINK tokens (equivalent $1.36 billion at an average price of $15.12). This region could prove to be a resistance to price, as investors with their cost basis around the level would likely sell as soon as they break even, thereby putting downward pressure on the LINK price. Furthermore, IntoTheBlock data shows that the Chainlink price could find significant support around the $12.87 – $13.26 bracket, where 20,260 investors acquired 53.91 million LINK tokens at an average price of $13.05. The rationale behind this is that, when LINK’s price returns to around $12.8, investors with their cost basis in and around this level are likely to defend their position by purchasing more coins, ensuring the altcoin stays above the support area. Chainlink Price At A Glance As of this writing, the LINK token is valued at around $13.16, reflecting an almost 4% price decline in the past 24 hours. Related Reading: Ethereum Price Targets $3,000 As Analyst Calls It A ‘Powder Keg’ Featured image from Waratah Fencing, chart from TradingView"
    },
    {
      "title": "Solana Tests Rising Channel Support – Breakdown Could Send Price To $128.50 Level",
      "link": "https://www.newsbtc.com/news/solana/solana-tests-rising-channel-support-breakdown-could-send-price-to-128-50-level/",
      "summary": "Solana is facing a critical test this week, consolidating in a tight range between $145 and $160 since Monday. The price action reflects strong buying interest but also hesitation as bulls struggle to reclaim higher levels. Despite holding above key support, Solana must break decisively above resistance to confirm a bullish breakout and continue its upward trend. Related Reading: Ethereum Forms Rising Wedge Pattern – $2,200 Support Back In Focus? Market momentum has favored bulls in recent weeks, but Solana’s inability to breach the $160 zone raises questions about the strength of this trend. Top analyst Carl Runefelt shared insights highlighting that Solana is currently ranging within a rising channel pattern—a structure that, while seemingly bullish, can often precede a breakdown to lower demand zones if support fails. This makes the coming days especially important for SOL’s trajectory. As macro conditions improve and Bitcoin flirts with new all-time highs, Solana is expected to respond in kind. However, technical signals suggest caution. A break below the rising channel could target the $128.50 support area, while a successful breakout above $160 could open the door to retesting local highs. Traders and investors alike are closely watching Solana’s next move in this high-stakes consolidation phase. Solana Holds Key Support Amid Rising Channel Formation Solana is currently trading below the $150 level, reflecting a notable 20% decline from its local high set in May. Despite this setback, the asset continues to hold a strong support base, signaling that bullish sentiment has not entirely faded. The broader market remains in a consolidation phase, with Solana showing signs of indecision as it moves sideways within a tightening price range. Analysts remain cautiously optimistic, pointing out that a breakout above the key $150–$160 supply zone could spark renewed upside momentum. However, the current price structure suggests that Solana may not be ready yet to retest previous highs. According to Carl Runefelt, Solana is ranging within a rising channel—a pattern that can lead to sharp movements if broken. While rising channels can sustain bullish continuation, a breakdown below the lower trendline often results in accelerated downside moves. Runefelt warns that if Solana breaks below the channel, the next key support area lies around $128.50. This level has historically acted as a strong demand zone and could serve as the next target in the event of a bearish move. In the meantime, Solana’s consolidation reflects broader market uncertainty, with traders waiting for a decisive breakout or breakdown to guide positioning. A successful reclaim of the $150 level would improve sentiment significantly and could set the stage for a push toward the $170–$180 range. On the other hand, failure to hold above current levels may shift the narrative toward further downside risk. Related Reading: Chainlink Consolidates Above Key Support – Bulls Eye $20 Range SOL Holds Range Amid Resistance Solana (SOL) is currently trading at $147.62, moving sideways within a tightening range and forming a potential rising channel pattern. The daily chart reveals that SOL has been unable to break decisively above the $155–$160 resistance zone, while strong support remains near the $140 level. Price action shows repeated rejections near the 100-day moving average (blue line), which now acts as dynamic resistance around $155.60. The 200-day moving average (red) sits further above $165.54, marking a long-term resistance area. Volume remains relatively low compared to early June spikes, suggesting market participants are waiting for a clear breakout direction. A push above $160 would likely trigger bullish momentum, potentially opening the door toward the $170 level. However, the rising channel identified by analysts suggests a possible downside risk if the lower trendline fails. Related Reading: Litecoin Surges Past Descending Resistance – Bulls Target $97.10 Level If Solana breaks below the $145 support and falls out of the channel, the next target would be the $128.50 area, which previously acted as a demand zone in mid-May. Until then, bulls must defend current levels and aim to reclaim the 100-day SMA to maintain the broader recovery structure. The coming sessions may offer clarity as consolidation nears its resolution. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Ethereum Wave Count Predicts Price Crash To $1,800 — But $6,000 Is Still In Play",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-wave-count-1800/",
      "summary": "Ethereum is still struggling below $3,000 despite the Bitcoin price sitting close to all-time highs. At the current levels, Ethereum continues to look incredibly bearish, with sell-offs dominating the market at this level. While piling shorts are pointing to a possible relief rally, there is also the possibility that the price will crash back down from here. Crypto analyst Weslad maps out the ETH price trajectory using the ABCDE wave structure, showing a possible crash below $2,000. The Bullish Ethereum Scenario Weslad points to the 2021 Ethereum peak when the price reached $4,851 as the point when a large-scale symmetrical pennant had formed for the digital asset. Interestingly, this has continued for multiple years already, and continues to play out even in 2025, four years later. So far, the analyst believes that the altcoin has been in a long-term accumulation phase in a defined corrective range. Related Reading: Altcoin Season Not Remotely Close, Bitcoin Dominance Still Too High: Market Expert Says Another important development is the formation of an ABCDE wave pattern. This pattern often predicts peaks and troughs, and depending on where the asset is in the pattern, it could point to a recovery or a crash. Presently, the crypto analyst puts the Ethereum price as being somewhere in a D wave, which is still bullish for the price. “Currently, price action is developing near point D, approaching the upper boundary of the pennant, a crucial area that could define the next directional move,” the analyst said. If this D wave plays out as expected, then the Ethereum price is expected to actually surge from here. The top of this pattern would put it above $3,500 before the move is completed. On the upper end of this is the formation of an Inverse Head and Shoulders Pattern. This pattern has seen the $2,855 acting as key resistance, beating the Ethereum price down multiple times this year. However, if a sustained break is achieved above this level, in conjunction with a breakout from Wave D, then it is possible that the price does rally to new all-time highs above $6,000. The Bearish Scenario While the formation of the ABCDE wave count points to some bullishness for the Ethereum price, there is still the possibility that the price could go in the opposite direction. For example, after the D wave is completed, comes the next wave in the sequence, which is the E wave, and this is a bearish wave. Related Reading: Altcoin Season Not Remotely Close, Bitcoin Dominance Still Too High: Market Expert Says As the crypto analyst explains, a temporary rejection at the neckline or pennant resistance would trigger an E wave retracement. In this case, the Ethereum price could see an over 30% crash, putting it back toward the $1,400-$1,800 level, where there is the most support. “Recent price behavior shows compressed volatility and increased buying interest on dips, reinforcing the possibility of an imminent directional breakout,” Weslad warned. “A decisive move outside this macro structure may mark the beginning of a new phase of long-term price expansion.” Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Near Historic Weekly Close Despite Drop – Analyst Warns Of Volatile Weekend",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-near-historic-weekly-close-despite-drop-analyst-warns-of-volatile-weekend/",
      "summary": "As the market sees a Friday retrace, Bitcoin (BTC) is attempting to reclaim a crucial area as support. An analyst suggests that the flagship crypto’s daily close could set the stage for a bullish end of the week despite potential volatility. Related Reading: SUI Prepares For Bullish Flag Breakout Amid $3 Reclaim – Analyst Doubles The Target Bitcoin Breakout To Come ‘Sooner Or Later’ At the start of the new quarter, Bitcoin has retested crucial levels, touching the $105,000 support and $110,000 resistance over the past four days. Amid its Tuesday pullback, the flagship crypto fell to a two-week low but managed to bounce from a crucial range. Analyst Sjuul from AltCryptoGems previously noted that BTC needed a strong rebound from the “most important” support and resistance area, between the $104,000 and $106,000 price levels, explaining that failing to hold this range would open the door for a drop to the range lows around $101,000. On Friday, the analyst highlighted Bitcoin’s price action after holding the key levels, which “provided the perfect entry for a bounce, just as expected.” Following this performance, he asserted that Bitcoin is expanding on its two-month Power of Three (Po3) setup, signaling that potential further expansion is ahead. Nonetheless, he pointed out that the flagship crypto is still trading in a two-month range, suggesting a volatile price action until the price successfully breaks out, which it has attempted to do earlier this week. “Since we are in a range, we are forced to respect the key levels of the range: high, mid, and low,” Sjuul detailed, adding that all eyes are currently on the mid-range, where bulls must step in to confirm the bullish move to the range high. Based on this, the analyst forecasted another move above the $110,00 mark, where “we have left a lot of unfinished business” and “plenty of liquidity lies.” He pointed to a huge cluster near the $111,000 area in BTC’s Liquidity Heatmap, affirming that “price is attracted by liquidity, so I am expecting that level to be visited sooner or later.” BTC Eyes Pivotal Closes After being rejected from the $108,000 at the start of the week, analyst Rekt Capital noted that Bitcoin broke out of two 2-week downtrends in the past 40 days but was rejected from the crucial 6-week diagonal downtrend, around the $108,000 mark, during the same timeframe. This week, BTC closed above this resistance twice, and daily closed above the $109,000 mark on Thursday. However, Friday’s pullback saw Bitcoin drop below the crucial level, falling to the $107,245 area. The analyst considers that a key retest of the pattern is in progress. He previously explained that any dipping into the top of Bitcoin’s pattern could “technically be considered additional retesting to further solidify the recently broken black diagonal resistance into new support.” Nonetheless, BTC must close today above the diagonal resistance for a successful retest. “Bitcoin is losing the diagonal for the moment. But if price Daily Closes above the diagonal, then this will have ended as a downside wick as part of a volatile retest. Upcoming Daily Close will be pivotal,” he stated. Related Reading: Ethereum Eyes Key Resistance As Price Reclaims $2,550 – Here Are The Levels To Watch Meanwhile, Bitcoin is also on the cusp of making history as its price nears the “final major Weekly resistance” around the $109,000. Rekt Capital detailed that if BTC closes above this level, it would confirm a break from this major resistance, which would likely unlock a new all-time high (ATH). He concluded that, with the recent weekend volatility, “we won&#8217;t know until the very last moment heading into the new Weekly Close whether this level has been flipped into support or not.” Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Shiba Inu Supply Most Centralized Among Top Coins—62% Held By Just 10 Whales",
      "link": "https://www.newsbtc.com/shiba-inu-news/shiba-inu-centralized-top-coins-62-just-10-wallets/",
      "summary": "On-chain data shows Shiba Inu (SHIB) has its supply more concentrated on the largest holders than other assets like Ethereum (ETH) and Pepe (PEPE). Shiba Inu Has 62% Of Its Supply Controlled By Top 10 Whales In a new post on X, the on-chain analytics firm Santiment has shared how some top coins currently compare against each other in terms of the percentage of supply held by the ten largest wallets on the respective networks. Below is a chart showing the trend in this metric for eight cryptocurrencies: Shiba Inu, Ethereum, Pepe, USDT, USDC, DAI, Chainlink (LINK), and Uniswap (UNI). As is visible in the graph, the stablecoin USDC has the lowest amount of supply concentrated on the top 10 addresses among these assets at around 27%. Chainlink and DAI come close with the metric sitting at 32% and 33%, respectively. Others like Uniswap and Ethereum, however, have a more significant part of their supply under the control of these humongous entities: 51% and 49%, respectively. One asset that particularly stands out is Shiba Inu, with a massive 62% of its supply belonging to the ten largest whales on the network. For comparison, the other memecoin on the list, Pepe, has the same metric at 39%. Generally, the centralization of supply on just a few hands isn&#8217;t a constructive sign for any cryptocurrency&#8217;s stability, as tokens signify power on the network. It&#8217;s especially relevant in the case of a proof-of-stake (PoS) asset like Ethereum. As Santiment explains, As a retail trader, it&#8217;s generally safer to hold coins with less supply held by the most elite whales. There is less risk of sudden dumps or price manipulation should an asset&#8217;s largest whales decide to exit their positions. Given this, the assets like Ethereum, Uniswap, and Shiba Inu that currently have a majority of their supply or close to it in the hands of the top 10 whales may not be in the best position right now. In some other news, the cryptocurrency market sentiment is on the verge of extreme greed, according to the Fear &#38; Greed Index. The Fear &#38; Greed Index is an indicator created by Alternative that inputs a few different factors to determine the investor mentality as a score lying between zero and hundred. As displayed above, the cryptocurrency Fear &#38; Greed has a value of 73 at the moment. This corresponds to the presence of a strong sentiment of greed present among the traders. Historically, markets have often moved in the direction that goes contrary to the expectations of the crowd. The probability of a contrary move is especially strong in the extreme ends of the index. For now, the market is still outside of the extreme greed zone, but only by a couple of units. SHIB Price At the time of writing, Shiba Inu is trading around $0.0000115, up over 3% in the last seven days. Featured image from Dall-E, Alternative.me, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Treasury Companies Are Bubbles",
      "link": "https://bitcoinmagazine.com/bigread/the-bitcoin-treasury-companies-bubble",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/BM-Big-Read-07-04-25.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bigread/the-bitcoin-treasury-companies-bubble\" rel=\"nofollow\"> </a></p> <p>BM Big Read: You are the yield that the bitcoin treasury companies are chasing. Their earnings stem not from revenue but from new investors.</p> <p>"
    },
    {
      "title": "Why Liquidity Matters More Than Ever For Bitcoin",
      "link": "https://bitcoinmagazine.com/markets/why-liquidity-matters-for-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Why-Liquidity-Matters-More-Than-Ever-For-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/why-liquidity-matters-for-bitcoin\" rel=\"nofollow\"> </a></p> <p>Global M2 vs. BTC: A key chart showing how liquidity drives Bitcoin's price, with historical rallies tied to M2 expansions.</p> <p>"
    },
    {
      "title": "Senator Lummis’ New Bill Enables Tax-Exempt Bitcoin Spending — But Thresholds Are Too Low",
      "link": "https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Senator-Lummis-at-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start\" rel=\"nofollow\"> </a></p> <p>Long-time Bitcoin advocate Senator Cynthia Lummis (R-WY) has drafted a bill that allows Bitcoin enthusiasts to spend small amounts of bitcoin without incurring capital gains taxes (which is very cool), but many — including myself — feel that the spending limits in the bill are too low.</p> <p>"
    },
    {
      "title": "Senator Lummis Introduces Digital Asset Tax Legislation",
      "link": "https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/US-Senator-Cynthia-Lummis-Discusses-Bitcoin-Reserve-Stablecoin-Legislation-and-Market-Structure-Bill-at-Bitcoin-2025-Conference.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation\" rel=\"nofollow\"> </a></p> <p>The bill proposes a $300 exemption for small Bitcoin and crypto transactions, defers taxes on mining and staking until assets are sold.</p> <p>"
    },
    {
      "title": "Bitcoin Miner Riot Produces 450 Bitcoin In June",
      "link": "https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Miner-Riot-Produces-450-Bitcoin-In-June.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june\" rel=\"nofollow\"> </a></p> <p>The company saw a 76% year-over-year increase in production, earned $5.6 million in power credits, and ended the month holding 19,273 Bitcoin.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin Dives on OG Whale FUD, But Charts Remain Bullish: Analysis",
      "link": "https://decrypt.co/328731/bitcoin-price-dives-og-whale-fud-charts-bullish-analysis",
      "summary": "A dormant Bitcoin whale woke up and chose violence—by spooking skittish BTC traders with an $8 billion move. The charts though? They tell a different story."
    },
    {
      "title": "Russian Arms Maker Wants Its Own Stablecoin Too—On Tron",
      "link": "https://decrypt.co/328715/russia-military-rostec-stablecoin-tron",
      "summary": "Russian state-owned manufacturing firm Rostec has said it will roll out a ruble-pegged token called RUBx on Tron. And a payments platform to boot."
    },
    {
      "title": "Another Solo Bitcoin Miner Beats the Odds, Winning $350K Jackpot",
      "link": "https://decrypt.co/328699/solo-bitcoin-miner-beats-odds-350k-jackpot",
      "summary": "The lucky solo Bitcoin miner processed a block with a reward of 3.137 BTC, or $349,028, late Thursday night."
    },
    {
      "title": "How a Hacker Spent Only $2.7K to Steal $140 Million From Brazilian Banks",
      "link": "https://decrypt.co/328700/hacker-spent-2k-steal-140-million-brazil-central-bank",
      "summary": "The hackers laundered roughly $40 million worth of the stolen funds using Bitcoin, Ethereum, and Tether, according to a blockchain investigator."
    },
    {
      "title": "Sweden Orders Police to Increase Seizures of Criminal Crypto Profits",
      "link": "https://decrypt.co/328687/sweden-orders-police-to-increase-seizures-of-criminal-crypto-profits",
      "summary": "Sweden's Minister of Justice has called on the authorities to make greater use of forfeiture legislation to seize cryptocurrency."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Dormant Bitcoin whale activates after 14 years and moves 60,000 BTC",
      "link": "https://cryptobriefing.com/ancient-bitcoin-whale-movement/",
      "summary": "<p>The reactivation of dormant Bitcoin could signal market volatility or strategic repositioning, impacting investor sentiment and market dynamics.</p> <p>"
    },
    {
      "title": "Russia’s military-industrial powerhouse Rostec to launch ruble-backed token on Tron",
      "link": "https://cryptobriefing.com/ruble-backed-token-rostec-tron/",
      "summary": "<p>Rostec's ruble-backed token on Tron could enhance Russia's digital finance landscape, fostering innovation and integration with global systems.</p> <p>"
    },
    {
      "title": "cheqd and ASI Alliance team up to address AI identity crisis with verifiable credentials",
      "link": "https://cryptobriefing.com/cryptographic-verification-ai-impersonation/",
      "summary": "<p>The collaboration could significantly enhance trust and security in AI systems, mitigating risks of fraud and manipulation in a rapidly growing market.</p> <p>"
    },
    {
      "title": "TRON DAO joins EthCC as WAGMI Sponsor, co-hosts events with MetaMask and Arkham",
      "link": "https://cryptobriefing.com/tron-eth-partnership-ethcc/",
      "summary": "<p>TRON DAO's active role at EthCC highlights its strategic push for cross-chain collaboration and strengthening ties within the blockchain community.</p> <p>"
    },
    {
      "title": "Trump’s ‘Big Beautiful Bill’ clears Congress after narrow House vote, what could this mean for Bitcoin?",
      "link": "https://cryptobriefing.com/trump-tax-bill-congress-vote/",
      "summary": "<p>The bill's passage may lead to a liquidity squeeze, impacting Bitcoin's price volatility and potentially increasing national debt concerns.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum transactions near 2021 highs – Will ETH prices follow?",
      "link": "https://ambcrypto.com/ethereum-transactions-near-2021-highs-will-eth-prices-follow/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ethereum-ETH-.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ETH speculative traders increased their long bets by 12% in early July."
    },
    {
      "title": "Tether’s last stand? GENIUS Act leaves USDT with 3 doors AND a ticking clock",
      "link": "https://ambcrypto.com/tethers-last-stand-genius-act-leaves-usdt-with-3-doors-and-a-ticking-clock/",
      "summary": "<img alt=\"TETHER\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-4.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The GENIUS Act may have finally cornered crypto’s biggest stablecoin. Will it bend or break?"
    },
    {
      "title": "NEAR Protocol: 72% of traders bet on a rally, yet 2 signs suggest caution",
      "link": "https://ambcrypto.com/near-protocol-72-of-traders-bet-on-a-rally-yet-2-signs-suggest-caution/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-04T165859.324-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />NEAR signals a potential trend reversal, but unbroken resistance and long liquidations suggest caution."
    },
    {
      "title": "Tether mints $1B USDT – Can ‘crypto week’ unlock major market moves?",
      "link": "https://ambcrypto.com/tether-mints-1b-usdt-can-crypto-week-unlock-major-market-moves/",
      "summary": "<img alt=\"USDT\" class=\"attachment-full size-full wp-post-image\" height=\"756\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-2.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1344\" />Could ‘Crypto Week’ actually move the market or is it just political theater?"
    },
    {
      "title": "Is the Crypto Fear and Greed Index asking you to HODL? – Assessing…",
      "link": "https://ambcrypto.com/is-the-crypto-fear-and-greed-index-asking-you-to-hodl-assessing/",
      "summary": "<img alt=\"Crypto Fear and Greed Index stays green- should you expect new highs for Bitcoin?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Crypto-Fear-and-Greed-Index-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The crypto fear and greed index reached a similar score of 78 on the 23rd of May, when Bitcoin reached a high of $111.8k before facing rejection."
    }
  ]
}