{
  "CoinDesk": [
    {
      "title": "Russian Malware Campaign Adds Downward Pressure to Internet Computer's ICP Token",
      "link": "https://www.coindesk.com/markets/2025/07/04/russian-malware-campaign-adds-downward-pressure-to-internet-computer-icp",
      "summary": ""
    },
    {
      "title": "Bitcoin Whales Wake Up From 14-Year Slumber to Move Over $2B of BTC",
      "link": "https://www.coindesk.com/markets/2025/07/04/bitcoin-whales-wake-up-from-14-year-slumber-to-move-over-usd2b-of-btc",
      "summary": ""
    },
    {
      "title": "Crypto ETF BLOX, Which Offers Digital Asset Exposure and Options Income, Gains Steam",
      "link": "https://www.coindesk.com/markets/2025/07/04/crypto-etf-blox-which-offers-digital-asset-exposure-and-options-income-gains-steam",
      "summary": ""
    },
    {
      "title": "Amber International Raises $25.5M to Expand $100M Crypto Reserve Strategy",
      "link": "https://www.coindesk.com/business/2025/07/03/amber-international-raises-255m-to-expand-100m-crypto-reserve-strategy",
      "summary": ""
    },
    {
      "title": "Ondo, Pantera Capital to Invest $250M in Real-World Asset Projects",
      "link": "https://www.coindesk.com/business/2025/07/03/ondo-pantera-capital-to-invest-250m-in-real-world-asset-projects",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin price can hit $150K in weeks thanks to Trump&#039;s &#039;Big Beautiful Bill&#039;",
      "link": "https://cointelegraph.com/news/bitcoin-price-can-hit-150k-trump-big-beautiful-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Q0ZDYtOWNiYi03NGU4LWFmODEtNTMyMWRjZDg4MTNi.jpg\" /></p><p>Bitcoin has historically made double-digit gains in weeks after major US debt-boosting bills are signed — will history repeat in 2025?</p>"
    },
    {
      "title": "Belgian court sentences three in kidnapping of crypto investor’s wife",
      "link": "https://cointelegraph.com/news/belgium-crypto-kidnapping-three-men-12-years-prison-sentence?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Q0NWUtZDJlZS03YzRhLTg5MzktMTJkZDQ4YTA2YjU4.jpg\" /></p><p>After sentencing the three kidnappers to 12 years each and ordering civil damages, the court noted that the masterminds behind the attack remain at large.</p>"
    },
    {
      "title": "How Zelenskyy&#039;s ‘suit’ became the center of a massive Polymarket fight",
      "link": "https://cointelegraph.com/news/zelensky-suit-polymarket-dispute-ignites-again?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2QzOTUtNGVlOS03ODg0LTkzNjYtNDg4ZGQ0YTJlNzVi.jpg\" /></p><p>Crypto bettors have staked millions on whether the outfit technically counts as a suit, while a renowned fashion industry commentator hasn’t helped, calling it “both a suit and not a suit.”</p>"
    },
    {
      "title": "$20M crypto scam victim who sued Citibank says 2 more banks liable",
      "link": "https://cointelegraph.com/news/crypto-scam-victim-claims-2-more-banks-liable-20m-scheme?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmMyNjEtYzdlOS03OWE5LTk1MWQtOTdmNmM1MDVjY2Fh.jpg\" /></p><p>The victim of a $20 million crypto scam who sued Citibank last week for allegedly ignoring “red flags” has filed a similar complaint against two more banks.</p>"
    },
    {
      "title": "Solana treasury firm extends stock rally after buying $2.7M of SOL",
      "link": "https://cointelegraph.com/news/solana-treasury-firm-extends-rally-after-buying-sol?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjU5ZmQtYjY4MC03Y2E3LWExZDAtZDFmMTg5MzZhZDNj.jpg\" /></p><p>The company’s Solana stack is now worth almost $98 million. The firm’s stock price is up 2,733% year-to-date.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "MARA’s $5.4B Bitcoin treasury grows to 50k BTC as miners adopt a HODL strategy",
      "link": "https://cryptoslate.com/maras-5-4b-bitcoin-treasury-grows-to-50k-btc-as-miners-adopt-a-hodl-strategy/",
      "summary": "<p>MARA (formerly Marathon Digital) reports its Bitcoin holdings have increased to 49,940 BTC, bringing the digital asset miner to the edge of a major corporate milestone and reinforcing a broader market trend of miners retaining their produced assets. MARA&#8217;s holdings position it as the second-largest public corporate holder of Bitcoin, with a treasury valued at [&#8230;]</p> <p>"
    },
    {
      "title": "Dormant Bitcoin holder moves $2 billion BTC from 2011 for potential 14,000,000% gain",
      "link": "https://cryptoslate.com/dormant-bitcoin-holder-moves-2-billion-btc-from-2011-for-potential-14-million-percent-gain/",
      "summary": "<p>Two Bitcoin wallets inactive for 14 years transferred a combined 20,000 BTC, valued at approximately $2.18 billion, on July 4. The transactions originated from separate addresses that held 10,000 BTC since April 3, 2011, when the asset price was roughly $0.78. The analytics account Lookonchain first flagged the on-chain movements, which detailed the two separate [&#8230;]</p> <p>"
    },
    {
      "title": "DeFi TVL breaks above $116B as lending roars back",
      "link": "https://cryptoslate.com/defi-tvl-breaks-above-116b-as-lending-roars-back/",
      "summary": "<p>The DeFi market has rebounded at the beginning of July, with total value locked (TVL) rising to $116.416 billion, a level last seen in April. The 24-hour increase of 4.95% reflects rising crypto asset prices and renewed deposit flows into lending protocols, restaking services, and yield-bearing primitives. As Ethereum and Solana continue to absorb most [&#8230;]</p> <p>"
    },
    {
      "title": "TRON DAO Joins EthCC as WAGMI Sponsor, Co-Hosts Events with MetaMask and Arkham",
      "link": "https://cryptoslate.com/tron-dao-joins-ethcc-as-wagmi-sponsor-co-hosts-events-with-metamask-and-arkham/",
      "summary": "<p>Geneva, Switzerland, July 3 2025 — TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and decentralized applications (dApps), proudly participated as a WAGMI Sponsor at the Ethereum Community Conference (EthCC), held from June 30 to July 3 in Cannes, France. As Europe’s largest annual Ethereum-focused event, EthCC [&#8230;]</p> <p>"
    },
    {
      "title": "Pantera, Ondo launch $250M fund to drive RWA tokenization",
      "link": "https://cryptoslate.com/pantera-ondo-launch-250m-fund-to-drive-rwa-tokenization/",
      "summary": "<p>Ondo Finance and Pantera Capital have launched a $250 million fund to accelerate investments in tokenized real-world assets (RWAs), Axios reported on July 3. According to the report, the fund, named Ondo Catalyst, will invest in equity stakes and tokens of projects developing tokenized versions of traditional financial assets. Ian De Bode, chief strategy officer [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "SUI Prepares For Bullish Flag Breakout Amid $3 Reclaim – Analyst Doubles The Target",
      "link": "https://www.newsbtc.com/news/sui-prepares-for-bullish-flag-breakout-amid-3-reclaim-analyst-doubles-the-target/",
      "summary": "After recovering from the recent pullbacks, SUI is attempting to reclaim a crucial resistance, which could trigger a breakout from its bullish formation. Some analysts believe that the cryptocurrency’s imminent rally could target significantly higher levels. Related Reading: Ethereum Eyes Key Resistance As Price Reclaims $2,550 – Here Are The Levels To Watch SUI Eyes Key Area Reclaim On Thursday, SUI has surged more than 10% from its $2.70 support toward the crucial $3.00 barrier. The cryptocurrency has been attempting to reclaim this area throughout Thursday, hovering between the $2.95 and $3.08 levels. Notably, the altcoin ended its multi-month downtrend after breaking above its descending resistance at the end of March, fueling its rally toward the $4.29 high in May. Since the Q2 breakout, SUI has been trading within the $2.33-$4.10 range. Nonetheless, the June pullbacks, driven by the global geopolitical tensions, sent the token below the $3.00 mid-range support to its local low of $2.22 nearly two weeks ago, before reclaiming the $2.80-$2.90 area. Amid the start-of-month retracement, the altcoin briefly lost its local range, but the Wednesday pump reignited bullish sentiment and potentially set the stage for a rally continuation. Analyst Alex Clay noted that SUI is currently testing the confluence of the 50-day, 100-day, and 200-day Exponential Moving Averages (EMAs) resistances alongside its bullish flag resistance. According to the chart, the cryptocurrency has been trading within a bullish flag formation since May, and lost the technical indicators throughout the June pullbacks. Now, the indicators and the patterns’ upper boundary sit as resistance around the $3.00-$3.10 area. If the altcoin reclaims these key levels, the analyst considers that a rally to the $5.00 resistance would be “an easy trade.” Is A Breakout To $10 Nearby? Analyst Marcus pointed out that SUI “just snapped back from the 0.786 Fib zone sharp, clean and confident.” He added that the cryptocurrency’s structure held despite the correction, which confirmed a “healthy pullback, not a breakdown.” To the analyst, the current bounce could be the higher low that sets the stage for SUI’s next major move, as “all signs point to a setup that’s not done yet.” Meanwhile, market Watcher Crypto Yhodda affirmed that SUI is “in a big accumulation right now,” pointing to an eight-month triangle formation. According to the analyst, a breakout from this pattern “can help it reach the dream target of $10.” Similarly, Kaleo highlighted SUI’s bounce on its trading pairs against Bitcoin (BTC) and USD. He explained that there are many similarities between the base the altcoin is currently building and the base from the April lows that propelled the token to its local high. The cryptocurrency bounced off the High timeframe (HTF) ascending support line on both occasions, suggesting a massive rally could be ahead. To the analyst, the $10 target is “a magnet.” Related Reading: Bitcoin Holds Key Level Amid $108,000 Rejection, But Analysts Suggest Caution This Quarter Crypto Batman also highlighted this ascending support, noting that the recent pullback marks the third time the cryptocurrency has bounced from it since August. Following the previous two retests, the token rallied for weeks toward higher levels, signaling that a breakout could be nearby. Additionally, he considers that SUI displays a “solid-looking setup,” as it is trading above the key $2.30-$2.40 area that has served as resistance and support on the weekly chart. As of this writing, SUI trades at $3.09, a 15% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Analyst Sees a Bitcoin Market Shift — Here’s What’s Happening",
      "link": "https://www.newsbtc.com/bitcoin-news/analyst-sees-a-bitcoin-market-shift-heres-whats-happening/",
      "summary": "The Bitcoin market now appears to be seeing a notable surge in its momentum, with the asset finally breaching the $110,000 mark to inch really close to its all-time high. The asset has so far registered a 24-hour high of $110,117, less than 3% increase away from its all-time high of $111,814 registered in May. At the time of writing, BTC trades back at $109,000 levels, marking a 1.3% increase in the past day. While the price action alone has fueled speculation of an imminent breakout, several analysts suggest that deeper structural shifts within the market are at play. On-chain data particularly reveals changes in whale activity, exchange flows, and stablecoin dynamics that could offer clues about the market’s next move. Related Reading: Bitwise Just Sounded The Alarm—Bitcoin Could Explode Soon Signs of Reduced Bitcoin Selling Pressure and Upward Bias CryptoQuant analyst Crypto Dan shared a detailed view of the current state of Bitcoin’s price structure, emphasizing a broader directional change in the market that began in April. According to the analyst, Bitcoin’s recent price resilience can be attributed to a noticeable decline in selling pressure from US-based institutional investors and whales. These large players, who were previously offloading significant holdings, have shifted into accumulation mode in recent months. Dan explained that Bitcoin appears to be in a transitional phase. He observed a gradual fade in sell-side activity from major US wallets since April, and that drop has been met with stable buying pressure. This suggests that institutions are no longer offloading positions but are maintaining or adding to their holdings. Dan added that the current consolidation, marked by Bitcoin&#8217;s price hovering above the $100,000 range, is allowing short-term overheated indicators to cool down. Dan noted: While the possibility of a correction remains, the broader market direction continues to be upward, so I will maintain my perspective and look forward to the second half of 2025. Overall, this could mean that the ongoing price action in the market may be the calm before a longer-term move upward, assuming macro conditions remain supportive. Exchange Outflows and Liquidity Trends Paint a Risk-On Picture Adding further context, another CryptoQuant contributor, Novaque Research, pointed to recent shifts in on-chain flows and broader liquidity conditions. According to their data, exchange outflows have picked up notably since late June, with some days seeing over 10,000 BTC withdrawn. Such behavior typically signals long-term investor confidence and a reduced likelihood of near-term sell pressure. Additionally, the report noted that miners have remained largely inactive in terms of selling despite BTC trading above $100,000. Related Reading: Whales Are Quietly Repositioning, Here’s What Bitcoin’s $107K Price Isn’t Telling You This suggests confidence in price sustainability and possible anticipation of more favorable financial conditions. Meanwhile, stablecoin activity has also shown key changes. Both USDC and USDT supply ratios on exchanges have been trending downward since mid-June, indicating capital is sitting idle rather than flowing into spot markets. Novaque noted that investors may be on the sidelines waiting for confirmation, but the structural behavior is leaning toward accumulation. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin Latest Rally Backed By Stronger Purchasing Power: Report",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-rally-backed-stronger-purchasing-power/",
      "summary": "Data of the Bitcoin Stablecoin Supply Ratio suggests investors have stronger purchasing power today than during the previous bull rally. Bitcoin Stablecoin Supply Ratio Showing Neutral Purchasing Power In its latest weekly report, the on-chain analytics firm Glassnode has talked about the latest trend in the Stablecoin Supply Ratio (SSR) of Bitcoin. This indicator measures the ratio between the Bitcoin supply and the supply of stablecoins. Related Reading: Dogecoin Bounces Back With 8% Gain—Is $0.26 In Sight? Stablecoins are cryptocurrencies that have their price tied to a fiat currency. The SSR specifically measures the supply of the stablecoins tied to the US Dollar (USD). As for the role that these assets play in the sector, Glassnode explains: Stablecoins have become a critical component of the digital asset ecosystem, serving as the primary quote asset for trading across both centralized and decentralized venues. Functionally, they represent readily available capital, or &#8220;dry powder&#8221;, available for digital asset purchases. As such, the SSR compares the Bitcoin supply against this available dry powder. In other words, it tells us about how the cryptocurrency compares against the investor&#8217;s purchasing power. When the value of the metric is high, it means the BTC supply is high compared to the stablecoin supply. In other words, the trader&#8217;s purchasing power is weak. On the other hand, the indicator being low suggests there is high dry powder available relative to the BTC supply. In the context of the current discussion, the SSR itself isn&#8217;t of focus, but rather a modified indicator called the SSR Oscillator. According to the analytics firm, the metric measures &#8220;how the 200d SMA of the SSR moves within the Bollinger Bands BB(200, 2).&#8221; Now, here is a chart that shows the trend in the Bitcoin SSR Oscillator over the last few years: As displayed in the above graph, the Bitcoin SSR Oscillator has been close to the zero mark during the last couple of months, indicating the investor purchasing power is more or less neutral compared to the size of the BTC supply. Related Reading: Bitcoin Short-Term Upper Bound Is $117,000, Glassnode Says From the chart, it&#8217;s visible that the trend was different during the rally beyond $100,000 that occurred late last year. Back then, the SSR Oscillator took on a highly positive value, suggesting the stablecoin supply was low relative to BTC. The cryptocurrency is currently also trading around the same levels as then, yet the SSR is showing a different story. &#8220;Despite similar price levels, this shift suggests that investor purchasing power has improved markedly, reflecting stronger underlying demand conditions,&#8221; notes the report. BTC Price At the time of writing, Bitcoin is trading around $109,500, up over 2% in the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Brushes $110K as Whales Pull Funds from Binance, What Are They Planning?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-brushes-110k-as-whales-pull-funds-from-binance-what-are-they-planning/",
      "summary": "Bitcoin’s upward momentum has returned, with the asset briefly crossing the $110,000 threshold before pulling back slightly. After hitting a 24-hour high of $110,117, Bitcoin now trades at $109,386, reflecting a 1.8% increase in the past day. This recent push places the asset about $2,000 surge away from its all-time high of $111,814, recorded in May 2025, prompting renewed attention from traders and analysts. While price movements often attract headlines, on-chain data has started signaling deeper market activity. Related Reading: Bitcoin Realized Dominance Signals Weak Hands Capitulating, Strong Hands Rising Binance Sees 3,400 Bitcoin in Outflows as Spot Volume Surges According to CryptoQuant analyst Amr Taha, a substantial volume of BTC has recently been moved off Binance, one of the world’s largest crypto exchanges. The shift aligns with anticipation around a series of US macroeconomic indicators, which historically tend to influence risk-on assets like Bitcoin. Taha highlighted that Binance recorded a net outflow of over 3,400 BTC in a single day. This occurred shortly after Bitcoin’s price breached the $109,000 mark. Large-scale withdrawals from exchanges such as Binance are often interpreted as a sign that holders may be preparing to hold their assets longer-term, or shielding their positions from potential short-term volatility. Simultaneously, Binance’s share of the global Bitcoin spot volume surged significantly, from 41% to 56% in just one session. Taha noted that this spike indicates increased reliance on Binance’s liquidity by traders seeking exposure to Bitcoin ahead of anticipated market-moving economic data. The outflow trend, paired with rising spot volume, suggests that traders are actively responding to broader market signals, especially from traditional finance. US Jobs Report Drives Market Positioning The current surge in Bitcoin activity coincides with heightened market focus on US labor market data, including the Non-Farm Employment Change, Unemployment Rate, and Average Hourly Earnings figures. These indicators are closely watched by investors as they influence inflation expectations and the Federal Reserve’s approach to interest rate adjustments. Shifts in rate expectations often have direct consequences for risk assets like Bitcoin, as changes in the cost of capital affect liquidity and investor appetite. Related Reading: Bitcoin Seasonality: Why Summer 2025 Will Catch Everyone Off Guard Taha suggests that the recent Binance outflows may reflect investor positioning ahead of potential macro-driven market volatility. “Bitcoin outflows from Binance alongside the sharp rise in spot trading activity… appear to show that investors are positioning for potential upside volatility,” he wrote. A favorable labor report could amplify bullish sentiment across both equity and crypto markets if it strengthens expectations of a rate cut or an extended pause in rate hikes. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Solana (SOL) Cools After Recovery — Resistance Proving Difficult to Crack",
      "link": "https://www.newsbtc.com/analysis/solana-sol-cools-155/",
      "summary": "Solana started a recovery wave above the $150 zone. SOL price is now correcting gains and might struggle to rise above the $155 resistance. SOL price started a fresh decline after it failed to clear $155 against the US Dollar. The price is now trading near $152 and the 100-hourly simple moving average. There is a key bullish trend line forming with support at $151 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could start a fresh increase if it clears the $156 resistance zone. Solana Price Trims Gains Solana price started a decent increase after it cleared the $150 resistance, like Bitcoin and Ethereum. SOL climbed above the $152 level to enter a short-term positive zone. There was a move above the 50% Fib retracement level of the downward move from the $160 swing high to the $144 low. However, the bears were active near the $156 resistance. They protected a move above the 76.4% Fib retracement level of the downward move from the $160 swing high to the $144 low. The price is now moving lower and trading below the $154 level. Solana is now trading near $152 and the 100-hourly simple moving average. There is also a key bullish trend line forming with support at $151 on the hourly chart of the SOL/USD pair. On the upside, the price is facing resistance near the $155 level. The next major resistance is near the $156 level. The main resistance could be $160. A successful close above the $160 resistance zone could set the pace for another steady increase. The next key resistance is $162. Any more gains might send the price toward the $165 level. Another Decline in SOL? If SOL fails to rise above the $155 resistance, it could start another decline. Initial support on the downside is near the $150 zone. The first major support is near the $146 level. A break below the $146 level might send the price toward the $142 zone. If there is a close below the $142 support, the price could decline toward the $136 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $150 and $146. Major Resistance Levels – $155 and $160."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Senator Lummis’ New Bill Enables Tax-Exempt Bitcoin Spending — But Thresholds Are Too Low",
      "link": "https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Senator-Lummis-at-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start\" rel=\"nofollow\"> </a></p> <p>Long-time Bitcoin advocate Senator Cynthia Lummis (R-WY) has drafted a bill that allows Bitcoin enthusiasts to spend small amounts of bitcoin without incurring capital gains taxes (which is very cool), but many — including myself — feel that the spending limits in the bill are too low.</p> <p>"
    },
    {
      "title": "Senator Lummis Introduces Digital Asset Tax Legislation",
      "link": "https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/US-Senator-Cynthia-Lummis-Discusses-Bitcoin-Reserve-Stablecoin-Legislation-and-Market-Structure-Bill-at-Bitcoin-2025-Conference.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation\" rel=\"nofollow\"> </a></p> <p>The bill proposes a $300 exemption for small Bitcoin and crypto transactions, defers taxes on mining and staking until assets are sold.</p> <p>"
    },
    {
      "title": "Bitcoin Miner Riot Produces 450 Bitcoin In June",
      "link": "https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Miner-Riot-Produces-450-Bitcoin-In-June.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june\" rel=\"nofollow\"> </a></p> <p>The company saw a 76% year-over-year increase in production, earned $5.6 million in power credits, and ended the month holding 19,273 Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin at UATX: A New Era of Intellectual Sovereignty",
      "link": "https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_A_majestic_depiction_of_the_Texas_State_Ca_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty\" rel=\"nofollow\"> </a></p> <p>UATX’s Bitcoin Endowment and hands-on curriculum defy academia’s past. Students mine with Antminer S9s — could this shape Bitcoin’s academic future? </p> <p>"
    },
    {
      "title": "Blue Star Capital Secures £1.25M For Bitcoin and Crypto Treasury Expansion",
      "link": "https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Blue-Star-Capital-Secures-1.25M-For-Bitcoin-and-Crypto-Treasury-Expansion.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion\" rel=\"nofollow\"> </a></p> <p>The funding will be used to expand SatoshiPay’s Bitcoin and crypto treasury and enhance its crypto operations. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin ETF Inflows Surge Past $600 Million for First Time Since May",
      "link": "https://decrypt.co/328589/bitcoin-etf-inflows-surge-past-600-million-for-first-time-since-may",
      "summary": "BlackRock’s IBIT and Fidelity’s FBTC led Thursday’s inflows as investors repositioned around Trump’s tax bill and shifting market conditions."
    },
    {
      "title": "Detroit Sues Crypto Real Estate Platform Over Safety, Health Violations",
      "link": "https://decrypt.co/328586/detroit-sues-crypto-real-estate-platform-safety-health-violations",
      "summary": "The city alleges the asset tokenization platform left hundreds of properties in disrepair, even as it promised significant returns."
    },
    {
      "title": "UK and Singapore Forge New AI and Tokenization Pact in London Talks",
      "link": "https://decrypt.co/328583/uk-singapore-ai-tokenization-pact-london-talks",
      "summary": "Officials are exploring cooperation in digital finance, ranging from asset tokenization to artificial intelligence."
    },
    {
      "title": "Japan's Minna Bank Explores Stablecoins on Solana in Fireblocks-Led Study",
      "link": "https://decrypt.co/328372/japans-minna-bank-stablecoins-solana-fireblocks-study",
      "summary": "The study will examine whether stablecoins are suitable for modernizing payments and cross-border finance in Japan."
    },
    {
      "title": "House GOP Declares ‘Crypto Week’ to Advance Landmark Digital Asset Bills",
      "link": "https://decrypt.co/328567/house-gop-crypto-week-advance-landmark-digital-asset-bills",
      "summary": "House Republicans are coordinating a legislative blitz to reshape U.S. crypto regulation and block future state-issued digital currencies."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "TRON DAO joins EthCC as WAGMI Sponsor, co-hosts events with MetaMask and Arkham",
      "link": "https://cryptobriefing.com/tron-eth-partnership-ethcc/",
      "summary": "<p>TRON DAO's active role at EthCC highlights its strategic push for cross-chain collaboration and strengthening ties within the blockchain community.</p> <p>"
    },
    {
      "title": "Trump’s ‘Big Beautiful Bill’ clears Congress after narrow House vote, what could this mean for Bitcoin?",
      "link": "https://cryptobriefing.com/trump-tax-bill-congress-vote/",
      "summary": "<p>The bill's passage may lead to a liquidity squeeze, impacting Bitcoin's price volatility and potentially increasing national debt concerns.</p> <p>"
    },
    {
      "title": "Senator Lummis proposes to exempt small crypto transactions from taxes, ending double taxation for miners and stakers",
      "link": "https://cryptobriefing.com/crypto-tax-reform-innovation-users/",
      "summary": "<p>The proposed tax reform could boost crypto adoption, enhance U.S. competitiveness in digital finance, and simplify tax compliance for users.</p> <p>"
    },
    {
      "title": "TON builder The Open Platform raises $28.5 million, reaches $1 billion valuation in extended Series A",
      "link": "https://cryptobriefing.com/ton-blockchain-funding-unicorn-status/",
      "summary": "<p>The funding and valuation boost for The Open Platform could accelerate global blockchain adoption, leveraging Telegram's extensive user base.</p> <p>"
    },
    {
      "title": "IMF denies Pakistan’s proposal to offer cheap power to Bitcoin, crypto miners",
      "link": "https://cryptobriefing.com/crypto-mining-electricity-pakistan-imf/",
      "summary": "<p>The IMF's rejection highlights challenges in balancing economic growth with sustainable energy policies in developing nations.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Why Solana and Ethereum are set to rally soon – Crypto VC weighs in",
      "link": "https://ambcrypto.com/why-solana-and-ethereum-are-set-to-rally-soon-crypto-vc-weighs-in/",
      "summary": "<img alt=\"SOL ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/SOLETHFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Wall Street could FOMO on SOL and ETH as stablecoin and tokenized stocks momentum grows."
    },
    {
      "title": "A Bitcoin ATH in the making? – Here’s why KEY data suggests…",
      "link": "https://ambcrypto.com/a-bitcoin-ath-in-the-making-heres-why-key-data-suggests/",
      "summary": "<img alt=\"A new Bitcoin all-time high could be brewing, here are the signs that support this\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A 40% decrease in coins flowing to exchanges, according to the flow multiple, showed decreased short-term inflows and implied exhausted sellers."
    },
    {
      "title": "PEPE tests key support, whales scoop $3M – Is a 12% rally next?",
      "link": "https://ambcrypto.com/pepe-tests-key-support-whales-scoop-3m-is-a-12-rally-next/",
      "summary": "<img alt=\"PEPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/AF47A37D-62E6-4505-95BD-593CE6033532.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PEPE's recent upward movement is supported by several bullish factors."
    },
    {
      "title": "Ripple applies for U.S. bank license – Next big step in crypto’s Wall Street takeover?",
      "link": "https://ambcrypto.com/ripple-applies-for-u-s-bank-license-next-big-step-in-cryptos-wall-street-takeover/",
      "summary": "<img alt=\"Ripple applies for U.S. bank license - Next big step in crypto’s Wall Street takeover?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/RippleXRPbankFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Arthur Hayes believe that crypto firms can't compete with traditional banks."
    },
    {
      "title": "Wormhole crypto’s latest price rejection – Result of a short squeeze or an organic rally?",
      "link": "https://ambcrypto.com/wormhole-cryptos-latest-price-rejection-result-of-a-short-squeeze-or-an-organic-rally/",
      "summary": "<img alt=\"Wormhole crypto&#039;s latest price rejection - Result of a short squeeze or an organic rally?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Wormhole-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The Ripple partnership announcement boosted demand for W, but would this be sustainable?"
    }
  ]
}