{
  "CoinDesk": [
    {
      "title": "Bitcoin Remains Defiant Amid Escalating Middle East Conflict and Trade War Fears",
      "link": "https://www.coindesk.com/markets/2025/06/14/bitcoin-remains-defiant-amid-escalating-middle-east-conflict-and-trade-war-fears",
      "summary": ""
    },
    {
      "title": "Bitcoin Bounces to $106K After Iran-Israel Jitters, but Analysts Warn of Deeper Pullback",
      "link": "https://www.coindesk.com/markets/2025/06/13/bitcoin-bounces-to-106k-after-iran-israel-jitters-but-analysts-warn-of-deeper-pullback",
      "summary": ""
    },
    {
      "title": "SUI Drops 10% to $3.02, but Is a Turnaround Forming After Buyers Step In Near $3?",
      "link": "https://www.coindesk.com/markets/2025/06/13/sui-drops-10-to-usd3-02-but-is-a-turnaround-forming-after-buyers-step-in-near-usd3",
      "summary": ""
    },
    {
      "title": "Weekly Recap: Milestones Galore for Stablecoins",
      "link": "https://www.coindesk.com/news-analysis/2025/06/13/weekly-recap-milestones-galore-for-stablecoins",
      "summary": ""
    },
    {
      "title": "Solana's SOL Falls 8% to $147 Despite Standard Chartered’s $275 Year-End Target",
      "link": "https://www.coindesk.com/markets/2025/06/13/solana-s-sol-falls-8-to-usd147-despite-standard-chartered-s-usd275-year-end-target",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Trump discloses $57M crypto windfall from World Liberty Financial",
      "link": "https://cointelegraph.com/news/trump-reports-57m-crypto-income-from-world-liberty-financial?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTFlYjMtMzBlOS03NTc0LThjZmYtMTUxNTcyNGMxY2E0.jpg\" /></p><p>Trump discloses $57.4 million in income tied to World Liberty Financial, a DeFi project that has raised over $550 million from investors.</p>"
    },
    {
      "title": "Spot Ether ETFs post outflow day after record 19-day inflow streak",
      "link": "https://cointelegraph.com/news/spot-ether-etfs-outflow-day-record-inflow-streak?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTM2ZjktNmU3NC03NmZkLWJlY2ItY2Y2M2UwYmFjMzA4.jpg\" /></p><p>Despite a record 19-day inflow streak for spot Ether ETFs, Ether is still trading below where it was at the start of the run.</p>"
    },
    {
      "title": "Trump Media’s Bitcoin treasury registration ‘declared effective’ by SEC",
      "link": "https://cointelegraph.com/news/trump-media-bitcoin-treasury-registration-effective-us-sec?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NWYxZjUtZjUyMC03ZTY4LWI3YzEtZWQyNDBmM2MxMmVh.jpg\" /></p><p>The SEC’s approval comes just weeks after Trump Media confirmed its capital raise to purchase Bitcoin, following initial denials of earlier reports.</p>"
    },
    {
      "title": "7 Solana ETF hopefuls file S-1s, more ‘back and forth’ with SEC ahead",
      "link": "https://cointelegraph.com/news/solana-etf-issuers-file-s1-sec-discussions-continue-etf-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTQ3OTQtYzcwZi03NGY5LWEzZjAtMzc0ZDBhMTlkZTlm.jpg\" /></p><p>ETF analyst James Seyffart points to how long it took for spot Bitcoin ETFs to get approved as a reason he doesn’t think approval is coming imminently for spot Solana ETFs.</p>"
    },
    {
      "title": "ETH price trend data suggests all future dips are for buying",
      "link": "https://cointelegraph.com/news/eth-price-trend-data-suggests-all-future-dips-are-for-buying?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzZhMWYtNDUyYi03MmZhLTg4ZDMtNGMzY2E3NTYzZmE1.jpg\" /></p><p>Technical data and ETH accumulation trends suggest price dips in the $2,100 zone are strategic purchasing opportunities.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin holds steady at $105k despite escalating tensions between Iran, Israel",
      "link": "https://cryptoslate.com/bitcoin-holds-steady-at-105k-despite-escalating-tensions-between-iran-israel/",
      "summary": "<p>Bitcoin (BTC) remained near the $105,000 mark on June 13, a sign of relative resilience following a sharp dip triggered by escalating conflict between Israel and Iran. As of press time, Bitcoin was trading at $105,600, having recovered the previous night&#8217;s pullback to end the day down 0.11% over the past 24 hours. The turbulence [&#8230;]</p> <p>"
    },
    {
      "title": "Anthony Pompliano planning $750 million Bitcoin-focused investment firm via SPAC",
      "link": "https://cryptoslate.com/anthony-pompliano-planning-750-million-bitcoin-focused-investment-firm-via-spac/",
      "summary": "<p>Morgan Creek Digital Assets co-founder and crypto influencer Anthony Pompliano is preparing to launch a new Bitcoin-focused investment vehicle that aims to raise $750 million through a merger with Columbus Circle Capital 1, the Financial Times reported on June 13, citing people familiar with the matter. The new entity, called ProCapBTC, will reportedly secure $500 [&#8230;]</p> <p>"
    },
    {
      "title": "Tornado Cash support: Ethereum Foundation pledges $1M to Storm’s defense, entities boost Pertsev appeal",
      "link": "https://cryptoslate.com/tornado-cash-support-ethereum-foundation-pledges-1m-to-storms-defense-entities-boost-pertsev-appeal/",
      "summary": "<p>Tornado Cash developers Roman Storm and Alexey Pertsev received renewed support from the crypto community on their respective trials for deploying the open-source code behind the mixer. The Ethereum Foundation on June 12 donated $500,000 to Tornado Cash developer Roman Storm’s legal defense. It said it will match another $750,000 from public contributors as the [&#8230;]</p> <p>"
    },
    {
      "title": "Spot Ethereum ETFs register new inflow record with 19-day streak, capturing nearly $1.4 billion",
      "link": "https://cryptoslate.com/spot-ethereum-etfs-register-new-inflow-record-with-19-day-streak-capturing-nearly-1-4-billion/",
      "summary": "<p>Spot Ethereum exchange-traded funds (ETFs) listed in the US set a new record by attracting net inflows for 19 consecutive trading sessions between May 16 and June 12, adding almost $1.4 billion. According to Farside Investors’ data, the streak began with $35 million on May 16, passed $1 billion on May 29, and reached $1.38 [&#8230;]</p> <p>"
    },
    {
      "title": "Invesco and Galaxy chase Solana ETF dream with Delaware trust registration",
      "link": "https://cryptoslate.com/invesco-and-galaxy-chase-solana-etf-dream-with-delaware-trust-registration/",
      "summary": "<p>Invesco and Galaxy Digital have taken a concrete step toward bringing a Solana exchange-traded fund (ETF) to the US market. Public records show that the firms registered a trust named Invesco Galaxy Solana ETF with Delaware&#8217;s Division of Corporations on June 12. Over the past months, several firms have created Delaware statutory trusts before seeking [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Billionaire Snaps Up $100 Million Of Trump Coin – Details",
      "link": "https://www.newsbtc.com/bitcoin-news/billionaire-snaps-up-100-million-of-trump-coin-after-investigation-ends/",
      "summary": "US President Donald Trump’s media group is making a big splash in crypto finance. A Chicago trading firm put up $100 million to buy 4 million shares in Trump Media &#38; Technology Group. That move comes just nine weeks after US regulators closed a probe into the same firm. Based on reports, the deal is tied to TMTG’s plan to buy over $2.5 billion worth of Bitcoin. Related Reading: Crypto Bloodbath: Over $1 Billion Liquidated As Iran-Israel Tensions Erupt Big Bet On Trump Coin According to the filing, DRW Investments treats Bitcoin like any other corporate asset. The company &#8211; founded and controlled by trading mogul Don Wilson &#8211; said it has been active in crypto for more than a decade. It sees value in holding Bitcoin on its balance sheets. Buying into TMTG was, in its view, a straightforward way to back that idea. News update from the swamp: &#8220;An American financier invested $100 million in the Trump family’s flagship bitcoin project just nine weeks after a probe into his crypto business was dropped by the Trump administration.&#8221; pic.twitter.com/ibiLp38CNC — Jake M. Grumbach (@JakeMGrumbach) June 14, 2025 Institutional Backers Rally Jane Street leads the pack with a $375 million stake in the Trump Group. That makes it the largest backer so far. Other investors are also lining up. Based on reports, TMTG’s goal is to raise $2.5 billion and use much of that cash to buy Bitcoin. If all goes to plan, the firm could hold over 140,000 BTC at current prices. Regulatory Milestone Achieved On Friday, June 13, the SEC declared TMTG’s registration statement for its Bitcoin Treasury offering effective. That covers 56 million new shares of equity and 29 million in convertible notes. Clearing this step means the company can sell shares and raise the cash it needs. It also subjects TMTG to ongoing SEC reporting and oversight. Voice Of The Crypto Industry Meanwhile, a DRW spokesperson called for a fresh look at the SEC and CFTC. The firm argued that the current regulators don’t match the pace of global market changes. Over the years, DRW’s crypto arm, Cumberland, bought 70,000 BTC in a US government auction of Silk Road assets. That stash is worth about $7.7 billion today. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Featured image from Digital Watch Observatory, chart from TradingView"
    },
    {
      "title": "This Analyst Predicted The Dogecoin Price Crash – Here’s The Rest Of The Forecast",
      "link": "https://www.newsbtc.com/news/dogecoin/analyst-dogecoin-price-crash/",
      "summary": "The Dogecoin price has crashed alongside the rest of the crypto market, and this has led to the break of a very important support level. This crash below $0.18 has signaled a turn in the tide, and this could trigger the next wave of declines. A crypto analyst had previously predicted this market decline, calling it before it began. However, it is not all bad news for the meme coin as longer timeframes offer more bullish options as time goes by. Dogecoin Price Still Bullish On The Long-Term Crypto analyst Master Ananda forecasted in a TradingView post where the Dogecoin price could be headed next. At the time of"
    },
    {
      "title": "Bitcoin To See ‘Choppy’ Next Few Weeks, Will BTC Retest The Range Lows?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-to-see-choppy-next-few-weeks-will-btc-retest-the-range-lows/",
      "summary": "After hitting a one-week low on Thursday, Bitcoin (BTC) is attempting to reclaim the key $104,000-$105,000 area as support, but some analysts have warned that a visit to its range’s lows could be in BTC’s short-term future if volatility continues. Related Reading: ONDO To Repeat 2024’s ‘Parabolic’ Run? Analyst Anticipates 130% Rally Soon Bitcoin to Continue Choppy Performance On Thursday afternoon, Bitcoin dropped 5.5% to the $102,000 support fueled by the news of the Iran-Israel conflict. Amid the market pullback, the flagship crypto failed to hold its $108,000-$110,000 three-day range, falling to the mid-zone of its post-November breakout range. Notably, BTC had just recovered from last week’s retest of the $100,000 level, reclaiming the key $106,800 area as support earlier this week. Daan Crypto Trades noted that the cryptocurrency “saw a clear trigger on that retest of the range high,” driven by the headlines of the Middle East turmoil, as it is “still quite a volatile and headline-driven market currently.” Bitcoin took the liquidity above and below its local price range, the analyst explained, adding that it is “already starting to trade more like the choppy (pre) summer environment” he had forecasted. Despite the drop, the analyst highlighted that the range high remains the key level for a larger move up: I think the range high is a key area for the Bulls to hold on to. If not, I think there&#8217;s a case to be made for a local high to be put in and for the market to move back further within this range. At this point, I&#8217;m fairly certain that if price breaks either the current monthly high or low, it will keep trending that direction for the rest of June (and possibly beyond). However, he suggested investors be cautious until BTC price breaks back above the range high convincingly and holds it as support on the higher timeframes. “Don&#8217;t chop yourself up in the next few weeks/months,” he warned. Volatility Could Send BTC To Range Lows Analyst Carl Runefelt from The Moon Show highlighted a potential double top pattern forming on BTC’s 4H chart, noting that if the price didn’t bounce from the previous descending resistance, reclaimed a week ago, it could further drop into the mid-zone of its range. According to the analysis, if it loses the mid-range, BTC could risk a retest of the range lows, around the $90,000-$92,000 area. Similarly, market watcher Merlijn The Trader suggested that Bitcoin could fill the lower CME gaps if the war narrative intensifies. BTC opened two CME gaps between the end of April and the start of May, situated at the $92,500 and $97,300 levels, respectively. Nonetheless, the trader considers that this could serve as a discount entry for investors, as BTC “already left higher CME gaps open,” signaling that a rebound to the levels is likely. Moreover, he noted that Bitcoin is displaying the same structure as last year, which could hint at a massive rally brewing. In 2024, the cryptocurrency faced rejection from a multi-month descending resistance following its all-time high (ATH) rally, which set the Range high level. Related Reading: Ethereum Prepares For Massive Run After $2,800 Reclaim – ‘Up Only’ Ahead? According to"
    },
    {
      "title": "Ethereum ETF Frenzy: Inflows Jump 5x While Bitcoin Stalls",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-etf-frenzy-inflows-jump-5x-bitcoin-stalls/",
      "summary": "Data shows the Ethereum spot exchange-traded funds (ETFs) have seen weekly inflows five times the recent average, while Bitcoin has seen a slowdown in momentum. Ethereum Spot ETFs Have Seen 154,000 ETH In Inflows This Week In a new post on X, the analytics firm Glassnode has talked about the latest trend in the netflow related to the US-based Ethereum spot ETFs. The &#8220;spot ETFs&#8221; refer to investment vehicles that allow an alternate means of exposure to a given asset. This means that with a spot ETF, a trader can &#8216;invest&#8217; into an asset without having to directly own it. In the context of cryptocurrencies, this is especially relevant, as the ETFs trade on traditional platforms. Some investors may not want to fiddle with digital asset exchanges and wallets, so the ETFs offer them a familiar path into cryptocurrencies. Related Reading: Tron Has Plenty Of Room For A 2025 Bull Run, Risk Metric Signals The option of the spot ETFs is a relatively recent one in the sector, with Bitcoin&#8217;s version gaining approval from the US Securities and Exchange Commission (SEC) at the start of 2024 and Ethereum&#8217;s in mid-2024. Below is a chart that shows how the netflows related to the latter&#8217;s spot ETFs have looked during the past month. From the graph, it&#8217;s visible that the Ethereum US spot ETFs have been witnessing net inflows for the last few weeks, a sign that there has been demand for the coin from the traditional investors. &#8220;This week alone, they’ve seen 154K ETH in inflows &#8211; 5x higher than their recent weekly average,&#8221; notes Glassnode. &#8220;For context: the biggest single-day ETH inflow this month was 77K ETH on June 11th.&#8221; While the trend has been that of growth for Ethereum, it has looked a bit more mixed when it comes to the number one digital asset, Bitcoin. As displayed in the above graph, the Bitcoin US spot ETFs have also seen positive netflows this week. The scale of the inflows, however, hasn&#8217;t been anything impressive, as only around 7,800 BTC has entered into the ETFs. This is above average, but far lower than the highs witnessed in May, when at one point the daily inflow had reached a peak of 7,900 BTC, more than the inflows for the entire current week. Related Reading: Bitcoin Options Traders Expect Quiet—But On-Chain Data Suggests Chaos Last week, the Bitcoin spot ETFs witnessed an outright negative netflow, so it seems the momentum has recently just been slower for the asset. In contrast, things have looked much more green for Ethereum indeed. ETH Price While Ethereum has been seeing consistent ETF inflows, its price has still underperformed against Bitcoin over the past day as it has dropped to $2,540, a decline of 7% compared to BTC&#8217;s 2% loss. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Drops Below $105K as Binance Net Taker Volume Turns Deep Red",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-drops-below-105k-as-binance-net-taker-volume-turns-deep-red/",
      "summary": "Bitcoin’s recent rally appears to have paused as the asset declined to just above $104,000 following a 2.1% drop over the past 24 hours. This latest movement signals a potential shift in short-term market momentum, with traders increasingly opting to exit positions. While the broader cryptocurrency market has experienced similar pullbacks, Bitcoin’s trajectory is attracting closer scrutiny due to its influence on overall sentiment and market structure. Analysts are looking into how external factors, particularly geopolitical developments, are impacting trading behavior. One such development is the reported military engagement between Israel and Iran on June 13, which triggered sell pressure across high-risk assets, including digital currencies. Amid these events, key metrics on Binance, particularly Net Taker Volume, are showing increased sell-side dominance, suggesting short-term volatility may continue. Related Reading: Bitcoin Nears All-Time High as Whale Behavior Suggests Further Upside Binance Net Taker Volume Hits Multi-Week Low Amid Bitcoin Panic Selling According to on-chain analyst Amr Taha on CryptoQuant’s QuickTake platform, Bitcoin’s Net Taker Volume on Binance fell to -$197 million, the most negative reading since June 6. This metric, which compares aggressive selling to aggressive buying, indicates heightened urgency among traders to sell at market prices, bypassing limit orders. The seven-hour moving average (7HMA) has remained in negative territory since June 12, reinforcing the current downward pressure. Historically, such extremes in net taker volume have been linked to local price bottoms, as they often signal panic-induced capitulation by retail and overleveraged traders. Taha highlighted that a similar event occurred on June 6, followed by a 4% rebound in Bitcoin’s price within 24 hours. The implication is that, while aggressive selling may signal weakness, it also presents conditions that have previously preceded price reversals. Geopolitical Shock Triggers Liquidation Cascade, May Signal Local Bottom Taha also pointed to the geopolitical backdrop, specifically the sudden escalation between Israel and Iran, as a major catalyst for recent market behavior. News of the strike led to a surge in liquidation activity, especially among long-leveraged positions. The correlation between the timing of the conflict and the spike in Binance sell volume suggests that traders are reacting to broader market uncertainty, contributing to downward momentum. Related Reading: Bitcoin Funding Rate Flips Again And History Says A Rally Is Around The Corner Despite this, Taha still views these conditions as potentially bullish in the medium term. Heavy selling often flushes out weaker hands, creating opportunities for long-term holders or institutional participants to accumulate positions at lower prices. Taha suggests that while the short-term outlook remains volatile, the current setup resembles previous recovery phases, marked by contrarian buying and reduced selling pressure. Featured image created with DALL-e, Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Layer 2: Statechains",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Statechains-fotor-20250613161023.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains\" rel=\"nofollow\"> </a></p> <p>The second article in the Bitcoin Layer 2 series. This article covers Statechains, originally designed by Ruben Somsen, and implemented by CommerceBlock.</p> <p>"
    },
    {
      "title": "Pakistan’s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?",
      "link": "https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Pakistan-Bitcoin-Reserve.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation\" rel=\"nofollow\">Pakistan&#8217;s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?</a></p> <p>A strategic Bitcoin reserve is a step in the right direction for Pakistan, but only mass adoption will truly unlock the immense potential Bitcoin can offer.</p> <p>"
    },
    {
      "title": "The 30,000-Foot View of the Oslo Freedom Forum",
      "link": "https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Oslo-Freedom-Forum.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum\" rel=\"nofollow\"> </a></p> <p>Stories of courage and repression, and the tools defending civil liberties at the 17th Annual Oslo Freedom Forum in Norway.</p> <p>"
    },
    {
      "title": "UK Gold Mining Company Bluebird to Convert Gold Revenues into Bitcoin",
      "link": "https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/UK-Gold-Mining-Company-Bluebird-to-Convert-Gold-Revenues-into-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bluebird Mining Ventures Ltd. will adopt bitcoin as a treasury reserve asset and convert future gold revenues into Bitcoin.</p> <p>"
    },
    {
      "title": "JPMorgan Reports Record Profits for Bitcoin Miners in Q1",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-MORGAN.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1\" rel=\"nofollow\"> </a></p> <p>Bitcoin mining companies in the U.S. have kicked off 2025 with record performance, according to a recent report. The first quarter of the year was “one of Bitcoin miners&#8217; best quarters to date,” analysts Reginald Smith and Charles Pearce stated.&#160; &#8220;Four of the five operators in our coverage reported record revenue and profits,&#8221; the report [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "How Will the Israel-Iran Conflict End? Here's What AI Models Predict",
      "link": "https://decrypt.co/325190/how-israel-iran-conflict-end-ai-models-predict",
      "summary": "We asked seven leading AI models to analyze the most plausible scenario for how the conflict between Israel and Iran will play out."
    },
    {
      "title": "Solana ETF Applicants Submit Updated SEC Filings With Staking",
      "link": "https://decrypt.co/325234/solana-etf-applicants-updated-sec-filings-staking",
      "summary": "Prospective Solana ETF issuers in the United States submitted updated SEC filings Friday, suggesting approvals may be near."
    },
    {
      "title": "Public Keys: Circle Keeps Surging, GameStop's Bitcoin 'Black Box', Ethereum Treasury Tanks",
      "link": "https://decrypt.co/325150/public-keys-circle-gamestop-bitcoin-ethereum-treasury-tanks",
      "summary": "Circle’s stock soared again while GameStop shares swooned—but SharpLink Gaming’s fall takes the cake on a busy week."
    },
    {
      "title": "Bitcoin Treasury Firm GameStop Boosts Convertible Bond Offering to $2.25 Billion",
      "link": "https://decrypt.co/325182/gamestop-upsizes-convertible-bond-offering-2-5-billion",
      "summary": "Shares fell earlier this week after the Texas-based video game retailer announced plans to offer $1.75 billion in convertible bonds."
    },
    {
      "title": "Elizabeth Warren, Consumer Groups Slam Walmart and Amazon Stablecoin Plans",
      "link": "https://decrypt.co/325178/elizabeth-warren-consumer-groups-slam-walmart-amazon-stablecoin-plans",
      "summary": "Retailers Amazon and Walmart are considering issuing their own stablecoins, according to a Friday report in the Wall Street Journal."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Invesco, Galaxy Digital file to launch Solana ETF in Delaware amid SEC approval buzz",
      "link": "https://cryptobriefing.com/solana-etf-sec-approval/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional interest and investment in the Solana blockchain ecosystem.</p> <p>"
    },
    {
      "title": "Cardano founder Charles Hoskinson proposes converting $100M ADA to Bitcoin and stablecoins",
      "link": "https://cryptobriefing.com/cardano-treasury-conversion-proposal/",
      "summary": "<p>Hoskinson's proposal could enhance Cardano's DeFi competitiveness, potentially increasing its market share and attracting more developers.</p> <p>"
    },
    {
      "title": "Amazon, Walmart, and Expedia consider issuing stablecoins to sidestep costly card fees: WSJ",
      "link": "https://cryptobriefing.com/retailers-embrace-stablecoins/",
      "summary": "<p>Retailers' stablecoin adoption could revolutionize payment systems, enhance cash flow, and challenge traditional financial networks.</p> <p>"
    },
    {
      "title": "Bitcoin slides, gold spikes after Israel strikes Iran, Israeli PM warns campaign will last as many days as needed",
      "link": "https://cryptobriefing.com/crypto-market-volatility-israel-iran/",
      "summary": "<p>Geopolitical tensions may drive investors to traditional safe-haven assets, impacting cryptocurrency markets and regional economic stability.</p> <p>"
    },
    {
      "title": "$USD1 stablecoin begins minting on TRON",
      "link": "https://cryptobriefing.com/usd1-stablecoin-minting-on-tron/",
      "summary": "<p>The minting of USD1 on TRON could enhance institutional trust and adoption, bolstering TRON's position in the global blockchain market.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Solana ETF filings now include staking – Approval odds soar to 91%",
      "link": "https://ambcrypto.com/solana-etf-filings-now-include-staking-approval-odds-soar-to-91/",
      "summary": "<img alt=\"Solana ETF filings now include staking - Approval odds soar to 91%\" class=\"attachment-full size-full wp-post-image\" height=\"605\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Solana-ETF-application-goes-for-ammendment.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1075\" />The SEC isn't saying no, but it’s also not saying yes. What's behind this ETF limbo?"
    },
    {
      "title": "BSC perps see 800% jump – Is BNB the next high-risk bet?",
      "link": "https://ambcrypto.com/bsc-perps-see-800-jump-is-bnb-the-next-high-risk-bet/",
      "summary": "<img alt=\"BSC perps see 800% jump - Is BNB the next high-risk bet?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-6.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BSC’s perp frenzy is real - Does BNB ride the wave or miss it?"
    },
    {
      "title": "Polkadot’s Threshold Bitcoin plan under fire: ‘Long-term thinking’ or ‘garbage’?",
      "link": "https://ambcrypto.com/polkadots-threshold-bitcoin-plan-under-fire-long-term-thinking-or-garbage/",
      "summary": "<img alt=\"Polkadot&#039;s Threshold Bitcoin plan under fire: &#039;Long-term thinking&#039; or &#039;garbage&#039;?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Polkadot-Explores-Bitcoin-Reserve-Plans.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" /> Is this the lifeline the network desperately needs or just a financial misstep?"
    },
    {
      "title": "A mid-year analysis: Who will lead Bitcoin mining in 2025?",
      "link": "https://ambcrypto.com/a-mid-year-analysis-who-will-lead-bitcoin-mining-in-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"607\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-14-124645.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"931\" />As the world’s largest Bitcoin mining hub, the United States rolled out a series of [&#8230;]"
    },
    {
      "title": "Ethena drops 14%, but why investor sentiment remains strong",
      "link": "https://ambcrypto.com/ethena-drops-14-but-why-investor-sentiment-remains-strong/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250613_151937_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ENA faces major market struggles, but hope remains."
    }
  ]
}