{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing:  U.S. Loads Up, Germany Cashes Out as BTC Holds Near $119K",
      "link": "https://www.coindesk.com/markets/2025/07/15/asia-morning-briefing-us-loads-up-germany-cashes-out-as-btc-holds-near-119k",
      "summary": ""
    },
    {
      "title": "Bitcoin Market Top Is 'Nowhere Near,' Say Analysts as Price Pauses at $120K",
      "link": "https://www.coindesk.com/markets/2025/07/14/bitcoin-market-top-is-nowhere-near-say-analysts-as-price-pauses-at-120k",
      "summary": ""
    },
    {
      "title": "It's Crypto Week. Congress Can Future-Proof the U.S. Financial System: Summer Mersinger",
      "link": "https://www.coindesk.com/opinion/2025/07/14/its-crypto-week-congress-can-future-proof-the-us-financial-system-summer-mersinger",
      "summary": ""
    },
    {
      "title": "U.S. Banking Regulators Issue Crypto 'Safekeeping' Statement, Not Pushing New Policy",
      "link": "https://www.coindesk.com/policy/2025/07/14/u-s-banking-regulators-issue-crypto-safekeeping-statement-not-pushing-new-policy",
      "summary": ""
    },
    {
      "title": "Anti-Bitcoin Vanguard Might Be the Largest Institutional Holder of MSTR Stock",
      "link": "https://www.coindesk.com/business/2025/07/14/vanguard-accidentally-becomes-largest-holder-of-strategy-stock-despite-anti-bitcoin-stance",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin-fueled darknet marketplace vanishes in possible exit scam",
      "link": "https://cointelegraph.com/news/abacus-market-exit-scam-bitcoin-darknet-shutdown?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGY5MjUtYjZlYS03ZjViLTg3NzMtOGY5NTQ2NTQ1ZTcy.jpg\" /></p><p>Abacus commanded around 70% of the market share across all Bitcoin-enabled Western darknet marketplaces in 2024.</p>"
    },
    {
      "title": "Even retail demand is now outpacing Bitcoin supply: Bitfinex",
      "link": "https://cointelegraph.com/news/bitcoin-retail-demand-outpacing-bitcoin-issuance-rate-bitfinex-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGUyZDQtNGM3Ni03NzgzLTljZTAtOWFmNTYxOGJkZGFi.jpg\" /></p><p>Bitfinex analysts say this level of accumulation “supports the broader bullish narrative that new buyers entering the Bitcoin market are price-agnostic buyers.”</p>"
    },
    {
      "title": "FOMO, lax rules are fueling the crypto crime supercycle",
      "link": "https://cointelegraph.com/news/regulatory-gaps-fomo-powering-crypto-crime-supercycle?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmMyNjEtYzdlOS03OWE5LTk1MWQtOTdmNmM1MDVjY2Fh.jpg\" /></p><p>Retired DEA agent Bill Callahan tells that bad actors can make plenty of mistakes and still “make a handsome profit.”</p>"
    },
    {
      "title": "US Federal agencies outline key risks for banks eyeing crypto custody",
      "link": "https://cointelegraph.com/news/fdic-agencies-crypto-custodial-risks-banks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5ODBhYzMtYmM1MC03MmQwLWFmZTQtNDdiNTQ1N2ExOTli.jpg\" /></p><p>One risk facing banks that custody crypto is the potential for liability if crypto assets are lost, according to three US financial agencies.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Options gamma pin at $123k holds Bitcoin in a tight range after new ATH",
      "link": "https://cryptoslate.com/options-gamma-pin-at-123k-holds-bitcoin-in-a-tight-range-after-new-ath/",
      "summary": "<p>Bitcoin has set a new all-time high above $121,000, and the options market on Deribit is showing clear signs of hedging pressure and gamma-driven pinning around this level. Traders are in a market structured heavily in favor of upside exposure, with positioning and Greek profiles aligning at a delicate inflection point. Current open interest and [&#8230;]</p> <p>"
    },
    {
      "title": "PUMP debuts at $5.6B FDV, logs $34M volume within first 3 hours",
      "link": "https://cryptoslate.com/pump-debuts-at-5-6b-fdv-logs-34m-volume-within-first-3-hours/",
      "summary": "<p>Pump.fun’s PUMP token opened at a fully diluted valuation (FDV) of roughly $5.6 billion on July 14 and fell 7.3% within the first three hours of trading, according to DEX Screener data. The Solana-based coin changed hands at approximately $0.005128 at 20:30 UTC, implying a current FDV of nearly $5.12 billion, liquidity of $19.3 million, [&#8230;]</p> <p>"
    },
    {
      "title": "Retail accumulation absorbs fresh supply, propels Bitcoin to record highs",
      "link": "https://cryptoslate.com/retail-accumulation-absorbs-fresh-supply-propels-bitcoin-to-record-highs/",
      "summary": "<p>Retail investors buying long-term drove Bitcoin (BTC) out of its four-month channel between $100,000 and $110,000 to a new all-time high of $123,120, a 65% rebound from April’s tariff-panic low. According to the latest Bitfinex Alpha report, the move to heavy bidding from wallets holding fewer than 100 BTC, while long-term holder selling slowed. Grassroots [&#8230;]</p> <p>"
    },
    {
      "title": "OCC, Fed, FDIC publish joint guidance for banks offering crypto custody",
      "link": "https://cryptoslate.com/occ-fed-fdic-publish-joint-guidance-for-banks-offering-crypto-custody/",
      "summary": "<p>The Office of the Comptroller of the Currency (OCC), the Federal Reserve Board (Fed), and the Federal Deposit Insurance Corporation (FDIC) released a joint statement explaining how existing banking rules apply when institutions custody crypto for customers. The guidance describes “safekeeping” as the act of holding a digital asset on a client’s behalf and stresses [&#8230;]</p> <p>"
    },
    {
      "title": "Daily Bitcoin Ordinals sales volume soar to strongest level since December",
      "link": "https://cryptoslate.com/daily-bitcoin-ordinals-sales-volume-soar-to-strongest-level-since-december/",
      "summary": "<p>Daily trading in Bitcoin Ordinals reached its most active level since December 6, 2024, with CryptoSlam data showing $11.5 million in sales on July 14. The data also highlighted more than 8,000 unique buyers versus approximately 3,000 unique sellers, representing the widest buyer/seller gap in five months. The surge places the sales volume curve above [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Exchange Inflows Spike After $123,000 Peak – Signs Of Short-Term Cooling?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-exchange-inflows-spike-after-123000-peak-signs-of-short-term-cooling/",
      "summary": "Bitcoin (BTC) surged to a new all-time high (ATH) of $123,218 earlier today, pushing its market cap beyond $2.4 trillion. However, exchange data shows a sharp increase in BTC inflows following this milestone, raising concerns of a potential short-term correction. Bitcoin Exchange Inflows Warn Of Pullback According to a CryptoQuant Quicktake post by contributor Tarekonchain, BTC is beginning to show signs of short-term cooling. Notably, exchange inflows recorded a sharp uptick right after Bitcoin hit its fresh ATH. Related Reading: Bitcoin Rally Ahead? DXY Breakdown Suggests Capital Shift To Risk-On Assets The following chart shared by the analyst highlights exchange netflows to spot platforms, with notable spikes in inflows to centralized exchanges. This typically indicates profit-taking behavior by short-term holders and some whales. Tarekonchain noted that such on-chain activity is usually indicative of a local top that could lead to a healthy price correction or consolidation in the coming days. They added: It&#8217;s a classic pattern we&#8217;ve seen after previous parabolic rallies &#8211; profits are realized, weak hands exit, and price finds a new base. That said, the analyst noted that despite the warning signs of a looming price correction, the overall market structure remains largely bullish. For instance, long-term holders are still holding their BTC, not keen on selling at current price levels. Supporting the bullish thesis, spot Bitcoin exchange-traded funds (ETFs) continue to attract strong capital. For the week ending July 11, they saw $2.72 billion in net inflows &#8211; a clear sign of ongoing institutional interest. Whales Preparing To Sell? In a separate post, CryptoQuant contributor Crazzyblockk pointed to an uptick in whale activity on Binance. The Binance Whale Activity Score shows that deposits from large wallets have spiked dramatically. Related Reading: Bitcoin Uptrend Intact, But Binance Activity Warns Of Short-Term Pullback Whales reportedly deposited as much as 1,800 BTC to Binance in a single day, with more than 35% of transactions valued at over $1 million, hinting at strategic positioning ahead of expected volatility. Crazzyblockk highlighted two possible scenarios following the surge in deposits from large-scale investors. First, it is likely that these investors are sitting on healthy profits and may be getting ready to secure some gains after a historic run. Alternatively, they might be aiming to leverage Binance’s deep liquidity to hedge or open new positions as the market experiences heightened volatility. Either way, this sell-side pressure on Binance is likely to weigh on BTC’s bullish momentum. Despite rising inflows and increased whale activity, market sentiment remains broadly positive. Retail investor participation is still muted compared to previous bull runs, suggesting the current rally might still have room to grow. At press time, BTC trades at $119,449, up 0.8% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Bitcoin Price Retreats After Hitting ATH — Bulls Pause for Breath",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-retreats-123k/",
      "summary": "Bitcoin price started a fresh increase above the $118,500 zone. BTC traded to a new high above $120,000 and recently started a downside correction. Bitcoin started a fresh increase above the $120,000 zone. The price is trading near $118,500 and the 100 hourly Simple moving average. There was a break below a bullish trend line with support at $119,800 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might start another increase if it clears the $120,500 resistance zone. Bitcoin Price Sets New ATH Bitcoin price started a fresh increase after it cleared the $116,500 resistance zone. BTC gained pace for a move above the $118,000 and $120,000 resistance. The bulls even pumped the pair above the $122,000 resistance zone. A new all-time high was formed at $123,140 and the price is now consolidating gains. There was a move below the 23.6% Fib retracement level of the upward move from the $108,636 swing low to the $123,140 high. Besides, there was a break below a bullish trend line with support at $119,800 on the hourly chart of the BTC/USD pair. Bitcoin is now trading near $118,500 and the 100 hourly Simple moving average. Immediate resistance on the upside is near the $119,550 level. The first key resistance is near the $120,500 level. The next resistance could be $122,000. A close above the $122,000 resistance might send the price further higher. In the stated case, the price could rise and test the $123,200 resistance level. Any more gains might send the price toward the $125,000 level. The main target could be $130,000. Downside Correction In BTC? If Bitcoin fails to rise above the $120,500 resistance zone, it could start a downside correction. Immediate support is near the $117,500 level. The first major support is near the $115,800 level or the 50% Fib retracement level of the upward move from the $108,636 swing low to the $123,140 high. The next support is now near the $114,000 zone. Any more losses might send the price toward the $112,500 support in the near term. The main support sits at $110,500, below which BTC might continue to move down. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $117,500, followed by $115,800. Major Resistance Levels – $120,500 and $122,000."
    },
    {
      "title": "Bitcoin Hits $123,000—But Inflows Are Just A Fraction Of 2024’s Peak",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-123000-inflows-just-fraction-of-2024s-peak/",
      "summary": "Bitcoin has set a new all-time high (ATH) around $123,000, but cryptocurrency market inflows are still far from the peak observed back in 2024. Crypto Capital Inflows Are Currently Sitting At $51 Billion As pointed out by analyst Ali Martinez in a new post on X, there is a stark difference in capital participation between the current Bitcoin rally and the one from December 2024. Related Reading: Bitcoin Breaks $118,000—But Liquidity Still Thin, Glassnode Warns Below is the chart shared by the analyst that compares the two bull runs. The graph captures the 30-day capital flows occurring for Bitcoin, Ethereum, and the stablecoins. For the former two assets, it tracks them using the Realized Cap indicator. The Realized Cap is a capitalization model that calculates a given cryptocurrency&#8217;s total value by assuming that each coin in the circulating supply has its value equal to the last time it changed hands on the network. In short, what the metric represents is the amount of capital that investors of the asset as a whole have put into it. Changes in this indicator, therefore, correspond to the entry or exit of capital into the network. As is visible in the chart, the 30-day Realized Cap change for Bitcoin and Ethereum (colored in orange) has gone up alongside the latest price rally, indicating that capital has flowed into these coins. It&#8217;s also apparent that stablecoin flows (blue) have also noted an uptick, although the scale has been smaller. For stables, capital flow can be directly measured using the market cap, since their price is always pegged to $1 means that the Realized Cap never differs from the market cap. In the cryptocurrency sector, capital mainly comes in through three entry points: Bitcoin, Ethereum, and stablecoins. The altcoins usually only receive a rotation of capital from these assets. Since the flows related to the three have recently been positive, the market as a whole has been getting an injection of capital. In total, the aggregate capital inflows for the cryptocurrency sector have stood at $51.2 billion for the past month. This is certainly a sizeable figure on its own, but it pales in comparison to what was witnessed before. Related Reading: Bitcoin Price Breaks 8-Year Resistance Line That Failed In 2017-2021 As Martinez has highlighted in the chart, the monthly capital flows peaked at almost $135 billion in the December 2024 Bitcoin rally above $100,000, more than double the latest number. Something to keep in mind, however, is the fact that the previous run was more explosive, while the latest one has come in two waves: an initial recovery surge above $100,000 that led into a consolidation phase and the current breakout into the $120,000 levels. This could, at least in part, explain why the metric has appeared relatively cool recently. Bitcoin Price At the time of writing, Bitcoin is trading around $121,700, up nearly 3% over the last 24 hours. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Hits $123K, But Market Euphoria Has Yet to Kick In, Says Analyst",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-hits-123k-but-market-euphoria-has-yet-to-kick-in-says-analyst/",
      "summary": "Bitcoin has reached new milestones this week, briefly breaking above the $123,000 mark earlier today before retracing slightly to $121,812 at the time of writing. This follows a week of strong gains, with BTC rising by more than 10% amid a broader uptrend in the cryptocurrency market. Despite the minor pullback, market analysts are closely monitoring on-chain and derivatives data to assess whether momentum is building toward a more aggressive phase of the rally. The recent surge has also benefited the broader cryptocurrency ecosystem, lifting total global crypto market capitalization to just under $4 trillion. Related Reading: Bitcoin Breaks Records: What Miners and Leverage Traders Are Doing Behind the Scenes While Bitcoin continues to dominate in terms of volume and influence, sentiment metrics suggest that traders and investors may still be approaching with measured optimism. According to analysts, several indicators are now pointing to a potential shift in market dynamics that could influence Bitcoin’s next major move. Market Euphoria Not Yet Confirmed CryptoQuant contributor Joao Wedson has offered insights into the current structure of the Bitcoin market through an analysis of the price gap between spot and perpetual futures contracts on Binance. In a recent QuickTake post, Wedson noted that the spot price of Bitcoin continues to outpace the perpetual futures price, a sign that market sentiment has not yet tipped into full euphoria. Historically, a positive gap between the two markets has signaled increased speculative activity and the onset of parabolic rallies. &#8220;The gap is still in negative territory,&#8221; Wedson stated, “but the narrowing trend indicates that sentiment may be transitioning from cautious to more optimistic.&#8221; The analysis implies that traders in the futures market have yet to aggressively price in further upside, possibly waiting for stronger confirmation before deploying leverage. Should this gap flip to positive territory, it could be interpreted as a sign of increased risk appetite, potentially fueling a sharper upward move. Wedson also emphasized the importance of monitoring how derivatives markets respond in the coming days. “If the trend continues and flips positive, we could see a more intense phase of the rally driven by leveraged traders,” he wrote. Until then, the current environment appears to reflect a market in the process of building a foundation, rather than one that has already entered a euphoric phase. Bitcoin Profit-Taking Remains Measured In another analysis, CryptoQuant’s Enigma Trader examined the Spent Output Profit Ratio (SOPR), a key indicator used to evaluate the extent of realized profits by Bitcoin holders. According to"
    },
    {
      "title": "Bitcoin Is Not Stopping At $123,000 — Technical Indicators Point To $140,000 Top",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-not-stopping-at-123000/",
      "summary": "Bitcoin (BTC) has reignited market excitement after smashing through the $123,000 level. Currently, technical indicators, surging liquidity, and macroeconomic tailwinds have analysts predicting that the leading cryptocurrency is on the verge of a parabolic surge to a $140,000 top in the next few weeks. $140,000 Set As Bitcoin Next Top Target The Bitcoin price is exhibiting remarkable strength as it continues its parabolic advance beyond the $123,000 range. Technical indicators identified by crypto analyst Mr. Wall Street are now aligning around a new short-term target between $135,000 and $140,000. Related Reading: Here’s Why The Bitcoin And Ethereum Prices Are Surging Today According to the market expert’s chart report, BTC has successfully broken out of a Broadening Wedge pattern after consolidating between a descending support and horizontal resistance for nearly two months. The decisive breakout above the $112,000 resistance validates the analyst’s earlier bullish projections. Initially, the analyst proposed two possible scenarios: A breakout above all-time highs around $112,000 leading directly to a $117,000-$120,000 rally or a brief dip to $92,000 to fill the CME gap before continuing up toward the same target zone. Based on its recent price movement, Bitcoin has chosen to follow the first scenario, underscoring the strength of its bullish momentum and signaling that short-term Fear, Uncertainty, and Doubt (FUD) has had little to no effect. With the second scenario officially invalidated, BTC’s price trajectory is seemingly clearer and higher. The recent surge above $123,000 has also spotlighted the next major liquidity pool between $135,000 and $140,000. The chart highlights that reaching this zone would liquidate over $45 billion in short positions. Following this, the next target zone sits between $160,000 and $170,000, threatening another $70 billion in short liquidations. M2 Surge And MACD Fuel BTC’s Bullish Case Mr. Wall Street’s bullish setup for Bitcoin is further supported by macroeconomic and key chart indicators. The analyst pointed to US President Donald Trump’s recent approval of a bill to raise the country’s debt ceiling—a move that signals accelerating debt growth. This, in turn, is expected to expand M2 money supply, which historically correlates with rising prices for assets like Bitcoin. Related Reading: Bitcoin To Repeat Parabolic Phase From 2017 And 2021? Here’s The Target BTC’s Moving Average Convergence Divergence (MACD) also remains fully intact across all time frames, while the Market Value to Realized Value (MVRV) ratio is still well below historic top levels. In addition, the Relative Strength Index (RSI) has yet to enter overbought territory. These indicators confirm that Bitcoin is still far from a macro top, making the $135,000 &#8211; $140,000 range a plausible interim target. Looking ahead, Mr. Wall Street emphasizes that Bitcoin has entered a supercycle, a phase where the market is marked by price discovery. While he acknowledges the possibility of a short-term retest of the $112,000 level before continuing upward, the analyst maintains that, regardless of minor pullbacks, the price action from here is likely to be swift and aggressive. Featured image from Pixabay, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Tornado Cash Trial Begins with Discussions around Motions In Limine and Data Custodians",
      "link": "https://bitcoinmagazine.com/news/tornado-cash-trial-begins-with-discussions-around-motions-in-limine-and-data-custodians",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Tornado-Cash-Trial-SDNY.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/tornado-cash-trial-begins-with-discussions-around-motions-in-limine-and-data-custodians\" rel=\"nofollow\"> </a></p> <p>The judge addressed questions and requests from the defense regarding updated motions and the legitimacy of certain data that will be used as evidence in the case.</p> <p>"
    },
    {
      "title": "TD Cowen Raises Strategy Price Target to $680, Forecasts $155K Bitcoin by Year-End",
      "link": "https://bitcoinmagazine.com/news/td-cowen-raises-strategy-price-target-to-680-forecasts-155k-bitcoin-by-year-end",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/TD-Cowen-Raises-Strategy-Price-Target-to-680-Forecasts-155K-Bitcoin-by-Year-End.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/td-cowen-raises-strategy-price-target-to-680-forecasts-155k-bitcoin-by-year-end\" rel=\"nofollow\"> </a></p> <p>TD Cowen has raised its price target for Strategy’s stock from $590 to $680 per share, citing the company’s deepening role as a Bitcoin proxy and forecasting a potential surge in BTC prices to $155,000 by December.&#160; The research report from today sets a base-case target of $128,000 for Bitcoin by year-end, with a downside [&#8230;]</p> <p>"
    },
    {
      "title": "US Regulators Allow Banks Custody Over Bitcoin And Crypto",
      "link": "https://bitcoinmagazine.com/news/us-regulators-allow-banks-custody-over-bitcoin-and-crypto",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/US-Regulators-Allow-Banks-Custody-Over-Bitcoin-And-Crypto-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/us-regulators-allow-banks-custody-over-bitcoin-and-crypto\" rel=\"nofollow\"> </a></p> <p>The Federal Reserve, OCC, and FDIC warn banks that safekeeping bitcoin and other crypto-assets demands strong cybersecurity, operational expertise, and full legal compliance.</p> <p>"
    },
    {
      "title": "Make Bitcoin Mining Decentralized Again",
      "link": "https://bitcoinmagazine.com/business/make-bitcoin-mining-decentralized-again",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/BM-TN.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/make-bitcoin-mining-decentralized-again\" rel=\"nofollow\"> </a></p> <p>From Bitaxes to Heatbits, small and comfortable home mining equipment are retail’s new entry into Bitcoin.</p> <p>"
    },
    {
      "title": "Kazakhstan Considers Investing National Reserves in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/kazakhstan-considers-investing-national-reserves-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Kazakhstan-Considers-Investing-National-Reserves-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kazakhstan-considers-investing-national-reserves-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>The country’s central bank is exploring Bitcoin and crypto exposure for its sovereign wealth portfolios and advancing plans to create a Bitcoin reserve.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Grok Went MechaHitler and Elmo Said Hold My Beer",
      "link": "https://decrypt.co/330121/grok-mechahitler-elmo-hold-my-beer",
      "summary": "The incident follows a previous issue with Grok last week, which began responding with hate-filled speech to users on X."
    },
    {
      "title": "'Artificial Gooning Intelligence': Elon Musk's xAI Launches Waifu Companions for Grok",
      "link": "https://decrypt.co/330097/artificial-gooning-intelligence-elon-musk-xai-waifu-companions-grok",
      "summary": "xAI's new Companions feature brings anime waifus to Grok subscribers, sparking everything from marriage proposals to existential dread about humanity's future."
    },
    {
      "title": "Coinbase Stock Hits Record High Alongside Bitcoin as Analysts Highlight 'Growth Runway'",
      "link": "https://decrypt.co/330112/coinbase-hits-record-high-bitcoin-analysts-highlight-growth",
      "summary": "Argus Research said in a new note that the expected passing of the GENIUS Act will likely act as an “impetus for growth” for Coinbase."
    },
    {
      "title": "Despite Grok's 'MechaHitler' Meltdown, Elon Musk’s xAI Scores $200M Pentagon Deal",
      "link": "https://decrypt.co/330090/despite-grok-mechahitler-meltdown-xai-200-million-pentagon-deal",
      "summary": "The U.S. Department of Defense has awarded xAI a lucrative deal just days after the Grok chatbot spewed antisemitism, sparking concern."
    },
    {
      "title": "BitMine Stock Spikes, Then Sags After Bitcoin Miner Tops $500 Million in Ethereum",
      "link": "https://decrypt.co/330081/bitmine-stock-spikes-sags-bitcoin-miner-tops-500-million-ethereum",
      "summary": "Bitcoin miner BitMine saw its stock price briefly surge Monday after acquiring more Ethereum for its treasury."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Wallet linked to Satoshi-era Bitcoin whale moves 9,000 BTC to Galaxy Digital",
      "link": "https://cryptobriefing.com/galaxy-digital-receives-4500-btc-from-dormant-80k-btc-whale/",
      "summary": "<p>The movement of dormant Bitcoin by a whale could impact market stability and spark renewed interest in cryptocurrency security and ownership.</p> <p>"
    },
    {
      "title": "Ripple CTO David Schwartz sees Bitcoin as the bedrock of the digital asset ecosystem",
      "link": "https://cryptobriefing.com/bitcoin-dominance-ripple-cto-insights/",
      "summary": "<p>Bitcoin's foundational role as a secure settlement layer may ensure its enduring relevance despite competition from advanced blockchains.</p> <p>"
    },
    {
      "title": "Federal Reserve clears US banks to custody crypto assets including Bitcoin",
      "link": "https://cryptobriefing.com/federal-reserve-approves-us-banks-custody-bitcoin-crypto/",
      "summary": "<p>US banks can now offer crypto custody services following new Federal Reserve guidance, opening doors for institutional adoption.</p> <p>"
    },
    {
      "title": "Pump.fun’s $PUMP token launches at $5.6B valuation",
      "link": "https://cryptobriefing.com/pump-token-launch-valuation/",
      "summary": "<p>PUMP went live today with listings across top exchanges including Bybit, KuCoin, MEXC, and Hyperliquid, marking pumpfuns official debut.</p> <p>"
    },
    {
      "title": "Vanguard calls Bitcoin immature, then becomes top shareholder of Bitcoin proxy Strategy",
      "link": "https://cryptobriefing.com/vanguard-bitcoin-proxy-strategy-shares/",
      "summary": "<p>Vanguard's shift highlights growing institutional acceptance of Bitcoin, signaling a potential mainstream integration of digital assets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin: How is THIS gap setting the stage for BTC’s climb to $130K?",
      "link": "https://ambcrypto.com/bitcoin-how-is-this-gap-setting-the-stage-for-btcs-climb-to-130k/",
      "summary": "<img alt=\"Bitcoin: How is THIS gap setting the stage for BTC&#039;s climb to $130K?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-3-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />It’s not 2021 all over again. Not yet. But some of the same signs are flashing again."
    },
    {
      "title": "Stellar [XLM] bulls exhausted after rally – Is a pullback nearby?",
      "link": "https://ambcrypto.com/stellar-xlm-bulls-exhausted-after-rally-is-a-pullback-nearby/",
      "summary": "<img alt=\"Stellar [XLM] bulls exhausted after rally - Is a pullback nearby?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/XLM-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The prime suspect for the next demand zone was the highs set in February at $0.364."
    },
    {
      "title": "dogwifhat jumps 10%, crosses $1B market cap: Are more gains coming?",
      "link": "https://ambcrypto.com/dogwifhat-jumps-10-crosses-1b-market-cap-are-more-gains-coming/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-14T151931.550_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />dogwifhat cracks key resistance—Are traders bracing for a memecoin moonshot?"
    },
    {
      "title": "Popcat’s $100 mln volume spike and whale buy-up: Is $0.45 near?",
      "link": "https://ambcrypto.com/popcats-100-mln-volume-spike-and-whale-buy-up-is-0-45-near/",
      "summary": "<img alt=\"Popcat&#039;s $100 mln volume spike and whale buy-up: Is $0.45 near?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-44.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Popcat jumps 12.89% to $0.41 as whales add 1.21 million tokens while retailers exit, raising correction risks."
    },
    {
      "title": "Will JASMY break THIS key resistance? Watch out for 2 major signs!",
      "link": "https://ambcrypto.com/will-jasmy-break-this-key-resistance-watch-out-for-2-major-signs/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250714_131711_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />JASMY is up big! But price just hit resistance. Will momentum, derivatives and on-chain data help break it?"
    }
  ]
}