{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Could 3AC and Terraform be Blamed for Singapore's Crackdown on Offshore Crypto Firms?",
      "link": "https://www.coindesk.com/markets/2025/06/12/asia-morning-briefing-could-3ac-and-terraform-be-blamed-for-singapores-crackdown-on-offshore-crypto-firms",
      "summary": ""
    },
    {
      "title": "Bitcoin 'Skew' Slides as Oil Prices Surge 6% on Israel-Iran Tensions",
      "link": "https://www.coindesk.com/markets/2025/06/13/bitcoin-skew-slides-as-oil-prices-surges-6-on-israel-iran-tensions",
      "summary": ""
    },
    {
      "title": "Bitcoin Tumbles Below $104K as Israel Strikes Iran",
      "link": "https://www.coindesk.com/markets/2025/06/12/btc-trading-under-104k-as-israel-appears-to-strike-iran",
      "summary": ""
    },
    {
      "title": "Ethereum Treasury Firm SharpLink Gaming Plunges 70% – But There May Be a Twist",
      "link": "https://www.coindesk.com/markets/2025/06/12/ethereum-treasury-firm-sharplink-gaming-plunges-70-but-there-may-be-a-twist",
      "summary": ""
    },
    {
      "title": "Crypto Cracks Late in Day, Bitcoin Slumps Below $106K",
      "link": "https://www.coindesk.com/markets/2025/06/12/crypto-cracks-late-in-day-bitcoin-slumps-below-106k",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "SEC axes Biden-era proposed crypto rules in flurry of repeals",
      "link": "https://cointelegraph.com/news/sec-axes-biden-era-proposed-rules-on-crypto-in-flurry-of-repeals?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY3MmItMWI5ZC03ZGFiLWI2MGUtYTMxNzUwZjg4YjA3.jpg\" /></p><p>The SEC has withdrawn over a dozen rules the agency proposed under Joe Biden, including two crypto-related rules targeting DeFi and digital asset custody.</p>"
    },
    {
      "title": "CFTC’s Pham says it won’t give ‘easy street’ to anybody, crypto included",
      "link": "https://cointelegraph.com/news/cftc-caroline-pham-not-going-easy-on-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDYyYjktYWRlYS03MjU1LWE0ZjEtNTZhMDViZDlmNGUx.jpg\" /></p><p>CFTC acting chair Caroline Pham says the agency won't ease up on crypto just because the Trump administration has pledged to support the industry.</p>"
    },
    {
      "title": "Sharplink Gaming drops 73% amid looming $1B Ethereum buy",
      "link": "https://cointelegraph.com/news/sharplink-gaming-shares-plunge-ether-buy-looms?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY2OWItOGI1MS03N2EwLTk0YzgtMTA0NzNhZDI1ZDQ0.jpg\" /></p><p>A crypto executive says if Sharplink Gaming were to announce its planned mega-Ether buy tomorrow, it could “light the match to reignite the stock.”</p>"
    },
    {
      "title": "Australia bans financial adviser for 10 years for $9.6M crypto scam",
      "link": "https://cointelegraph.com/news/australia-ten-year-ban-financial-adviser-crypto-scam?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5MzkwMTktYWE2Yi03OWFjLWIxZjMtMzc0ZDQ0MmY5ZTdh.jpg\" /></p><p>Australia’s financial regulator alleges Glenda Maree Rogan told clients they were investing in a high-yield fixed-interest account but sent their funds to a crypto exchange listed as a scam.</p>"
    },
    {
      "title": "Tencent explores purchase of Nexon gaming company",
      "link": "https://cointelegraph.com/news/tencent-purchase-nexon-gaming-company?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY2MzAtMzYzMi03M2VkLTg5MGMtMjE5NDI5NmUzN2Mx.jpg\" /></p><p>Talks of a potential acquisition follow renewed interest in Nexon's massively multiplayer online role-playing game series MapleStory.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin liquidity moves to non-KYC exchanges as US reserves thin",
      "link": "https://cryptoslate.com/bitcoin-liquidity-moves-to-non-kyc-exchanges-as-us-reserves-thin/",
      "summary": "<p>During Bitcoin&#8217;s climb to a new ATH above $111,000 in late May, a silent but measurable reshuffling has occurred in the market: more BTC is now held on offshore exchanges than on regulated platforms in the US, and volumes are steadily leaking from KYC-compliant venues. Data from CryptoQuant shows that the market embraced institutional inflows [&#8230;]</p> <p>"
    },
    {
      "title": "$USD1 Stablecoin Begins Minting on TRON",
      "link": "https://cryptoslate.com/usd1-stablecoin-begins-minting-on-tron/",
      "summary": "<p>Geneva, Switzerland, June 12, 2025 – TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet through blockchain technology and decentralized applications (dApps), has announced the first minting of the USD1 stablecoin on the TRON blockchain. Released by World Liberty Financial., the developer of a pioneering DeFi protocol and governance platform inspired [&#8230;]</p> <p>"
    },
    {
      "title": "Neo Pepe Coin Ultimate Guide – Community DAO Token Highlights",
      "link": "https://cryptoslate.com/neo-pepe-coin-ultimate-guide-community-dao-token-highlights/",
      "summary": "<p>Unveil the Secret to Decentralized Crypto with Neo Pepe Welcome to the Neo Pepe revolution, where memes meet cutting-edge cryptocurrency! Neo Pepe ($NEOP) isn’t just a coin; it’s a movement, a rallying cry for decentralization, and the hottest ticket in town for crypto enthusiasts (and yes, meme lovers too). Want to learn how Neo Pepe [&#8230;]</p> <p>"
    },
    {
      "title": "SEC, Ripple seek to end multi-year legal dispute with amended filing",
      "link": "https://cryptoslate.com/sec-ripple-seek-to-end-multi-year-legal-dispute-with-amended-filing/",
      "summary": "<p>Ripple and the U.S. Securities and Exchange Commission have refiled a joint request asking a federal judge to dissolve a court-imposed injunction and approve a revised $50 million penalty settlement, aiming to conclude their years-long legal battle. According to a June 12 court filing, the SEC and Ripple asked Judge Analisa Torres of the Southern [&#8230;]</p> <p>"
    },
    {
      "title": "Shopify to enable USDC payments via Base across its Checkout ecosystem",
      "link": "https://cryptoslate.com/shopify-to-enable-usdc-payments-via-base-across-its-checkout-ecosystem/",
      "summary": "<p>Shopify is rolling out support for USDC payments, allowing consumers to pay with stablecoins via Shopify Payments and Shop Pay. The feature, developed in partnership with Coinbase and launching on the exchange&#8217;s Base blockchain, is available in early access starting this week and will expand to more merchants over the coming months. New payment rails [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Breakout Imminent? Broadening Wedge Hints At $4,200 Surge",
      "link": "https://www.newsbtc.com/ethereum-news/ethereum-breakout-imminent-broadening-wedge-hints-at-4200-surge/",
      "summary": "According to recent technical analysis, Ethereum (ETH) may be gearing up for a major breakout that could propel the cryptocurrency close to the $4,200 mark. Meanwhile, ETH continues to attract growing institutional interest, with Ethereum exchange-traded funds (ETFs) outperforming their Bitcoin (BTC) counterparts. Ethereum Headed For A Breakout? In a recent X post, noted crypto analyst Titan of Crypto highlighted that ETH is climbing within a massive weekly broadening wedge structure. The analyst shared the following chart and suggested that ETH could be targeting the $4,200 level &#8211; marking the top of the wedge. For the uninitiated, a broadening wedge is a chart pattern characterized by diverging trendlines, where price makes higher highs and lower lows, forming a megaphone-like shape. It typically indicates increasing market volatility and can signal a potential breakout, with the direction depending on the prevailing trend and breakout confirmation. Related Reading: Ethereum Gains Momentum Amid Flat Funding Rates – Is This A Healthy Uptrend? Fellow crypto analyst Master of Crypto echoed a similar outlook, stating that ETH is “setting up for a big move,” especially with over $2.2 billion in short positions clustered near the $3,000 level. If Ethereum breaks above $3,000, it could trigger a short squeeze, potentially accelerating ETH’s rally. At the time of writing, ETH is trading 43.7% below its all-time high (ATH) of $4,878, recorded in November 2021. Capital flows also indicate rising institutional interest in Ethereum. Crypto market commentator Ted Pillows recently pointed out that spot ETH ETFs attracted $240.3 million in inflows yesterday, compared to $164.6 million for spot BTC ETFs. The stronger performance of ETH ETFs suggests that capital may be rotating from Bitcoin to Ethereum. It’s worth noting that while BTC is up 54% since June 2024, ETH is still down 24.6% during the same period. Crypto trader Merlijn the Trader shared the following monthly BTC/ETH chart showing two consecutive red candles, signaling a potential shift in momentum as BTC weakens relative to ETH. The trader noted that a similar capital rotation in 2020 preceded a “monster altseason.” Things Look Positive For ETH While altcoins like Solana (SOL), Tron (TRX), and SUI created fresh ATHs in 2024, ETH’s performance did not live up to expectations. As a result, the broader sentiment in the Etheruem ecosystem took a hit. Related Reading: Ethereum ‘Insanely Undervalued’ As Accumulation Addresses Keep Stacking – Is A Rally Imminent? However, 2025 appears to be ushering in a more favorable outlook. On-chain data reveals that ETH faces no major resistance until the $3,417 level. Additionally, ETH recently flashed a golden cross on the daily chart &#8211; a bullish technical signal that could indicate an impending rally. At press time, ETH trades at $2,756, down 1.7% in the past 24 hours. Featured image from with Unsplash, charts from X and TradingView.com"
    },
    {
      "title": "Bitcoin Funding Rate Flips Again And History Says A Rally Is Around The Corner",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-funding-rate-flips-again-and-history-says-a-rally-is-around-the-corner/",
      "summary": "Bitcoin’s price has declined slightly following recent gains, falling 2.3% over the past 24 hours to trade at approximately $107,205. This latest movement places the asset 4.1% below its all-time high of over $111,000 recorded last month. Despite the short-term dip, some analysts see familiar signs in derivatives data that could point to the next phase of market movement. Related Reading: Why Bitcoin’s Calm Rally Could Be a Setup for a Massive Breakout, Analyst Reveals Funding Rate Rebounds Signal Potential Upside for Bitcoin According to recent insights shared by on-chain analyst &#8220;nino&#8221; on CryptoQuant’s QuickTake platform, Bitcoin may be repeating a funding rate pattern that has historically led to price rebounds. The data shows the asset’s funding rate briefly dipping into negative territory before beginning to reverse, a pattern that has aligned with price recoveries earlier in the year. Nino’s analysis suggests this reversal, particularly the 72-hour moving averages exiting the oversold zone and producing a yellow-blue-black signal formation, could indicate a potential round of short position liquidations. The funding rate, still below levels typically associated with excessive bullish sentiment, may also imply that traders have yet to become overconfident, leaving room for additional upside without immediate overheating in derivatives markets. Nino’s observation focuses on market structure and derivative sentiment, highlighting how positioning in perpetual futures markets could precede notable spot price moves. In particular, when funding rates turn negative and then begin to climb, they often reflect the unwinding of overly bearish bets by traders who shorted BTC at high leverage. As these traders are forced to close positions, the resulting buy pressure can act as a short-term catalyst. This setup has played out multiple times earlier in 2025, and the current conditions suggest it may be occurring again. By keeping track of moving averages and sentiment zones, traders may interpret these signals as part of a broader cyclical trend. Binance Volume Share Signals Key Trends in Market Liquidity Separately, another analyst from CryptoQuant, Burak Kesmeci, addressed structural shifts in spot trading liquidity, particularly Binance’s share of global trading volume. Kesmeci emphasized that Binance’s dominance remains an important barometer of institutional participation and overall market health. He explained that an increase in Binance’s spot volume share is often associated with higher liquidity and smoother price discovery. Conversely, if Binance were to fall below a 30% volume threshold, it could signal a move toward more &#8220;fragmented liquidity&#8221; across exchanges such as Coinbase or Upbit. Such shifts could lead to more volatility and less predictable trading behavior. Related Reading: Bitcoin Options Traders Expect Quiet—But On-Chain Data Suggests Chaos At present, Binance’s volume share is showing signs of recovery, suggesting that capital is still flowing through the exchange and supporting a relatively stable trading environment. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Tron Has Plenty Of Room For A 2025 Bull Run, Risk Metric Signals",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-plenty-room-2025-bull-run-risk-metric-signals/",
      "summary": "The Tron (TRX) Sharpe Ratio suggests the cryptocurrency&#8217;s price may be far from overheating, a sign that the coin could have more upside potential. Tron Sharpe Ratio Is Still Significantly Below Overheating Zone In a CryptoQuant Quicktake post, an analyst has talked about the latest trend in the Sharpe Ratio of Tron. The &#8220;Sharpe Ratio&#8221; refers to an indicator that compares the returns of an asset against the risk associated with it. The numerator in the ratio, the &#8216;returns&#8217; portion, is defined as the difference between the average return of the coin and the risk-free return (that is, the theoretical return involved with an asset carrying zero risk) over a given period. The denominator, the &#8216;risk&#8217; part, is the asset&#8217;s standard deviation of returns over the same window (in other words, its volatility). Related Reading: Bitcoin Options Traders Expect Quiet—But On-Chain Data Suggests Chaos When the value of this metric is greater than 1, it means the cryptocurrency is printing returns that outweigh its risk. On the other hand, it being under the threshold suggests the asset&#8217;s performance has been lackluster compared to its volatility. Now, here is a chart that shows the trend in the Tron Sharpe Ratio over the last few years: As displayed in the above graph, the Tron Sharpe Ratio fell below the 1 level earlier, but its value has since returned above the mark. According to the quant, the metric being above the level has historically accompanied bullish price action. An extremely high value, however, has proven to be an overheating signal, with the asset tending to arrive at a top. &#8220;Whenever the Adjusted Sharpe Ratio climbs above 40, it often signals a market that&#8217;s overheating,&#8221; explains the analyst. &#8220;In the past, readings over 40 have lined up well with local tops.&#8221; So far since its return above 1, the Tron Sharpe Ratio has only managed to reach a high of 8.3, which is clearly significantly below this cutoff. This trend could mean that TRX hasn&#8217;t been too overheated. &#8220;With TRX’s Sharpe Ratio still far from historical peaks, the data suggests there&#8217;s plenty of upside room for a potential bull run in 2025,&#8221; says the quant. It now remains to be seen how the coin will develop in the near future, given this pattern. Related Reading: Ethereum To $3,400? On-Chain Shows No Big Hurdles Ahead In some other news, the Tron network set a new record in USDT transaction volume last month, as CryptoQuant community analyst Maartunn has pointed out in an X post. In total, the month of May saw over $694 billion in USDT transaction volume on the Tron network. Around $411 billion of these transfers were of a size that&#8217;s generally associated with the whales. TRX Price At the time of writing, Tron is trading around $0.272, down 1% in the last week. Featured image from iStock.com, CryptoQuant.com, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Nosedives—Profit-Taking Sparks Sudden Correction",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-nosedives-profit-taking-sparks-sudden-correction/",
      "summary": "Bitcoin price started a fresh decline below the $105,500 zone. BTC is now consolidating and struggling to stay above the $103,200 support. Bitcoin started a fresh decline below the $106,500 and $105,500 levels. The price is trading below $106,500 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance at $106,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh recovery wave if it clears the $105,500 resistance zone. Bitcoin Price Dips Sharply Bitcoin price started a fresh decline after it failed to clear the $110,500 resistance zone. BTC declined below the $107,500 and $106,500 support levels. The price even dipped below the $104,200 support level. Finally, it tested the $103,000 zone. A low was formed at $103,078 and the price is now consolidating losses below the 23.6% Fib level of the recent decline from the $110,273 swing high to the $103,078 low. Bitcoin is now trading below $105,500 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance at $106,600 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $104,200 level. The first key resistance is near the $105,500 level. The next key resistance could be $106,600 and the 50% Fib retracement level of the recent decline from the $110,273 swing high to the $103,078 low. A close above the $106,600 resistance might send the price further higher. In the stated case, the price could rise and test the $108,000 resistance level. Any more gains might send the price toward the $110,000 level. More Losses In BTC? If Bitcoin fails to rise above the $105,500 resistance zone, it could start another decline. Immediate support is near the $103,000 level. The first major support is near the $102,350 level. The next support is now near the $101,500 zone. Any more losses might send the price toward the $100,500 support in the near term. The main support sits at $100,000, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $103,000, followed by $102,350. Major Resistance Levels – $104,200 and $105,500."
    },
    {
      "title": "UNI Flashes Strength After Breaking Past Key Resistance Levels, What’s Next?",
      "link": "https://www.newsbtc.com/analysis/uni/uni-flashes-upside-strength/",
      "summary": "In a recent update shared by Crypto Man MAB on X, UNI’s price action has taken a bullish turn. The token is currently trading at $8.403, up 1.82% (+$0.150), and has managed to break past the previous resistance range of $ 7.50–$ 8.00. This upward movement signals growing buying interest, and that momentum could be building for a stronger push ahead. Key Support And Resistance Levels Define UNI’s Next Move In his analysis, Crypto Man MAB highlighted UNI&#8217;s evolving price structure, pointing to key support and resistance levels. The immediate support is seen around $7.103, which marks the 24-hour low. If UNI pulls back further, stronger support may be found near $6.500, a level that has previously attracted buying interest and could act as a safety net for bulls. Related Reading: Uniswap (UNI) Blastoff At Hand? The Sleeping Giant Awakens At $4.6 Support On the upside, resistance stands near $8.677, the recent 24-hour high. This zone is currently capping the rally, but if buying momentum persists, UNI could target the $9.0 mark next. While this level presents a psychological barrier, it also aligns with short-term bullish projections, adding more weight to its significance. In terms of market activity, Crypto Man MAB noted a notable increase in trading volume, which aligns with UNI’s recent price surge. This volume spike suggests that buyers are stepping in with strong conviction, reinforcing the strength behind the upward movement. A sustained high volume typically validates price action, which supports the argument for a potential rally continuation, provided the momentum holds and no major resistance halts the trend. Breakout Signals Strength, But Long-Term Caution Lingers According to the analyst, the UNI chart shows a shift from a period of consolidation into a noticeable upward breakout. The recent dominance of green candlesticks points to growing bullish moves and renewed buying pressure in the short term. Related Reading: Uniswap Stays On Course For More Gains – $12.3 Resistance In Sight However, the longer-term trend suggests a more cautious outlook. Over the last 180 days, UNI has declined by 53.31%, and its one-year performance shows a decrease of 18.98%, indicating that the asset has been in an overall downtrend despite recent gains. Presently, the Simple Moving Average (SMA) is demonstrating increased trading activity, which aligns with the positive price movement and supports the current bullish sentiment. This rise in volume may strengthen the case for a possible continuation of the ongoing upward trend, but traders should remain alert to any shifts in momentum. In conclusion, Crypto Man MAB noted that UNI is showing short-term upward strength, but the broader trend remains uncertain. However, a clear breakout above the $8.677 resistance level would be a strong signal for continued upside. Featured image from Medium, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Will Replace Gold And Go To $1,000,000, Says Galaxy Digital CEO Mike Novogratz",
      "link": "https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Will-Replace-Gold-And-Go-To-1000000-Says-Galaxy-Digital-CEO-Mike-Novogratz.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz\" rel=\"nofollow\"> </a></p> <p>Mike Novogratz, in an interview with CNBC, said “there have been more Bitcoins lost than will be mined for the rest of eternity.\"</p> <p>"
    },
    {
      "title": "Coinbase Announces Bitcoin Rewards Credit Card, Offering up to 4% BTC Back on Everything",
      "link": "https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-BTC-Credit-Card.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything\" rel=\"nofollow\"> </a></p> <p>Coinbase is launching its first-ever branded credit card in partnership with American Express, set to roll out this fall. Called the Coinbase One Card, it will be available only to U.S. members of Coinbase One, the platform’s monthly subscription service. The card will offer 2% to 4% back in Bitcoin on everyday purchases, along with [&#8230;]</p> <p>"
    },
    {
      "title": "France’s The Blockchain Group Secures €9.7 Million More For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Frances-The-Blockchain-Group-Secures-E9.7-Million-More-For-Its-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Adam Back, TOBAM and Ludovic Chechin-Laurans back ALTBG with €9.7 million in equity and convertible bonds.</p> <p>"
    },
    {
      "title": "Bitcoin: How To Solve the Student Loan Crisis",
      "link": "https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/studentdebt.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis\" rel=\"nofollow\"> </a></p> <p>Students are already taking out mortgage-sized loans for college. The financial jiu-jitsu of pairing bitcoin with student loans can fix the student debt crisis.</p> <p>"
    },
    {
      "title": "Passport Prime: A New Security Device For a New Generation",
      "link": "https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Passport-Prime-A-New-Security-Device-For-a-New-Generation.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation\" rel=\"nofollow\"> </a></p> <p>Passport Prime from Foundation Devices gears up for a Q3 2025 release, offering NFC, 2FA, and a sleek design to boost Bitcoin security.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Ripple, SEC Ask Court to Dissolve XRP Injunction, Release $125M in Escrow",
      "link": "https://decrypt.co/325015/ripple-sec-ask-court-to-dissolve-xrp-injunction-release-125m-in-escrow",
      "summary": "The joint filing proposes a $50 million payment to the SEC and marks a key step toward settling the years-long legal battle over XRP sales."
    },
    {
      "title": "Former NBA Star Shaquille O'Neal Agrees to Pay $1.8M to Settle FTX Suit",
      "link": "https://decrypt.co/325012/former-nba-star-shaquille-oneal-settle-ftx-suit",
      "summary": "The agreement marks one of the first major financial settlements against celebrities who promoted FTX before its spectacular collapse."
    },
    {
      "title": "SEC Adds Dogecoin, Hedera ETFs to Growing List of Delayed Decisions",
      "link": "https://decrypt.co/324998/sec-dogecoin-hedera-etfs-growing-list-delayed-decisions",
      "summary": "The SEC has delayed decisions on crypto ETF proposals, including Dogecoin and HBAR, while seeking further public input."
    },
    {
      "title": "Big Brains, Tiny Models: Spain’s Multiverse Computing Bags $215M to Shrink AI for Smartphones",
      "link": "https://decrypt.co/324914/spains-multiverse-bags-215m-shrink-ai-smartphones",
      "summary": "Multiverse Computing claims its quantum-inspired compression tech can get large AI models like Llama-2 to fit on a smartphone."
    },
    {
      "title": "Bitcoin Dips as Israel Launches Airstrikes on Iran",
      "link": "https://decrypt.co/324979/bitcoin-drops-israel-launches-airstrikes-iran",
      "summary": "Bitcoin fell sharply late Thursday after Israel launched strikes on Iran, rattling global markets and sparking a flight from risk assets."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin slides, gold spikes after Israel strikes Iran, Israeli PM warns campaign will last as many days as needed",
      "link": "https://cryptobriefing.com/crypto-market-volatility-israel-iran/",
      "summary": "<p>Geopolitical tensions may drive investors to traditional safe-haven assets, impacting cryptocurrency markets and regional economic stability.</p> <p>"
    },
    {
      "title": "$USD1 stablecoin begins minting on TRON",
      "link": "https://cryptobriefing.com/usd1-stablecoin-minting-on-tron/",
      "summary": "<p>The minting of USD1 on TRON could enhance institutional trust and adoption, bolstering TRON's position in the global blockchain market.</p> <p>"
    },
    {
      "title": "Trump says Fed can raise rates if inflation returns, but warns Powell will be “too late for that too”",
      "link": "https://cryptobriefing.com/trump-fed-interest-rates-inflation/",
      "summary": "<p>Trump's remarks highlight ongoing tensions with the Fed, potentially impacting future monetary policy decisions and economic stability.</p> <p>"
    },
    {
      "title": "Circle brings USDC to Ripple’s network as XRP Ledger gears up for EVM-compatible sidechain this quarter",
      "link": "https://cryptobriefing.com/usdc-on-xrp-ledger-evm-sidechain/",
      "summary": "<p>The integration of USDC on XRPL and the upcoming EVM sidechain could significantly enhance XRPL's utility and attract diverse blockchain projects.</p> <p>"
    },
    {
      "title": "BlackRock targets to become world’s largest crypto asset manager by 2030",
      "link": "https://cryptobriefing.com/blackrock-crypto-asset-management/",
      "summary": "<p>BlackRock's crypto ambitions could reshape global financial markets, influencing regulatory landscapes and accelerating digital asset adoption.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Dremes to Give Away a Lamborghini in Wild New Crypto Game Campaign",
      "link": "https://ambcrypto.com/dremes-to-give-away-a-lamborghini-in-wild-new-crypto-game-campaign/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"661\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-13-101608.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"882\" />Dremes, the pseudonymous team behind Coqnet Bonanza and Coqnet, has launched a new on-chain campaign: [&#8230;]"
    },
    {
      "title": "Hyperliquid faces short-term dip, but why HYPE’s bull run will continue",
      "link": "https://ambcrypto.com/hyperliquid-faces-short-term-dip-but-why-hypes-bull-run-will-continue/",
      "summary": "<img alt=\"Hyperliquid faces short-term dip, but why HYPE&#039;s bull run will continue\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/HYPE-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The dip in trading volume alongside the momentum divergence underlined the possibility of a price dip."
    },
    {
      "title": "Bitcoin’s next rally might be boring, but it’s definitely bullish!",
      "link": "https://ambcrypto.com/bitcoins-next-rally-might-be-boring-but-its-definitely-bullish/",
      "summary": "<img alt=\"Bitcoin&#039;s next rally might be boring, but it&#039;s definitely bullish!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-19.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BTC outflows and long-term holder accumulation point to reduced sell pressure."
    },
    {
      "title": "Chainlink eyes $14.25 support as LINK fights on 2 fronts",
      "link": "https://ambcrypto.com/chainlink-eyes-14-25-support-as-link-fights-on-2-fronts/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-12T161233.694_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />LINK rallies, then stumbles...Are bears preparing to crush hopes of a breakout?"
    },
    {
      "title": "Health tech to Bitcoin bet: H100 stock soars 45% after bold crypto move",
      "link": "https://ambcrypto.com/health-tech-to-bitcoin-bet-h100-stock-soars-45-after-bold-crypto-move/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"929\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/H100-Stock-Soars-45.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1651\" />Is Bitcoin becoming the new backbone for innovation in the health and wellness space?"
    }
  ]
}