{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Risk of Escalating Israel-Iran Conflict Keeps BTC Around 105K Says QCP",
      "link": "https://www.coindesk.com/markets/2025/06/15/asia-morning-briefing-risk-of-escalating-israel-iran-conflict-keeps-btc-around-105k-says-qcp",
      "summary": ""
    },
    {
      "title": "ETH Holds Strong; Is It the ‘Digital Oil’ Powering the Global Digital Economy?",
      "link": "https://www.coindesk.com/markets/2025/06/15/eth-holds-strong-is-it-the-digital-oil-powering-the-global-digital-economy",
      "summary": ""
    },
    {
      "title": "Chart of the Week: Bitcoin's Summer Lull Still Offers 'Inexpensive' Trading Opportunity",
      "link": "https://www.coindesk.com/markets/2025/06/15/chart-of-the-week-bitcoin-s-summer-lull-still-offers-inexpensive-trading-opportunity",
      "summary": ""
    },
    {
      "title": "Shiba Inu Price Sell-Off Continues as SHIB Burn Rate Skyrockets to 112,000%",
      "link": "https://www.coindesk.com/markets/2025/06/15/shiba-inu-price-sell-off-continues-as-shib-burn-rate-skyrockets-to-112-000",
      "summary": ""
    },
    {
      "title": "Owning One Bitcoin Is the New American Dream, Says Bitwise Portfolio Manager",
      "link": "https://www.coindesk.com/markets/2025/06/15/owning-one-bitcoin-is-the-new-american-dream-says-bitwise-portfolio-manager",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Metaplanet’s Bitcoin holdings hits 10,000 BTC, beating Coinbase",
      "link": "https://cointelegraph.com/news/metaplanet-bitcoin-holdings-hits-10000-btc-beating-coinbase?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGYxMDQtYjM4Yi03ZGQxLThiNTktYjk3ZjQxMjJlNjlh.jpg\" /></p><p>Metaplanet’s stock surged over 20% after announcing its latest Bitcoin buy and a $210 million bond issuance to buy even more.</p>"
    },
    {
      "title": "Bitcoin buying firms must weigh quitting as risks emerge: VanEck",
      "link": "https://cointelegraph.com/news/bitcoin-buying-firms-weigh-stopping-risks-emerge-vaneck?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzQ2OWEtNDhiNi03ZDQ5LWFlMjktM2JlM2M2ZTU2N2Nl.jpg\" /></p><p>Bitcoin-buying public companies should be ready to cancel more buys if the value of their holdings eclipses their market cap, says VanEck crypto researcher Matthew Sigel.</p>"
    },
    {
      "title": "Crypto user loses $6.9M to a cold wallet from China’s TikTok",
      "link": "https://cointelegraph.com/news/crypto-investor-loses-6m-douyin-cold-wallet-scam?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzc2YmItYjc0OC03OGY4LWJkMzEtM2VlNzUzNWYzNjAz.jpg\" /></p><p>SlowMist’s chief information security officer said it’s important not to “gamble your entire fortune on a wallet that’s a few hundred bucks cheaper.”</p>"
    },
    {
      "title": "Bitcoin closer to equities than gold as Middle East war deepens",
      "link": "https://cointelegraph.com/news/gold-reaches-near-all-time-high-is-bitcoin-follow?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzM0OGYtMzM1ZS03NWJjLTlmY2YtNjBlNDMyMWFmODkz.jpg\" /></p><p>Gold brushed its all-time highs amid Middle East tensions, while analysts say BTC still trades more like a risk asset than a safe haven.</p>"
    },
    {
      "title": "Bybit targets Q3 launch of new Solana-based DEX Byreal",
      "link": "https://cointelegraph.com/news/bybit-launch-advanced-solana-based-dex-byreal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzc2N2ItOTkxYy03ZjVmLWE0NTMtNGVkYWU5NWUzMTJj.jpg\" /></p><p>Crypto exchange Bybit is launching Byreal, a hybrid decentralized exchange on Solana that combines centralized exchange liquidity with DeFi transparency.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Stablecoins are the ‘highest utility form of money,’ but industry is yet to reach ‘iPhone moment’: Circle CEO",
      "link": "https://cryptoslate.com/stablecoins-are-the-highest-utility-form-of-money-but-industry-is-yet-to-reach-iphone-moment-circle-ceo/",
      "summary": "<p>Jeremy Allaire, founder and CEO of Circle, the USD Coin (USDC) issuer that went public this month, called stablecoins the “highest utility form of money ever created” in an X post on June 15. He added, however, that the stablecoin industry is yet to experience a significant disruption. Programmability of stablecoins will usher in change [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase’s sponsorship of Trump’s military parade sparks debate over crypto’s anti-establishment roots",
      "link": "https://cryptoslate.com/coinbases-sponsorship-of-trumps-parade-sparks-debate-over-cryptos-anti-establishment-roots/",
      "summary": "<p>Coinbase’s sponsorship of the military parade in Washington, D.C., on June 14 has sparked a debate about whether crypto has lost sight of its original ethos. The parade, which was held to commemorate the U.S. Army’s 250th birthday, took place amid the country-wide ‘No Kings’ protests. The protestors voiced their opposition to President Donald Trump’s [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum at a crossroads: SSV founder Alon Muroch on the ‘dangerous’ divergence affecting crypto’s number 2 coin",
      "link": "https://cryptoslate.com/ethereum-at-a-crossroads-ssv-founder-alon-muroch-on-the-dangerous-divergence-affecting-cryptos-number-2-coin/",
      "summary": "<p>Welcome to Slate Sundays, ’s new weekly feature showcasing in-depth interviews, expert analysis, and thought-provoking op-eds that go beyond the headlines to explore the ideas and voices shaping the future of crypto. Alon Muroch is a man on a mission. As the founder of SSV Labs, which contributes to the second-largest Ethereum staking infra provider, SSV [&#8230;]</p> <p>"
    },
    {
      "title": "Data sovereignty can redefine the global economic markets",
      "link": "https://cryptoslate.com/data-sovereignty-can-redefine-the-global-economic-markets/",
      "summary": "<p>The following is a guest post and analysis from Trevor Koverko, Co-Founder at Sapien. The emergence of internet-enabled tech has transformed global trade and economics, as citizens, governments, and companies participate in borderless exchanges. Subsequently, data has become the lifeblood and primary fuel of businesses and societies worldwide, driving economic growth through shared values. In [&#8230;]</p> <p>"
    },
    {
      "title": "Taiwan tightens semiconductor export controls on Huawei and SMIC amid US-China tech rivalry",
      "link": "https://cryptoslate.com/taiwan-tightens-semiconductor-export-controls-on-huawei-and-smic-amid-us-china-tech-rivalry/",
      "summary": "<p>Taiwan has intensified its technology export controls by blacklisting two of China’s foremost semiconductor companies, Huawei Technologies and Semiconductor Manufacturing International Corp (SMIC), amid escalating tensions in the global tech sector. The updated Strategic High-Tech Commodities Entity List, released by Taiwan’s Ministry of Economic Affairs, now includes both firms along with several of their subsidiaries, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Dogecoin (DOGE) Slips Once More—Bears Tighten Grip on Meme Coin Darling",
      "link": "https://www.newsbtc.com/analysis/doge/dogecoin-doge-slips-0-20/",
      "summary": "Dogecoin started a fresh decline from the $0.1880 zone against the US Dollar. DOGE is now consolidating losses and might recover if it clears $0.1780. DOGE price started a fresh decline below the $0.1880 and $0.180 levels. The price is trading below the $0.180 level and the 100-hourly simple moving average. There is a short-term bearish trend line forming with resistance at $0.1760 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could start a fresh decline if it declines below the $0.180 zone. Dogecoin Price Dips Again Dogecoin price started a fresh decline after it failed to clear the $0.1880 zone, like Bitcoin and Ethereum. DOGE declined below the $0.1800 and $0.1750 levels. The bears even pushed the price below the $0.1720 level. A low was formed at $0.1695 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $0.2064 swing high to the $0.1697 low. Dogecoin price is now trading below the $0.180 level and the 100-hourly simple moving average. There is also a short-term bearish trend line forming with resistance at $0.1760 on the hourly chart of the DOGE/USD pair. Immediate resistance on the upside is near the $0.1760 level. The first major resistance for the bulls could be near the $0.1785 level. The next major resistance is near the $0.180 level. A close above the $0.180 resistance might send the price toward the $0.1880 resistance. It is close to the 50% Fib retracement level of the downward move from the $0.2064 swing high to the $0.1697 low. Any more gains might send the price toward the $0.200 level. The next major stop for the bulls might be $0.2120. More Losses In DOGE? If DOGE’s price fails to climb above the $0.180 level, it could start another decline. Initial support on the downside is near the $0.1720 level. The next major support is near the $0.1700 level. The main support sits at $0.1680. If there is a downside break below the $0.1680 support, the price could decline further. In the stated case, the price might decline toward the $0.1550 level or even $0.1525 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now losing momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1700 and $0.1680. Major Resistance Levels – $0.1760 and $0.1800."
    },
    {
      "title": "XRP Price Tries to Bounce Back—But Hurdles May Delay the Comeback",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-tries-to-bounce-back-2-150/",
      "summary": "XRP price started a fresh decline and tested the $2.080 zone. The price is now recovering and might aim for an upward move above the $2.20 resistance. XRP price started a decent upward move from the $2.080 zone. The price is now trading above $2.150 and the 100-hourly Simple Moving Average. There is a short-term rising channel forming with support at $2.140 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start another increase if it clears the $2.20 resistance zone. XRP Price Eyes Recovery XRP price declined below the $2.250 and $2.20 levels, like Bitcoin and Ethereum. The price even declined below the $2.120 zone and tested the $2.080 support. A low was formed at $2.085 and the price is now attempting to recover. There was a move above the $2.10 and $2.120 levels. The price climbed above the 23.6% Fib retracement level of the downward move from the $2.338 swing high to the $2.085 low. Besides, there is a short-term rising channel forming with support at $2.140 on the hourly chart of the XRP/USD pair. The price is now trading above $2.150 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.20 level. The first major resistance is near the $2.2120 level. It is close to the 50% Fib retracement level of the downward move from the $2.338 swing high to the $2.085 low. The next resistance is $2.250. A clear move above the $2.250 resistance might send the price toward the $2.320 resistance. Any more gains might send the price toward the $2.350 resistance or even $2.3650 in the near term. The next major hurdle for the bulls might be $2.420. Another Decline? If XRP fails to clear the $2.20 resistance zone, it could start another decline. Initial support on the downside is near the $2.140 level and the trend line. The next major support is near the $2.120 level. If there is a downside break and a close below the $2.120 level, the price might continue to decline toward the $2.080 support. The next major support sits near the $2.020 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.150 and $2.120. Major Resistance Levels – $2.20 and $2.2120."
    },
    {
      "title": "Ethereum Price Eyes Recovery—Can ETH Kick Off a Fresh Upside Move?",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-eyes-recovery-2620/",
      "summary": "Ethereum price started a fresh decline and tested the $2,450 zone. ETH is now correcting losses and might aim for a move above the $2,620 resistance. Ethereum started a fresh decline below the $2,750 level. The price is trading near $2,575 and the 100-hourly Simple Moving Average. There was a break above a contracting triangle with resistance at $2,550 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it clears the $2,620 zone in the near term. Ethereum Price Corrects Losses Ethereum price started a fresh decline below the $2,750 and $2,620 levels, like Bitcoin. ETH price even traded below the $2,500 level and tested $2,440. A low was formed at $2,441 and the price recently started a recovery wave. There was a move above the $2,500 and $2,520 levels. The price surpassed the 23.6% Fib retracement level of the downward move from the $2,880 swing high to the $2,441 low. Besides, there was a break above a contracting triangle with resistance at $2,550 on the hourly chart of ETH/USD. Ethereum price is now trading near $2,575 and the 100-hourly Simple Moving Average. On the upside, the price could face resistance near the $2,585 level. The next key resistance is near the $2,620 level. The first major resistance is near the $2,660 level. It is near the 50% Fib retracement level of the downward move from the $2,880 swing high to the $2,441 low. A clear move above the $2,660 resistance might send the price toward the $2,720 resistance. An upside break above the $2,720 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,800 resistance zone or even $2,880 in the near term. Another Decline In ETH? If Ethereum fails to clear the $2,620 resistance, it could start a fresh decline. Initial support on the downside is near the $2,540 level. The first major support sits near the $2,500 zone. A clear move below the $2,500 support might push the price toward the $2,440 support. Any more losses might send the price toward the $2,420 support level in the near term. The next key support sits at $2,350. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,500 Major Resistance Level – $2,620"
    },
    {
      "title": "Bitcoin Price Bounces Back: Bulls Eye New Upside Leg",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-bounces-back-106k/",
      "summary": "Bitcoin price started a fresh decline and tested the $103,200 zone. BTC is now recovering and might aim for a move above the $106,800 resistance. Bitcoin started a fresh decline below the $106,800 and $105,500 levels. The price is trading near $105,800 and the 100 hourly Simple moving average. There was a break above a key bearish trend line with resistance at $105,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it clears the $106,800 resistance zone. Bitcoin Price Recovers Bitcoin price started a fresh decline after it failed to clear the $110,000 resistance zone. BTC declined below the $107,000 and $106,000 support levels. The price even dipped below the $104,000 support level. Finally, it tested the $103,200 zone. A low was formed at $103,078 and the price is now recovering losses. There was a move above the 23.6% Fib retracement level of the recent decline from the $110,411 swing high to the $103,078 low. Besides, there was a break above a key bearish trend line with resistance at $105,000 on the hourly chart of the BTC/USD pair. Bitcoin is now trading near $105,800 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $106,000 level. The first key resistance is near the $106,750 level. It is close to the 50% Fib retracement level of the recent decline from the $110,411 swing high to the $103,078 low. The next key resistance could be $107,500. A close above the $107,500 resistance might send the price further higher. In the stated case, the price could rise and test the $108,000 resistance level. Any more gains might send the price toward the $110,000 level. Another Decline In BTC? If Bitcoin fails to rise above the $106,750 resistance zone, it could start another decline. Immediate support is near the $105,000 level. The first major support is near the $104,200 level. The next support is now near the $103,200 zone. Any more losses might send the price toward the $102,500 support in the near term. The main support sits at $100,000, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $104,200, followed by $103,200. Major Resistance Levels – $106,750 and $107,500."
    },
    {
      "title": "Shiba Inu Burn Explodes 3,194%: Can It Change The SHIB Price Trajectory?",
      "link": "https://www.newsbtc.com/altcoin/shiba-inu-burn-explodes-3194-can-it-change-the-shib-price-trajectory/",
      "summary": "Shiba Inu has seen a surge in burn activity, with the burn rate climbing by 3,194% in the last 24 hours. According to data from burn tracker Shibburn, over 521.6 million SHIB tokens were permanently removed from circulation during this period. This sudden and sharp rise in burn rate has raised optimism within the SHIB community, although the token&#8217;s price action is struggling with bullish sentiment. Large Transactions Dominate SHIB Burn Activity As shown by data from Shiba Inu&#8217;s burn tracking website Shibburn.com, the latest burn wave was dominated by a few large transactions. A notable contributor was the wallet address beginning with &#8220;0xdb6,&#8221; which alone facilitated burns totaling over 500 million SHIB across multiple transactions to the BA-1 burn address. One of its largest single burns reached 310,744,788 SHIB, followed closely by another 107,333,061 SHIB, and then another 103,276,575 SHIB. Related Reading: Billionaire Snaps Up $100 Million Of Trump Coin – Details Other wallets also participated, including &#8220;0x28be&#8221; and &#8220;0x6176,&#8221; with each sending SHIB tokens into various burn addresses such as CA and BA-2. These contributions, although not on the same scale as the primary whale wallet, collectively helped elevate the day’s total burn count to over 521 million SHIB. Together, these burn events reflect a push within the Shiba Inu community to increase SHIB burns, which had otherwise been short of noteworthy burns in recent weeks. Despite Burn Efforts, SHIB Supply Still Faces Uphill Battle Although 521 million SHIB tokens is a significant figure for a single day, it barely makes a dent in the meme token’s vast circulating supply, which currently sits above 589 trillion SHIB tokens. This context relays the challenge faced by the current Shiba Inu tokenomics. Despite periods of aggressive burns like the one witnessed in the past 24 hours, the token’s massive supply continues to weigh on its long-term price appreciation goals. However, the spike in burn rate is still a positive signal, particularly from a sentiment standpoint, especially now that the Shiba Inu price is struggling with sentiment. With SHIB currently trading within a tight range between $0.00001225 and $0.0000119, more Shib burns in the rest of the new week could bode well for its price action moving forward. As of the time of writing, Shiba Inu is trading at $0.00001192, down by 1.7% in the last 24 hours. Despite the massive uptick in burn activity, market response is somewhat muted. However, there may be more happening behind the scenes. Related Reading: $57 Million In Crypto And Counting: Trump’s World Liberty Connection A Shiba Inu community member recently posted on the social media platform X, hinting that the project’s lead developer, Shytoshi Kusama, still has “several aces up his sleeve” for the Shiba Inu community. Although no further details were shared, past developments like the launch of Shibarium have influenced price trends. Hopefully, any new announcements could reignite interest and drive the Shiba Inu price token to new highs. Featured image from Unsplash, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Layer 2: Statechains",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Statechains-fotor-20250613161023.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-statechains\" rel=\"nofollow\"> </a></p> <p>The second article in the Bitcoin Layer 2 series. This article covers Statechains, originally designed by Ruben Somsen, and implemented by CommerceBlock.</p> <p>"
    },
    {
      "title": "Pakistan’s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?",
      "link": "https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Pakistan-Bitcoin-Reserve.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/pakistans-strategic-bitcoin-reserve-a-step-toward-orange-pilling-a-nation\" rel=\"nofollow\">Pakistan&#8217;s Strategic Bitcoin Reserve: A Step Toward Orange-Pilling a Nation?</a></p> <p>A strategic Bitcoin reserve is a step in the right direction for Pakistan, but only mass adoption will truly unlock the immense potential Bitcoin can offer.</p> <p>"
    },
    {
      "title": "The 30,000-Foot View of the Oslo Freedom Forum",
      "link": "https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Oslo-Freedom-Forum.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/the-30000-foot-view-of-the-oslo-freedom-forum\" rel=\"nofollow\"> </a></p> <p>Stories of courage and repression, and the tools defending civil liberties at the 17th Annual Oslo Freedom Forum in Norway.</p> <p>"
    },
    {
      "title": "UK Gold Mining Company Bluebird to Convert Gold Revenues into Bitcoin",
      "link": "https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/UK-Gold-Mining-Company-Bluebird-to-Convert-Gold-Revenues-into-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/uk-gold-mining-company-bluebird-to-convert-gold-revenues-into-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bluebird Mining Ventures Ltd. will adopt bitcoin as a treasury reserve asset and convert future gold revenues into Bitcoin.</p> <p>"
    },
    {
      "title": "JPMorgan Reports Record Profits for Bitcoin Miners in Q1",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-MORGAN.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-reports-record-profits-for-bitcoin-miners-in-q1\" rel=\"nofollow\"> </a></p> <p>Bitcoin mining companies in the U.S. have kicked off 2025 with record performance, according to a recent report. The first quarter of the year was “one of Bitcoin miners&#8217; best quarters to date,” analysts Reginald Smith and Charles Pearce stated.&#160; &#8220;Four of the five operators in our coverage reported record revenue and profits,&#8221; the report [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Vietnam Passes Landmark Law Defining Digital Assets, Boosting AI and Chip Sectors",
      "link": "https://decrypt.co/325317/vietnam-passes-landmark-law-digital-assets",
      "summary": "Vietnam's National Assembly overwhelmingly approved landmark legislation Saturday, legalizing digital assets and establishing sweeping incentives for semiconductor manufacturing, artificial intelligence development, and digital technology startups. The Law on Digital Technology Industry passed with 441 votes in favor out of 445 lawmakers present, making Vietnam one of the first countries to comprehensively regulate digital assets through [&hellip;]"
    },
    {
      "title": "Trump Discloses $57M Windfall From Crypto Venture World Liberty Financial",
      "link": "https://decrypt.co/325314/trump-57m-windfall-crypto-venture-world-liberty-financial",
      "summary": "Trump has reported over $600 million in income from crypto, golf clubs, and licensing ventures in his latest federal financial disclosure."
    },
    {
      "title": "Digital Finance Reform Could Add Billions to Australia's Economy, New Research Shows",
      "link": "https://decrypt.co/325307/digital-finance-reform-billions-australia-new-research-shows",
      "summary": "Australia could unlock billions annually through digital finance innovation and tokenization, but key hurdles remain."
    },
    {
      "title": "Metaplanet Reaches 10,000 BTC Target Amid $210M Bond Issuance",
      "link": "https://decrypt.co/325302/metaplanet-reaches-10000-btc-target-amid-210m-bond-issuance",
      "summary": "Metaplanet is now aiming to acquire 210,000 BTC by 2027 equivalent to roughly 1% of Bitcoin’s total supply"
    },
    {
      "title": "This Week in Crypto Games: Dogecoin Got Game, FIFA Rivals Launches",
      "link": "https://decrypt.co/325277/this-week-crypto-games-dogecoin-gaming-fifa-rivals",
      "summary": "Dogecoin is about to get a slew of games via DogeOS and PlaysOut, FIFA Rivals is live on mobile, and more from the crypto gaming world."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Polyhedra Network’s ZKJ token crashes over 80% after Binance Alpha LPs reportedly pull liquidity",
      "link": "https://cryptobriefing.com/zkj-token-crash-after-liquidity-withdrawals/",
      "summary": "<p>The ZKJ token's crash highlights the vulnerability of crypto markets to liquidity shifts, impacting investor confidence and market stability.</p> <p>"
    },
    {
      "title": "Bybit to launch Byreal, its first onchain DEX on Solana, on June 30",
      "link": "https://cryptobriefing.com/byreal-on-solana-dex/",
      "summary": "<p>Bybit's launch of Byreal on Solana signifies a strategic shift towards hybrid finance, potentially reshaping the DeFi landscape.</p> <p>"
    },
    {
      "title": "Invesco, Galaxy Digital file to launch Solana ETF in Delaware amid SEC approval buzz",
      "link": "https://cryptobriefing.com/solana-etf-sec-approval/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional interest and investment in the Solana blockchain ecosystem.</p> <p>"
    },
    {
      "title": "Cardano founder Charles Hoskinson proposes converting $100M ADA to Bitcoin and stablecoins",
      "link": "https://cryptobriefing.com/cardano-treasury-conversion-proposal/",
      "summary": "<p>Hoskinson's proposal could enhance Cardano's DeFi competitiveness, potentially increasing its market share and attracting more developers.</p> <p>"
    },
    {
      "title": "Amazon, Walmart, and Expedia consider issuing stablecoins to sidestep costly card fees: WSJ",
      "link": "https://cryptobriefing.com/retailers-embrace-stablecoins/",
      "summary": "<p>Retailers' stablecoin adoption could revolutionize payment systems, enhance cash flow, and challenge traditional financial networks.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "AAVE price prediction – A deeper retracement may be on the cards because…",
      "link": "https://ambcrypto.com/aave-price-prediction-all-about-the-possibility-of-the-altcoin-falling-once-again/",
      "summary": "<img alt=\"AAVE price prediction - All about the possibility of the altcoin falling once again\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Aave-Featured-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The breakout succeeded briefly, but Bitcoin's correction and market fears saw AAVE drop towards $260."
    },
    {
      "title": "Dogecoin’s road to slow recovery – Here’s why investors should be ready for volatility!",
      "link": "https://ambcrypto.com/dogecoins-road-to-slow-recovery-heres-why-investors-should-be-ready-for-volatility/",
      "summary": "<img alt=\"Dogecoin&#039;s road to slow recovery - Here&#039;s why investors should be ready for volatility!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Dogecoin-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The leading memecoin was unable to defeat the $0.2 resistance."
    },
    {
      "title": "Examining how Bitcoin’s investors are holding up despite global FUD and panic",
      "link": "https://ambcrypto.com/examining-how-bitcoins-investors-are-holding-up-despite-global-fud-and-panic/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-4.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />There seemed to be lack of intense selling pressure on centralized exchanges."
    },
    {
      "title": "DeFi’s top DAOs have huge treasuries – Yet they’re blind to THESE…",
      "link": "https://ambcrypto.com/defis-top-daos-have-huge-treasuries-yet-theyre-blind-to-these/",
      "summary": "<img alt=\"DAO\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-23.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As DAO budgets balloon into the hundreds of millions, growth remains elusive as they are overlooking…"
    },
    {
      "title": "Bitcoin’s 58.8% return beats gold and S&P 500 – Why investors should take note",
      "link": "https://ambcrypto.com/bitcoins-58-8-return-beats-gold-and-sp-500-why-you-should-take-note/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250615_132317_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin makes a role shift, potentially becoming a new store of value for investors."
    }
  ]
}