{
  "CoinDesk": [
    {
      "title": "Circle Rockets After Stablecoin Bill Clears Senate, Pushes Post-IPO Rally to Over 500%",
      "link": "https://www.coindesk.com/markets/2025/06/19/circle-rockets-after-stablecoin-bill-clears-senate-pushes-post-ipo-rally-to-over-500",
      "summary": ""
    },
    {
      "title": "Dogecoin Steady But Flashing 'Oversold' in Signal for Bearish Bets",
      "link": "https://www.coindesk.com/markets/2025/06/19/dogecoin-steady-but-flashing-oversold-in-signal-for-bearish-bets",
      "summary": ""
    },
    {
      "title": "KuCoin Allows Institutional Clients to Trade Without Having to Pre-Fund Wallets",
      "link": "https://www.coindesk.com/business/2025/06/19/kucoin-allows-institutional-clients-to-trade-without-having-to-pre-fund-wallets",
      "summary": ""
    },
    {
      "title": "Ether, Solana, and Other Majors Could Slide Further as Trump Threatens Iran Strikes",
      "link": "https://www.coindesk.com/markets/2025/06/19/ether-solana-and-other-majors-could-further-slide-as-trump-threatens-iran-strikes",
      "summary": ""
    },
    {
      "title": "Who's Selling Bitcoin Above $100K and Holding Back the Price Rally?",
      "link": "https://www.coindesk.com/markets/2025/06/19/who-s-been-selling-bitcoin-above-usd100k-and-holding-back-the-price-rally",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Binance’s CZ suggests ‘will function’ to distribute crypto in case of death",
      "link": "https://cointelegraph.com/news/binance-will-function-crypto-inheritance?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg2ZjctYzllYy03ZjhiLTg0MWQtZWI0NGRkNjBhNmJl.jpg\" /></p><p>Binance founder Changpeng Zhao said crypto platforms must prepare for the inevitable by enabling users to pass on digital assets after they die.</p>"
    },
    {
      "title": "Canada’s Sol Strategies files with SEC to list on the Nasdaq",
      "link": "https://cointelegraph.com/news/canada-sol-strategies-files-list-nasdaq?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzE5N2UtNTVhNC03NmNmLWFkYjctYjY1N2IzMjZjYjA2.jpg\" /></p><p>Sol Strategies’ stock price rose by more than 4% following the announcement that it has filed to be listed on the Nasdaq exchange.</p>"
    },
    {
      "title": "Pacific nation Nauru passes law to establish a crypto regulator",
      "link": "https://cointelegraph.com/news/nauru-passes-legislation-crypto-digital-asset-regulator?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg2NWMtZTg5NC03Zjg3LTk0YzAtYTg4NjM0YzY5MDUx.jpg\" /></p><p>The brother of former FTX CEO Sam Bankman-Fried once plotted to buy Nauru and build a doomsday bunker using funds from the now-defunct crypto exchange.</p>"
    },
    {
      "title": "Bitcoin to Ether shift going unnoticed with ‘bear market PTSD’ — Trader",
      "link": "https://cointelegraph.com/news/bitcoin-ether-rotation-going-unnoticed-bear-market-fear-crypto-trader?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDcyN2UtZTA3OS03NDZmLWEwZWItZTY1ZWU0Mzk2Mzdk.jpg\" /></p><p>A crypto analyst says the altcoin season “we are all craving for” now hinges on Ether doing better and showing strength.</p>"
    },
    {
      "title": "Ohio House passes bill allowing up to $200 tax-free crypto payments",
      "link": "https://cointelegraph.com/news/ohio-bill-tax-free-crypto-payments-passses-house?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg2MjktOGE3Ni03ZmI2LThkNDgtOGNkYmUzNjZkOTA4.jpg\" /></p><p>Ohio’s House passed a bill to legally insulate various crypto activities, such as mining and staking, and exempt some transactions from capital gains tax.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "North Korean dev hijacks dormant Waves repositories, slips credential-stealing code in wallet updates",
      "link": "https://cryptoslate.com/north-korean-dev-hijacks-dormant-waves-repositories-slips-credential-stealing-code-in-wallet-updates/",
      "summary": "<p>A North Korean developer gained elevated privileges inside Waves Protocol&#8217;s Keeper-Wallet codebase, according to a June 18 report by Ketman. The report highlighted routine scans for Democratic People&#8217;s Republic of Korea (DPRK) activity on GitHub, which uncovered the account &#8220;AhegaoXXX&#8221; pushing updates to Keeper-Wallet. The wallet&#8217;s repositories showed no legitimate commits after August 2023, yet [&#8230;]</p> <p>"
    },
    {
      "title": "10-year Bitcoin holdings grow faster than daily issuance, marking scarcity signal after 2024 halving",
      "link": "https://cryptoslate.com/10-year-bitcoin-holdings-grow-faster-than-daily-issuance-marking-scarcity-signal-after-2024-halving/",
      "summary": "<p>On-chain data shows that Bitcoin’s (BTC) “ancient supply” is increasing faster than new BTC daily issuance, according to a June 18 research by Fidelity Digital Assets. The report treats ancient supply as Bitcoins that have remained unmoved for at least a decade, and it counted an average of 566 BTC entering the 10-year-plus cohort daily [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase launches stablecoin payment stack with USDC checkout targeting commerce giants",
      "link": "https://cryptoslate.com/coinbase-launches-stablecoin-payment-stack-with-usdc-checkout-targeting-commerce-giants/",
      "summary": "<p>Coinbase officially launched Coinbase Payments on June 18, a three-layer platform that enables commerce providers to add USDC checkout without running their blockchain infrastructure. The stack begins with Stablecoin Checkout, a wallet-native interface that supports hundreds of wallets, delivers gas-free transactions, and records payments in USDC. Beneath it, an E-commerce Engine exposes application programming interfaces [&#8230;]</p> <p>"
    },
    {
      "title": "Circle stock leaps to $200 record after 34% daily gain",
      "link": "https://cryptoslate.com/circle-stock-leaps-to-200-record-after-34-daily-gain/",
      "summary": "<p>Circle’s CRCL shares climbed 34% and closed at $199.59 on June 18 after registering a new all-time high at $200.90. The new price peak is roughly 6.5x the company’s initial public offering price of $31 set on June 5. The price leap came one day after the Senate advanced the Guiding and Establishing National Innovation [&#8230;]</p> <p>"
    },
    {
      "title": "Distribution or death: Arthur Hayes says only exchange-backed or bank-linked stablecoins can thrive",
      "link": "https://cryptoslate.com/distribution-or-death-arthur-hayes-says-only-exchange-backed-or-bank-linked-stablecoins-can-thrive/",
      "summary": "<p>Arthur Hayes said that stablecoin issuers who cannot immediately tap a large exchange, a Web2 platform, or a legacy bank will struggle to survive. In a June 16 blog post, the BitMEX co-founder recounted how the banking shutdowns in the 2010s in Hong Kong and Mainland China drove traders toward Tether. Bitfinex and Tether allowed [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana Plunges 13%: Can Key On-Chain Support Stop The Fall?",
      "link": "https://www.newsbtc.com/news/solana/solana-plunges-13-key-on-chain-support-stop-fall/",
      "summary": "Solana has declined by around 13% in the past week, which has brought the asset back to a major on-chain support cluster. Could this be where the bleed ends? Solana Has Strong On-Chain Support Between $145 &#38; $147 In a new post on X, the on-chain analytics firm Glassnode has talked about where support and resistance levels lie for Solana based on the Cost Basis Distribution (CBD) metric. Related Reading: These Altcoins Are Bucking The Trend—But Can They Keep It Up? The Cost Basis Distribution tells us about how much of the cryptocurrency&#8217;s circulating supply was last purchased or transferred at what spot price. Below is the chart shared by Glassnode that shows the data of the indicator for Solana over the past few months. As is visible, there are a few price zones near the current Solana spot price that stand out in terms of the amount of supply that they hold. The $155 to $157 range carries the cost basis of around 31 million tokens and the $164 to $166 range that of 29 million tokens. A third demand zone exists at $145 to $147, a region that the cryptocurrency&#8217;s price is currently making a retest of. Here, the investors last purchased a total of 13 million SOL. To any investor, their cost basis is an important level, so they are more likely to show some kind of move when a retest of it occurs. Generally, this type of reaction isn&#8217;t anything relevant for the asset when just a few holders share their acquisition mark at the level, but when a large amount of them are involved, like in the case of the range that SOL is retesting right now, a sizeable reaction can sometimes appear. Generally, these moves tend toward buying when the retest occurs from above. That is, when the investors were in the green prior to the retest. This happens because these holders might believe the price decline to be just a dip opportunity or they may simply want to protect their cost basis. Similarly, holders might panic sell when the retest happens from below. This could happen because underwater sellers can be desperate to get back into the green and once they do, they might fear that the rise is only temporary so they could push for the exit. As Solana is retesting the $145 to $147 range from above, it&#8217;s possible that buyers from this region could provide support to the asset and help cushion its fall. In the event that a turnaround does happen, the $155 to $157 resistance range could be of focus next. Related Reading: Bitcoin NVT Enters Reversal Zone: BTC Dangerously Overvalued? The analytics firm has also shared the CBD of another altcoin, Tron (TRX). As Glassnode explains, Cost Basis Distribution shows TRON found support in the $0.26–$0.27 range, where over 14B $TRX is held -marking the strongest cluster on the chart. Above that, the supply is relatively thin and most investor positioning remains below current price. SOL Price Solana is currently hanging right at the lower end of the support range as its price is floating around $145. Looks like the price of the coin has plunged during the last couple of days &#124; Source: SOLUSDT on TradingView Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Ethereum Stalls at $2,500, But Is a $4,000 Breakout Closer Than You Think?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-stalls-at-2500-but-is-a-4000-breakout-closer-than-you-think/",
      "summary": "Ethereum has struggled to maintain upward momentum following a brief rally that pushed its price above $2,800 last week. Currently, ETH is trading at $2,511, reflecting a 9.4% decline over the past week. This retreat comes amid a broader period of consolidation across the digital asset market, with Ethereum seeing both technical resistance levels and on-chain trends that could shape its price action in the coming weeks. Related Reading: Ethereum Golden Cross Approaching – Will History Repeat? Ethereum Faces Technical Resistance The latest analysis from İbrahim COŞAR, a contributor to CryptoQuant’s QuickTake platform, highlights the significance of the 50-week exponential moving average (EMA) as a resistance level for ETH. Historically, successful breakouts above this technical marker have been followed by substantial price gains. COŞAR notes that in prior cycles, once ETH crossed above the 50-week EMA, price increases ranged from 25% to 135%. Averaging those moves suggests a breakout could see Ethereum targeting the $4,000 range. The EMA is a trend-following indicator that places more weight on recent price action, often used to identify potential breakout or breakdown zones in asset movements. Staking and Accumulation Metrics Show Investor Conviction In parallel to price action, Ethereum’s staking metrics continue to show steady growth. On-chain analyst OnChainSchool reported that more than 500,000 ETH were staked in the first half of June, bringing the total staked to over 35 million ETH. This milestone represents the highest amount ever locked in Ethereum&#8217;s proof-of-stake contract and reflects a growing trend toward network participation and supply reduction. Staking, in ETH’s case, involves locking ETH to help secure the network and validate transactions in return for staking rewards. As the amount of ETH staked rises, the liquid circulating supply shrinks, potentially tightening available supply on exchanges. Additionally, accumulation wallets, or addresses with no history of selling, have also reached an all-time high, now holding 22.8 million ETH. Combined, these metrics point toward long-term holding behavior, rather than speculative trading. Ethereum Hits ATH in Staking: Over 35 Million ETH Locked “Alongside this, Accumulation Addresses (holders with no history of selling) have also reached an all-time high, now holding 22.8 million ETH.” – By @onchainschool Read more ⤵️https://t.co/WYoX9qpODZ pic.twitter.com/6MAlK0sCfJ — CryptoQuant.com (@cryptoquant_com) June 17, 2025 These on-chain developments coincide with ongoing interest in Ethereum-based financial products. The Ethereum ecosystem has seen renewed institutional and retail engagement, particularly after the US Securities and Exchange Commission approved the first spot ETH ETFs. Related Reading: Ethereum Price at Risk of Downside Break as Bears Test Key Support Just recently, SharpLink Gaming, a Nasdaq-listed firm, also a marketing partner to sportsbooks and online casino gaming operators, unveiled a $425M Ethereum reserve strategy led by ConsenSys. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Iran’s Top Crypto Hub Loses $82 Million To Hackers With Israeli Links—Details",
      "link": "https://www.newsbtc.com/altcoin/irans-top-crypto-hub-loses-81-million-to-hackers-with-israeli-links-details/",
      "summary": "An onchain investigator has flagged a major breach at Iran-based Nobitex, where hackers made off with more than $81 million in digital assets. Related Reading: Tether Enforces Freeze On $12 Million In Tron Funds Over Illicit Activity Based on reports from blockchain sleuth ZachXBT, at least $81.7 million was moved out of the exchange’s hot wallets on June 16, 2025. The stolen funds came from both the Tron network and various Ethereum Virtual Machine (EVM) chains. Massive Funds Drained From Hot Wallets According to ZachXBT’s Telegram post, the first chunk—$49 million—went through a vanity address that read “TKFuckiRGCTerrorists&#8230;mNX.” A second custom address, “0xffFFfFFffFF&#8230;Dead,” was used to pull the rest. These special wallet names aren’t random. They show how attackers slipped around Nobitex’s checks and grabbed funds meant to stay locked down. Vanity Addresses Exploit Access Controls Experts say the use of these human‑readable addresses points to a flaw in the exchange’s internal controls. “Attackers managed to infiltrate systems that should have blocked unauthorized wallets,” noted Hakan Unal of Cyvers security. The exchange confirmed that it spotted the breach quickly and suspended the affected hot wallets. Political Motive Behind The Breach A pro‑Israel hacker group calling itself “Gonjeshke Darande” claimed responsibility in an X post. The group called Nobitex a tool for “regime financing” and threatened to release source code and internal files within 24 hours. After the IRGC’s “Bank Sepah” comes the turn of Nobitex WARNING! In 24 hours, we will release Nobitex&#8217;s source code and internal information from their internal network. Any assets that remain there after that point will be at risk! The Nobitex exchange is at the heart of the… pic.twitter.com/GFyBCPCFIE — Gonjeshke Darande (@GonjeshkeDarand) June 18, 2025 They warned that any assets left on the platform would be in danger. This hack comes as tensions surged between Israel and Iran after Israel’s largest strikes on Iran since the 1980s. Reports say at least 224 people died in Iran and 24 in Israel during the renewed conflict. Cold Storage And User Security Assurances Nobitex says users’ main funds are safe in cold storage, and only a fraction of hot‑wallet assets were hit. The exchange promised to cover all losses with its insurance fund and internal resources. That promise should reassure customers, though the fear of leaked code or files could drive some to pull funds. Related Reading: Crypto Gets A Green Light From Spanish Banking Giant Unmoved Funds Could Reveal Next Steps Interestingly, none of the stolen coins have moved since the hack was first spotted. That could mean the hackers are choosing their next move. Or it might be a warning shot meant to show they can strike again. Either way, this incident highlights how vital it is for exchanges to guard against insider‑level slip‑ups. Protocols alone aren’t enough if people and processes leave doors open. As the crypto world watches, Nobitex users will be looking closely at how the platform rebuilds trust and keeps their money safe. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Dogecoin (DOGE) Struggles to Climb — Upside Moves Likely to Face Strong Resistance",
      "link": "https://www.newsbtc.com/analysis/doge/dogecoin-doge-struggles-0-180/",
      "summary": "Dogecoin started a fresh decline from the $0.1820 zone against the US Dollar. DOGE is now consolidating losses and might recover if it clears $0.1750. DOGE price started a fresh decline below the $0.1820 and $0.180 levels. The price is trading below the $0.1780 level and the 100-hourly simple moving average. There was a break above a bearish trend line forming with resistance at $0.1680 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could start a fresh decline if it stays below the $0.1780 zone. Dogecoin Price Faces Resistance Dogecoin price started a fresh decline after it failed to clear the $0.1820 zone, underperforming Bitcoin and Ethereum. DOGE declined below the $0.1800 and $0.1780 levels. The bears even pushed the price below the $0.170 level. A low was formed at $0.1641 and the price is now attempting to recover. There was a minor move above the 23.6% Fib retracement level of the downward move from the $0.1811 swing high to the $0.1641 low. Besides, there was a break above a bearish trend line forming with resistance at $0.1680 on the hourly chart of the DOGE/USD pair. Dogecoin price is now trading below the $0.1780 level and the 100-hourly simple moving average. Immediate resistance on the upside is near the $0.1725 level. It is close to the 50% Fib retracement level of the downward move from the $0.1811 swing high to the $0.1641 low. The first major resistance for the bulls could be near the $0.1750 level. The next major resistance is near the $0.1820 level. A close above the $0.1820 resistance might send the price toward the $0.1880 resistance. Any more gains might send the price toward the $0.200 level. The next major stop for the bulls might be $0.2120. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.1750 level, it could start another decline. Initial support on the downside is near the $0.1680 level. The next major support is near the $0.1640 level. The main support sits at $0.1620. If there is a downside break below the $0.1620 support, the price could decline further. In the stated case, the price might decline toward the $0.150 level or even $0.1440 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now losing momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1640 and $0.1620. Major Resistance Levels – $0.1750 and $0.1800."
    },
    {
      "title": "XRP Price Clings to Support — Recovery Hopes Hinge on Holding the Line",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-clings-to-support-2-120/",
      "summary": "XRP price started a fresh decline below the $2.150 zone. The price is now consolidating losses and might recover unless the bears push it below $2.120. XRP price started a fresh decline below the $2.180 zone. The price is now trading below $2.20 and the 100-hourly Simple Moving Average. There was a break above a bearish trend line with resistance at $2.1550 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start a recovery wave if there is a close above the $2.20 resistance zone. XRP Price Holds Support XRP price reacted to the downside below the $2.220 support zone, like Bitcoin and Ethereum. The price declined below the $2.20 and $2.180 support levels. The pair tested the $2.120 support A low was formed at $2.120 and the price is now consolidating losses. There was a minor move above the 23.6% Fib retracement level of the recent decline from the $2.335 swing high to the $2.120 low. Besides, there was a break above a bearish trend line with resistance at $2.1550 on the hourly chart of the XRP/USD pair. The price is now trading below $2.20 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.180 level. The first major resistance is near the $2.20 level. The next resistance is $2.2250 or the 50% Fib retracement level of the recent decline from the $2.335 swing high to the $2.120 low. A clear move above the $2.2250 resistance might send the price toward the $2.2540 resistance. Any more gains might send the price toward the $2.280 resistance or even $2.30 in the near term. The next major hurdle for the bulls might be $2.350. Another Decline? If XRP fails to clear the $2.20 resistance zone, it could start another decline. Initial support on the downside is near the $2.1420 level. The next major support is near the $2.120 level. If there is a downside break and a close below the $2.120 level, the price might continue to decline toward the $2.050 support. The next major support sits near the $2.020 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now near the 50 level. Major Support Levels – $2.1420 and $2.120. Major Resistance Levels – $2.180 and $2.20."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    },
    {
      "title": "The Trolls Are Coming: Defending Bitcoin Mining from Patent Trolls",
      "link": "https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_GenerateThe-Trolls-Are-Coming_-Defending-Bitcoin-Mining-from-Patent-Trollsd_Image_9ib8k29ib8k29ib8-fotor-20250618125328.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls\" rel=\"nofollow\"> </a></p> <p>The clash between Malikie Innovations and Bitcoin miners exemplifies a classic conflict between open innovation and legacy fiat intellectual property rights.</p> <p>"
    },
    {
      "title": "Bitdeer Raises $330M to Expand Bitcoin Mining and AI Operations",
      "link": "https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BITDEER-EXPANDS-BITCOIN-MINING.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-raises-330m-to-expand-bitcoin-mining-and-ai-operations\" rel=\"nofollow\"> </a></p> <p>Singapore-based Bitcoin mining firm Bitdeer Technologies Group has launched a $330 million convertible notes offering, aiming to strengthen its mining operations, develop ASIC rigs, and scale its AI infrastructure.&#160; The notes, due in 2031, carry an annual interest rate of 4.875% and may be converted into Bitdeer Class A shares at a 25% premium to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin Tech Booms: Lightning Data Defies Digital Gold Narrative",
      "link": "https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_a_rough_gold_rock_with_Bitcoin_logo_stampe_2.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-tech-booms-lightning-data-defies-digital-gold-narrative\" rel=\"nofollow\"> </a></p> <p>Bitcoin tech shines in 2025 with 1.5 million Lightning users, $1.5 billion trading volume, and Block’s 9.7% yield, outpacing treasury hype.</p> <p>"
    },
    {
      "title": "K33 Announces Plans To Purchase Up To 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Norwegian-Public-Company-K33-AB-Purchased-10-BTC-For-Their-New-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/k33-announces-plans-to-purchase-up-to-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>K33 has launched a SEK 85 million share issue at a price of SEK 0.1036 per share.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Treasury Secretary Bessent Says Stablecoins Can Bolster US Dollar 'Supremacy’",
      "link": "https://decrypt.co/326021/treasury-secretary-bessent-stablecoins-dollar-supremacy",
      "summary": "Bessent framed stablecoins as a strategic asset for U.S. influence, as lawmakers weigh whether politics will stall key legislation again."
    },
    {
      "title": "Bitcoin Scandal Fails to Topple Czech Government in No-Confidence Vote",
      "link": "https://decrypt.co/326018/bitcoin-scandal-fails-czech-government-no-confidence-vote",
      "summary": "A $45 million Bitcoin donation from a convicted darknet operator set off a political crisis and brought the Czech government to its knees."
    },
    {
      "title": "1inch Foundation Proposes User Compensation Plan Following October Hack",
      "link": "https://decrypt.co/326012/1inch-foundation-proposes-user-compensation-plan",
      "summary": "DAO members of 1inch are voting on whether to approve a reimbursement scheme for victims of a supply chain exploit last year."
    },
    {
      "title": "Civil Rights Group Gives Elon Musk's xAI 60 Days to Fix Alleged Clean Air Act Violations",
      "link": "https://decrypt.co/326005/civil-rights-elon-musks-xai-60-days-fix-alleged-clean-air-act-violations",
      "summary": "The NAACP has threatened xAI with a lawsuit over unpermitted gas turbines at Memphis AI data center, citing pollution concerns."
    },
    {
      "title": "Trump Pushes House to Pass GENIUS Act as Lawmakers Debate Crypto Oversight",
      "link": "https://decrypt.co/325996/trump-pushes-house-genius-act-lawmakers-debate-crypto",
      "summary": "The President has called on the House to approve the stablecoin bill, despite concerns over conflicts of interest and tech sector influence."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Iran restricts crypto exchange hours after massive Nobitex exploit drains BTC, ETH, XRP",
      "link": "https://cryptobriefing.com/iran-crypto-restrictions-nobitex-exploit/",
      "summary": "<p>Iran's crypto exchange restrictions may hinder financial innovation and exacerbate tensions in an already volatile geopolitical climate.</p> <p>"
    },
    {
      "title": "Bitcoin holds steady at $104K as Fed eyes inflation from tariffs before easing",
      "link": "https://cryptobriefing.com/bitcoin-stability-fed-rate/",
      "summary": "<p>Bitcoin holds at $104K as the Fed keeps rates at 4.25% to 4.50%, citing tariff-driven inflation as reason to delay cuts.</p> <p>"
    },
    {
      "title": "US DOJ seeks to forfeit $225 million in crypto from global scam network",
      "link": "https://cryptobriefing.com/crypto-scam-forfeiture-seizure/",
      "summary": "<p>The DOJ's action highlights the increasing need for robust international cooperation and advanced digital forensics in combating crypto fraud.</p> <p>"
    },
    {
      "title": "Bitcoin stays resilient ahead of Fed meeting as investors await policy signals",
      "link": "https://cryptobriefing.com/bitcoin-resilient-ahead-fed-meeting/",
      "summary": "<p>Bitcoin's resilience amid Fed uncertainty highlights its potential as a hedge, but future rate signals could impact broader market liquidity.</p> <p>"
    },
    {
      "title": "Canada’s first XRP spot ETF goes live on Toronto Stock Exchange",
      "link": "https://cryptobriefing.com/canadas-first-xrp-spot-etf/",
      "summary": "<p>The launch of Canada's first XRP spot ETF could accelerate mainstream adoption of digital assets, enhancing financial market innovation.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum eyes $3,237 next – But is there ONE missing factor?",
      "link": "https://ambcrypto.com/ethereum-eyes-3237-next-but-is-there-one-missing-factor/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-18T152522.056-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum forms bullish structure, but divergence in activity and valuation clouds short-term direction."
    },
    {
      "title": "Bitcoin’s fate hinges on $102K – Breakdown or breakout ahead for the price?",
      "link": "https://ambcrypto.com/bitcoins-fate-hinges-on-102k-breakdown-or-breakout-ahead-for-the-price/",
      "summary": "<img alt=\"Bitcoin’s Fate Hinges on $102K: Breakdown or Breakout Ahead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-102k.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Long-term outlook may be bullish for Bitcoin, but short-term volatility could play a role too."
    },
    {
      "title": "Shiba Inu – A 6,306% hike in inflows? It could be a breakout or a bull trap IF…",
      "link": "https://ambcrypto.com/shiba-inu-a-6306-hike-in-inflows-it-could-be-a-breakout-or-a-bull-trap-if/",
      "summary": "<img alt=\"Shiba Inu - A 6,306% hike in inflows? It could be a breakout or a bull trap IF...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-18T172712.105-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SHIB’s price action has built momentum amid whale inflows, burn spikes, and a falling wedge setup."
    },
    {
      "title": "Why is crypto down today – Geopolitical tensions, fear of war dictate Bitcoin’s price action!",
      "link": "https://ambcrypto.com/why-is-crypto-down-today-geopolitical-tensions-fear-of-war-dictate-bitcoins-price-action/",
      "summary": "<img alt=\"Why is crypto down today - Geopolitical tensions, fear of war dictate Bitcoin&#039;s price action!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-6.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Capital flows into crypto and Bitcoin could slow down in the short-term."
    },
    {
      "title": "Cardano: Here’s why ADA might be the smartest bet right now!",
      "link": "https://ambcrypto.com/cardano-heres-why-ada-might-be-the-smartest-bet-right-now/",
      "summary": "<img alt=\"Cardano\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-33.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />After $50M in liquidations and an oversold market, is ADA ready to lead the next rebound?"
    }
  ]
}