{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Institutional Buying Makes $3K ETH Likely, While AI Agents Seek Crypto Rails",
      "link": "https://www.coindesk.com/markets/2025/06/11/asia-morning-briefing-institutional-buying-makes-3k-eth-likely-while-ai-agents-seek-crypto-rails",
      "summary": ""
    },
    {
      "title": "GameStop Raising Another $1.75B for Potential Bitcoin Purchases",
      "link": "https://www.coindesk.com/business/2025/06/11/gamestop-raising-another-175b-for-potential-bitcoin-purchases",
      "summary": ""
    },
    {
      "title": "Safe Establishes New Development Firm to Attract Institutions and Tackle Crypto’s ‘Cyber Warfare’ Era",
      "link": "https://www.coindesk.com/tech/2025/06/11/safe-establishes-new-development-firm-to-attract-institutions-and-tackle-cryptos-cyber-warfare-era",
      "summary": ""
    },
    {
      "title": "Tom Lee Mulls Roughed-Up Semler Scientific for 'Granny Shot' Portfolio",
      "link": "https://www.coindesk.com/markets/2025/06/11/tom-lee-mulls-roughed-up-semler-scientific-for-granny-shot-portfolio",
      "summary": ""
    },
    {
      "title": "Senate Begins Passage of Stablecoin Bill as House Marks Market-Structure Wins",
      "link": "https://www.coindesk.com/policy/2025/06/11/senate-begins-passage-of-stablecoin-bill-as-house-marks-market-structure-wins",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Sweden’s H100 soars 45% in a day after raising $10M for Bitcoin treasury",
      "link": "https://cointelegraph.com/news/swedens-h100-soars-45-percent-10-million-raise?utm_source=rss_feed&utm_medium=rss%3FREFRESH1635322580998&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzYyMGUtYTQzNi03OGVmLWI3ZjMtYWRiZDVhNDM0NDc2.jpg\" /></p><p>H100 Group’s shares surged after the Swedish health firm announced it had raised $10.6 million to stack more Bitcoin.</p>"
    },
    {
      "title": "Centralized Bitcoin treasuries hold 31% of BTC supply: Gemini",
      "link": "https://cointelegraph.com/news/bitcoin-treasuries-now-hold-nearly-31-bitcoin-supply-gemini?utm_source=rss_feed&utm_medium=rss%3FREFRESH1635322580998&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGUyZDQtNGM3Ni03NzgzLTljZTAtOWFmNTYxOGJkZGFi.jpg\" /></p><p>Centralized treasuries, including governments, ETFs and public companies, now control approximately $668 billion of Bitcoin’s circulating supply.</p>"
    },
    {
      "title": "No one will sell their Bitcoin once it taps $130K: Bitwise CEO",
      "link": "https://cointelegraph.com/news/bitcoin-price-130k-sell-off-disappears-bitwise-ceo?utm_source=rss_feed&utm_medium=rss%3FREFRESH1635322580998&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzYxN2MtYTRkOC03YzYzLTgxNTMtNWQwMjlmOTU5OTk2.jpg\" /></p><p>Bitcoin selling will “peter off” once Bitcoin’s price moves above $130,000, says a crypto executive.</p>"
    },
    {
      "title": "Circle gains 10% on deals with Brazil’s Matera, Altman’s World",
      "link": "https://cointelegraph.com/news/circle-gains-matera-partnership-usdc-launch-on-world-chain?utm_source=rss_feed&utm_medium=rss%3FREFRESH1635322580998&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzYxMzItNjYyYy03ODI0LTk5MGQtMzBkYzZjNDlkYzNm.jpg\" /></p><p>USDC issuer Circle has put its stablecoin live on World Chain and has partnered with Matera to allow Brazilian banks to offer multicurrency payments.</p>"
    },
    {
      "title": "Disney, Universal sue Midjourney — ‘bottomless pit of plagiarism’",
      "link": "https://cointelegraph.com/news/disney-universal-sue-midjourney-copyright-infringement?utm_source=rss_feed&utm_medium=rss%3FREFRESH1635322580998&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzYxNmMtZmZjYy03OGNiLWJiN2YtMGY2M2RkNmEzMGQ5.jpg\" /></p><p>Disney said it filed the complaint after its request to Midjourney to adopt anti-copyright infringement measures was ignored.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitwise CIO calls Bitcoin ‘best horse in the race’ to explain accelerated corporate buys",
      "link": "https://cryptoslate.com/bitwise-cio-calls-bitcoin-best-horse-in-the-race-to-explain-accelerated-corporate-buys/",
      "summary": "<p>Bitwise CIO Matt Hougan said the &#8220;megatrend&#8221; of public companies adding Bitcoin (BTC) to treasury reserves will continue accelerating as the movement is still in its early stages. Hougan made the statement during a June 10 interview on CNBC, where he highlighted that 79 listed firms now hold roughly $57 billion worth of Bitcoin as of [&#8230;]</p> <p>"
    },
    {
      "title": "GameStop’s plan to raise another $1.75B fuels speculation of further Bitcoin acquisitions",
      "link": "https://cryptoslate.com/gamestops-plan-to-raise-another-1-75b-fuels-speculation-of-further-bitcoin-acquisitions/",
      "summary": "<p>GameStop Corp. plans to raise $1.75 billion through a private offering of convertible senior notes due 2032, as the company explores digital asset investments, including potential Bitcoin acquisitions, under its updated investment strategy, according to a June 11 press release. The zero-coupon notes will be offered to qualified institutional buyers under Rule 144A of the [&#8230;]</p> <p>"
    },
    {
      "title": "Bank of America eyes dollar-pegged stablecoin amid Senate fast-tracking GENIUS Act",
      "link": "https://cryptoslate.com/bank-of-america-eyes-dollar-pegged-stablecoin-amid-senate-fast-tracking-genius-act/",
      "summary": "<p>Bank of America CEO Brian Moynihan confirmed the lender plans to issue a dollar-pegged stablecoin and is working on an internal build conducted alongside other industry participants, Reuters reported on June 11. However, Moynihan added that any progress in a potential launch would be contingent on forthcoming federal rules. He also told investors the bank [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin dips as Trump finalizes tariff deals with China",
      "link": "https://cryptoslate.com/bitcoin-dips-as-trump-finalizes-tariff-deals-with-china/",
      "summary": "<p>Bitcoin (BTC) and the wider market experienced a minor pullback after President Donald Trump announced the finalization of a new tariff arrangement with China, pending a formal sign-off by him and President Xi Jinping. Trump announced on Truth Social that the accord grants the US &#8220;55% tariffs&#8221; on Chinese goods, versus 10% levied on US [&#8230;]</p> <p>"
    },
    {
      "title": "Senate’s 68-30 cloture vote speeds GENIUS Act toward simple majority passage",
      "link": "https://cryptoslate.com/senates-68-30-cloture-vote-speeds-genius-act-toward-simple-majority-passage/",
      "summary": "<p>The Senate voted 68-30 on June 11 to invoke cloture on the Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act, ending the filibuster option and moving the bill toward a final floor vote that will require a simple majority. Majority Leader John Thune, who controls the chamber’s schedule, started the 30-hour post-cloture clock [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin",
      "link": "https://www.newsbtc.com/altcoin/trx-price-up-as-tron-rolls-out-the-red-carpet-for-trump-backed-stablecoin/",
      "summary": "Tron’s blockchain just added a USD1 stablecoin from World Liberty Financial Inc. That move put the spotlight back on TRX. And traders are paying attention to what comes next. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Significant Price Movement According to trading data, TRX climbed 6% on Tuesday. It broke above the $0.2875 level on the daily chart before hitting resistance at $0.2980. A clean break past that hurdle could send the token toward $0.3230, the 50% Fibonacci retracement level. Currently, TRX trades around $0.2920, sitting between support at $0.2808 and the 23.6% Fib mark of $0.2645. The first USD1 has officially been minted on TRON — a small step for USD1, a giant leap for stablecoins!https://t.co/KMLg8NcXw8 — H.E. Justin Sun 🍌 (@justinsuntron) June 11, 2025 High-Profile Stablecoin Launch Based on reports from World Liberty Financial Inc., the new USD1 stablecoin is now live on Tron. The issuer has ties to US President Donald Trump, and Justin Sun—Tron’s founder and the largest holder of the Trump Token meme coin—called the launch a “giant leap for stablecoins.” Sun also joined a White House dinner for top Trump Token holders. This link to big names has drawn fresh eyes to Tron’s ecosystem. On-Chain Growth Signals According to DeFiLlama, the total value locked on Tron reached over $5 billion. On June 6, the network saw 4.50 million returning user addresses. Those stats suggest people keep coming back to DeFi apps on Tron, but it’s worth watching whether those funds stay in place or chase higher yields on other chains. Bullish Bets in Derivatives Based on CoinGlass data, TRX derivatives open interest rose by 8.25% over the past 24 hours to $329 million. The weighted funding rate open interest rose to 0.0098%, indicative that bullish long positions are greater than shorts. Short liquidations in the past day were almost double that of longs, which settled a bearish bet wave. Technical analysis supports this positive perspective. The RSI on the daily chart is inching up to the overbought region, indicating heightened buying pressure. A recent MACD crossover drove histogram bars into positive territory, which means momentum has favored the buyers. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Meanwhile, traders will keep a close eye on Bitcoin’s moves too. A pullback there could drag altcoins lower, while a fresh rally could lift TRX even more. For now, the combination of a big-name stablecoin launch, rising TVL, swelling open interest and positive technical signals gives Tron fans reason to watch for a potential breakout. Featured image from Getty Images, chart from TradingView"
    },
    {
      "title": "Ethereum Price Tests Ascending Channel Resistance – Breakout Or Breakdown?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-price-tests-ascending-channel-resistance-breakout-or-breakdown/",
      "summary": "Ethereum pushed above the $2,820 mark yesterday, strengthening the bullish case for a breakout after weeks of consolidation. The move has created renewed optimism among traders who expect ETH to rally beyond its current range and begin a new upward leg. Despite lingering global tensions, markets are responding positively to growing speculation that a trade deal between the US and China may soon be finalized, offering a temporary boost to risk assets across the board. Related Reading: Ethereum Approaches Decisive Level – Trading Around 200 DMA Resistance Ethereum’s recent strength comes at a critical moment, as price approaches the upper boundary of its current ascending channel. Top analyst M-log1 shared a technical analysis highlighting this structure, stating that ETH needs to break out of this current channel. Until then, price action may remain contained within the structure, with limited upside unless a decisive breakout occurs. As Ethereum pushes toward resistance, all eyes are on volume and confirmation signals that could mark the start of a broader trend. For bulls, breaking above the ascending channel could signal the beginning of a strong move toward $3,000 and beyond. Until then, Ethereum remains at a key inflection point in its cycle. Ethereum Holds The Key To Altseason Ts Bulls Eye Breakout Ethereum is now at the center of the market’s attention, as its next move could determine whether a true altseason begins. While Bitcoin continues to lead, Ethereum’s ability to reclaim higher price levels—particularly above the $2,800 mark—will be critical in confirming the start of a broader altcoin rally. So far, positive sentiment and rising price action suggest momentum is building, with ETH pushing into resistance and forming a constructive setup. Bulls have regained control in recent sessions, but the challenge now lies in escaping the current structure. M-log1 highlighted that Ethereum remains trapped in an ascending channel, a pattern that often leads to slow grinding moves until a breakout or breakdown occurs. “If we want anything significant to happen,” he noted, “then ETH needs to leave this ascending channel.” Failing to do so increases the probability of a revisit to the lower end of the range, though M-log1 clarified that this isn’t a certainty—just a probability to keep in mind. On a positive note, Ethereum’s moving averages continue to trend upward and support price from below, providing a favorable technical backdrop. As long as these levels hold and bulls remain active, the breakout scenario remains the dominant outlook. If ETH can decisively flip $2,800 into support and break above the channel structure, it could unleash a wave of capital rotation into altcoins. Until then, Ethereum holds the spotlight—and its next move will likely shape the direction of the entire market heading into summer. Related Reading: Ethereum Still Rangebound Below $2,735 Level – No Clear Breakout Yet Ethereum Breaks Above Resistance But Faces Retest At Key Level Ethereum is currently trading at $2,771 on the daily chart after briefly breaking above the critical $2,800 resistance zone. This level has capped price action multiple times since early May, making this breakout attempt a significant development. However, today’s rejection from a high of $2,834 suggests that ETH is not yet ready to confirm a clean breakout and may be entering a short-term retest phase. The $2,750–$2,800 zone, now acting as immediate resistance, aligns closely with the 200-day simple moving average (SMA) at $2,654.52 — a historically important level that often dictates medium-term trend direction. ETH’s recent surge above all major moving averages, including the 50-day ($2,333.32) and 100-day ($2,085.42) SMAs, reflects growing bullish momentum and a strong trend structure. Related Reading: Ethereum Weekly Structure Tightens – Tower Top Pattern In Play? If Ethereum holds above the 200-day SMA on a retest and reclaims $2,800 with follow-through, the path toward $3,000 becomes more realistic. On the other hand, failure to hold this area could result in a slide back toward the $2,600–$2,650 support zone. Volume has picked up, indicating interest, but confirmation will come from sustained price above resistance. For now, ETH remains in a promising position — but the next few candles will be key. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "XRP Could Hit $73, Says Research Firm In Bullish Outlook",
      "link": "https://www.newsbtc.com/xrp-news/xrp-could-hit-73-research-firm-bullish-outlook/",
      "summary": "An extended technical review aired Tuesday on Sistine Research’s YouTube channel has placed XRP at the top of the current market hierarchy and mapped a price trajectory that—if historical analogues and present chart structure hold—could lift the token as high as $73 in a late-cycle blow-off. Speaking during the firm’s regular live-stream, analyst Forrest began by ranking assets that have rallied since the US election on 5 November 2024. “XRP is the number-one performing coin since the election, the strongest coin on my watch-list,” he said, displaying a four-hour relative-performance chart that compared crypto majors, select altcoins, metals and equities. The next-best performers—HBAR and XLM—were described as “beta” plays that historically accelerate only after XRP begins to trend. Can XRP Reach $73 This Cycle? Forrest’s thesis hinges on what he called a “seven-year flag and breakout” visible on XRP’s monthly time frame. The pattern comprises the long consolidation that followed the 2017 bull market and a second, five-month bull flag carved out this year. “Why would I not own a chart that looks like this?” he asked, noting the rarity of multi-cycle structures that break decisively to the upside without retracing the move. In his view, the next critical trigger sits above $3.00–3.30, where XRP’s prior all-time high was set in January 2018. Once breached, the analyst argues, momentum traders who “feel like they’ve missed it” will encounter a higher-time-frame market that is in fact just warming up: “Above three dollars I get even more bullish. The higher this goes, the more bullish it becomes—up to a point, of course.” Related Reading: XRP Eyes $2.50 Decision Zone As Macro Wave Structure Takes Shape Forrest offered a ladder of profit-taking zones: $7–10 — initial resistance where early longs may start trimming. $17–37 — an intermediate band calibrated from Fibonacci extensions and prior percentage moves. $73 — the “absolute” target, projected by measuring the full height of the 2017 breakout and extending it from the current flag’s pivot. He acknowledged that the $73 figure “sounds crazy” with XRP trading near $2.28 at the time of the stream but argued that similarly outsized moves materialised in past crypto supercycles. During the 2017 run, XRP advanced roughly 1,400% from its breakout flag; applying a comparable ratio to today’s structure yields Forrest’s upper bound. While the tone remained unambiguously bullish, the analyst did outline scenarios that would invalidate the thesis. A decisive breakdown below the present trading range—he cited the $1.80–1.90 area—could force a “round-trip” to the mid-$1 zone and delay the upward resolution. For now, however, he sees range-bound price action as constructive: “As long as we’re holding range, I’m not entertaining the deep retrace.” Related Reading: XRP Price: Analyst Says Expect Biblical Move Before Historic Crash – Here Are The Targets Forrest also distinguished between holding spot XRP—“a no-brainer”—and employing leverage, reminding viewers that structural targets are measured in months and that leveraged positions may not survive interim volatility. Sistine Research’s macro overlay remains resolutely pro-risk through the summer. The firm’s proprietary “Bitcoin Blueprint” identified the 7 June–21 June window as a historically bullish pocket. That seasonal tailwind, combined with the technical setup, underpins Forrest’s conviction that XRP will continue to outperform not only rival tokens but also traditional safe-haven assets such as gold and silver, which the firm nonetheless holds as portfolio hedges. Whether XRP can emulate its 2017 trajectory will depend on broader liquidity conditions, regulatory milestones in the ongoing SEC litigation, and the extent to which institutional flows diversify beyond Bitcoin and Ethereum. Yet the Sistine Research desk is positioned as though the heavy lifting is already under way: “It’s slowed down a little recently, but I expect this overall trend to continue.” At press time, XRP traded at $2.32. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Price Sees Short-Term Correction—Healthy Dip or Warning Sign?",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-sees-correction-3750/",
      "summary": "Ethereum price started a fresh increase above the $2,750 zone. ETH is now correcting gains and might test the $2,680 support zone. Ethereum started a fresh increase above the $2,800 level. The price is trading above $2,750 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line forming with support at $2,800 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $2,680 support in the near term. Ethereum Price Corrects Gains Ethereum price started a fresh increase after it found support near the $2,550 level, beating Bitcoin. ETH price was able to clear the $2,650 and $2,720 resistance levels. The bulls pushed the price above $2,800. ETH even spiked above $2,850. A high was formed at $2,880 and the price is now correcting gains. There was a move below the 23.6% Fib retracement level of the upward move from the $2,483 swing low to the $2,880 high. Besides, there was a break below a key bullish trend line forming with support at $2,800 on the hourly chart of ETH/USD. Ethereum price is now trading above $2,750 and the 100-hourly Simple Moving Average. On the upside, the price could face resistance near the $2,800 level. The next key resistance is near the $2,840 level. The first major resistance is near the $2,880 level. A clear move above the $2,880 resistance might send the price toward the $2,920 resistance. An upside break above the $2,920 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $3,000 resistance zone or even $3,120 in the near term. More Losses In ETH? If Ethereum fails to clear the $2,820 resistance, it could start a fresh decline. Initial support on the downside is near the $2,755 level. The first major support sits near the $2,680 zone and the 50% Fib retracement level of the upward move from the $2,483 swing low to the $2,880 high. A clear move below the $2,680 support might push the price toward the $2,620 support. Any more losses might send the price toward the $2,550 support level in the near term. The next key support sits at $2,500. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,680 Major Resistance Level – $2,880"
    },
    {
      "title": "Solana Bubble Maps Turn Neutral – Is This The Setup For A SOL Summer Rally?",
      "link": "https://www.newsbtc.com/news/solana/solana-bubble-maps-turn-neutral-is-this-the-setup-for-a-sol-summer-rally/",
      "summary": "Solana (SOL) has surged 6.6% over the past week, raising hopes among holders that the digital asset may be on the cusp of a significant rally &#8211; one that could potentially propel it to new all-time highs (ATH). A combination of strengthening fundamentals and bullish technical signals supports this optimistic outlook. Solana Primed For A Spectacular Summer? According to a recent CryptoQuant Quicktake post by contributor burakkesmeci, SOL is currently undergoing a cooling phase on both the spot and futures Bubble Maps. The analyst shared the following chart to highlight this cooling period. For the uninitiated, a bubble map visualizes volume data across exchanges, with each bubble representing trading activity for a specific pair or platform. The size of the bubble indicates the total volume, while the color shows the intensity or change in that volume &#8211; such as cooling (green), neutral (gray), or overheating (red). Related Reading: Solana Key Indicator Flashes Buy Signal On Daily Chart – Rally Ahead? At first glance, lower trading volume might seem like fading momentum. However, the CryptoQuant analyst suggests this deceleration could be a strategic accumulation phase, particularly as a potential catalyst looms on the horizon. Many in the crypto community are expecting the US Securities and Exchange Commission (SEC) to approve the first Solana exchange-traded fund (ETF) in the coming weeks. In an X post published today, Eric Balchunas, Senior ETF Analyst at Bloomberg, said Solana could lead a “potential altcoin ETF summer.” Meanwhile, predictions platform Polymarket currently places a 91% probability on a Solana ETF being approved in 2025 &#8211; the highest odds recorded since January of this year. Most speculators expect a SOL ETF to go live by July 2025. From a technical standpoint, things are also looking encouraging. In a recent X post, crypto analyst Ali Martinez remarked that if SOL breaks above the $200 mark, it could kickstart a 5x to 10x bull run. Martinez shared the following SOL weekly chart, which shows the digital asset forming a bullish Cup and Handle pattern. While the “cup” portion has already been completed, the emerging “handle” suggests the potential for significant price appreciation &#8211; possibly pushing SOL beyond $2,000. SOL Showing Promise But Take Caution Despite widespread optimism, some indicators urge caution. On-chain data recently revealed a large movement of dormant SOL coins, which has raised concerns about increased selling pressure in the near term. Related Reading: Solana Horizontal Support Under Pressure – Bearish Target At $142 That said, a considerable number of analysts believe that SOL could surpass its current ATH of $293 later this year. At press time, SOL trades at $167.30, up 3.5% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant, X, and TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "F Street Announced Goal Of Accumulating $10 Million In Bitcoin",
      "link": "https://bitcoinmagazine.com/news/f-street-announced-goal-of-accumulating-10-million-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/F-Street-Announced-Goal-Of-Accumulating-10-Million-In-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/f-street-announced-goal-of-accumulating-10-million-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>F Street plans adding Bitcoin to its corporate treasury and wants to establish public proof of reserves for stakeholders. </p> <p>"
    },
    {
      "title": "Bitdeer Mined 196 Bitcoin Worth Over $21 Million In May",
      "link": "https://bitcoinmagazine.com/news/bitdeer-mined-196-bitcoin-worth-over-21-million-in-may",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitdeer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-mined-196-bitcoin-worth-over-21-million-in-may\" rel=\"nofollow\"> </a></p> <p>Bitdeer Technologies Group, a global leader in Bitcoin mining and infrastructure, has released its unaudited operational update for May 2025, highlighting robust expansion in hashrate capacity, ongoing infrastructure development, and an entrance into AI services.&#160; “In May 2025, we continued to deploy our SEALMINER mining rigs to our sites in Texas, U.S., Norway, and Bhutan, [&#8230;]</p> <p>"
    },
    {
      "title": "Skull, $5 million; Banana, $6 million; Freedom, Priceless",
      "link": "https://bitcoinmagazine.com/culture/skull-5-million-banana-6-million-freedom-priceless",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/result_banana.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/skull-5-million-banana-6-million-freedom-priceless\" rel=\"nofollow\"> </a></p> <p>Freedom. Decentralization. Unity.<br /> And without a certificate of authenticity, all Justin Sun gifted Ross Ulbricht was a 1/1 print of the original art.</p> <p>"
    },
    {
      "title": "The CLARITY Act Heads To House Floor For Vote With Protection For Noncustodial Tools Intact",
      "link": "https://bitcoinmagazine.com/news/the-clarity-act-heads-to-house-floor-for-vote-with-protection-for-noncustodial-tools-intact",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Capitol-Building-CLARITY-Act.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-clarity-act-heads-to-house-floor-for-vote-with-protection-for-noncustodial-tools-intact\" rel=\"nofollow\"> </a></p> <p>The section of the CLARITY Act (H.R. 3633) that protects Bitcoin and crypto users’ right to use noncustodial wallets as well as developers’ right to create such tools without being subject to The Bank Secrecy Act (BSA) will remain in the bill as it gets voted on in the House.</p> <p>"
    },
    {
      "title": "Stripe Acquires Startup Privy To Expand Bitcoin Strategy",
      "link": "https://bitcoinmagazine.com/news/stripe-acquires-startup-privy-to-expand-bitcoin-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Stripe-Acquires-Startup-Privy-To-Expand-Bitcoin-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/stripe-acquires-startup-privy-to-expand-bitcoin-strategy\" rel=\"nofollow\"> </a></p> <p>Privy joins Stripe to build a Bitcoin and crypto wallet infrastructure. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Startup DIMO Launches DePIN Venture in Japan to Help Automakers Monetize Vehicle Data",
      "link": "https://decrypt.co/324771/startup-dimo-launches-depin-venture-in-japan-to-help-automakers-monetize-vehicle-data",
      "summary": "The decentralized physical infrastructure platform wants to scale and improve data infrastructure for vehicles in Japan."
    },
    {
      "title": "Disney, Universal, DreamWorks Sue Midjourney, Call It a 'Bottomless Pit of Plagiarism'",
      "link": "https://decrypt.co/324768/disney-universal-dreamworks-sue-midjourney",
      "summary": "Hollywood studios are accusing Midjourney of rampant copyright infringement, citing unauthorized use of iconic characters."
    },
    {
      "title": "Bitcoin Miner Bitdeer Boosts BTC Production as Mining Industry Rebounds",
      "link": "https://decrypt.co/324710/bitcoin-miner-bitdeer-boosts-btc-production-may",
      "summary": "Bitcoin miner Bitdeer reported an increase in BTC mined in May, an 18% jump from April, as the industry recovers from a tough spell."
    },
    {
      "title": "Alleged NYC Bitcoin Kidnappers Plead Not Guilty, Claim Accuser Was 'Laughing and Smiling'",
      "link": "https://decrypt.co/324714/alleged-nyc-bitcoin-kidnappers-plead-not-guilty",
      "summary": "The two men charged with kidnapping a Bitcoin investor in NYC have pleaded not guilty as wild new details emerge in a court appearance."
    },
    {
      "title": "ChatGPT Is Eating the Internet: OpenAI Commands 80% of AI Market",
      "link": "https://decrypt.co/324737/chatgpt-eating-internet-openai-dominates-ai-market",
      "summary": "A new Similarweb report reveals that ChatGPT commands 5.5 billion monthly visits while competitors struggle to make a fraction of that."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Why is Bitcoin down today? US-China trade deal fails to impress, Israel-Iran conflict threat rises",
      "link": "https://cryptobriefing.com/bitcoin-down-us-china-trade-tensions/",
      "summary": "<p>Geopolitical tensions and unimpressive trade deals highlight Bitcoin's vulnerability to global instability, affecting its market resilience.</p> <p>"
    },
    {
      "title": "Fintech giant Stripe to acquire crypto wallet provider Privy following $1.1B stablecoin deal",
      "link": "https://cryptobriefing.com/stripe-acquires-privy-enhancing-services/",
      "summary": "<p>Stripe's acquisition of Privy signals a significant step towards enhancing global digital financial infrastructure and streamlining crypto adoption.</p> <p>"
    },
    {
      "title": "Bitcoin rally could resume as tariff fears ease and CPI cools, says analyst",
      "link": "https://cryptobriefing.com/bitcoin-rally-potential-inflation-tariff-ease/",
      "summary": "<p>Eased tariff tensions and cooling inflation may boost Bitcoin, potentially prompting Fed rate cuts and renewed retail crypto interest.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Interactive Strength plans to invest $500M in Fetch.ai’s FET token to build an AI-focused crypto treasury",
      "link": "https://cryptobriefing.com/ai-focused-crypto-treasury-investment/",
      "summary": "<p>This move highlights a growing trend of public companies investing in AI-driven digital assets, potentially reshaping corporate finance.</p> <p>"
    },
    {
      "title": "Pro-Bitcoin Scott Bessent emerges as candidate for next Fed chair",
      "link": "https://cryptobriefing.com/fed-chair-successor-bessent-powell/",
      "summary": "<p>Bessent's potential Fed chair candidacy highlights a shift towards integrating cryptocurrency perspectives in U.S. monetary policy.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Optimism: Examining if OP can surpass $0.72 and race to…",
      "link": "https://ambcrypto.com/optimism-examining-if-op-can-surpass-0-72-and-race-to/",
      "summary": "<img alt=\"Optimism rallies 20% after testing local support, but faces stiff opposition at $0.72\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Optimism-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The buying pressure over the past two days has been encouraging, but an OP rally past $0.72-$0.74 was not guaranteed."
    },
    {
      "title": "Algorand’s 66% transaction surge and low volatility: Is ALGO set to soar?",
      "link": "https://ambcrypto.com/algorands-66-transaction-surge-and-low-volatility-is-algo-set-to-soar/",
      "summary": "<img alt=\"ALGO volatility dips as usage spikes: Breakout ahead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-97-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Algorand tests descending resistance as usage grows and whales accumulate, hinting at breakout potential."
    },
    {
      "title": "ONDO’s TVL hit new ATH with Ripple partnership – Will prices follow?",
      "link": "https://ambcrypto.com/ondos-tvl-hit-new-ath-with-ripple-partnership-will-prices-follow/",
      "summary": "<img alt=\"ONDO&#039;s TVL hit new ATH with Ripple partnership - Will prices follow?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-6.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite the ONDO x Ripple partnership, the two cryptocurrencies did not react instantly."
    },
    {
      "title": "Bitcoin: Why should you buy BTC before the CPI report is released?",
      "link": "https://ambcrypto.com/bitcoin-why-should-you-buy-btc-before-the-cpi-report-is-released/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-15.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin's volatility has dropped to 200 ATR as investors wait for U.S. CPI data."
    },
    {
      "title": "Russia moves to seize crypto, slap fines on illegal miners under new law",
      "link": "https://ambcrypto.com/russia-moves-to-seize-crypto-slap-fines-on-illegal-miners-under-new-law/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"864\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Russia-Moves-to-Seize-Crypto.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1536\" />New rules might redefine what counts as ‘illegal’ in crypto."
    }
  ]
}