{
  "CoinDesk": [
    {
      "title": "Jack Ma's Ant International Seeks Stablecoin Licenses in Hong Kong, Singapore: Bloomberg",
      "link": "https://www.coindesk.com/policy/2025/06/12/jack-mas-ant-international-seeks-stablecoin-licenses-in-hong-kong-singapore-bloomberg",
      "summary": ""
    },
    {
      "title": "Mercurity Fintech Plans $800M Bitcoin Treasury, Eyes Russell 2000 Inclusion",
      "link": "https://www.coindesk.com/markets/2025/06/12/mercurity-fintech-plans-800m-bitcoin-treasury-eyes-russell-2000-inclusion",
      "summary": ""
    },
    {
      "title": "Strong Uptake at 10-Year U.S. Debt Sale Eases Demand Concerns, 30-Year Sale's Up Next",
      "link": "https://www.coindesk.com/markets/2025/06/12/strong-uptake-at-10-year-u-s-debt-sale-eases-demand-concerns-30-year-sale-s-up-next",
      "summary": ""
    },
    {
      "title": "Bitcoin-Based Stablecoin Network Plasma Raises Deposit Cap to $1B, Gets Filled in 30 Minutes",
      "link": "https://www.coindesk.com/markets/2025/06/12/bitcoin-based-stablecoin-network-plasma-raises-deposit-cap-to-1b-gets-filled-in-30-minutes",
      "summary": ""
    },
    {
      "title": "XRP Slides 4% After Failing to Break $2.33 Resistance Level Thrice",
      "link": "https://www.coindesk.com/markets/2025/06/12/xrp-slides-4-after-failing-to-break-233-resistance-level-thrice",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Jack Ma’s Ant International eyes stablecoin licenses in Singapore, Hong Kong",
      "link": "https://cointelegraph.com/news/jack-ma-ant-group-stablecoin-license-for-singapore-hong-kong?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NGE3OTQtNzc3Mi03YjVhLTg3NGUtYzE0OTQwNzZjMDM3.jpg\" /></p><p>Ant International plans to apply for stablecoin licenses in Hong Kong and Singapore, signaling growing fintech interest in regulated crypto payment systems, Bloomberg reported.</p>"
    },
    {
      "title": "Can Bitcoin fix Pakistan’s energy problem? The 2,000 megawatt mining strategy explained",
      "link": "https://cointelegraph.com/explained/can-bitcoin-fix-pakistans-energy-problem-the-2-000-megawatt-mining-strategy-explained?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9iYWUxZTFiMDVkMDBjNDI5NTRiYzNiMDc3NmU4ZmExOS5qcGc=.jpg\" /></p><p>Can Bitcoin solve the energy crisis in Pakistan? 2,000 MW Mining Plan</p>"
    },
    {
      "title": "Crypto has killed the weekend: Hedge funds quietly scramble to adapt",
      "link": "https://cointelegraph.com/news/hedge-funds-hire-weekend-crypto-traders?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGNjMjUtYWJjNy03MmMyLWFiNmMtNzgxM2YwNzgyNjE0.jpg\" /></p><p>Hedge funds like Qube, Virtu and Jump are hiring weekend crypto traders as traditional finance adapts to nonstop digital asset markets.</p>"
    },
    {
      "title": "Why is Bitcoin price down today?",
      "link": "https://cointelegraph.com/news/why-is-bitcoin-price-down-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvZDM2MDViNmItMGVmZi00NmY2LWE0NmYtYjE1ZWMzYjNlY2I=.jpg\" /></p><p>Bitcoin is down 1.7% over the last 24 hours after running into resistance above the $108,000 level, among other drivers that are weakening bullish momentum.</p>"
    },
    {
      "title": "Bitcoin must avoid sub-$100K wick as traders digest 55% China tariffs",
      "link": "https://cointelegraph.com/news/bitcoin-must-avoid-sub-100k-wick-traders-55-china-tariffs?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2RmMzUtOTlkYi03ZTk5LWIzZWQtNDM0ZTFhYzQyZjM0.jpg\" /></p><p>BTC price requirements are clear as consolidation below all-time highs continues. Can Bitcoin bulls stick to the plan and avoid falling back below $100,000?</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Solana hitting 1M TPS, memecoin rug pull seizures to put SOL on US digital asset stockpile radar",
      "link": "https://cryptoslate.com/solana-hitting-1m-tps-memecoin-rug-pull-seizures-can-put-sol-on-us-digital-asset-stockpile-radar/",
      "summary": "<p>While Solana is up just 5% over the past year, global sentiment around the altcoin is bullish due to its potential technical capabilities to outperform its main rivals in performance. Solana&#8217;s Firedancer validator client, expected to leave testnet in 2025, is demonstrating transaction-per-second capabilities exceeding one million in test environments, a development aimed at solving [&#8230;]</p> <p>"
    },
    {
      "title": "Ripple CEO Brad Garlinghouse sees XRP capturing 14% of SWIFT’s market in five years",
      "link": "https://cryptoslate.com/ripple-ceo-brad-garlinghouse-sees-xrp-capturing-14-of-swifts-market-in-five-years/",
      "summary": "<p>Ripple CEO Brad Garlinghouse believes XRP could soon take a meaningful slice of the global payments sector. In a recent video shared on X, Garlinghouse projected that XRP might capture as much as 14% of the volume currently processed through Society for Worldwide Interbank Financial Telecommunication (SWIFT) within the next five years. He argued that [&#8230;]</p> <p>"
    },
    {
      "title": "Bitwise CIO calls Bitcoin ‘best horse in the race’ to explain accelerated corporate buys",
      "link": "https://cryptoslate.com/bitwise-cio-calls-bitcoin-best-horse-in-the-race-to-explain-accelerated-corporate-buys/",
      "summary": "<p>Bitwise CIO Matt Hougan said the &#8220;megatrend&#8221; of public companies adding Bitcoin (BTC) to treasury reserves will continue accelerating as the movement is still in its early stages. Hougan made the statement during a June 10 interview on CNBC, where he highlighted that 79 listed firms now hold roughly $57 billion worth of Bitcoin as of [&#8230;]</p> <p>"
    },
    {
      "title": "GameStop’s plan to raise another $1.75B fuels speculation of further Bitcoin acquisitions",
      "link": "https://cryptoslate.com/gamestops-plan-to-raise-another-1-75b-fuels-speculation-of-further-bitcoin-acquisitions/",
      "summary": "<p>GameStop Corp. plans to raise $1.75 billion through a private offering of convertible senior notes due 2032, as the company explores digital asset investments, including potential Bitcoin acquisitions, under its updated investment strategy, according to a June 11 press release. The zero-coupon notes will be offered to qualified institutional buyers under Rule 144A of the [&#8230;]</p> <p>"
    },
    {
      "title": "Bank of America eyes dollar-pegged stablecoin amid Senate fast-tracking GENIUS Act",
      "link": "https://cryptoslate.com/bank-of-america-eyes-dollar-pegged-stablecoin-amid-senate-fast-tracking-genius-act/",
      "summary": "<p>Bank of America CEO Brian Moynihan confirmed the lender plans to issue a dollar-pegged stablecoin and is working on an internal build conducted alongside other industry participants, Reuters reported on June 11. However, Moynihan added that any progress in a potential launch would be contingent on forthcoming federal rules. He also told investors the bank [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Risks Pullback To $105,000 After Facing Rejection Above $110,000",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-risks-pullback-105000/",
      "summary": "Bitcoin has faced a lot of resistance above $110,000, suggesting the bears are trying to keep the digital asset from reclaiming its all-time high levels. This has been obvious with multiple rejections above $110,000 over the last few days, while the bulls have held support above $108,000. This trend plays into an analysis published by crypto analyst TehThomas, who had forecasted the rejection from $110,000. But what’s more interesting is where Thomas sees the price going from here. Bitcoin Could Drop For Shallow Pullback In the analysis, Thomas explained what is happening with the Bitcoin price and why the pullback could happen. This begins with the breakout after falling toward $100,000 and then bouncing back again. The digital asset was able to quickly clear multiple fair value gaps on the 4-hour timeframes to claim its spot above $110,000. Related Reading: Positioning For Altcoin Season: Analyst Reveals When To Buy As Bitcoin Dominance Rises The crypto analyst explains that this move has triggered a shift in the sentiment toward the positive, and this has been followed by rising volumes, as well as impulsive candles. In all, this is quite bullish for the cryptocurrency. However, there is still a risk of a price decline from here. After filling multiple fair value gaps with strength, the crypto analyst believes this has set a precedent for the Bitcoin price. He expects the same pattern to play out for the cryptocurrency, which includes a rapid rise before a shallow pullback, and then a continuation from there. BTC Pullback Into $104,000 Territory The Bitcoin price recovery above $110,000 seems to have created a fair value gap below $107,000, which the crypto analyst believes will need to be filled. If this is the case, then it is possible that the price rally will not continue until this condition is fulfilled. Nevertheless, a pullback to the level would not be bearish, but rather provide a bounce-off point for the price recovery. Related Reading: XRP Price: Analyst Says Expect Biblical Move Before Historic Crash – Here Are The Targets Thomas referred to this trend as “a classic breakout-fill-continue sequence”, and the next thing in line is to fill the fair value gap. According to the shared chart, the crypto analyst sees the pullback taking the price back down below $105,000 and into the $104,000 territory before its next bounce. This would mean a 5% pullback, and going by the trends from this year so far, something that would be bad for altcoins. However, the conclusion remains that Bitcoin is still bullish from here. Once the fair value gap is filled, a strong push upward is expected, possibly toward new all-time highs. “I’m expecting a controlled retracement to fill the new 4H imbalance, after which price could continue pushing toward the major resistance area,” the analyst said. “The momentum is clean and structured—until that changes, continuation remains the more likely path.” Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Options Traders Expect Quiet—But On-Chain Data Suggests Chaos",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-options-traders-expect-on-chain-chaos/",
      "summary": "The Bitcoin Options traders have been pricing in low implied volatility, but on-chain data shows a setup ripe for amplified price swings. Bitcoin Options ATM IV Has Been Trending Lower In its latest weekly report, the analytics firm Glassnode has talked about how the volatility risk associated with Bitcoin looks from the perspective of on-chain analysis. Related Reading: Ethereum To $3,400? On-Chain Shows No Big Hurdles Ahead The indicator shared by Glassnode is the Realized Supply Density, which tells us about how concentrated the cryptocurrency&#8217;s supply is around the current spot price. When the value of this metric is high, it means the investors have participated in a large amount of buying at or near the asset&#8217;s latest price. &#8220;In such environments, even modest price fluctuations can affect a broad swath of investors, often amplifying market sensitivity and, in turn, volatility potential,&#8221; explains the analytics firm. Below is the chart for the indicator shared by in the report. As is visible in the graph, the Bitcoin Realized Supply Density has gone through an uplift during the past few weeks, which suggests accumulation has taken place around the current spot price. &#8220;This concentration raises the probability of outsized reactions to price movements, increasing volatility risk in the near term,&#8221; notes Glassnode. While on-chain data may hint that volatility could go up in the future, it would appear the traders on the Options market don&#8217;t quite think the same, as the At-The-Money Implied Volatility (ATM IV) has been going down. The IV is a metric that represents the traders&#8217; expectations of how volatile Bitcoin will be over a given period, based on the pricing of Options contracts. The ATM version of the indicator specifically calculates this expectation based on Options closest to the latest spot price. Related Reading: Bitcoin Back At $109,000, But HODLer Profit-Taking Down 89% Here is a chart that shows the trend in the Bitcoin Options ATM IV across different expiration timeframes: From the above graph, it&#8217;s apparent that the Bitcoin Options ATM IV has been going down for all major tenors, an indication that the traders don&#8217;t expect high volatility for the cryptocurrency in the near future. &#8220;Historically, such complacency in volatility pricing has often served as a counter-trend signal, preceding periods of heightened volatility,&#8221; says the analytics firm. With on-chain data suggesting increased volatility risk and this signal forming at the same time, it now remains to be seen how Bitcoin would develop in the coming days. BTC Price At the time of writing, Bitcoin is trading around $108,800, up more than 3.5% in the last week. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Ethereum Prepares For Massive Run After $2,800 Reclaim – ‘Up Only’ Ahead?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-prepares-for-massive-run-after-2800-reclaim-up-only-ahead/",
      "summary": "As Ethereum (ETH) attempts to reclaim its January 2025 price range, the cryptocurrency has been holding a recently recovered level, leading some analysts to suggest another 10% surge before new highs. Related Reading: Bitcoin Eyes New Highs As Price Retests $109,000, But Analyst Warns Of Potential Pullback Ethereum Breakout Eyes $3,100 Ethereum has reclaimed the key $2,800 barrier for the first time since February, nearing the $2,900 level on Wednesday morning. The King of Altcoins had been trading between the $2,475-$2,680 range since its May breakout, unable to turn the range’s upper boundary into support. During last week’s retracement, ETH dropped to the $2,400 support before bouncing over the weekend. The crypto market’s recovery saw Ethereum surge toward the key resistance, finally breaking past it at the start of the week and hitting a three-month high of $2,879 today. Following this performance, Analyst Carl Runefelt from The Moon Show noted that the cryptocurrency had broken out of an ascending triangle formation and now targets the $3,100 resistance. The analyst previously highlighted ETH’s triangle pattern, which began forming at the start of last month’s recovery rally. During that period, the price compressed between the support and resistance lines, with the latter situated around the $2,700 mark. He forecasted a 15% surge toward the $3,100 level if the altcoin reclaimed the crucial resistance level. Based on this, Ethereum could climb another 10.7% if it holds its current range. Runefelt also pointed out another bullish formation in ETH’s trading pair against Bitcoin (BTC). According to the ETH/BTC chart, Ethereum also formed a bullish pennant pattern during the May rally. Amid this week’s recovery, the cryptocurrency has broken out of the formation’s upper boundary, eyeing a 30% surge toward the 0.03300 mark. ETH To Repeat History? Market Watcher Kaleo highlighted the resemblance between ETH’s performance between 2020 and 2025. According to the analyst, there are “a lot of similarities on the chart to where we are now vs. where we were in 2020.” As he explained, in the Spring of 2020, Ethereum experienced a major sell-off, fueled by the COVID-19 crash, which sent its price below a key higher timeframe (HFT) support. However, once the ascending trendline was reclaimed as support, ETH was “up only for the next 20 months.” Kaleo detailed the recent sell-off, caused by the Trump Tariffs scare, sent the altcoin below its multi-year ascending support trendline, adding that “ETH is currently on the verge of reclaiming that line.” Related Reading: Solana Triangle Formation Breakout Targets Rally To $164 – Is A Recovery Around The Corner? The analyst suggested that if history repeats, investors could see “another great ETH bull run and accompanying alt season.” Meanwhile, analyst DonAlt affirmed that ETH’s chart looks “pretty good” amid its HTF range reclaim. To him, a new all-time high (ATH) is likely if the $3,800 resistance is reclaimed, while the rally’s invalidation level is a close below the $2,200 mark. As of this writing, ETH trades at $2,803, a 6.7% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Bitcoin Nears All-Time High as Whale Behavior Suggests Further Upside",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-nears-all-time-high-as-whale-behavior-suggests-further-upside/",
      "summary": "Bitcoin continues to show signs of recovery as its price rebounds from a brief correction last week. At the time of writing, the crypto is trading at $109,693, reflecting a 0.4% increase over the past 24 hours. Despite this upward movement, the current price remains roughly 2% below its all-time high of over $111,000, recorded last month. This ongoing strength in price performance has been accompanied by notable on-chain signals, particularly from large holders. CryptoQuant contributor Crypto Dan recently analyzed the current market structure and behavior of Bitcoin whales. Related Reading: Bitcoin Recovers From $100K Dip While On-Chain Data Shows Rising Miner Activity Bitcoin Whale Behavior Suggests Further Upside In his latest analysis, Dan observed that despite Bitcoin hovering near record levels, there is little evidence of the profit-taking behavior typically observed during previous market tops. According to him, whales are not engaging in mass selloffs, suggesting that these investors expect the rally to continue. Dan emphasized that these large holders are likely waiting for more pronounced market euphoria and higher valuations before initiating substantial sell activity, a pattern often seen near the final stages of a bull market. Bitcoin &#8211; Near All-Time Highs but No Profit-Taking “Whales show no intention of taking profits at this price level and are likely to wait for higher prices, where significant market overheating and a bubble form, before making their moves.” – By @DanCoinInvestor pic.twitter.com/W5PtrHo0Q5 — CryptoQuant.com (@cryptoquant_com) June 11, 2025 Whale Exchange Activity Indicates Similar Move Further reinforcing the current sentiment, another CryptoQuant analyst, Darkfost, highlighted a significant trend in Binance whale behavior. According to Darkfost, historical data shows that when Bitcoin approaches or breaches its all-time high, there is typically a sharp rise in exchange inflows, driven by whales seeking to take profits. This pattern was visible during earlier cycle peaks, where inflows reached $5.3 billion in early 2024, and even higher levels of $8.45 billion and $7.24 billion in previous cycles. A strong bullish signal from Binance whales! “Today, however, inflows are just around $3 billion and are continuing to decline, suggesting that these whales prefer to keep holding.” – By @Darkfost_Coc Full analysis ⤵️https://t.co/T1FlLnM4nK pic.twitter.com/O3XrqhAyEc — CryptoQuant.com (@cryptoquant_com) June 11, 2025 In contrast, recent inflows to Binance remain substantially lower. Darkfost reports current inflows hovering around $3 billion, and more importantly, on a declining trajectory. This divergence from historical patterns suggests that whales are refraining from selling at current levels. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Their reduced activity implies an expectation that higher prices may lie ahead, and that they are positioning for potentially greater returns later in the cycle. This restraint from large holders is seen as an important signal, especially given the influence whale movements can have on market liquidity and price action. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin",
      "link": "https://www.newsbtc.com/altcoin/trx-price-up-as-tron-rolls-out-the-red-carpet-for-trump-backed-stablecoin/",
      "summary": "Tron’s blockchain just added a USD1 stablecoin from World Liberty Financial Inc. That move put the spotlight back on TRX. And traders are paying attention to what comes next. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Significant Price Movement According to trading data, TRX climbed 6% on Tuesday. It broke above the $0.2875 level on the daily chart before hitting resistance at $0.2980. A clean break past that hurdle could send the token toward $0.3230, the 50% Fibonacci retracement level. Currently, TRX trades around $0.2920, sitting between support at $0.2808 and the 23.6% Fib mark of $0.2645. The first USD1 has officially been minted on TRON — a small step for USD1, a giant leap for stablecoins!https://t.co/KMLg8NcXw8 — H.E. Justin Sun 🍌 (@justinsuntron) June 11, 2025 High-Profile Stablecoin Launch Based on reports from World Liberty Financial Inc., the new USD1 stablecoin is now live on Tron. The issuer has ties to US President Donald Trump, and Justin Sun—Tron’s founder and the largest holder of the Trump Token meme coin—called the launch a “giant leap for stablecoins.” Sun also joined a White House dinner for top Trump Token holders. This link to big names has drawn fresh eyes to Tron’s ecosystem. On-Chain Growth Signals According to DeFiLlama, the total value locked on Tron reached over $5 billion. On June 6, the network saw 4.50 million returning user addresses. Those stats suggest people keep coming back to DeFi apps on Tron, but it’s worth watching whether those funds stay in place or chase higher yields on other chains. Bullish Bets in Derivatives Based on CoinGlass data, TRX derivatives open interest rose by 8.25% over the past 24 hours to $329 million. The weighted funding rate open interest rose to 0.0098%, indicative that bullish long positions are greater than shorts. Short liquidations in the past day were almost double that of longs, which settled a bearish bet wave. Technical analysis supports this positive perspective. The RSI on the daily chart is inching up to the overbought region, indicating heightened buying pressure. A recent MACD crossover drove histogram bars into positive territory, which means momentum has favored the buyers. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Meanwhile, traders will keep a close eye on Bitcoin’s moves too. A pullback there could drag altcoins lower, while a fresh rally could lift TRX even more. For now, the combination of a big-name stablecoin launch, rising TVL, swelling open interest and positive technical signals gives Tron fans reason to watch for a potential breakout. Featured image from Getty Images, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "F Street Announced Goal Of Accumulating $10 Million In Bitcoin",
      "link": "https://bitcoinmagazine.com/news/f-street-announced-goal-of-accumulating-10-million-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/F-Street-Announced-Goal-Of-Accumulating-10-Million-In-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/f-street-announced-goal-of-accumulating-10-million-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>F Street plans adding Bitcoin to its corporate treasury and wants to establish public proof of reserves for stakeholders. </p> <p>"
    },
    {
      "title": "Bitdeer Mined 196 Bitcoin Worth Over $21 Million In May",
      "link": "https://bitcoinmagazine.com/news/bitdeer-mined-196-bitcoin-worth-over-21-million-in-may",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitdeer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-mined-196-bitcoin-worth-over-21-million-in-may\" rel=\"nofollow\"> </a></p> <p>Bitdeer Technologies Group, a global leader in Bitcoin mining and infrastructure, has released its unaudited operational update for May 2025, highlighting robust expansion in hashrate capacity, ongoing infrastructure development, and an entrance into AI services.&#160; “In May 2025, we continued to deploy our SEALMINER mining rigs to our sites in Texas, U.S., Norway, and Bhutan, [&#8230;]</p> <p>"
    },
    {
      "title": "Skull, $5 million; Banana, $6 million; Freedom, Priceless",
      "link": "https://bitcoinmagazine.com/culture/skull-5-million-banana-6-million-freedom-priceless",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/result_banana.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/skull-5-million-banana-6-million-freedom-priceless\" rel=\"nofollow\"> </a></p> <p>Freedom. Decentralization. Unity.<br /> And without a certificate of authenticity, all Justin Sun gifted Ross Ulbricht was a 1/1 print of the original art.</p> <p>"
    },
    {
      "title": "The CLARITY Act Heads To House Floor For Vote With Protection For Noncustodial Tools Intact",
      "link": "https://bitcoinmagazine.com/news/the-clarity-act-heads-to-house-floor-for-vote-with-protection-for-noncustodial-tools-intact",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Capitol-Building-CLARITY-Act.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-clarity-act-heads-to-house-floor-for-vote-with-protection-for-noncustodial-tools-intact\" rel=\"nofollow\"> </a></p> <p>The section of the CLARITY Act (H.R. 3633) that protects Bitcoin and crypto users’ right to use noncustodial wallets as well as developers’ right to create such tools without being subject to The Bank Secrecy Act (BSA) will remain in the bill as it gets voted on in the House.</p> <p>"
    },
    {
      "title": "Stripe Acquires Startup Privy To Expand Bitcoin Strategy",
      "link": "https://bitcoinmagazine.com/news/stripe-acquires-startup-privy-to-expand-bitcoin-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Stripe-Acquires-Startup-Privy-To-Expand-Bitcoin-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/stripe-acquires-startup-privy-to-expand-bitcoin-strategy\" rel=\"nofollow\"> </a></p> <p>Privy joins Stripe to build a Bitcoin and crypto wallet infrastructure. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Philippines Enacts Sweeping Crypto Rules, Mandates Licensing and Capital Requirements",
      "link": "https://decrypt.co/324797/philippines-crypto-rules-licensing-capital-requirements",
      "summary": "The new SEC framework imposes minimum capital, local incorporation, and strict data rules on crypto firms operating in the Philippines."
    },
    {
      "title": "US Senators Probe Stablecoin Plans by Facebook Parent Meta",
      "link": "https://decrypt.co/324791/us-senators-probe-stablecoin-plans-meta",
      "summary": "Senators Warren and Blumenthal are demanding answers from Meta over renewed stablecoin plans, warning of risks to competition and privacy."
    },
    {
      "title": "Australian Woman Hit With Ten-Year Ban Over $9.6 Million Crypto Scheme",
      "link": "https://decrypt.co/324774/australian-woman-ten-year-ban-9-6-million-crypto-scheme",
      "summary": "ASIC has banned Glenda Rogan for misleading conduct after she allegedly transfered client funds into blacklisted crypto platform."
    },
    {
      "title": "Startup DIMO Launches DePIN Venture in Japan to Help Automakers Monetize Vehicle Data",
      "link": "https://decrypt.co/324771/startup-dimo-launches-depin-venture-in-japan-to-help-automakers-monetize-vehicle-data",
      "summary": "The decentralized physical infrastructure platform wants to scale and improve data infrastructure for vehicles in Japan."
    },
    {
      "title": "Disney, Universal, DreamWorks Sue Midjourney, Call It a 'Bottomless Pit of Plagiarism'",
      "link": "https://decrypt.co/324768/disney-universal-dreamworks-sue-midjourney",
      "summary": "Hollywood studios are accusing Midjourney of rampant copyright infringement, citing unauthorized use of iconic characters."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Why is Bitcoin down today? US-China trade deal fails to impress, Israel-Iran conflict threat rises",
      "link": "https://cryptobriefing.com/bitcoin-down-us-china-trade-tensions/",
      "summary": "<p>Geopolitical tensions and unimpressive trade deals highlight Bitcoin's vulnerability to global instability, affecting its market resilience.</p> <p>"
    },
    {
      "title": "Fintech giant Stripe to acquire crypto wallet provider Privy following $1.1B stablecoin deal",
      "link": "https://cryptobriefing.com/stripe-acquires-privy-enhancing-services/",
      "summary": "<p>Stripe's acquisition of Privy signals a significant step towards enhancing global digital financial infrastructure and streamlining crypto adoption.</p> <p>"
    },
    {
      "title": "Bitcoin rally could resume as tariff fears ease and CPI cools, says analyst",
      "link": "https://cryptobriefing.com/bitcoin-rally-potential-inflation-tariff-ease/",
      "summary": "<p>Eased tariff tensions and cooling inflation may boost Bitcoin, potentially prompting Fed rate cuts and renewed retail crypto interest.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Interactive Strength plans to invest $500M in Fetch.ai’s FET token to build an AI-focused crypto treasury",
      "link": "https://cryptobriefing.com/ai-focused-crypto-treasury-investment/",
      "summary": "<p>This move highlights a growing trend of public companies investing in AI-driven digital assets, potentially reshaping corporate finance.</p> <p>"
    },
    {
      "title": "Pro-Bitcoin Scott Bessent emerges as candidate for next Fed chair",
      "link": "https://cryptobriefing.com/fed-chair-successor-bessent-powell/",
      "summary": "<p>Bessent's potential Fed chair candidacy highlights a shift towards integrating cryptocurrency perspectives in U.S. monetary policy.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "XRP Ledger’s vision – Can it handle 14% of SWIFT payments by 2030?",
      "link": "https://ambcrypto.com/xrp-ledgers-vision-can-it-handle-14-of-swift-payments-by-2030/",
      "summary": "<img alt=\"Ripple XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ripple-XRP.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ripple CEO expect XRP Ledger to handle $175 trillion annual payment volume in five years."
    },
    {
      "title": "Brazil’s Bitcoin Reserve Bill passes first review – All details here",
      "link": "https://ambcrypto.com/brazils-bitcoin-reserve-bill-passes-first-review-all-details-here/",
      "summary": "<img alt=\"BTC Brazil\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_42_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Brazil backs Bitcoin reserves as ETF inflows and Japanese corporate accumulation signal renewed institutional confidence."
    },
    {
      "title": "Dogecoin: Musk apologized, DOGE reacted – You’ll want to see this!",
      "link": "https://ambcrypto.com/dogecoin-musk-apologized-doge-reacted-youll-want-to-see-this/",
      "summary": "<img alt=\"DOGE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-11T164229.036-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Dogecoin rises 2.97%, but retail investors stay cautious despite Elon Musk’s Trump-driven buzz."
    },
    {
      "title": "Ethereum beats S&P 500 and Solana—Here’s what the $65B DeFi war signals!",
      "link": "https://ambcrypto.com/ethereum-beats-sp-500-and-solana-heres-what-the-65b-defi-war-signals/",
      "summary": "<img alt=\"ETH SOL\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250611_144909_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Investors begin to ditch SOL for ETH."
    },
    {
      "title": "Bitcoin: Here are the clues for what’s beyond BTC ATH; first, look for…",
      "link": "https://ambcrypto.com/bitcoin-here-are-the-clues-for-whats-beyond-btc-ath-first-look-for/",
      "summary": "<img alt=\"Here&#039;s the on-chain data shows Bitcoin holders remain confident of further gains\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The dissimilarities to November 2024 were encouraging for Bitcoin bulls."
    }
  ]
}