{
  "CoinDesk": [
    {
      "title": "Real Estate Firm Murano to Build Bitcoin Treasury With $500M Equity Deal",
      "link": "https://www.coindesk.com/business/2025/07/07/real-estate-firm-murano-to-build-bitcoin-treasury-with-500m-equity-deal",
      "summary": ""
    },
    {
      "title": "Solana Matches All Other Chains Combined in Monthly Active Users, Artemis Data Shows",
      "link": "https://www.coindesk.com/markets/2025/07/07/solana-matches-all-other-chains-combined-in-monthly-active-users-artemis-data-shows",
      "summary": ""
    },
    {
      "title": "Nigerian Scammer Posing as Trump Ally Steve Witkoff Stole 250K in Crypto From One Political Donor",
      "link": "https://www.coindesk.com/policy/2025/07/07/nigerian-scammer-posing-as-trump-ally-steve-witkoff-stole-250k-in-crypto-from-one-political-donor",
      "summary": ""
    },
    {
      "title": "CoreWeave’s All-Stock Bid for Core Scientific Likely to Draw Shareholder Scrutiny: KBW",
      "link": "https://www.coindesk.com/markets/2025/07/07/coreweaves-all-stock-bid-for-core-scientific-likely-to-draw-shareholder-scrutiny-kbw",
      "summary": ""
    },
    {
      "title": "BitFuFu Hits 36.2 EH/s Hashrate, 728 MW Capacity in June",
      "link": "https://www.coindesk.com/markets/2025/07/07/bitfufu-hits-36-2-eh-s-hashrate-728-mw-capacity-in-june",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Two Ethereum Genesis wallets wake, move $2.9M ETH",
      "link": "https://cointelegraph.com/news/ethereum-genesis-wallets-wake-move-eth?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2U2YjUtNTUyZC03NDNkLWI2NjItZmQ5YWRiODVlYmM4.jpg\" /></p><p>Ether has appreciated nearly 90,000% in the 10 years since the two Ethereum wallets received their coins.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Casascius bar owner gets less physical, moves BTC to wallet after 13 years",
      "link": "https://cointelegraph.com/news/casascius-bar-hodling-100-btc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2U1NWEtOWFhMy03ZjlhLTg2ODAtOGFkZjEzOGY4OGEx.jpg\" /></p><p>\"This was more about staying safe than suddenly getting rich,\" said a crypto user who converted a 100-BTC Casascius bar they bought in 2012.</p>"
    },
    {
      "title": "Bitcoin data points to rally to $120K after pro BTC traders abandon their bearish bets",
      "link": "https://cointelegraph.com/news/bitcoin-data-points-to-rally-to-120k-after-pro-btc-traders-abandon-their-bearish-bets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2U2NTctNjhlZS03NTgxLTliODktMmQzMzc0YWE2ZTVl.jpg\" /></p><p>Traders are unwinding their bearish positions as Bitcoin holds strong, fueling optimism for a potential breakout to $120,000.</p>"
    },
    {
      "title": "Robinhood’s OpenAI, SpaceX private equity tokens face EU scrutiny",
      "link": "https://cointelegraph.com/news/robinhood-openai-spacex-tokens-eu-investigation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2U2NTUtZDFkMi03Nzc1LThkZGItMGRjNTdmZjNiZmM5.jpg\" /></p><p>Robinhood’s OpenAI and SpaceX tokens are controversial, but the fine print indicates that they offer indirect exposure to these companies through derivatives.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Solana’s tokenized stock market more than triples in two weeks to hit $48M",
      "link": "https://cryptoslate.com/solanas-tokenized-stock-market-more-than-triples-in-two-weeks-to-hit-48m/",
      "summary": "<p>Solana’s tokenized stock market hit $48.53 million on July 4, up more than threefold from $15.28 million on June 20, according to on-chain data tracked by rwa.xyz. Solana’s tokenized stocks capitalization expanded more than threefold in two weeks, outpacing every other tracked network during the period. Furthermore, the tokenized stock market on Solana represented 11.4% [&#8230;]</p> <p>"
    },
    {
      "title": "EU regulators probing Robinhood’s tokenized equity plans after OpenAI raises concerns",
      "link": "https://cryptoslate.com/eu-regulators-probing-robinhoods-tokenized-equity-plans-after-openai-raises-concerns/",
      "summary": "<p>Robinhood’s private equity tokens, offering exposure to tech stocks like SpaceX and OpenAI, have triggered regulatory scrutiny in Europe after OpenAI raised concerns and said that the digital assets do not represent equity ownership in the company, CNBC reported on July 7. The Bank of Lithuania, which serves as Robinhood’s primary regulator in the European [&#8230;]</p> <p>"
    },
    {
      "title": "Cloudflare’s bot paywall could ignite a tokenized content gold rush",
      "link": "https://cryptoslate.com/cloudflares-bot-paywall-could-ignite-a-tokenized-content-gold-rush/",
      "summary": "<p>The following is a guest post and opinion from Ahmad Shadid, CEO at O.XYZ. For years, a broken value exchange has defined the web. AI companies, racing to build powerful models, deployed bots to scrape a vast internet of content without permission or compensation. This practice of harvesting news, art, and data undermined the creators [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin remains stuck in $100k-$110k band as retail and whales enter potential standoff",
      "link": "https://cryptoslate.com/bitcoin-remains-stuck-in-100k-110k-band-as-retail-and-whales-enter-potential-standoff/",
      "summary": "<p>Bitcoin (BTC) continued to trade between $100,000 and $110,500 for a second consecutive week as smaller investors replaced whales on the buy side, Bitfinex Alpha reported on July 7. The report noted that BTC spent most of July so far within a 10% channel, capped by the January high of $109,590 and floored near the [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum co-founder Vitalik Buterin advocates copyleft to counter tech monopolies",
      "link": "https://cryptoslate.com/ethereum-co-founder-vitalik-buterin-advocates-copyleft-to-counter-tech-monopolies/",
      "summary": "<p>Ethereum co-founder Vitalik Buterin said he is rethinking his long-held preference for permissive software licenses, advocating for broader use of &#8220;copyleft&#8221; frameworks as open source enters what he described as a more competitive and concentrated era. In a blog post published on July 7, Buterin explained that permissive licenses such as MIT or CC0 have [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin In For Another 460% Run? This Rare Fiat Signal Just Returned",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-another-460-run-rare-fiat-signal-returned/",
      "summary": "The Global Money Supply has just hit a rare yearly growth rate of 9%. Here&#8217;s what followed for Bitcoin the last few times this signal appeared. Global Money Supply Is Currently Sharply Going Up In a new post on X, Capriole Investments founder Charles Edwards has talked about the latest trend in the Global Money Supply. The &#8220;Global Money Supply&#8221; refers to an indicator that measures the total amount of fiat supply (priced in US Dollars) issued by the top countries around the world. Related Reading: Shiba Inu Supply Most Centralized Among Top Coins—62% Held By Just 10 Whales Below is the chart shared by Edwards that shows the data for the year-on-year growth in the metric: As displayed in the graph, the metric&#8217;s value has recently been witnessing an increase, indicating that fiat supply is going up. &#8220;Central banks are flooding the market with fiat money,&#8221; notes the analyst. Currently, the indicator stands at around 9%, which corresponds to the Global Money Supply undergoing a 9% jump over the last twelve months. &#8220;This is extreme and rare,&#8221; says Edwards. In the same chart, the Capriole Investments founder has also attached the historical data of the daily Bitcoin price. Interestingly, past surges of the metric to this level all preceded significant bull rallies for the cryptocurrency over the next twelve months. More specifically, the August 2017 signal led to a 663% surge, the November 2017 one to a 136% increase, and the June 2020 one to a 580% rally. This comes to an average gain of 460%. Thus, it would appear that money printers being busy around the world is something that tends to be bullish for Bitcoin. Considering that the Global Money Supply is once again rising at an appreciable rate, it only remains to be seen whether BTC will once again feel a positive effect over the coming year. In some other news, the Bitcoin network recently saw its largest ever movement of coins older than ten years, as CryptoQuant Head of Research Julio Moreno has pointed out in an X post. In total, this latest spike of transactions involving ancient coins saw the movement of around 81,000 BTC, worth a whopping $8.8 billion. Generally, old coins move when they are being sold, so these transfers could correspond to profit-taking. Related Reading: Bitcoin Latest Rally Backed By Stronger Purchasing Power: Report Interestingly, the Apparent Demand indicator has remained positive for Bitcoin even after these transactions, as Edwards has explained in another X post. This metric gauges the demand for Bitcoin by comparing its production (mining issuance) against its inventory (supply inactive over 1 year). &#8220;Despite 80,000 BTC moving, Bitcoin&#8217;s Apparent Demand is still bullish,&#8221; says the analyst. Bitcoin Price At the time of writing, Bitcoin is trading around $108,400, up 0.7% over the last week. Featured image from Dall-E, CryptoQuant.com, charts from TradingView.com"
    },
    {
      "title": "Bitcoin Heating Up? NVT Golden Cross Hints At Potential Local Top",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-heating-up-nvt-golden-cross-hints-at-potential-local-top/",
      "summary": "Bitcoin (BTC) is up 7% over the last two weeks, showing signs of strength despite expectations that the US Federal Reserve (Fed) will keep interest rates unchanged at its upcoming July 30 meeting. However, some indicators suggest that the market may be entering overheating territory. Bitcoin Market Entering Overheating Territory? According to a recent CryptoQuant Quicktake post by contributor burakkesmeci, the Bitcoin Network Value to Transaction (NVT) Golden Cross is on the rise. Importantly, this upward movement is beginning to signal signs of market overheating. Related Reading: Bitcoin Realized Dominance Signals Weak Hands Capitulating, Strong Hands Rising For the uninitiated, the Bitcoin NVT Golden Cross is a technical indicator that compares short-term and long-term moving averages of the NVT ratio to identify potential market tops or bottoms. When the short-term NVT crosses above the long-term average, it often signals that Bitcoin is becoming overvalued and may face a short-term correction. Notably, this indicator has successfully predicted three local tops so far in 2025. The first occurred on February 5, when the NVT Golden Cross hit 2.68 while BTC traded at $97,600, followed by a 23.65% correction. On March 24, the indicator peaked at 2.87 with BTC around $87,500, leading to a subsequent correction of 16.06%. Most recently &#8211; on June 16 &#8211; it rose to 2.21 with BTC trading at $106,800, which was followed by a 9.87% price dip. Currently, the NVT Golden Cross stands at 1.98. Although it hasn’t crossed the key 2.2 threshold yet, its upward trajectory suggests that market overheating could be brewing. The CryptoQuant analyst explained: Breaking its previous high is moderately bullish and shows momentum is building. If the metric crosses 2.2 again, it may hint at a local top. But don’t rush to exit &#8211; historically, the metric has stayed above 2.2 for several days. In conclusion, burakkesmeci noted that while crossing the 2.2 level might suggest Bitcoin is heating up in the short-term, it could also signal a return of bullish momentum in the medium-term. That said, the opinion on BTC&#8217;s short-term price trajectory is largely divided. Analysts Split Over BTC Price Action ​​The NVT Golden Cross suggests that BTC may still have room to rally before hitting a potential local top. However, some analysts foresee a short-term pullback before Bitcoin reaches new highs. Related Reading: Bitcoin Network Volume Echoes Mid-2021 ‘Stable Equilibrium’ – Is A Big Move Brewing? For instance, noted crypto analyst Chistian Chifoi described the current BTC price action as a “deceptive setup,” warning it may trap bulls before a possible surge toward a new all-time high (ATH) of $160,000. Meanwhile, on-chain analytics firm Glassnode forecasts BTC’s short-term peak at $117,000. At press time, BTC trades at $108,204, down 0.1% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Shiba Inu Price Could See 180% Explosion As This Indicator Flashes Bullish Divergence",
      "link": "https://www.newsbtc.com/shiba-inu/shiba-inu-could-see-180-explosion/",
      "summary": "Crypto analyst Javon Marks has provided a bullish outlook for the Shiba Inu price, predicting a potential rally of 180%. The analyst alluded to an indicator that suggests that SHIB can record this explosive rally, reclaiming the psychological $0.00002 level in the process. Shiba Inu Price Eyes 180% Rally As MACD Forms Bullish Divergence In an X post, Javon Marks stated that the Shiba Inu price has formed a clear Bullish Divergence with its Moving Average Convergence Divergence (MACD). He further remarked that this points to a nearly 180% upside for SHIB to rally to $0.000032. Marks added that this may only be the start of a much larger positive reversal for the meme coin. Related Reading: 65% Of Shiba Inu Holders Suffer Massive Losses As Curse Of June Takes Hold His accompanying chart showed that the Shiba Inu price could hit this target between now and year-end. This provides a bullish outlook for the meme coin, which has greatly underperformed this year. SHIB has recorded a 45% loss year-to-date (YTD). Meanwhile, the coin is also down over 8% in the last 30 days. This represents a change of fortune for the meme coin, which recorded a gain of around 150% in 2024. However, based on Javon Marks’ analysis, the Shiba Inu price could still end this year in the green if it records this projected 180% rally. SHIB could also reclaim one of the top 10 spots in the ranking of cryptocurrencies by market cap. Fundamentals like the SHIB burns and network activity could spark this momentum for the Shiba Inu price. In an X post, a SHIB community member revealed that the meme coin has just shattered another record. Over 1.5 million on-chain wallets now hold the meme coin, with the number still rising. However, the SHIB burns will need to pick up as they remain unstable. Shibburn data shows that the daily burns have crashed by over 82%, with 1.5 million SHIB burned in the last 24 hours. The burn rate is also down around 11% in the last seven days, with 48 million SHIB burned during this period. SHIB Can Rally As Much As 600% Javon Marks is still confident that the Shiba Inu price can rally as much as 600% in the long term. He recently stated that the $0.000081 target for SHIB remains unchanged and that sights are still on an over 609% uphill run to reach it in response to a massive holding breakout of the displayed resisting trend. Related Reading: Can The Shiba Inu Developer Push SHIB Price To $0.01? Expert Responds The analyst remarked that due to"
    },
    {
      "title": "Bitcoin’s Liquidity Lifeline Just Got Cut—What You Need To Know",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoins-liquidity-lifeline-just-got-cut/",
      "summary": "The liquidity engine that has supported risk assets, including Bitcoin, since the beginning of 2025 is now shifting into reverse. According to macro analyst Tomas (@TomasOnMarkets), the six-month upswing in Federal Reserve liquidity has ended, and a potentially destabilizing wave of debt issuance by the US Treasury is about to begin. In a post published on X late Sunday, Tomas warned: “ Federal Reserve Liquidity set to fall… The Fed liquidity upswing that began on January 1 2025 is now over.” Bitcoin Enters Danger Zone The catalyst behind this reversal is the recent $5 trillion debt ceiling increase passed by Congress last week. That legislative decision gives the Treasury Department the green light to aggressively rebuild its cash balance at the Federal Reserve—known as the Treasury General Account (TGA)—which had been intentionally drained to inject liquidity into the system during the first half of the year. “The US Government had previously been draining the Treasury General Account (liquidity injection). But a new debt ceiling agreement was reached last week ($5 trillion raise). This means the Government will start to flood the market with new debt to ‘refill’ the TGA (liquidity drain),” Tomas wrote. He emphasized that the refill target is currently set at $850 billion, up from recent levels around $350 billion, implying roughly $500 billion in liquidity will be removed from the system in the coming months. Related Reading: Bitcoin Investor Sentiment Back To ‘Very Bullish’ — What This Means The implications for Bitcoin are stark. Risk assets have historically benefited from rising dollar liquidity—particularly in the context of elevated ETF inflows, corporate adoption, and a weakening US dollar. But that backdrop is now shifting. As Tomas put it, “All else being equal, this TGA rebuild process should be bullish for the US dollar.” A strengthening dollar, when coupled with falling bank reserves, is generally a bearish environment for Bitcoin. The pressure on liquidity won’t necessarily come all at once, but the mechanics are clear. Treasury will issue large volumes of new short-term debt—primarily T-bills—to finance the TGA refill. This issuance will compete with other dollar-denominated assets for funding, draining cash out of banks and money markets. Tomas notes that this dynamic could be softened if money market funds rotate their cash out of the Fed’s Overnight Reverse Repo Facility, which still holds about $214 billion. “It’s possible that Treasury Secretary Scott Bessent could lower the target level, meaning less of a refill,” he adds. “I’d expect we may see a lot of T-bill issuance, which could tempt some of the remaining $214bn left in the Reverse Repo to leave the facility (liquidity injection) and lessen any negative impact of the TGA refill.” Still, even with some reallocation from RRP, Tomas expects the overall effect to reduce reserve balances—bank reserves as a percentage of GDP are likely to fall below 10%, he estimates. While this is not as dire as the 7% level reached in 2019 (which triggered the repo crisis), it represents a sharp tightening compared to the first half of this year. “There could be some funding stress around the end of September (end-of-quarter),” Tomas cautioned. Related Reading: Bitcoin Breakout Is A Trap—Analyst Predicts Pain Before $160,000 Surge Bitcoin’s performance has coincided with the exact window Tomas outlines as a liquidity upswing. As documented, Bitcoin’s price has closely tracked the direction of aggregate G5 central bank balance sheets and the level of US bank reserves. When those reserves shrink—especially in the face of stronger Treasury issuance and a rebounding dollar—Bitcoin has historically struggled to sustain upside momentum. This concern is compounded by Tomas’s warning that speculative short positioning against the dollar has reached extremes. “Back in January, I was shouting about a fall in the dollar. Now everybody and their mothers are bearish on the dollar, and positioning is massively short across the board. It’s time for, at the very least, an upward correction/consolidation for the US dollar, in my opinion.” Such a reversal in the dollar would mark a critical macro headwind for Bitcoin. The 90-day rolling correlation between Bitcoin and the US Dollar Index (DXY) remains firmly negative. In environments where the dollar strengthens—especially when driven by tightening liquidity—Bitcoin has rarely outperformed. The next several weeks will be critical. If Treasury proceeds with aggressive issuance and market participants demand higher yields, liquidity could tighten faster than anticipated. While Tomas does leave open the possibility that Secretary Bessent may adjust the TGA target downward, the baseline scenario remains a $500 billion net liquidity drain—directly reversing the conditions that allowed Bitcoin to surge. At press time, BTC traded at $108,148. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Range Tightens – Liquidity Looms At $2,800 And $2,350",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-range-tightens-liquidity-looms-at-2800-and-2350/",
      "summary": "Ethereum is approaching a pivotal moment as it pushes to reclaim the $2,600 level, aiming to break free from weeks of sideways action. After trading within a tight range since early May, ETH is now testing the upper boundary of its consolidation zone, a move that could mark the start of a new bullish phase for the world’s second-largest cryptocurrency. Related Reading: Altcoins Set A Higher Low – Bulls Target 2024 High To Trigger Altseason Market participants are closely watching this level, as a successful breakout above $2,600 would likely attract momentum buyers and confirm renewed strength across the altcoin sector. However, the breakout is far from guaranteed. If bulls fail to sustain this move, Ethereum could face renewed selling pressure, with price potentially revisiting lower support zones. According to Coinglass data, liquidity clusters are clearly defined at $2,800 and $2,350. These levels will likely act as magnets in the coming days, depending on how Ethereum responds to current resistance. A clean break toward $2,800 would confirm bullish intent and broader altcoin surges, while a rejection could reinforce bearish sentiment. Ethereum&#8217;s Next Move Could Ignite Altseason Altcoins remain nearly 50% below their all-time highs, but bullish momentum is quietly building. Ethereum, the leader of the altcoin market, has been consolidating in a well-defined range between $2,400 and $2,700 since early May. This prolonged sideways action has kept much of the altcoin sector in a state of indecision. Now, traders and analysts agree: Ethereum must break out to lead the next major move. Market analyst Ted Pillows identifies two key liquidity levels for ETH: $2,800 on the upside and $2,350 on the downside. These zones represent the most likely destinations for price in the short term, depending on which side of the range breaks first. If Ethereum pushes above $2,800 with strength, it would likely trigger renewed risk appetite and a broad-based altcoin rally. On the other hand, a breakdown below $2,350 could lead to deeper corrections across the board. So far, bulls have defended the $2,500 level well, and growing open interest suggests that investors are positioning for an expansion. A decisive breakout in either direction will resolve weeks of consolidation and determine the short-term trend. Until then, Ethereum remains the gatekeeper of altcoin momentum—its next move could define the path for the entire market. Related Reading: Altcoins Set A Higher Low – Bulls Target 2024 High To Trigger Altseason ETH Tests Resistance Amid Range-Bound Structure Ethereum is currently trading at $2,563, hovering just below the $2,600 mark, a level that has acted as short-term resistance throughout June and early July. As shown in the 12-hour chart, ETH has been trapped in a horizontal consolidation structure between $2,400 and $2,700, with multiple failed attempts to break either side convincingly. The price remains above the 50, 100, and 200 simple moving averages (SMAs), which is a positive signal for bulls. The 100 SMA at $2,532 and the 200 SMA at $2,206 have offered strong dynamic support during recent pullbacks, reinforcing the current uptrend structure. Volume remains moderate, suggesting that market participants are waiting for a clear breakout before entering with conviction. A decisive close above $2,600 would open the door for a move toward $2,800, where large liquidity clusters have been identified by Coinglass. Related Reading: No Room For Bears: Bitcoin Bullish MACD, Monthly Close Fuel Bullish Outlook However, failure to maintain this short-term momentum could push ETH back toward the $2,400 support zone. Bulls have defended this level several times, and a break below it would likely invalidate the bullish setup and increase the risk of a deeper correction. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "U.S. Court Brings Coin Center’s Tornado Cash Appeal To A Close",
      "link": "https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Tornado-Cash-Trial.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close\" rel=\"nofollow\"> </a></p> <p>Coin Center’s appeal to the U.S. Treasury Department’s Office of Foreign Asset Control (OFAC) regarding Tornado Cash is now over.</p> <p>"
    },
    {
      "title": "CleanSpark Announces Mining 685 Bitcoin Worth Over $74 Million In June",
      "link": "https://bitcoinmagazine.com/news/cleanspark-announces-mining-685-bitcoin-worth-over-74-million-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/CleanSpark-Announces-Bitcoin-Mining-Results-From-June-2025.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/cleanspark-announces-mining-685-bitcoin-worth-over-74-million-in-june\" rel=\"nofollow\"> </a></p> <p>CleanSpark mined 685 bitcoin in June, sold 578 BTC for over $61 million, and became the first miner to reach 50 EH/s using fully self-operated infrastructure.</p> <p>"
    },
    {
      "title": "Nakiki SE to Become First German Public Company With ‘Pure’ Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/nakiki-se-to-become-first-german-public-company-with-pure-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Nakiki-SE-to-Become-First-German-Public-Company-With-‘Pure-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/nakiki-se-to-become-first-german-public-company-with-pure-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>German listed company plans to become the nation’s first public firm with a pure Bitcoin treasury.</p> <p>"
    },
    {
      "title": "Trustodial: An Ontological Dilemma",
      "link": "https://bitcoinmagazine.com/technical/trustodial-an-ontological-dilemma",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Trustodial.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/trustodial-an-ontological-dilemma\" rel=\"nofollow\"> </a></p> <p>\"Trustodial\" systems like statechains introduce a dilemma in terms of what constitutes self custodial.</p> <p>"
    },
    {
      "title": "Semler Scientific Acquires 187 More Bitcoin, Surpassing 4,600 BTC in Holdings",
      "link": "https://bitcoinmagazine.com/news/semler-scientific-acquires-187-more-bitcoin-surpassing-4600-btc-in-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Semler-Scientific.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/semler-scientific-acquires-187-more-bitcoin-surpassing-4600-btc-in-holdings\" rel=\"nofollow\"> </a></p> <p>Semler Scientific has purchased an additional 187 Bitcoin for approximately $20 million, according to a new SEC filing. The acquisition brings the firm’s total Bitcoin holdings to 4,636 BTC, worth about $502 million at current market prices. The company disclosed the purchases were made between June 4 and July 2 at an average price of [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Here's How All Major AI Platforms Stacked Up in a Harry Potter Sorting Hat Quiz",
      "link": "https://decrypt.co/328949/ai",
      "summary": "A developer tested 17 language models and discovered they're overwhelmingly associated with the Ravenclaw team, with one notable exception."
    },
    {
      "title": "'Evil' Proposal to Sell Gaza Land Via Crypto Tokens Met With Backlash",
      "link": "https://decrypt.co/329005/evil-proposal-sell-gaza-land-via-crypto-tokens-backlash",
      "summary": "Palestinian activists blasted the proposed plan to sell Gaza via crypto tokens and establish “blockchain-trade initiatives.”"
    },
    {
      "title": "Rescue Drones Deployed Amid Texas, North Carolina Floods—But Hobbyists Are Grounded",
      "link": "https://decrypt.co/328977/rescue-drones-deployed-texas-nc-flood-chaos-hobbyists-grounded",
      "summary": "With emergency crews relying on drones to save lives in flooded areas of Texas and the Carolinas, authorities are imposing no-fly zones to keep out amateur pilots."
    },
    {
      "title": "Solana Meme Coin Launchpad Pump.Fun's $600 Million Token Sale Teased, Then Pulled",
      "link": "https://decrypt.co/328988/solana-meme-coin-launchpad-pump-funs-600-million-token-sale-teased-then-pulled",
      "summary": "Is Pump.fun finally launching its own token? Crypto exchange Gate said yes on Monday, but then apparently removed the page."
    },
    {
      "title": "Ethereum OG Moves $2.2 Million in 'Genesis Coins' After 10 Years HODLing",
      "link": "https://decrypt.co/328983/ethereum-og-moves-2-2-million-in-genesis-coins-after-10-years-hodling",
      "summary": "The address received the coins when ETH was worth less than 50 cents."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Ripple CEO Brad Garlinghouse to testify before US Senate Banking Committee on crypto legislation",
      "link": "https://cryptobriefing.com/crypto-market-legislation-senate-hearing/",
      "summary": "<p>Garlinghouse's testimony could accelerate US crypto regulation, potentially fostering innovation and consumer protection in digital markets.</p> <p>"
    },
    {
      "title": "SEC pushes Solana ETF issuers to refile by end of July, signals fast-track approval path",
      "link": "https://cryptobriefing.com/solana-etf-approval-sec-fast-track/",
      "summary": "<p>The SEC's expedited process for Solana ETFs could accelerate mainstream crypto adoption and diversify investment options in the US market.</p> <p>"
    },
    {
      "title": "US govt moves $200K in Ethereum to Coinbase after test transaction",
      "link": "https://cryptobriefing.com/us-government-ethereum-wallet-test-deposit-coinbase-prime/",
      "summary": "<p>The US government's Ethereum transaction hints at potential future asset management strategies, impacting market perceptions and crypto policies.</p> <p>"
    },
    {
      "title": "US government abandons Tornado Cash appeal after policy reversal",
      "link": "https://cryptobriefing.com/tornado-cash-sanctions-reversal/",
      "summary": "<p>The US government's policy reversal on Tornado Cash may influence future regulatory approaches to crypto technologies and international software.</p> <p>"
    },
    {
      "title": "Plume Network brings real-world yield to TRON’s global payment ecosystem via SkyLink integration",
      "link": "https://cryptobriefing.com/real-world-yield-tron-plume/",
      "summary": "<p>Plume Network integrates SkyLink with TRON, enabling users global access to real-world yield from asset-backed financial products.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bonk crypto pushed by strong demand: Is a move beyond $0.000025 next?",
      "link": "https://ambcrypto.com/bonk-crypto-pushed-by-strong-demand-is-a-move-beyond-0-000025-next/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/BONK-crypto-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The highs from May have a substantial cluster of liquidation levels around them, which could stall BONK's rally."
    },
    {
      "title": "Bitcoin holds above $100K despite low volume: 2 signs point to more upside",
      "link": "https://ambcrypto.com/bitcoin-holds-above-100k-despite-low-volume-2-signs-point-to-more-upside/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-2.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The volume of BTC on Spot and Futures dropped as retail stayed quiet."
    },
    {
      "title": "Celestia’s 26% weekly rally can continue: Will TIA surge toward $2.26?",
      "link": "https://ambcrypto.com/celestias-26-weekly-rally-can-continue-will-tia-surge-toward-2-26/",
      "summary": "<img alt=\"Celestia&#039;s 26% weekly rally can continue: Will TIA surge toward $2.26?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-07T143229.902_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Celestia jumps 26% in a week and 12% in the past 24 hours, ending its prolonged bearish trend."
    },
    {
      "title": "What’s next for Bitcoin, Ethereum, and altcoins in the second half of 2025",
      "link": "https://ambcrypto.com/whats-next-for-bitcoin-ethereum-and-altcoins-in-the-second-half-of-2025/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-14.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />From treasury strategies to IPOs and tech upgrades, crypto's next chapter is being written right now."
    },
    {
      "title": "SPX climbs 10% as memecoins charge in – But watch out for THIS level!",
      "link": "https://ambcrypto.com/spx-climbs-10-as-memecoins-charge-in-but-watch-out-for-this-level/",
      "summary": "<img alt=\"SPX climbs 10% as memecoins charge in - But watch out for THIS level!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SPX surged 16% in four weeks, driven by the memecoin sector's momentum."
    }
  ]
}