{
  "CoinDesk": [
    {
      "title": "Meta's Stablecoin Plan Questioned by Democrats Ahead of Key Senate Vote",
      "link": "https://www.coindesk.com/policy/2025/06/11/metas-stablecoin-plan-questioned-by-democrats-ahead-of-key-senate-vote",
      "summary": ""
    },
    {
      "title": "Connecticut's Ban Throws Water on 2025 Trend of States Setting Up Crypto Investments",
      "link": "https://www.coindesk.com/policy/2025/06/11/connecticut-s-ban-throws-water-on-2025-trend-of-states-setting-up-crypto-investments",
      "summary": ""
    },
    {
      "title": "Ether Surges Toward $3K on Tentative U.S.–China Trade Pact and Soft U.S. CPI Report",
      "link": "https://www.coindesk.com/markets/2025/06/11/ether-surges-toward-usd3k-on-tentative-u-s-china-trade-pact-and-soft-u-s-cpi-report",
      "summary": ""
    },
    {
      "title": "Digital Assets Are One Step Closer to Regulatory Clarity",
      "link": "https://www.coindesk.com/opinion/2025/06/11/digital-assets-are-one-step-closer-to-regulatory-clarity",
      "summary": ""
    },
    {
      "title": "Stripe to Acquire Crypto Wallet Startup Privy in Bid to Expand Web3 Capabilities",
      "link": "https://www.coindesk.com/business/2025/06/11/stripe-to-acquire-crypto-wallet-startup-privy-in-bid-to-expand-web3-capabilities",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "How to set up and use AI-powered crypto trading bots",
      "link": "https://cointelegraph.com/news/how-to-set-up-and-use-ai-powered-crypto-trading-bots?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjY4M2ItMGFmZC03OTlmLTliMzYtNzkzYjg1OGJmMTU4.jpg\" /></p><p>A practical guide to setting up, using and optimizing AI crypto trading bots, plus a glimpse into where intelligent trading is headed next.</p>"
    },
    {
      "title": "Price predictions 6/11: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, HYPE, SUI, LINK",
      "link": "https://cointelegraph.com/news/price-predictions-6-11-btc-eth-xrp-bnb-sol-doge-ada-hype-sui-link?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVmZDgtNmVjZi03YzA3LWEwZDMtZTM4NDM0ZDYwZGY4.jpg\" /></p><p>Bitcoin price trades near its all-time high as ETH and several altcoins start fresh rallies.</p>"
    },
    {
      "title": "How to use ChatGPT for crypto strategy, signals, and sentiment",
      "link": "https://cointelegraph.com/news/how-to-use-chatgpt-to-analyze-crypto-market-movements?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM2MTAtY2VhMC03ZjRlLWI5NjAtNGQ4ZDQ2YTU1ODJj.jpg\" /></p><p>Use ChatGPT to summarize market news, interpret on-chain data, compare token metrics, and spot sentiment shifts using structured prompts.</p>"
    },
    {
      "title": "Developer accuses Ethereum Foundation of undermining devs, creating ‘secret’ teams",
      "link": "https://cointelegraph.com/news/geth-lead-developer-accuses-ethereum-foundation-creating-secret-team?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDMwZjUtMWU5Yy03ODlkLTk1MzktOGJjNmQ1MjE5OGU5.jpg\" /></p><p>Péter Szilágyi, a former Ethereum Foundation employee and the lead Geth developer, said the organization repeatedly undermined his team.</p>"
    },
    {
      "title": "‘Unique’ Bitcoin holder trend backs BTC’s next price discovery phase: Glassnode",
      "link": "https://cointelegraph.com/news/unique-bitcoin-holder-trend-backs-btc-s-next-price-discovery-phase-glassnode?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5Njc5YjEtMzljZi03MmFkLTgyYzYtMTE3MTY4MDM2ZGRl.jpg\" /></p><p>Bitcoin enters a unique market phase as rising long-term holder dominance and compressed volatility could potentially trigger a fresh round of price discovery.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Interactive Strength to launch AI-driven crypto treasury with $500 million Fetch.ai token acquisition",
      "link": "https://cryptoslate.com/interactive-strength-to-launch-ai-driven-crypto-treasury-with-500-million-fetch-ai-token-acquisition/",
      "summary": "<p>Interactive Strength (TRNR), a Nasdaq-listed fitness technology firm, is entering the digital asset space by launching what it describes as the first artificial intelligence-driven crypto treasury. The company plans to acquire $500 million worth of Fetch.ai&#8217;s FET tokens, according to a June 11 announcement. TRNR has started building its token position, backed by an initial [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin hashrate up 40% this year as miners keep scaling",
      "link": "https://cryptoslate.com/insights/bitcoin-hashrate-up-40-this-year-as-miners-keep-scaling/",
      "summary": "<p>Bitcoin’s network difficulty remains pinned at a record 127 T following its most recent adjustment on May 31, yet the underlying hashrate continues to push higher. As of June 10, the average seven-day hashrate is roughly 901 EH/s, with several daily prints brushing against 920 EH/s. This suggests a persistent mismatch between the protocol’s two-week [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum open interest hits all-time high as price rises to 4-month high",
      "link": "https://cryptoslate.com/insights/ethereum-open-interest-hits-all-time-high-as-price-rises-to-4-month-high/",
      "summary": "<p>Ethereum has surged more than 5% in the past 24 hours, climbing above $2,860 to reach its highest price since February. The rally comes amid rising activity in the derivatives market, signaling strong market conviction behind the move. On-chain data suggests that rising futures interest is driving much of the market’s current enthusiasm. Open interest, [&#8230;]</p> <p>"
    },
    {
      "title": "Polygon’s governance revamp to focus on stablecoin payments and AggLayer",
      "link": "https://cryptoslate.com/polygons-governance-revamp-to-focus-on-stablecoin-payments-and-agglayer/",
      "summary": "<p>Polygon&#8217;s governance is undergoing a significant transformation, with co-founder Sandeep Nailwal stepping in as the Foundation&#8217;s first CEO. In a June 11 post on X, Nailwal said: &#8220;As the largest holder of POL and someone who dedicated his life to development and success of Polygon from the very beginning, I have decided to take full [&#8230;]</p> <p>"
    },
    {
      "title": "XRP derivatives traders boost leverage as funding costs jump",
      "link": "https://cryptoslate.com/xrp-derivatives-traders-boost-leverage-as-funding-costs-jump/",
      "summary": "<p>A slow but clear divergence is emerging in XRP&#8217;s derivatives market: open interest has eased modestly over the past month, but the amount of leverage employed by traders is steadily rising. With spot demand softening and funding rates climbing to near their monthly highs, XRP appears to be entering a phase of elevated positioning risk, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "SUI Meteoric Rise: Golden Cross Signals A Potential 380% Explosion",
      "link": "https://www.newsbtc.com/sui/sui-meteoric-380-explosion/",
      "summary": "SUI has quickly become a standout performer in the crypto market, posting a dramatic 150% gain from $1.71 to $4.30. Yet, not all is smooth sailing. A $215 million token unlock on June 1, 2025, threatens to introduce major selling pressure. Volatility Meets Opportunity: SUI Charts A Risk-Reward Path According to SirRichard’s latest update on X, SUI has exhibited notable price swings, but its long-term outlook remains firmly bullish. The token recently pulled off a remarkable 150% rally, climbing from a low of $1.71 to a high of $4.30. This explosive move caught the attention of traders, especially as it coincided with a golden cross formation on the daily chart, a classic technical signal that often precedes major bullish continuation. Related Reading: Breakout In Sight? SUI Set To Test Crucial $3.5 Resistance With ATH In View Based on this setup, SirRichard believes SUI could be preparing for an even more significant leg up, potentially targeting new highs around the $7.56 mark. If this plays out, it would represent a staggering 380% gain from earlier levels. However, he also warned that the journey may not be without obstacles, particularly as other technical and fundamental signals begin to surface. A recent bearish crossover in the Exponential Moving Averages (EMAs) may hinder SUI’s bullish momentum in the short term. Additionally, the token unlock on June 1, 2025, resulting in the release of approximately $215 million worth of SUI into circulation, poses a potential risk. Such a large supply event could introduce selling pressure and spark short-term volatility if not absorbed smoothly by the market. Currently, immediate support lies between $3.40 and $3.43, which could act as a cushion in the event of a dip. On the upside, resistance is building around the $3.50–$4.00 zone. A firm break above this level would reignite bullish momentum, paving the way for SUI’s next upward surge. Bearish Winds Loom, But On-Chain Strength Holds Ground On the other hand, if bearish sentiment intensifies, the price could fall toward the $2.33 level, a key support that could be tested. Such a move would likely challenge bullish confidence and introduce volatility in the near term. Related Reading: Here’s Why SUI At $3.61 Could Be the Calm Before A Parabolic Surge Despite this, the broader outlook is supported by impressive network activity. SUI’s ecosystem has seen over $40 billion in aggregator volume, a significant metric pointing to strong participation and interest. Even more encouraging is the 24% increase in activity over the last 30 days, highlighting a growing user base and rising utility. These fundamentals serve as a strong counterbalance to short-term risks. If sustained, they could provide a firm foundation for renewed bullish momentum. As such, any price dip may offer a fresh opportunity for long-term investors. Featured image from Shutterstock, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin w rezerwie USA, a Bitcoin Hyper przyspiesza jego rozwój",
      "link": "https://www.newsbtc.com/crypto/bitcoin-w-rezerwie-usa-a-bitcoin-hyper-przyspiesza-jego-rozwoj/",
      "summary": "Stany Zjednoczone oficjalnie rozpoczęły budowę Rezerwy Strategicznej Bitcoina, a Bitcoin Hyper($HYPER) wspiera rozwój warstwy drugiej króla kryptowalut. Nowa struktura powstała z inicjatywy administracji Donalda Trumpa, która zdecydowała się wykorzystać skonfiskowane środki w celu zabezpieczenia cyfrowych aktywów. Ten ruch nie wynika z przypadku. Z danych udostępnionych przez Gemini i Glassnode wynika, że ponad 30% całkowitej podaży BTC znajduje się w rękach scentralizowanych podmiotów. Wśród nich są fundusze ETF, giełdy kryptowalut, przedsiębiorstwa oraz rządy. W raporcie podkreślono, że zaangażowanie instytucji publicznych może mieć istotny wpływ na rozwój rynku. Każdy dolar wprowadzony przez państwowy kapitał przekłada się na wzrost wartości rynkowej w wysokości 25 dolarów. Co więcej, generuje 1,70 dolara trwałego wzrostu wartości sieci. Tego typu wpływ sygnalizuje coraz większe znaczenie strategicznych rezerw w świecie cyfrowych aktywów. Nowy sygnał dla inwestorów długoterminowych Bitcoin przestaje być kojarzony wyłącznie z aktywem spekulacyjnym. Wzrost liczby zasobów przenoszonych z giełd do niezależnych depozytariuszy wskazuje na proces konsolidacji. Zmienność kursu uległa zmniejszeniu, co ułatwia planowanie inwestycji w dłuższym horyzoncie. Obecne cykle rynkowe nie przypominają już gwałtownych skoków i spadków. Sprawdź, jak kupić Bitcoina. Źródło: CoinMarketCap Zamiast tego charakteryzują się spokojniejszymi, bardziej stabilnymi wzrostami. Rezerwa Strategiczna działa nie tylko jako narzędzie ochrony wartości. Stanowi również dowód na to, że państwa zaczynają włączać kryptowaluty do swoich modeli zarządzania finansami. Dla inwestorów oznacza to zwiększoną pewność, a także nowe formy zaangażowania kapitału instytucjonalnego. Zjawisko to może wpłynąć na dalsze umacnianie pozycji Bitcoina w globalnym systemie finansowym. Bitcoin Hyper &#8211; nowa warstwa funkcjonalności Pomimo coraz większej akceptacji ze strony instytucji, główna sieć Bitcoina długo pozostawała ograniczona w zakresie możliwości technologicznych. Sytuacja ta zmienia się dzięki projektowi Bitcoin Hyper. W ciągu pięciu dni sprzedaż tokena $HYPER przekroczyła milion dolarów. Sprawdź też najlepsze kryptowaluty poniżej 1 dolara. To efekt rosnącego zapotrzebowania na rozwiązania, które rozszerzają funkcjonalność Bitcoina bez naruszania jego podstawowych zasad bezpieczeństwa. Bitcoin Hyper to druga warstwa Bitcoina zbudowana na maszynie wirtualnej Solany, która działa w połączeniu z bazową warstwą BTC. Taka konstrukcja pozwala uzyskać ponad 2 tysiące transakcji na sekundę, zachowując przy tym odporność na manipulacje oraz decentralizację. Użytkownicy mogą realizować szybkie przelewy, korzystać z aplikacji zdecentralizowanych, a także uczestniczyć w nowych formach aktywności, takich jak staking czy zdecentralizowany handel. Mechanizm działania sieci Bitcoin Hyper System opiera się na transparentnym modelu. Użytkownik deponuje BTC w inteligentnym kontrakcie, który weryfikuje transakcję na podstawie danych z łańcucha bloków. Następnie sieć emituje równoważny token, możliwy do wykorzystania w ekosystemie Bitcoin Hyper($HYPER). Po zakończeniu aktywności użytkownik może spalić token i odzyskać oryginalne BTC. W tle działają dowody zerowej wiedzy oraz weryfikacja danych przez light clients. Użytkownik przesyła bitcoiny do inteligentnego kontraktu, który potwierdza transakcję na podstawie danych z sieci głównej. Po weryfikacji powstaje równoważny token w sieci Hyper, gotowy do dalszego wykorzystania. Kiedy użytkownik chce wycofać środki, token zostaje unieważniony, a oryginalne Bitcoiny wracają do właściciela. Cały proces odbywa się z użyciem zaawansowanych metod kryptograficznych, które zapewniają bezpieczeństwo i zgodność z głównym łańcuchem bez konieczności angażowania pośredników. Właściciele tokena $HYPER mogą korzystać z produktów o podwyższonym zwrocie, zyskać dostęp do zaawansowanych narzędzi oraz uczestniczyć w dalszym rozwoju projektu. Twórcy aplikacji mają szansę uzyskać dofinansowanie i zwroty kosztów opłat sieciowych, jeśli zdecydują się wykorzystywać $HYPER w swoich kontraktach. Dane z rynku potwierdzają skuteczność modelu Bitcoin Hyper Podobne projekty już wcześniej osiągały znaczące wyniki. Arbitrum zgromadziło ponad 13 miliardów dolarów wartości zablokowanej oraz ponad milion aktywnych portfeli. Sieć Base, powiązana z Coinbase, przekroczyła wartość 2,5 miliarda dolarów i notuje ponad milion aktywnych adresów dziennie. Dane te to dowód na to, że dobrze zaprojektowane sieci drugiej warstwy mogą szybko zdobywać rynek i użytkowników. Bitcoin Hyper ma potencjał, żeby powtórzyć ten sukces i stać się jedną z najlepszych przedsprzedaży kryptowalut. Całkowita podaż tokenów została ustalona na 21 miliardów, bez alokacji dla uprzywilejowanych grup. Obecnie trwa przedsprzedaż tokena $HYPER, a jeden z większych inwestorów nabył niedawno tokeny za równowartość 55 tysięcy dolarów. Tego rodzaju ruchy ze strony dużych graczy często prognozują większe zmiany. Nowa rola Bitcoina w cyfrowym świecie Rozwój Rezerwy Strategicznej oraz wdrożenie sieci Hyper to dwa bieguny tej samej zmiany. Z jednej strony widać instytucjonalizację zasobów cyfrowych. Z drugiej pojawiają się narzędzia, które poszerzają zakres ich użycia. Bitcoin przestaje pełnić jedynie funkcję przechowywania wartości. Staje się środowiskiem operacyjnym dla całych aplikacji, usług i produktów nowej generacji. Bitcoin Hyper wnosi do sieci Bitcoina funkcjonalność, której dotąd brakowało. Dzięki nowej warstwie technicznej możliwe stają się szybkie transakcje, obsługa aplikacji finansowych, zdecentralizowanych projektów i rozwiązań opartych na inteligentnych kontraktach. Sieć zyskuje skalę, której wymaga nowoczesna gospodarka cyfrowa. Bitcoin nie pełni już wyłącznie roli cyfrowego magazynu wartości. W połączeniu z Bitcoin Hyper przechodzi transformację w platformę operacyjną dla szerszego ekosystemu finansowego. Może wspierać codzienne zastosowania, przepływy kapitału, tworzenie nowych usług oraz rozwiązań dla użytkowników i firm. Kup Bitcoin Hyper"
    },
    {
      "title": "Bitcoin Is Wildly Undervalued, Says Bitwise: ‘Fair Price’ Today Is $230,000",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-undervalued-bitwise-fair-price-today-230000/",
      "summary": "Bitcoin is once again knocking on the door of price discovery, but researchers at Bitwise Asset Management argue that spot quotations still understate what the network is worth. In their Week 24 Crypto Market Compass circulated late Tuesday, Dr. André Dragosch, Bitwise’s Head of Research for Europe, and analyst Ayush Tripathi calculate that “quantitative models estimate Bitcoin’s hypothetical ‘fair value’ amid the current sovereign default probabilities at around $230,000 today.” The figure implies a premium of just over 110 percent to the market price, which was hovering near $109,600 at press time on 11 June 2025. Bitcoin’s ‘True Worth’ Is Explosive Dragosch ties that assessment to the rally in sovereign-risk hedges. United-States one-year credit-default-swap spreads are trading near half-percentage-point territory—levels last seen during the 2023 debt-ceiling scare—reflecting “broader concerns over the US fiscal deficit,” Reuters reported last week. “Bitcoin can provide an alternative ‘portfolio insurance’ against widespread sovereign defaults as a scarce, decentralised asset which is free of counterparty risks,” the note argues, adding that net interest outlays projected by the Congressional Budget Office point to a tripling of US debt-service costs to roughly $3 trillion by 2030. Related Reading: Bitcoin Skyrockets Past $108,000 Amid US-China Tariff Discussions The macro backdrop, however, is not the only pillar supporting Bitwise’s fair-value call. The firm’s in-house Cryptoasset Sentiment Index shows twelve of fifteen market-breadth gauges trending higher, while the cross-asset risk-appetite index (CARA) compiled from equities, credit, rates and commodities has surged to a five-year high. “Both cryptoasset and cross-asset sentiment are now decisively bullish,” Dragosch writes, noting that Bitcoin’s climb back above $110,000 places it within two percent of the all-time high near $112,000 set in May. On-chain data remain constructive. Exchange reserves have slipped to 2.91 million BTC—about 14.6 percent of the circulating supply—after whales withdrew an estimated 390,632 BTC last week. At the same time, net exchange-spot outflows slowed to roughly $0.53 billion from $1.78 billion the previous week, suggesting lighter profit-taking pressure. Derivative positioning echoes the spot-market resilience. Aggregate Bitcoin futures open interest added 2,200 BTC across venues, while the CME leg gained 6.4 k BTC. Funding rates on perpetual swaps stayed positive overall despite flipping negative for parts of the weekend, and the three-month annualised basis held around 6.3 percent. In options, open interest expanded by 27,300 BTC, with the put-to-call ratio settling at 0.55; one-month 25-delta skew remained modestly negative, implying continued demand for downside hedges even as realised volatility slipped to 28.2 percent. Institutional flows are reinforcing the bullish tone. Global crypto ETPs absorbed $488.5 million last week, of which $254.9 million went into Bitcoin products. US spot Bitcoin ETFs led the charge with $525 million of inflows, counterbalanced by a $24.1 million weekly leak from the Grayscale Bitcoin Trust. Bitwise’s own BITB vehicle attracted $78.1 million, while its European physical Bitcoin ETP (BTCE) saw only marginal outflows. Ethereum products also enjoyed $260.9 million in net inflows, maintaining the broad-based risk bid. Related Reading: Bitcoin &#38; Ethereum Diverge—ETF Flows Just Flipped The Narrative Bitwise concedes that headline risk can still provoke sharp, short-lived drawdowns—last week’s spat between Elon Musk and President Donald Trump briefly drove BTC back to $100,000—but sees structural forces firmly tilted to the upside. “US economic policy uncertainty has most likely passed its zenith already and continues to decline at the margin,” Dragosch writes, pointing to May non-farm-payroll growth of 139,000 and a moderation in recession odds. With Bitcoin already outperforming traditional assets year-to-date and cross-asset sentiment now confirmed by Bitwise’s indicators, the analysts argue that the market is beginning to price the asset less as a speculative vehicle and more as a macro hedge. Whether traders embrace the $230,000 fair-value marker hinges on the same variables underscored in the note—sovereign-risk premiums, policy uncertainty and the pace of institutional adoption—but the groundwork, they say, is visible on-chain, on desks and in the flow data. “Bitcoin also reclaimed 110k USD and is close to its previous all-time high,” the report reminds readers. For Bitwise, that proximity is not an end point but a staging area: the monetary asset’s intrinsic value, they conclude, resides “considerably further north.” At press time, BTC traded at $109,617. &#160; Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Break Above $107,000 Triggers Bullishness, These Factors Will Drive A Faster Rise",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-107000-triggers-bulls/",
      "summary": "After days of testing a resistance zone at $106,000, Bitcoin has finally broken above the $107,000 mark to confirm a strong bullish momentum that has been building since early June. The breakout, which has seen Bitcoin reclaim $110,000 briefly in the past 24 hours, follows several failed attempts to close above this pivotal level. Technical analysis of the Bitcoin price indicates that the breakout above $107,000 has given bulls back control. Particularly, technical analysis from crypto analyst Michaël van de Poppe suggests that Bitcoin&#8217;s price will accelerate for the rest of the week. $106,500 Confirms Strength, Analyst Eye Accelerated Move Over the past few days, Bitcoin’s price structure has been forming a rounded base with higher lows, gradually coiling under a support turned resistance. Now that the breakout has occurred, bulls seem to be back in control. Related Reading: Why The Bitcoin Price Could See Another 70%-170% Jump From Here According to Michaël van de Poppe, a widely-followed crypto analyst on the social media platform X, the decisive moment came after Bitcoin cleared the $106,500 resistance, a level he previously mentioned he&#8217;s looking at. In his post, he noted that as long as Bitcoin maintains support above this zone, momentum will continue to shift in favor of buyers. Specifically, he pointed out that day traders are likely to pile in with new long positions, while short sellers are either closing their positions or getting squeezed out entirely. Both of these actions will continue to generate buying pressure, at least in the short term. This shift in market structure has already begun to play out. As the chart below shows, the previous resistance zone around $107,000, which was a strong support during the earlier ATH moves in May, has now flipped. This zone had repeatedly rejected price advances, acting as a price ceiling since May 30. Now, with the breakout confirmed and volume increasing, the analyst expects a swift rally toward $108,900 and beyond for the rest of the week. Bulls Prepare For New Bitcoin All-Time High The timing of this breakout also coincides with the start of the trading week, which Van de Poppe describes as a great start to the week and a continued upside for the remainder of the week. More often than not in this cycle, Bitcoin has exhibited sentiment surges early in the week that persisted throughout the week. If Bitcoin can consolidate above the $107,000 to $108,000 range without falling back into the previous structure, it could enter a new price zone as soon as the $111,000 barrier is breached. Related Reading: Bitcoin Diamond Hands Are Buying Again, Here’s Why It’s Bullish For The Market With increasing interest due to ETF inflows, it could serve as the launchpad for Bitcoin’s next major leg up, carrying it toward new all-time highs before the end of June. At the time of writing, Bitcoin is trading at $109,455, having recently reached an intraday high of $110,237. The leading cryptocurrency is currently only about 2.5% away from setting a new all-time high. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-to-1-million-michael-saylor-laughs-off-crypto-winter-fears/",
      "summary": "Bitcoin’s price outlook remains sky-high after Strategy founder Michael Saylor told Bloomberg on Tuesday that a market freeze won’t come back. He argued that growing demand and limited daily supply point straight to a rally toward $1 million. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Supply And Demand Pressure According to Saylor, miners release only about 450 BTC each day. That adds up to roughly $50 million at today’s price of around $109,859. He said once that $50 million is snapped up by buyers, there’s no choice but for the price to climb. His view rests on the idea that active demand now matches or exceeds what miners sell. High Price Targets Based on reports, asset manager ARK Invest recently boosted its bull case for Bitcoin from $1.5 million to $2.4 million by the end of 2030. Saylor went even further. He said that as long as Bitcoin doesn’t head to zero, it’s bound for $1 million. His own firm has picked up 582,000 BTC since 2020. That stash is worth nearly $64 billion, according to Saylor Tracker data. Institutional And Political Support Saylor pointed to big names backing Bitcoin. He mentioned US President Donald Trump, US Treasury Secretary Scott Bessent and SEC chair Paul Atkins as signs that the asset has won its toughest battles. He also noted that banks are lining up to offer custody services. And he praised Bitcoin ETFs from BlackRock and others for buying coins daily. Volatility Warning Saylor didn’t shy away from a cautionary note. He suggested that if Bitcoin hits $500,000 or $1 million, a fall to about $200,000 could follow. That’s almost a 60% drop from the peak. His point was that big price swings are part of Bitcoin’s history—and likely its future. Beyond miner sales and whale wallets, analysts say wider market moves matter too. Spot and futures trading often top $10 billion a day, so $50 million of fresh buys might only nudge the price. Regulation could swing the other way if concerns over energy use or consumer protection grow. And rival cryptocurrencies keep popping up with new features. Related Reading: Owning 10,000 XRP? You’re Among Crypto’s Elite, Expert Claims What Comes Next Reports disclose the real test will be whether steady new buyers can outpace both miner supply and selling by holders looking to bank profits. Saylor’s figures make a strong case for continued upside. But investors who build a plan around a $1 million Bitcoin should brace for big dips along the way. In the end, daily demand, political moves and how the rest of the financial world reacts will decide if those eye-popping targets really come to pass. Featured image from Getty Images, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Skull, $5 million; Banana, $6 million; Freedom, Priceless",
      "link": "https://bitcoinmagazine.com/culture/skull-5-million-banana-6-million-freedom-priceless",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/result_banana.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/skull-5-million-banana-6-million-freedom-priceless\" rel=\"nofollow\"> </a></p> <p>Freedom. Decentralization. Unity.<br /> And without a certificate of authenticity, all Justin Sun gifted Ross Ulbricht was a 1/1 print of the original art.</p> <p>"
    },
    {
      "title": "The CLARITY Act Heads To House Floor For Vote With Protection For Noncustodial Tools Intact",
      "link": "https://bitcoinmagazine.com/news/the-clarity-act-heads-to-house-floor-for-vote-with-protection-for-noncustodial-tools-intact",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Capitol-Building-CLARITY-Act.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-clarity-act-heads-to-house-floor-for-vote-with-protection-for-noncustodial-tools-intact\" rel=\"nofollow\"> </a></p> <p>The section of The CLARITY Act (H.R. 3633) that protects Bitcoin and crypto users’ right to use noncustodial wallets as well as developers’ right to create such tools without being subject to The Bank Secrecy Act (BSA) will remain in the bill as it gets voted on in the House.</p> <p>"
    },
    {
      "title": "Stripe Acquires Startup Privy To Expand Bitcoin Strategy",
      "link": "https://bitcoinmagazine.com/news/stripe-acquires-startup-privy-to-expand-bitcoin-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Stripe-Acquires-Startup-Privy-To-Expand-Bitcoin-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/stripe-acquires-startup-privy-to-expand-bitcoin-strategy\" rel=\"nofollow\"> </a></p> <p>Privy joins Stripe to build a Bitcoin and crypto wallet infrastructure. </p> <p>"
    },
    {
      "title": "Paul Tudor Jones: Bitcoin, Gold, Stocks Are The Best Portfolio To Fight Inflation",
      "link": "https://bitcoinmagazine.com/news/paul-tudor-jones-bitcoin-gold-stocks-are-the-best-portfolio-to-fight-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Paul-Tudor-Jones-Bitcoin-Gold-Stocks-Are-The-Best-Portfolio-To-Fight-Inflation.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/paul-tudor-jones-bitcoin-gold-stocks-are-the-best-portfolio-to-fight-inflation\" rel=\"nofollow\"> </a></p> <p>Billionaire Paul Tudor Jones said that bitcoin, gold, stocks would be the best portfolio to have to fight against inflation in an interview with Bloomberg.</p> <p>"
    },
    {
      "title": "Evertz Pharma Becomes First German Company With Strategic Bitcoin Reserve, Adds 100 BTC to Treasury",
      "link": "https://bitcoinmagazine.com/news/evertz-pharma-becomes-first-german-company-with-strategic-bitcoin-reserve-adds-100-btc-to-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Evertz-Pharma-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/evertz-pharma-becomes-first-german-company-with-strategic-bitcoin-reserve-adds-100-btc-to-treasury\" rel=\"nofollow\"> </a></p> <p>Evertz Pharma GmbH, a company focusing on premium natural cosmetics, has become Germany’s first company to adopt a strategic Bitcoin reserve model by purchasing an additional 100 BTC in May 2025—valued at approximately €10 million (~$10.8 million USD), according to a press release.&#160; The adoption marks a continued expansion of the company’s BTC treasury, which [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Crypto Industry’s Coveted Market Structure Bill Is Doomed, Lobbyists Say",
      "link": "https://decrypt.co/324686/crypto-coveted-market-structure-bill-doomed-lobbyists",
      "summary": "The landmark bill’s odds of passage have been derailed by macro political forces, crypto policy leaders believe."
    },
    {
      "title": "Invesco Hires JP Morgan Veteran to Lead Its $1.6 Billion Crypto ETF Business",
      "link": "https://decrypt.co/324691/invesco-hires-jpmorgan-veteran-lead-1-6-billion-crypto-etf-business",
      "summary": "The global asset manager, which boasts $1.8 trillion assets under management, has welcomed Kathleen Wrynn to manage its portfolio of crypto ETFs and other tokenized assets."
    },
    {
      "title": "Payments Giant Stripe to Acquire Crypto Wallet Tech Firm Privy",
      "link": "https://decrypt.co/324674/payments-giant-stripe-acquire-crypto-firm-privy",
      "summary": "Stripe is cozying up to crypto even more with its latest acquisition, adding crypto wallet infrastructure firm Privy."
    },
    {
      "title": "Gate Marks 12 Years in Crypto With ‘Evolving Vision’",
      "link": "https://decrypt.co/324658/gate-marks-12-years-in-crypto-with-evolving-vision",
      "summary": "The crypto exchange is celebrating its 12th anniversary with a sweeping brand transformation and pushes into AI and RWAs."
    },
    {
      "title": "Why You Are Thinking About Ethereum All Wrong",
      "link": "https://decrypt.co/324655/why-you-are-thinking-about-ethereum-all-wrong",
      "summary": "Current narratives around Ethereum would suggest the blockchain network is in distress. EY's Paul Brody explains what the critics get wrong."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Fintech giant Stripe to acquire crypto wallet provider Privy following $1.1B stablecoin deal",
      "link": "https://cryptobriefing.com/stripe-acquires-privy-enhancing-services/",
      "summary": "<p>Stripe's acquisition of Privy signals a significant step towards enhancing global digital financial infrastructure and streamlining crypto adoption.</p> <p>"
    },
    {
      "title": "Bitcoin rally could resume as tariff fears ease and CPI cools, says analyst",
      "link": "https://cryptobriefing.com/bitcoin-rally-potential-inflation-tariff-ease/",
      "summary": "<p>Eased tariff tensions and cooling inflation may boost Bitcoin, potentially prompting Fed rate cuts and renewed retail crypto interest.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Interactive Strength plans to invest $500M in Fetch.ai’s FET token to build an AI-focused crypto treasury",
      "link": "https://cryptobriefing.com/ai-focused-crypto-treasury-investment/",
      "summary": "<p>This move highlights a growing trend of public companies investing in AI-driven digital assets, potentially reshaping corporate finance.</p> <p>"
    },
    {
      "title": "Pro-Bitcoin Scott Bessent emerges as candidate for next Fed chair",
      "link": "https://cryptobriefing.com/fed-chair-successor-bessent-powell/",
      "summary": "<p>Bessent's potential Fed chair candidacy highlights a shift towards integrating cryptocurrency perspectives in U.S. monetary policy.</p> <p>"
    },
    {
      "title": "Solana ETFs could be approved in 3-5 weeks, SEC signals openness to staking",
      "link": "https://cryptobriefing.com/solana-etf-approval-potential-signals/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional investment in crypto, enhancing market legitimacy and innovation.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "South Korea’s stablecoin bill sparks KAIA’s 20% jump: More gains ahead?",
      "link": "https://ambcrypto.com/south-koreas-stablecoin-bill-sparks-kaias-20-jump-more-gains-ahead/",
      "summary": "<img alt=\"South Korea&#039;s stablecoin bill sparks KAIA&#039;s 20% jump: More gains ahead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_41_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />South Korea's crypto bill just sent KAIA flying...here's what we know!"
    },
    {
      "title": "90% chance for Solana ETFs in 2025 – Is it time to buy SOL now?",
      "link": "https://ambcrypto.com/solanas-spot-etfs-90-approval-odds-is-it-time-to-buy-sol/",
      "summary": "<img alt=\"Solana ETF\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Solana-ETF.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SOL could be grossly undervalued at current levels if the ETF approval happens in July."
    },
    {
      "title": "Avalanche adoption surges 275% – Can it help AVAX break above $24?",
      "link": "https://ambcrypto.com/avalanche-adoption-surges-275-can-it-help-avax-break-above-24/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-95-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />AVAX’s network activity is booming, but major resistance still threatens its short-term upside momentum."
    },
    {
      "title": "Ethena’s short-term direction hinges on $0.37 resistance – Will bulls prevail?",
      "link": "https://ambcrypto.com/ethenas-short-term-direction-hinges-on-0-37-resistance-will-bulls-prevail/",
      "summary": "<img alt=\"Ethena&#039;s short-term direction hinges on $0.37 resistance - Will bulls prevail?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-11T115334.177-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ENA faces breakout pressure as bulls confront trapped holders and rising volatility signals."
    },
    {
      "title": "SPX6900’s gains look strong, but THESE red flags could surprise you!",
      "link": "https://ambcrypto.com/spx6900s-gains-look-strong-but-these-red-flags-could-surprise-you/",
      "summary": "<img alt=\"Is SPX6900 unstoppable? Traders, wait, THESE 2 red flags suggest a rude wake-up!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250611_114632_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SPX has led the market with significant gains, but the sustainability of this rally is now in question."
    }
  ]
}