{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: BTC Climbs to 107K as 'War Drums Fade, Risk Appetite Roars'",
      "link": "https://www.coindesk.com/markets/2025/06/25/asia-morning-briefing-btc-climbs-to-107k-as-war-drums-fade-risk-appetite-roars",
      "summary": ""
    },
    {
      "title": "Bit Digital Exits BTC Mining to Focus Solely on ETH Staking Strategy",
      "link": "https://www.coindesk.com/markets/2025/06/25/bit-digital-exits-btc-mining-to-focus-solely-on-eth-staking-strategy",
      "summary": ""
    },
    {
      "title": "Bitcoin Rises Past $107K as FHFA's Pulte Orders Crypto Consideration in Mortgage Applications",
      "link": "https://www.coindesk.com/markets/2025/06/25/bitcoin-rises-past-107k-as-fhfas-pulte-orders-crypto-consideration-in-mortgage-applications",
      "summary": ""
    },
    {
      "title": "SoFi to Launch Blockchain Remittances With Stablecoins as Crypto Returns to Platform",
      "link": "https://www.coindesk.com/business/2025/06/25/sofi-to-launch-blockchain-remittances-with-stablecoins-as-crypto-returns-to-platform",
      "summary": ""
    },
    {
      "title": "Kalshi Joins Polymarket in Unicorn Club With Latest Fundraise: Report",
      "link": "https://www.coindesk.com/markets/2025/06/25/kalshi-joins-polymarket-in-unicorn-club-with-latest-fundraise-report",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "SoFi digital bank brings back crypto services after 2-year hiatus",
      "link": "https://cointelegraph.com/news/san-francisco-sofi-reoffering-crypto-trading-after-2-year-pause?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2FhMTMtMWFmYS03MGFlLTlhYzgtNDY5OWMzNmZiMGQz.jpg\" /></p><p>SoFi reenters the crypto space with onchain remittances and digital asset trading following the ease of regulations in the US.</p>"
    },
    {
      "title": "‘Fiat is fading’ — USD lowest in 3 years as Bitcoin reclaims $107K",
      "link": "https://cointelegraph.com/news/us-dollar-lows-iran-israel-bitcoin-uptrend-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzEzNjgtMDI4OS03ODQwLWFlN2UtZGU3ZDExZWRkMDU1.jpg\" /></p><p>Macroeconomist Lyn Alden said the US dollar barely “got any flight-to-safety bid” despite recent geopolitical tensions between Iran and Israel.</p>"
    },
    {
      "title": "Crypto ATM sting uncovers elderly widow who lost $281K in a scam",
      "link": "https://cointelegraph.com/news/widow-scammed-life-savings-crypto-atm-scam?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E5NDItMTEwMy03NDAwLTkyNzAtMTU1MjA2NjkxZWM4.jpg\" /></p><p>One of the victims identified in the police operation said she carried around $13,000 in cash at one point to send Bitcoin to scammers via crypto ATMs.</p>"
    },
    {
      "title": "Invesco Galaxy files for Solana ETF, 9 issuers now in the race",
      "link": "https://cointelegraph.com/news/invesco-galaxy-files-solana-etf-making-nine-bidders?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzMwZWYtYTE1Yy03MzA5LWJkZDYtOWRlZWEwOWIwYTVk.jpg\" /></p><p>Invesco and Galaxy Digital have filed the initial documents to launch a spot Solana ETF, making the ninth similar entry to be put before US regulators.</p>"
    },
    {
      "title": "ETH ETF flows impress, but Ether futures data suggest traders exercise caution",
      "link": "https://cointelegraph.com/news/eth-etf-flows-impress-but-ether-futures-data-suggest-traders-exercise-caution?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E5MDItNTA5Ny03MmE3LTkxYTYtMzNhZWQxZDVlYzNi.jpg\" /></p><p>Analysts are bullish on ETH’s long-term prospects and ETF inflows, but futures data paints a different picture.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Iran and Israel spent over $25B during the ’12-day war,’ equivalent to 1% of total Bitcoin supply",
      "link": "https://cryptoslate.com/insights/iran-and-israel-spent-over-25b-during-the-12-day-war-equivalent-to-1-of-total-bitcoin-supply/",
      "summary": "<p>The Iran-Israel conflict reportedly cost the two nations roughly $25.5 billion, worth over 240,837 BTC at current prices, according to a report by Opportunity Cost, a digital tool that translates global spending into Bitcoin and Satoshi equivalents. According to the platform, Israel fired Arrow interceptor missiles, each costing around $3 million or 28.3 BTC, to counter Iranian missiles [&#8230;]</p> <p>"
    },
    {
      "title": "Binance Bitcoin inflows plunge to 5,700 BTC, less than 50% of the monthly average since 2020",
      "link": "https://cryptoslate.com/binance-bitcoin-inflows-plunge-to-5700-btc-less-than-50-of-the-monthly-average-since-2020/",
      "summary": "<p>Binance’s monthly Bitcoin (BTC) inflows have fallen to 5,700 BTC, less than half the 12,000 BTC average recorded since 2020 and 25% of the 24,000 BTC that hit the exchange during the FTX panic of late 2022, CryptoQuant analyst Darkfost shared in a June 24 note. Darkfost’s data showed that every material deposit surge of [&#8230;]</p> <p>"
    },
    {
      "title": "European Commission to ease rules on foreign stablecoins despite ECB opposition",
      "link": "https://cryptoslate.com/european-commission-to-ease-rules-on-foreign-stablecoins-despite-ecb-opposition/",
      "summary": "<p>The European Union is preparing to relax its stance on foreign-issued stablecoins, potentially allowing U.S. dollar-backed tokens like USDC and USDT to circulate freely within the bloc, the Financial Times reported on June 25. According to the report, the European Commission will soon issue formal guidance enabling stablecoins issued outside the EU to be treated [&#8230;]</p> <p>"
    },
    {
      "title": "US adopts crypto in mortgage risks as Fannie Mae and Freddie Mac update asset models",
      "link": "https://cryptoslate.com/us-adopts-crypto-in-mortgage-risks-as-fannie-mae-and-freddie-mac-update-asset-models/",
      "summary": "<p>US Federal Housing Finance Agency (FHFA) Director Willian J. Pulte ordered on June 25 that Fannie Mae and Freddie Mac treat cryptocurrency reserves as eligible assets when they measure risk on single-family mortgage loans, effective immediately. The two government-sponsored enterprises must draft plans that show how they will recognize borrower crypto holdings without first converting [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase launches Cardano and Litecoin wrapped tokens cbADA, cbLTC on Base",
      "link": "https://cryptoslate.com/coinbase-launches-cardano-and-litecoin-wrapped-tokens-cbada-cbltc-on-base/",
      "summary": "<p>Coinbase launched wrapped tokens for Cardano (cbADA) and Litecoin (cbLTC) on its Base layer-2 network, the exchange said in a June 25 post. Each synthetic token is backed 1:1 by the underlying asset held in Coinbase custody, and proof-of-reserves pages list the on-chain addresses securing the collateral. The transparency pages already show 11,364 LTC and [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Trades Sideways — Bulls Preparing for Next Push?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-trades-sideways-2-20/",
      "summary": "XRP price started a fresh increase from the $2.150 zone. The price is consolidating gains and might aim for a move above the $2.220 zone. XRP price started a fresh increase above the $2.150 zone. The price is now trading above $2.150 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2.1320 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move up if it closes above the $2.220 resistance zone. XRP Price Eyes Upside Break XRP price remained supported and started a fresh increase above the $2.050 zone, like Bitcoin and Ethereum. The price recovered above the $2.080 and $2.120 resistance levels. The pair even cleared the $2.180 resistance and recently spiked above the $2.220 zone. A high was formed at $2.2294 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $1.910 swing low to the $2.2294 high. The price is now trading above $2.180 and the 100-hourly Simple Moving Average. Besides, there is a bullish trend line forming with support at $2.1320 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.220 level. The first major resistance is near the $2.250 level. The next resistance is $2.320. A clear move above the $2.320 resistance might send the price toward the $2.40 resistance. Any more gains might send the price toward the $2.480 resistance or even $2.50 in the near term. The next major hurdle for the bulls might be $2.550. Downside Correction? If XRP fails to clear the $2.220 resistance zone, it could start another decline. Initial support on the downside is near the $2.150 level. The next major support is near the $2.1320 level and the trend line. If there is a downside break and a close below the $2.1320 level, the price might continue to decline toward the $2.050 support or the 50% Fib retracement level of the upward move from the $1.910 swing low to the $2.2294 high. The next major support sits near the $2.00 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.150 and $2.1320. Major Resistance Levels – $2.220 and $2.250."
    },
    {
      "title": "Bitcoin Short-Term Holder Floor Rises Toward $100,000, Reinforcing Bullish Sentiment",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-short-term-holder-floor-rises-toward-100000-reinforcing-bullish-sentiment/",
      "summary": "Following a quick drop to nearly $98,000 over the weekend, Bitcoin (BTC) has recovered most of its recent losses and is now trading above $107,000 at the time of writing. Fresh on-chain data suggests that the short-term holder (STH) floor for BTC has been steadily rising toward the $100,000 level. Bitcoin STH Floor Approaching $100,000 According to a recent CryptoQuant Quicktake post by contributor unchained, Bitcoin’s STH Realized Price has been making its slow grind up toward the psychologically important $100,000 level. Notably, the analyst had earlier dubbed this metric as the “fault line” to watch. Related Reading: Bitcoin Binary CDD Hints At Healthy Consolidation, Not A Top For the uninitiated, the STH Realized Price represents the average price at which all Bitcoin held for less than 155 days was acquired. It acts as both a key psychological and technical support level. When the market price stays above it, STH are in profit and more confident, whereas if it falls below, fear and selling pressure often increase. Currently, the STH Realized Price hovers around $98,000. The analyst notes that each $500 rise in the STH Realized Price effectively resets the “new buyers’ comfort floor.” As this metric nears six figures, the mental stop-loss for newer investors also moves upward. The following chart illustrates two recent instances where BTC bounced sharply after touching the blue STH Realized Price line. This price action suggests a bullish structure, where selling pressure diminishes as soon as BTC revisits its average cost basis. Meanwhile, the premium &#8211; the difference between BTC’s spot price and STH Realized Price &#8211; currently hovers around 7.2%. A shrinking premium, typically under 10%, has historically signalled reduced market froth and often preceded the next leg up once open interest began to rebuild. On the long-term side, the long-term holder (LTH) Realized Price remains largely unchanged at $32,000, roughly one-third of the STH Realized Price. The analyst observes that these long-term coins are likely held in cold storage, indicating “strong hands” with little incentive to sell. They concluded: The blue line is climbing relentlessly; as long as BTC lives above it, the prevailing tide is still higher-lows, higher-highs. Lose it on a daily close, and we get our first real gut-check since April &#8211; otherwise the bull engine is merely cooling its cylinders. Experts Predict New High For BTC As BTC’s STH Realized Price continues to surge higher &#8211; resulting in a higher floor price for the digital asset &#8211; several crypto experts seem to agree that the cryptocurrency may soon reach a new all-time high (ATH) in the coming months. Related Reading: Bitcoin May Surprise Bears: $100K–$110K Range Shows Rising Short Interest For instance, Bitcoin is forming a bullish inverse head and shoulders pattern on the three-day chart, eyeing a potential ATH of as high as $150,000. At press time, BTC trades at $107,711, up 2.1% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Ethereum Price Signals Strength — Bullish Pop May Be Just Ahead",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-signals-strength-2450/",
      "summary": "Ethereum price started a fresh increase above the $2,350 zone. ETH is now showing positive signs and might aim for a move above the $2,550 zone. Ethereum started a fresh upward move above the $2,320 level. The price is trading above $2,350 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support at $2,440 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it settles above the $2,550 resistance zone in the near term. Ethereum Price Eyes More Gains Ethereum price started a fresh increase above the $2,250 support level, like Bitcoin. ETH price was able to clear the $2,320 and $2,350 resistance levels to move into a positive zone. The bulls even pushed the price above the 61.8% Fib retracement level of the downward move from the $2,568 swing high to the $2,115 low. The price is now facing hurdles near the $2,500 zone. Ethereum price is now trading above $2,450 and the 100-hourly Simple Moving Average. The price is now stuck near the 76.4% Fib retracement level of the downward move from the $2,568 swing high to the $2,115 low. On the upside, the price could face resistance near the $2,480 level. The next key resistance is near the $2,500 level. The first major resistance is near the $2,550 level. A clear move above the $2,550 resistance might send the price toward the $2,600 resistance. An upside break above the $2,600 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,720 resistance zone or even $2,800 in the near term. Another Drop In ETH? If Ethereum fails to clear the $2,550 resistance, it could start a fresh decline. Initial support on the downside is near the $2,440 level and the trend line. The first major support sits near the $2,390 zone. A clear move below the $2,390 support might push the price toward the $2,310 support. Any more losses might send the price toward the $2,220 support level in the near term. The next key support sits at $2,150. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,310 Major Resistance Level – $2,550"
    },
    {
      "title": "Ethereum Gears Up For Breakout Above $2,800 – Bullish Momentum Builds",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-gears-up-for-breakout-above-2800-bullish-momentum-builds/",
      "summary": "Ethereum has experienced a strong comeback after weeks of uncertainty and bearish momentum. Following a sharp breakdown below its long-standing consolidation range, ETH found support near the $2,100 level and has since surged 15% from Sunday’s low. The move comes amid improving market sentiment after a ceasefire agreement between Israel and Iran helped ease geopolitical tensions, while broader macroeconomic conditions remain in flux. Related Reading: Bitcoin Buy-Side Pressure Surges: Taker Buy Volume Spikes Sharply This recent bounce has placed Ethereum back into a critical technical zone, where bulls are once again attempting to reclaim control. After spending much of May and June in a sideways range, ETH is showing signs of renewed strength, fueling optimism that the next decisive move could be to the upside. Top analyst Mister Crypto shared a bullish technical outlook, highlighting that Ethereum is getting ready for a breakout. According to his view, the current price structure and momentum suggest ETH may be preparing to challenge previous resistance levels and enter a new phase of expansion. With on-chain activity starting to pick up and broader market confidence slowly returning, Ethereum could be positioning itself as the key altcoin to lead a potential rally in the coming weeks. Ethereum Reclaims Strength Ethereum has surged more than 15% from Sunday’s lows, recovering from sharp losses triggered by geopolitical tensions in the Middle East. The announcement of a ceasefire between Israel and Iran sent a wave of relief through global markets, with ETH leading the charge among major altcoins. After briefly losing key support levels, bulls are regaining momentum as Ethereum reclaims price levels last seen before the breakdown. This rebound marks a crucial moment for ETH, as it tests the strength of current market sentiment. While macroeconomic uncertainty continues—driven by growing fears of a U.S. recession, rising bond yields, and a cautious Federal Reserve—Ethereum appears to be consolidating for a potential breakout. The broader crypto market remains on edge, with altcoins underperforming Bitcoin, and many investors watching Ethereum closely as the likely catalyst for the long-awaited altseason. According to Mister Crypto, Ethereum is now preparing for a breakout above the $2,800 resistance. This level represents a major psychological and structural barrier, and a decisive move beyond it could redefine ETH’s trajectory for the remainder of the year. Volume is returning, and on-chain data shows rising confidence from long-term holders, signaling a potential shift in trend. If bulls succeed in pushing ETH past this zone, it could trigger renewed interest across the altcoin market and usher in a wave of fresh capital. As Ethereum flirts with this breakout level, its price action in the coming days may very well set the tone for the next phase of the crypto cycle. Related Reading: Ethereum Whale Loads Up: $422M In ETH Bought In Under a Month ETH Testing Resistance After 15% Surge Ethereum (ETH) is currently trading near $2,414 after rebounding sharply from the $2,100 zone, a level revisited last Sunday during heightened geopolitical tensions. The 8-hour chart shows a clean V-shaped recovery, with bulls pushing the price through the 200 SMA ($2,326), reclaiming short-term control. Volume surged on the way up, confirming strong buying interest during the bounce. However, ETH now faces a test near the $2,450–$2,500 zone, where the 50 and 100 SMAs converge. These moving averages, currently acting as resistance, previously played a key role during Ethereum’s consolidation in early June. A successful breakout above this range would open the door to a retest of the $2,700–$2,800 levels, as suggested by top analysts like Mister Crypto. Related Reading: Bitcoin Battles Key Support: Daily EMA-100 Must Hold to Prevent Deep Correction For now, price action remains in a neutral consolidation range with a slight bullish tilt. If Ethereum holds above the 200 SMA while building support above $2,400, the bullish case strengthens. However, failure to break above $2,500 could trigger another pullback toward the $2,300 level. The next few sessions will be crucial to determine whether ETH continues its breakout attempt or enters another phase of sideways consolidation amid broader market uncertainty. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Back In The Green — Momentum Builds for More Gains",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-green-105k/",
      "summary": "Bitcoin price started a fresh increase above the $105,500 zone. BTC is now consolidating and might aim for a move above the $108,000 resistance. Bitcoin started a fresh increase above the $105,500 zone. The price is trading above $105,500 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $107,400 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $106,000 zone. Bitcoin Price Eyes More Gains Bitcoin price started a fresh increase above the $103,500 zone. BTC gained pace and was able to climb above the $104,200 and $105,500 levels to enter a positive zone. The bulls pushed the price above the $106,500 resistance and the price tested the $108,200 zone. A high was formed at $108,165 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $98,272 swing low to the $108,165 high. Bitcoin is now trading above $106,000 and the 100 hourly Simple moving average. There is also a bullish trend line forming with support at $107,400 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $108,000 level. The first key resistance is near the $108,200 level or the 1.236 Fib extension level of the downward move from the $106,470 swing high to the $98,276 low. A close above the $108,200 resistance might send the price further higher. In the stated case, the price could rise and test the $110,000 resistance level. Any more gains might send the price toward the $112,000 level. Another Drop In BTC? If Bitcoin fails to rise above the $108,500 resistance zone, it could start another decline. Immediate support is near the $107,400 level and the trend line. The first major support is near the $105,500 level. The next support is now near the $104,000 zone. Any more losses might send the price toward the $103,500 support in the near term. The main support sits at $103,200, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $107,400, followed by $105,500. Major Resistance Levels – $108,500 and $110,000."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "FHFA Orders to Recognize Bitcoin And Other Cryptos in Mortgage Assessments",
      "link": "https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FHFA-Orders-to-Recognize-Bitcoin-And-Other-Cryptos-in-Mortgage-Assessments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fhfa-orders-to-recognize-bitcoin-and-other-cryptos-in-mortgage-assessments\" rel=\"nofollow\"> </a></p> <p>Fannie Mae and Freddie Mac are now directed to treat properly documented Bitcoin and other crypto assets as part of borrower reserves for mortgages.</p> <p>"
    },
    {
      "title": "Kraken Secures MiCA License To Offer Bitcoin And Crypto In Europe",
      "link": "https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Kraken-Becomes-First-Global-Bitcoin-Crypto-Platform-to-Secure-MiCA-License.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kraken-secures-mica-license-to-offer-bitcoin-and-crypto-in-europe\" rel=\"nofollow\"> </a></p> <p>The license allows Kraken to offer regulated bitcoin and crypto services across all 30 EEA countries.</p> <p>"
    },
    {
      "title": "GameStop Raising $450 Million From Convertible Senior Notes To Make Investments",
      "link": "https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/GameStop-Raising-450-Million-From-Convertible-Senior-Notes-To-Make-Investments.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gamestop-raising-450-million-from-convertible-senior-notes-to-make-investments\" rel=\"nofollow\"> </a></p> <p>GameStop boosts its convertible note offering to $2.7 billion, potentially for a Bitcoin allocation under its updated investment policy.</p> <p>"
    },
    {
      "title": "Mega Matrix Announces First Purchase Of 12 BTC For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Mega-Matrix-Announces-First-Purchase-of-12-BTC-for-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/mega-matrix-announces-first-purchase-of-12-btc-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Mega Matrix Inc., a Singapore based holding company that operates the FlexTV streaming platform, announced today its first Bitcoin purchase as part of a new treasury strategy. The company acquired 12 Bitcoin at an average price of approximately $105,554 per coin, including all fees and expenses.&#160; The purchase, completed at the end of May 2025, [&#8230;]</p> <p>"
    },
    {
      "title": "Digital Commodities Secures $3 Million to Expand Bitcoin Holdings",
      "link": "https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Digital-Commodities-Secures-3-Million-to-Expand-Bitcoin-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/digital-commodities-secures-3-million-to-expand-bitcoin-holdings\" rel=\"nofollow\"> </a></p> <p>The company now holds two Bitcoin and is raising $3 million through a private placement to accelerate its Bitcoin treasury strategy.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "US Housing Chief Orders Fannie Mae, Freddie Mac to Prepare for Crypto Assessment in Mortgages",
      "link": "https://decrypt.co/327087/us-housing-head-orders-fannie-mae-freddie-mac-accept-crypto",
      "summary": "Under a directive from the FHFA, Fannie Mae and Freddie Mac were ordered to prepare for crypto mortgage payments."
    },
    {
      "title": "Solana, Pudgy Penguins ETF Filings Added to SEC's Crypto To-Do List",
      "link": "https://decrypt.co/327076/solana-pudgy-penguins-etf-filings-sec-crypto",
      "summary": "A proposal for a Solana ETF and a new fund tied to Pudgy Penguins tokens have joined a growing list of products offering crypto exposure."
    },
    {
      "title": "Google's AlphaGenome AI Makes DNA Readable—And It's on GitHub",
      "link": "https://decrypt.co/327050/google-alphagenome-makes-dna-readable-github",
      "summary": "AlphaGenome, accessible via API, cracks the “junk DNA” code, outperforms top rivals in key tests, and puts advanced genomics tools within reach of labs around the world."
    },
    {
      "title": "Prediction Market Kalshi Notches $2 Billion Valuation With $185 Million Raise",
      "link": "https://decrypt.co/327074/prediction-market-kalshi-2-billion-valuation-185-million-raise",
      "summary": "Kalshi achieved unicorn status following its latest Series C funding round, amid the prediction markets platform's growing crypto embrace."
    },
    {
      "title": "Will GameStop Buy More Bitcoin? GME Boosts Latest Fundraise to $2.7 Billion",
      "link": "https://decrypt.co/327068/will-gamestop-buy-more-bitcoin-gme-boosts-latest-fundraise",
      "summary": "GameStop raised another $450 million that it can use to buy Bitcoin, boosting its latest raise to $2.7 billion. Will it grab more BTC?"
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Mortgage giants Fannie Mae, Freddie Mac directed to consider crypto as valid assets for home loan eligibility",
      "link": "https://cryptobriefing.com/fannie-mae-freddie-mac-crypto-mortgage-underwriting/",
      "summary": "<p>Integrating crypto assets into mortgage finance could broaden access to home loans, potentially reshaping financial inclusion and asset evaluation.</p> <p>"
    },
    {
      "title": "Fed’s Powell says Bitcoin and crypto have matured and become more mainstream",
      "link": "https://cryptobriefing.com/crypto-mainstream-adoption-fed/",
      "summary": "<p>The mainstreaming of crypto prompts regulatory reassessment, potentially reshaping financial policies and banking practices globally.</p> <p>"
    },
    {
      "title": "Starknet-based zkLend shuts down following exploit and ZEND token delisting from major exchanges",
      "link": "https://cryptobriefing.com/zklend-shutdown-zend-delisting/",
      "summary": "<p>The shutdown highlights the vulnerabilities in DeFi protocols and may deter investor confidence, impacting future decentralized finance projects.</p> <p>"
    },
    {
      "title": "Banking giant Barclays to block all crypto transactions on credit cards over debt and fraud concerns",
      "link": "https://cryptobriefing.com/barclays-crypto-ban-cards/",
      "summary": "<p>Barclays' crypto credit card ban highlights growing financial institutions' caution, potentially influencing global regulatory approaches.</p> <p>"
    },
    {
      "title": "Blockchain venture Republic to offer digital tokens tracking shares of Elon Musk’s SpaceX",
      "link": "https://cryptobriefing.com/tokenized-private-shares-spacex/",
      "summary": "<p>Republic's token initiative could democratize access to high-value private firms, but regulatory hurdles may challenge its long-term viability.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Solana traders bet on a bounce, but is the market ready to move?",
      "link": "https://ambcrypto.com/solana-traders-bet-on-a-bounce-but-is-the-market-ready-to-move/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-10-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />High-volume optimism meets hesitant momentum as SOL stands at a technical crossroads."
    },
    {
      "title": "DEXE climbs 10%, yet RISK lingers, with sellers in control – What next?",
      "link": "https://ambcrypto.com/dexe-climbs-10-yet-risk-lingers-with-sellers-in-control-what-next/",
      "summary": "<img alt=\"DEXE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_54_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />DEXE rallies 10%, but taker-seller pressure and overheating signals raise questions about trend durability."
    },
    {
      "title": "Norway’s Green Minerals to buy $1.2 billion in Bitcoin, citing fiat risk hedge",
      "link": "https://ambcrypto.com/norways-green-minerals-to-buy-1-2-billion-in-bitcoin-citing-fiat-risk-hedge/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"745\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Green-Minerals-to-Buy-1.2B-in-Bitcoin.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1324\" />Will larger, non-crypto companies follow in the footsteps of Strategy and Green Minerals?"
    },
    {
      "title": "BNB daily activity drops off a cliff – How long before the price follows?",
      "link": "https://ambcrypto.com/bnb-daily-activity-drops-off-a-cliff-how-long-before-the-price-follows/",
      "summary": "<img alt=\"BNB daily activity drops off a cliff - How long before the price follows?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250625_123611_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB is facing downward pressure as on-chain sentiment deteriorates."
    },
    {
      "title": "Circle’s 620% rally snaps as Wall Street warns of stablecoin showdown",
      "link": "https://ambcrypto.com/circles-620-rally-snaps-as-wall-street-warns-of-stablecoin-showdown/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Circle-CRCL.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is Circle overvalued? Here's what sparked its recent cool-off."
    }
  ]
}