{
  "CoinDesk": [
    {
      "title": "Hashed Research CEO Appointed Chief Policy Officer at Korea's Presidential Office",
      "link": "https://www.coindesk.com/policy/2025/06/06/hashed-research-ceo-appointed-chief-policy-officer-at-koreas-presidential-office",
      "summary": ""
    },
    {
      "title": "Billionaire Winklevoss Twins-Backed Exchange Gemini Files With SEC For Planned IPO",
      "link": "https://www.coindesk.com/business/2025/06/06/billionaire-winklevoss-twins-backed-exchange-gemini-files-with-sec-for-planned-ipo",
      "summary": ""
    },
    {
      "title": "Weekly Recap: Circle Scores Big on IPO Fever",
      "link": "https://www.coindesk.com/news-analysis/2025/06/06/circle-scores-big-on-ipo-fever",
      "summary": ""
    },
    {
      "title": "HIVE Digital Capacity Crosses 10 EH/s in May, Aims to More Than Double That by Year-End",
      "link": "https://www.coindesk.com/markets/2025/06/06/hive-digital-capacity-crosses-10-ehs-in-may-aims-to-more-than-double-that-by-year-end",
      "summary": ""
    },
    {
      "title": "House Dems Get Bonus Hearing on Crypto Market Structure, Assail Trump Conflicts",
      "link": "https://www.coindesk.com/policy/2025/06/06/house-dems-get-bonus-hearing-on-crypto-market-structure-assail-trump-conflicts",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Musician made $3M selling NFTs and lost it all to taxes and a crypto crash",
      "link": "https://cointelegraph.com/news/nft-artist-crypto-tax-nightmare-song?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ5ZDgtMjgwOC03OTJlLWExYWEtNzcyODliNzI4N2I4.jpg\" /></p><p>After earning $3 million from NFT sales, Jonathan Mann watched it vanish in a crash, and now he’s turned the ordeal into a painfully honest crypto tax tune.</p>"
    },
    {
      "title": "Singapore’s ousted crypto firms may not find shelter elsewhere",
      "link": "https://cointelegraph.com/news/singapore-crypto-shelter-elsewhere?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ1N2MtYjM1MS03M2Y0LWI1YmItMjI2ZWI1NjdmYTRi.jpg\" /></p><p>Singapore’s ousting of unlicensed firms was not a sudden move and it’s among several regions tightening licensing duties.</p>"
    },
    {
      "title": "Trump touts memecoin as sentiment gauge as $520M unlock nears",
      "link": "https://cointelegraph.com/news/trump-memecoin-unlock-july-2025-price-sentiment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzQ5MmItYTNkZC03MGFlLTllZDEtYWRlMjY1ODE5YzJh.jpg\" /></p><p>Trump seems to recognize his official memecoin, down 85% from its all-time high, as a tool to measure public sentiment.</p>"
    },
    {
      "title": "Spot Ether ETFs 15-day inflow streak accumulates $837.5M inflows",
      "link": "https://cointelegraph.com/news/spot-ether-etfs-inflow-streak-large-portion-net-flows?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTg2YTQtMmE0My03ODA2LWE3N2EtMmNjOGQzNjk2ZmJi.jpg\" /></p><p>The current streak of three consecutive trading weeks of inflows has accounted for approximately 25% of the total net inflows since the spot Ether ETFs launched in July 2024.</p>"
    },
    {
      "title": "‘Full porting Bitcoin’ could be Musk&#039;s Trump card in feud: Bitcoiners",
      "link": "https://cointelegraph.com/news/full-porting-bitcoin-could-be-musk-s-trump-card-in-feud-bitcoiners?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTIzZjYtZjFiOS03ODgxLWEzM2UtMmZkNTVjMjE1YTJi.jpg\" /></p><p>JAN3 founder Samson Mow says Elon Musk should go all in on Bitcoin before “they freeze his fiat assets.”</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Song A Day creator recounts ‘tax nightmare’ after making millions from NFT sale",
      "link": "https://cryptoslate.com/song-a-day-creator-recounts-tax-nightmare-after-making-millions-from-nft-sale/",
      "summary": "<p>Singer-songwriter Jonathan Mann recently shared the story of how earning millions in Ethereum (ETH) during a one-hour sale of his NFTs eventually became a &#8220;tax nightmare.&#8221; Mann has published one song a day over the past 17 years and released his 6,000th song on June 5, which was about the purported nightmare resulting from the [&#8230;]</p> <p>"
    },
    {
      "title": "Trump–Musk feud becomes memecoin meta, leads to surge in trading volume",
      "link": "https://cryptoslate.com/trump-musk-feud-becomes-memecoin-meta-leads-to-surge-in-trading-volume/",
      "summary": "<p>President Donald Trump and Elon Musk&#8217;s fallout caused a major spikes in memecoin launches and trading, with the largest tokens by trading activity generating over $355 million in volume over the past 24 hours, according to DEX Screener data. As traders seized on the pair’s high-profile social media clash using Solana&#8217;s ecosystem, Official Trump (TRUMP) [&#8230;]</p> <p>"
    },
    {
      "title": "Eric Trump says WLFI will acquire TRUMP for treasury, unofficial wallet project nixed",
      "link": "https://cryptoslate.com/eric-trump-says-wlfi-will-acquire-trump-for-treasury-unofficial-wallet-project-nixed/",
      "summary": "<p>Eric Trump announced that World Liberty Financial, the DeFi platform linked to President Donald Trump and his family, will take a significant treasury stake in the Official TRUMP memecoin. He also confirmed that the controversial Trump-branded wallet recently unveiled by the team behind the memecoin would not continue development. Wallet project nixed The announcement comes [&#8230;]</p> <p>"
    },
    {
      "title": "Spot Ethereum ETFs post 14-day inflow run, lifting year-to-date haul above $3B",
      "link": "https://cryptoslate.com/spot-ethereum-etfs-post-14-day-inflow-run-lifting-year-to-date-haul-above-3b/",
      "summary": "<p>Spot Ethereum (ETH) exchange-traded funds (ETFs) notched a 14-session streak of net inflows as of June 5, fueled by investment advisors and hedge fund managers. According to Bloomberg data shared by ETF Store CEO Nate Geraci, Ethereum ETFs since May 20 added roughly $812 million. This movement resulted in total net inflows of over $3 [&#8230;]</p> <p>"
    },
    {
      "title": "Senator Lummis says new Fed vice chair appointment signals ‘brighter future’ for crypto",
      "link": "https://cryptoslate.com/senator-lummis-says-new-fed-vice-chair-appointment-signals-brighter-future-for-crypto/",
      "summary": "<p>US Senator Cynthia Lummis said the confirmation of Michelle “Miki” Bowman as Vice Chair for Supervision at the Federal Reserve marks a critical shift in the regulatory approach toward digital assets. According to Lummis, the appointment is a “turning point” for crypto policy, and she expects a &#8220;brighter future&#8221; for the industry ahead. The Senate [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Repeating 2024 Rally? Analysts Eye ‘Real Breakout’ To $120,000",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-repeating-2024-rally-analysts-eye-real-breakout-to-120000/",
      "summary": "Amid the Trump-Musk online feud, Bitcoin (BTC) has hovered within the mid-and-low areas of its local price range, hitting a one-month low near the $100,000 support. However, some analysts suggest that the cryptocurrency is preparing for the “real” price jump toward a new all-time high (ATH) Related Reading: SUI Rally At Risk? Analysts Warn Of 30% Dip If This Level Doesn’t Hold Bitcoin Prepares For ‘Real Breakout’ Over the past 24 hours, Bitcoin experienced significant volatility fueled by the online feud between US President Donald Trump and Tesla and X owner Elon Musk. The flagship crypto’s price took a beating on Thursday afternoon after dropping by over 5% from the $105,000 level to the $100,000 support. Before the pullback, BTC had been attempting to reclaim its local mid-range area after its recent performance. Notably, the cryptocurrency traded sideways following its ATH rally to $111,980, hovering between the $106,800 and $109,700 price range. However, the cryptocurrency lost the key $106,800 support amid last week’s market retracement, which saw Bitcoin drop to $102,000 over the weekend. Since then, BTC has been attempting to reclaim the current levels. After yesterday’s drop, the largest cryptocurrency by market capitalization has surged 4.5%, climbing above the $104,000 level. Crypto trader Coinvo highlighted BTC’s one-year chart, pointing to the similarly looking price action between 2024 and 2025. According to the chart, Bitcoin recorded its first major pump after reclaiming its yearly opening level, consolidating within its new range for weeks before climbing to its Q1 2024 ATH. This year, the cryptocurrency has had a similar performance, although delayed, having reclaimed the yearly opening range and surging to the first major price surge in May. Similarly, analyst Alex Clay suggested that Bitcoin is preparing for the “real breakout” following its retests of the range’s mid-zone resistance in Q1 2025 and a “false” breakout last month. To the analyst, “We grabbed the liquidity below the Broken Supply Zone. Now looking for a Real Breakout” toward the $120,000 mark. BTC Price To Range For Two Weeks? The Cryptonomist noted that Bitcoin displays a 3-week bullish falling wedge formation, with the lower boundary sitting around the $101,000 level. Following the recent price drop, BTC bounced from that area, and could break out of the pattern if it reclaims the $105,000 barrier as support, targeting the $118,000-$120,000 levels. Meanwhile, market watcher Daan Crypto Trades highlighted that its price now trades at the mid-range again, near the Monthly opening price. To the trader, “it&#8217;s pretty safe to assume that these range high/lows are good triggers for whatever larger trend follows,” as BTC has been having a “relatively large move early in the month.” As he previously explained, Bitcoin tends to set its monthly high or low during the first week of the month, followed by a reversal in the opposite direction and a trend continuation until a new month begins. Based on this, he warned that if the price drops below yesterday’s lows, it will continue to trend down for another week or two, displaying “weakness and confirming a larger correction is due.” Related Reading: Ethereum Eyes 15% Move Amid Key Resistance Retest – Breakout Or Rejection Next? Nonetheless, if price surges above the monthly highs, around the $106,700 mark, “the correction is more likely to be over and there&#8217;s a good likelihood that we head to all-time highs and beyond.” “Good chance we range around this area for a while, though, without any of these levels breaking,” he concluded. As of this writing, Bitcoin trades at $104,224, a 2.6% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Crypto Suffers $1 Billion Flush As Musk-Trump Feud Shakes Bitcoin",
      "link": "https://www.newsbtc.com/bitcoin-news/crypto-1-billion-flush-musk-trump-shakes-bitcoin/",
      "summary": "Data shows the cryptocurrency sector has seen a large amount of liquidations following the volatility that Bitcoin and others have gone through in the past day. Bitcoin Has Seen A Rollercoaster Over The Last 24 Hours The past day has been a wild time for Bitcoin and the cryptocurrency market as a whole as prices have displayed some notable volatility. BTC, especially, has gone through quite the rollercoaster, with its price seeing swings in both the up and down direction. Related Reading: Bitcoin RSI Dips Below 30—Is A New All-Time High Next? Below is a chart that shows how the recent price action has looked for the number one digital asset. As is visible in the graph, the Bitcoin price first went down to a low of $100,400 from a high around $105,800 and then witnessed a recovery run back to $104,100. The coin is still overall down during the past day, but its loss stands at less than 2%. The other cryptocurrencies haven&#8217;t been so lucky, as their prices haven&#8217;t quite retraced to the same degree. Ethereum is still down almost 6% and Dogecoin about 7%. The volatile storm in the sector has come following a public feud between US President Donald Trump and Tesla founder Elon Musk. The spat began when the former said in an Oval Office meeting that he was &#8216;disappointed&#8217; in the latter over his criticism of the One Big Beautiful Bill Act. Musk had previously called the bill a &#8216;disgusting abomination.&#8217; The two let sparks fly on social media, with the SpaceX founder even accusing the President of being in the Epstein files. &#8220;That is the real reason they have not been made public,&#8221; said Musk in an X post. Crypto Liquidations Have Neared A Billion With all the volatility that has gripped Bitcoin and company during the past day, it&#8217;s only to be expected that the derivatives market would feel the impact. According to data from CoinGlass, a mass amount of liquidations have piled up on the various centralized exchanges. &#8220;Liquidation&#8221; here naturally refers to the forceful closure that any open contract has to go through if it amasses losses of a certain percentage. As displayed in the table, the cryptocurrency market has seen liquidations amounting to a whopping $970 million over the last 24 hours. Out of these, a staggering $854 million, representing 88% of the total, came from the long investors alone. This is naturally down to the fact that prices as a whole have gone down during this window. Related Reading: Solana’s Old Hands Are Moving—Is Trouble Brewing? Like usual, Bitcoin and Ethereum have led the sector in liquidations, contributing $346 million and $286 million, respectively. A mass liquidation event is popularly known as a &#8216;squeeze.&#8217; Considering that the longs have made up for an overwhelming majority of the latest event, it could be termed a long squeeze. Featured image from Dall-E, CoinGlass.com, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Recovers From $100K Dip While On-Chain Data Shows Rising Miner Activity",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-recovers-from-100k-dip-while-on-chain-data-shows-rising-miner-activity/",
      "summary": "Bitcoin is showing signs of recovery after a brief but sharp dip triggered by recent market turbulence linked to public tensions between Donald Trump and Elon Musk. The price of BTC had dropped to nearly $100,000 during the height of the reaction, but has since rebounded. At the time of writing, Bitcoin is trading at $104,891, marking a steady recovery from the 24-hour low. While the broader crypto market continues to digest the fallout, new data suggests that another force, miner activity, is beginning to shape the near-term outlook. Related Reading: Bitcoin Pullback or Setup? On-Chain Metrics Hint at What’s Coming Next Bitcoin Surge in Miner Inflows Could Pressure Price Action According to on-chain analytics published by CryptoQuant contributor CryptoOnchain, Bitcoin miners have dramatically increased the volume of BTC transferred to exchanges. Between May 19 and May 28, miner-to-exchange inflows exceeded $1 billion per day, levels not seen in previous market cycles. These inflows are often viewed as a proxy for miners&#8217; intent to sell, which could influence short-term supply dynamics and introduce added volatility to BTC’s spot market performance. The rise in realized inflows from miners to exchanges is interpreted as a sign of growing sell-side pressure. Since miners are key liquidity providers in the Bitcoin ecosystem, large-scale transfers to exchanges are typically seen as preparations to offload BTC. Historically, spikes in miner outflows have preceded periods of downward price pressure, particularly when they occur alongside fragile market conditions. CryptoOnchain emphasizes that while miner selling isn’t inherently negative, it can impact short-term price stability. As a result, traders and investors often monitor these flows to better assess potential risks. When miner inflows surge, it reflects the sector’s sentiment regarding profitability, operational stress, or anticipated price changes. CryptoOnchain noted: Paying close attention to these inflows—especially during historical peaks like the current phase—can help with risk management and more informed trading decisions. Hash Ribbon Signal Suggests Longer-Term Opportunity Amid rising sell pressure, another indicator is flashing a potential opportunity. CryptoQuant analyst Darkfost noted that Bitcoin’s Hash Ribbons indicator, a metric derived from comparing 30-day and 60-day moving averages of network hashrate, has recently produced a new buy signal. This metric is used to evaluate miner stress and recovery phases, and is generally interpreted as a signal that miners have gone through a period of capitulation and are now stabilizing or recovering. This signal has historically aligned with favorable long-term entry points, except in unique events like China’s 2021 mining ban. While the short-term effects of mining stress may contribute to price weakness, analysts suggest that these periods often set the stage for longer-term rallies. When miner capitulation resolves, it can clear excess supply from the market and establish stronger support levels. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin To Hit $180,000 In 2025? Analyst Highlights The Trigger",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-to-hit-180000-in-2025-analyst-highlights-the-trigger/",
      "summary": "Bitcoin dipped to $103,450 yesterday, wiping out about $1 billion in leveraged bets over the past 24 hours. Many traders hurried to sell, but the fall was short-lived. Related Reading: Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge Bitcoin found its footing and climbed back to $104,400 by the time this report was filed. According to a recent analysis by crypto researcher Klarch, this pullback was expected and might just be a pit stop before another run to fresh highs. Recurring Cycle Patterns Based on examination by Klarch, Bitcoin tends to follow a familiar path after each halving. One year after the 2016 halving, it rose about 280%. After the 2020 halving, it jumped roughly 550% in 367 days. Right now, Bitcoin has only moved up around 70% in the 416 days since the last halving. Klarch points out that in past cycles, these numbers picked up speed after a slow start. So, he says, there’s still room for more growth. Bitcoin cycles are identical&#8230; &#8211; In 2016, $BTC grew by 280%, 365 days after Halving &#8211; In 2020, $BTC grew by 550%, 367 days after Halving &#8211; Now, 416 days post-Halving, $BTC +70% — growth ahead&#8230; History repeats, here’s $BTC’s near future🧵👇 pic.twitter.com/wshX4egwbC — Klarck (@0xklarck) June 5, 2025 These percentages matter because they hint at what might come next. If Bitcoin’s history repeats, the best gains could be just around the corner. Information from blockchain data supports this too. For example, trading volume and on-chain addresses hit new highs in recent weeks. That fits the pattern Klarch described—after the initial rise, there’s often a bigger rally. Signs Of The Next Surge Bitcoin set a record of $112,100 on January 20, then edged up to $111,980 on May 22. Rather than signaling an end, Klarch believes these milestones mark the start of a higher peak. He sees those moves as part of the cycle’s build-up, not its climax. Based on his chart work, each cycle has multiple tops before it finally tops out. Klarch didn’t offer an exact date for a new peak, but he did suggest that Bitcoin has not yet hit its ceiling. He notes that a series of all-time highs usually happens when sentiment is still turning positive. Once more traders feel FOMO, the price often accelerates rapidly. Related Reading: Bitcoin Network Activity Booming Despite A Quiet Market—Data Demand And Liquidity Driving Price Liquidity pouring into the crypto market has been a key talking point. Klarch says that steady buys from institutions and US Bitcoin spot ETFs have made Bitcoin scarcer on exchanges. Michael Saylor&#8217;s Strategy and other big money players keep buying, which pushes supply lower. Based on figures presented by Klarch, this trend could lift Bitcoin to around $180,000—a rise of about 75% from current levels. VanEck, an asset manager, has shared a similar target. That makes Klarch’s outlook feel less like a lone voice. If big funds keep moving in and retail interest stays high, Bitcoin’s price might stay on the upswing. However, any pause in ETF inflows or a sudden shift in global markets could change that story. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "XRP Must Crash First—Then Comes The $10 Rally, Says Analyst",
      "link": "https://www.newsbtc.com/xrp-news/xrp-must-crash-first-then-10-rally/",
      "summary": "Crypto Insight UK has doubled down on a forecast that XRP must endure one last, violent shakeout before launching toward a long-awaited $10 milestone. In his latest video, the British analyst warned that “the most dense liquidity I’ve seen in a long time for XRP” still sits uncollected beneath current spot prices. Until that pool is swept, he argues, the market will not unlock the upside move he ultimately expects to carry the token into double-digit territory. XRP Needs One Last Flush “XRP didn’t come down as low as we wanted,” he told viewers. “It did hit the first key area of liquidity, but it didn’t take it all. That makes me think we’ve got continued downside.” In his own trading plan, the analyst has resting bids at roughly $2.01 and $1.95—a zone he believes will be tested once leveraged longs capitulate. Only after that “final flush,” he contends, can a rally toward $10 begin in earnest. The call comes amid broader cross-asset strength that has so far failed to translate into a sustained altcoin breakout. Silver is challenging decade-old highs near $36 an ounce, uranium contracts are pressing their recent peaks, and the Nasdaq Composite remains within sight of its all-time high. Yet despite what he calls “a broad-based commodities rally,” the analyst maintains that crypto still needs one more washout to clear residual excess. Related Reading: What Happens To The XRP Price If The 2017 Fractal Plays Out Again? Macro-political drama, he suggests, is only accelerating that process. He cited the public clash between Elon Musk and US president Donald Trump—sparked by Trump’s proposal for a four-trillion-dollar spending bill and Musk’s claim that Trump’s name appears in sealed Epstein files—as a narrative that briefly rattled risk markets. “If it brings the price to where I want it to go, fantastic,” he said dryly. “That’s all we’re looking at here.” On Ethereum he sees a similar dynamic. Open interest in ETH futures remains at all-time highs, a sign in his view that institutions are accumulating spot while shorting derivatives to hedge—a trade that could unwind violently should ETH pierce the $2,800 level. “When we get this squeeze to the upside,” he predicted, “we’ll see a fast move back toward all-time highs for ETH, probably toward $4,500 before you know it.” Related Reading: The Worst Case For XRP This Cycle? Just A Giga Rally To $19, Says Analyst Bitcoin, for its part, has already waded into the analyst’s preferred liquidity zone just above $100,000. Whether the flagship asset needs another dip, he said, is less important than what happens to its dominance. A brief surge in bitcoin market share toward 65.5% would, in his model, coincide with an XRP capitulation and set the stage for “crazy season,” his shorthand for a full-blown altcoin cycle. The hinge is XRP liquidity. Viewers were shown heat-map snapshots highlighting concentrated stop-loss orders beneath the May swing low. “People came long here after they thought, ‘Oh, the bottom’s in.’ That’s added to this liquidity below us,” he said. Until that layer is removed, he remains “80% sure” that price will probe lower—even though his own portfolio is almost entirely in spot XRP. “I’m on the side of wanting it to go,” he acknowledged. “If it goes up now, I’m happy. But I’d be highly surprised if we don’t get that push down.” Still, his end-point is unequivocally bullish. Once the liquidity has been harvested, he foresees a textbook bullish divergence on the daily relative-strength index—“lower low on price, higher low on RSI”—that would ignite what he calls the “next big push.” In that scenario, XRP would not merely revisit its 2021 peak near $3.80; it would overshoot to the analyst’s long-standing $10 target. “Let it send,” he concluded. At press time, XRP traded at $2.17. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin 2025 Las Vegas: Here’s What Went Down",
      "link": "https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-2025_ig.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down\" rel=\"nofollow\"> </a></p> <p>My name is Jenna Montgomery, and maybe you’ve read some of my news articles here before, or seen me on the TikTok. But today, I wanted to switch it up and give you an inside look at the Bitcoin 2025 Conference in Las Vegas through my eyes as an intern, hired just one [&#8230;]</p> <p>"
    },
    {
      "title": "TakeOver Successfully Hosts Second Annual BitGala Celebrating Bitcoin in Las Vegas",
      "link": "https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/TakeOver-Successfully-Hosts-Second-Annual-BitGala-Celebrating-Bitcoin-in-Las-Vegas.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/press-releases/takeover-successfully-hosts-second-annual-bitgala-celebrating-bitcoin-in-las-vegas\" rel=\"nofollow\"> </a></p> <p>LAS VEGAS, NV, May 26, 2025 &#8211; TakeOver, Magic Eden, Spark, and Stacks successfully hosted their second annual BitGala on May 26th at the Wynn in Las Vegas. The celebration brought together over 200 Bitcoin industry leaders and community members for an evening dedicated to celebrating Bitcoin. The BitGala was designed as a curated gathering [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini Files Draft With The SEC For Proposed IPO",
      "link": "https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini-Files-Draft-With-The-SEC-For-Proposed-IPO.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/gemini-files-draft-with-the-sec-for-proposed-ipo\" rel=\"nofollow\"> </a></p> <p>Gemini has confidentially filed a draft registration statement with SEC for a proposed IPO of its Class A common stock.</p> <p>"
    },
    {
      "title": "‘MicroStrategy of Asia’ Metaplanet Aims To Acquire Over 210,000 BTC By the End of 2027",
      "link": "https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘MicroStrategy-of-Asia-Metaplanet-Aims-To-Acquire-Over-210000-BTC-By-the-End-of-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/microstrategy-of-asia-metaplanet-aims-to-acquire-over-210000-btc-by-the-end-of-2027\" rel=\"nofollow\"> </a></p> <p>Metaplanet Inc. plans to acquire over 210,000 BTC by the end of 2027, which is equivalent to 1% of Bitcoin’s total supply.</p> <p>"
    },
    {
      "title": "Know Labs, Inc. Announces Adopting a Bitcoin Treasury Strategy, Starting with 1,000 Bitcoin",
      "link": "https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Know-Labs-Inc.-Announces-Adopting-a-Bitcoin-Treasury-Strategy-Starting-with-1000-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/know-labs-inc-announces-adopting-a-bitcoin-treasury-strategy-starting-with-1000-bitcoin\" rel=\"nofollow\"> </a></p> <p>Know Labs, Inc. announces making a Bitcoin Treasury Strategy, holding 1,000 Bitcoin and placing Greg Kidd as the CEO of the company.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Crypto Advocacy Groups Urge Dismissal of Case Against Bitcoin Mixer Samourai",
      "link": "https://decrypt.co/324098/crypto-advocacy-groups-urge-dismissal-case-bitcoin-mixer-samourai",
      "summary": "Crypto advocacy groups have argued that the case against Bitcoin mixer Samourai Wallet is unjust. Here's why."
    },
    {
      "title": "Circle IPO Outperforms Public Debuts From Meta, Robinhood and Airbnb",
      "link": "https://decrypt.co/324066/circle-ipo-outperforms-public-debuts-meta-robinhood-airbnb",
      "summary": "Stablecoin issuer Circle's stock skyrocketed out of the gate, beating the initial public markets performance of tech giants."
    },
    {
      "title": "Trump Crypto Wallet 'Isn't Moving Forward' After World Liberty Clash: Eric Trump",
      "link": "https://decrypt.co/324070/trump-crypto-wallet-isnt-moving-forward-eric-trump",
      "summary": "Eric Trump said Friday that the TRUMP meme coin team will not launch its crypto wallet following a dispute with World Liberty Financial."
    },
    {
      "title": "Polymarket to Serve as Official Prediction Market of Elon Musk’s X",
      "link": "https://decrypt.co/324062/polymarket-serve-official-prediction-market-elon-musks-x",
      "summary": "The two companies struck an agreement to create a product that will explain market moves, combining data from X posts, event contracts from Polymarket and xAI’s chatbot, Grok."
    },
    {
      "title": "Metaplanet Aims to Raise $5.3 Billion to Buy More Bitcoin",
      "link": "https://decrypt.co/324025/metaplanet-aims-raise-5-3-billion-to-buy-more-bitcoin",
      "summary": "The Bitcoin treasury is hungry for the leading cryptocurrency."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Circle rejected Ripple’s $5 billion buyout — now valued at over $20 billion after NYSE debut",
      "link": "https://cryptobriefing.com/circles-21-billion-valuation/",
      "summary": "<p>Circle's successful IPO highlights the growing legitimacy of stablecoins, potentially accelerating regulatory clarity and institutional adoption.</p> <p>"
    },
    {
      "title": "VanEck, 21Shares, and Canary urge SEC to revert to ‘first to file, first to approve’ standard for crypto ETFs",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec-standard/",
      "summary": "<p>The shift from a \"first-to-file\" to simultaneous approval for crypto ETFs may hinder innovation and favor larger firms, impacting market fairness.</p> <p>"
    },
    {
      "title": "Best way of staking USDT in 2025: Loopring AI-powered staking platform",
      "link": "https://cryptobriefing.com/ai-powered-staking-usdt-loopring/",
      "summary": "<p>Loopring's AI-powered staking platform offers up to 20% daily on USDT, leveraging AI &#38; Ethereum Layer 2 for optimal returns.</p> <p>"
    },
    {
      "title": "Elon Musk’s X names Polymarket as official prediction market partner",
      "link": "https://cryptobriefing.com/elon-musks-prediction-markets/",
      "summary": "<p>This partnership could enhance the accuracy of public sentiment analysis, potentially influencing decision-making in politics and finance.</p> <p>"
    },
    {
      "title": "Apple, X, and Google hold talks with crypto firms on stablecoin integration",
      "link": "https://cryptobriefing.com/stablecoin-integration-tech-discussions/",
      "summary": "<p>The integration of stablecoins by major tech firms could revolutionize global payment systems, enhancing efficiency and reducing costs.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Is Bitcoin’s price breaking out again? Analyzing THIS metric may be key!",
      "link": "https://ambcrypto.com/is-bitcoins-price-breaking-out-again-analyzing-this-metric-may-be-key/",
      "summary": "<img alt=\"Is Bitcoin&#039;s price breaking out again? Here&#039;s what this metric says!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-7.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Could Bitcoin be inching towards a breakdown before the breakout?"
    },
    {
      "title": "ETF issuers’ latest warning – SEC’s approval process ‘kills innovation, aids giants’",
      "link": "https://ambcrypto.com/etf-issuers-latest-warning-secs-approval-process-kills-innovation-aids-giants/",
      "summary": "<img alt=\"ETF issuers&#039; latest warning - SEC’s approval process &#039;kills innovation, aids giants&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"993\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/VanEck-on-SEC-and-its-ETF-approval-planning.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1766\" />Will Trump’s influence tip the scales on pending ETF approvals?"
    },
    {
      "title": "Eric Trump’s WLFI reveal splits market – Is it more than just memecoin theatrics?",
      "link": "https://ambcrypto.com/eric-trumps-wlfi-reveal-splits-market-is-it-more-than-just-memecoin-theatrics/",
      "summary": "<img alt=\"Eric Trump’s WLFI reveal splits market – Is it just more memecoin theatrics?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-1-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />WLFI is on the TRUMP bandwagon - Power move or pump-and-dump?"
    },
    {
      "title": "Wall Street floods into Bitcoin Futures as CME trader count hits all-time high",
      "link": "https://ambcrypto.com/wall-street-floods-into-bitcoin-futures-as-cme-trader-count-hits-all-time-high/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"529\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Wall-Street-Floods-Into-Bitcoin-Futures.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"940\" />Is Bitcoin on the verge of breaking free from volatility to dominate mainstream finance?"
    },
    {
      "title": "Everything you need to know about the $3.8B in Bitcoin, Ethereum Options expiry",
      "link": "https://ambcrypto.com/everything-you-need-to-know-about-the-3-8b-in-bitcoin-ethereum-options-expiry/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-2-2.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Could more volatility be in store for the crypto markets?"
    }
  ]
}