{
  "CoinDesk": [
    {
      "title": "Crypto Traders Mint Millions From Grok Glitching on 'MechaHitler'",
      "link": "https://www.coindesk.com/markets/2025/07/09/crypto-traders-mint-millions-from-grok-glitching-on-mechahitler",
      "summary": ""
    },
    {
      "title": "Memecoin PNUT Rips on Elon Musk’s Epstein Cue",
      "link": "https://www.coindesk.com/markets/2025/07/09/memecoin-pnut-rips-on-elon-musks-epstein-cue",
      "summary": ""
    },
    {
      "title": "Key Market Dynamic Keeps Bitcoin, XRP Anchored to $110K and $2.3 as Ether Looks Prone to Volatility",
      "link": "https://www.coindesk.com/markets/2025/07/09/key-market-dynamic-keeps-bitcoin-xrp-anchored-to-usd110k-and-usd2-3-as-ether-looks-prone-to-volatility",
      "summary": ""
    },
    {
      "title": "Robinhood Says OpenAI Stock Tokens Backed by Special Purpose Vehicle",
      "link": "https://www.coindesk.com/markets/2025/07/09/robinhood-says-openai-stock-tokens-backed-by-special-purpose-vehicle",
      "summary": ""
    },
    {
      "title": "OmegaPro Founder and Co-Conspirator Charged by U.S. DOJ in $650M Ponzi Scheme",
      "link": "https://www.coindesk.com/policy/2025/07/09/omegapro-founder-and-co-conspirator-charged-by-us-doj-in-650m-ponzi-scheme",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin lacks ‘sustained momentum’ for new high as traders are hesitant",
      "link": "https://cointelegraph.com/news/bitcoin-traders-momentum-all-time-highs-hesitant-bitfinex?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTAzY2QtNzZiZS03YTY1LTkwNDQtZDlhODI5NWIyNDUw.jpg\" /></p><p>Bitcoin traders are showing a “lack of follow-through strength” as BTC struggles to break its current all-time high level, says Bitfinex.</p>"
    },
    {
      "title": "SharpLink Gaming pops 28% as Ethereum holdings surpass $533M",
      "link": "https://cointelegraph.com/news/sharplink-gaming-stock-surges-ether-treasury-growth?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2Q1NDUtNjhjMi03YzI5LWIyMjMtZTBlNGI4YmIwOThi.jpg\" /></p><p>SharpLink Gaming’s total Ether holdings hit 205,634 ETH after its latest round of buys, which it will commit to staking.</p>"
    },
    {
      "title": "US charges 2 men over $650M OmegaPro crypto scam",
      "link": "https://cointelegraph.com/news/us-charges-two-over-650m-omegapro-crypto-scam?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NTY1NTctNDk3Yi03NzBjLWE3MWMtYmI3NjQ4MTE1OWFm.jpg\" /></p><p>US prosecutors charged two men for allegedly running the crypto fraud scheme OmegaPro, which promised 300% returns to investors.</p>"
    },
    {
      "title": "Bitcoin lacked mass media coverage in Q2: Report",
      "link": "https://cointelegraph.com/news/bitcoin-lacked-coverage-mass-media-q2-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VjZmYtMGM4Mi03ODgzLWIyNjEtNWEyMTc2ZDIyZGJi.jpg\" /></p><p>Major news outlets The Wall Street Journal, the Financial Times and The New York Times published just 13 articles on Bitcoin in Q2, according to research from Perception.</p>"
    },
    {
      "title": "Crypto traders ‘starting to salivate’ as Bitcoin inches back toward $110K",
      "link": "https://cointelegraph.com/news/crypto-traders-bitcoin-bullish-comments-surge-hopes-110k-btc-price?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VjN2UtMDYyOC03ZDcwLWE2NWItYTdjOWJiYWFlYzUx.jpg\" /></p><p>Santiment says the ratio of bullish to bearish Bitcoin comments on social media has hit a three-week high as traders grow more optimistic about Bitcoin breaking above $110,000.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Survey finds gaps in mainstream Bitcoin coverage, leaving institutional investors exposed",
      "link": "https://cryptoslate.com/survey-finds-gaps-in-mainstream-bitcoin-coverage-leaving-institutional-investors-exposed/",
      "summary": "<p>A second-quarter survey of 18 mainstream news outlets logged 1,116 Bitcoin (BTC) stories and measured sentiment at 31% positive, 41% neutral, and 28% negative, according to Bitcoin analysis firm Perception. The data reveal a significant gap between finance-focused media that cover the market extensively and legacy publications that rarely address it. Sparse coverage Perception counted [&#8230;]</p> <p>"
    },
    {
      "title": "Joe Lubin forecasts Ethereum treasury strategies will reshape Wall Street perception",
      "link": "https://cryptoslate.com/joe-lubin-forecasts-ethereum-treasury-strategies-will-reshape-wall-street-perception/",
      "summary": "<p>Ethereum and Consensys co-founder Joe Lubin said companies adopting ETH treasury strategies will play a critical role in communicating the second-largest digital asset&#8217;s value to Wall Street, as major financial institutions ramp up blockchain use and process around 24 million transactions daily. Lubin made the statement during an interview with CNBC on July 8 in [&#8230;]</p> <p>"
    },
    {
      "title": "Stablecoin issuers’ $182 billion US Treasury hoard ranks 17th among countries, beating UAE and South Korea",
      "link": "https://cryptoslate.com/stablecoin-issuers-182-billion-us-treasury-hoard-ranks-17th-among-countries-beating-uae-and-south-korea/",
      "summary": "<p>Four US-dollar stablecoin issuers hold roughly $182 billion in US Treasury bills, an amount that would slot them 17th on the Treasury Department’s country-by-country league table. The amount in overnight Treasury-collateralized repos and Treasury-heavy money market funds would put the group between Norway’s $195.9 billion and Saudi Arabia’s $133.8 billion. Tether&#8217;s USDT tops the cohort. [&#8230;]</p> <p>"
    },
    {
      "title": "Volkswagen ADMT chooses Solana-based Hivemapper to power Robotaxi test fleet",
      "link": "https://cryptoslate.com/volkswagen-admt-chooses-solana-based-hivemapper-to-power-robotaxi-test-fleet/",
      "summary": "<p>Volkswagen ADMT, the automaker’s autonomous-driving subsidiary, will source real-time street-level data from Bee Maps, a spatial intelligence service that runs on Hivemapper’s Solana-based mapping network. According to Hivemapper CEO Ariel Seidman, the partnership “shifts mapping from static to living,” and that robotaxi fleets require data “that evolves as fast as the streets do.” Bee Maps [&#8230;]</p> <p>"
    },
    {
      "title": "SharpLink stock continues surging as treasury tops 200k Ethereum",
      "link": "https://cryptoslate.com/sharplink-stock-continues-surging-as-treasury-tops-200k-ethereum/",
      "summary": "<p>SharpLink Gaming shares surged nearly 26% on July 8 after the Minneapolis-based online gaming company revealed a major expansion of its crypto treasury, bringing its total Ethereum (ETH) holdings to over 200,000 coins. The company announced it had purchased an additional 7,689 ETH for approximately $19.2 million at an average price of $2,501 per coin. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin & Stablecoin Reserves Diverge On Binance: Liquidity Explosion Brewing?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-stablecoin-diverge-binance-explosion/",
      "summary": "On-chain data shows the Binance Exchange Reserve has diverged between Bitcoin and the stablecoins. Here&#8217;s what this could mean for the market. Bitcoin &#38; Stablecoin Exchange Reserves Have Decoupled On Binance In a CryptoQuant Quicktake post, an analyst has talked about the latest trend in the Binance Exchange Reserve for Bitcoin and the stablecoins. The &#8220;Exchange Reserve&#8221; here refers to an on-chain metric that keeps track of the total amount of a given asset that&#8217;s sitting on the wallets attached to a centralized exchange. When the value of this metric rises, it means the holders are making net deposits of the asset to the platform. Generally, investors use exchanges when they want to participate in trading activities, so them making inflows could signal appetite for trading the coin away. Related Reading: Ethereum ETF Inflows Hit 8-Week Streak—Institutions Still Buying For cryptocurrencies like Bitcoin, this is something that can naturally have a bearish impact on the price. The same, however, isn&#8217;t true in the case of the stablecoins, as they are, by definition, always stable around the same value as the fiat currency that they are pegged to. Investors usually store their capital in the form of these tokens when they want to avoid the volatility associated with assets like Bitcoin. Many of them, however, plan to eventually return back to the volatile side. Once they have decided to make the switch, they transfer their stablecoins to exchanges. When they make the swap to a coin like Bitcoin, its price naturally observes a buying boost. As such, stablecoin inflows can be bullish for the volatile cryptocurrencies. Now, here is the chart shared by the analyst that shows the trend in the Exchange Reserve of Binance for Bitcoin and the stablecoins over the last couple of years: As displayed in the above graph, the Binance Exchange Reserve for the two asset classes showed some correlation in 2024. But by the end of the year, a shift had occurred, with the stablecoins witnessing sharp inflows and Bitcoin outflows. The two have remained decoupled in 2025 so far, although their trends no longer diverge as extremely. The stablecoin Binance exchange reserve has recently been trending sideways, while the one for Bitcoin has rapidly been moving down. Related Reading: Dogecoin Resistance Walls Ahead: Analyst Flags 3 Key Levels Thus, it would appear that there is a large amount of fiat-tied tokens on the exchange potentially waiting to be deployed into the volatile side and at the same time, investors are also pulling out BTC supply, hinting at ongoing accumulation. This could hint at bullish conditions aligning on the largest cryptocurrency exchange, but it only remains to be seen whether the setup would reflect in the Bitcoin price or not. BTC Price Bitcoin is holding steady as its price is still trading around the $108,800 level. Featured image from Dall-E, CryptoQuant.com, chart from TradingView.com"
    },
    {
      "title": "2% Of All XRP Is In His Hands — But Who Is He?",
      "link": "https://www.newsbtc.com/altcoin/2-of-all-xrp-is-in-his-hands-but-who-is-he/",
      "summary": "A long‑time figure in the world of digital money and a noted XRP advocate stepped out of the shadows this week, sparking fresh chatter among investors and developers alike. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 Arthur Britto, who co‑founded Ripple Labs in 2012, broke a 14‑year silence with a single emoji on X. That tiny message carried big weight. His name rarely surfaces in headlines, but his work helped build XRP into one of the top assets by market value. Impact Of A Secretive Founder According to reports, Britto kept a low profile while helping craft the XRP Ledger’s code. He holds a 2% stake in XRP under a deal made when the company launched. That slice of holdings could be worth billions if the token’s price ever climbed high enough. Some in the market worry that if Britto ever sold even part of that stake, it might send prices tumbling. 🚨⚠️ HE CO-CREATED THE XRP LEDGER. HE HOLDS 2% OF ALL XRP. HE’S NEVER BEEN SEEN IN PUBLIC. Arthur Britto might be the most important figure in crypto you’ve never heard of. Let’s dive into the mystery.🧵👇 pic.twitter.com/xKyiYXIpGY — All Things XRP (@XRP_investing) July 5, 2025 The Satoshi Connection Based on reports, comparisons to Bitcoin’s creator have swirled around Britto for years. Some fans point to the fact that Satoshi Nakamoto’s last known post came just as the XRP Ledger went live. That timing alone has led people to whisper that Britto could be Satoshi under a different name. No proof supports that idea. Experts say it’s more likely just a coincidence. Britto’s lone emoji on X was verified by Ripple CTO David Schwartz. That confirmation set off a wave of theories about what might come next. Some speculated a new protocol update. Others thought it hinted at a partnership or a fresh product launch. So far, nothing public has followed"
    },
    {
      "title": "Dogecoin (DOGE) Eyes Breakout — Can Bulls Unleash the Next Surge?",
      "link": "https://www.newsbtc.com/analysis/doge/dogecoin-doge-eyes-breakout-0-1650-2/",
      "summary": "Dogecoin started a fresh increase above the $0.1680 zone against the US Dollar. DOGE is now consolidating and might aim for a move above $0.1720. DOGE price started a fresh increase above the $0.1650 and $0.1680 levels. The price is trading above the $0.1680 level and the 100-hourly simple moving average. There is a bullish trend line forming with support at $0.1680 on the hourly chart of the DOGE/USD pair (data source from Kraken). The price could start a fresh rally if it clears the $0.1720 and $0.1750 resistance levels. Dogecoin Price Eyes More Gains Dogecoin price started a fresh increase from the $0.1650 zone, like Bitcoin and Ethereum. DOGE was able to climb above the $0.1665 and $0.1680 resistance levels. The bulls even pushed the price above the $0.170 resistance. There was a steady increase and the price even spiked above the 50% Fib retracement level of the downward move from the $0.1722 swing high to the $0.1657 low. Dogecoin price is now trading above the $0.1680 level and the 100-hourly simple moving average. Besides, there is a bullish trend line forming with support at $0.1680 on the hourly chart of the DOGE/USD pair. Immediate resistance on the upside is near the $0.1720 level. The first major resistance for the bulls could be near the $0.1730 level or the 61.8% Fib retracement level of the downward move from the $0.1722 swing high to the $0.1657 low. The next major resistance is near the $0.1750 level. A close above the $0.1750 resistance might send the price toward the $0.180 resistance. Any more gains might send the price toward the $0.200 level. The next major stop for the bulls might be $0.2120. Another Decline In DOGE? If DOGE’s price fails to climb above the $0.1750 level, it could start another decline. Initial support on the downside is near the $0.1680 level or the trend line zone. The next major support is near the $0.1650 level. The main support sits at $0.1610. If there is a downside break below the $0.1610 support, the price could decline further. In the stated case, the price might decline toward the $0.1550 level or even $0.1520 in the near term. Technical Indicators Hourly MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.1680 and $0.1650. Major Resistance Levels – $0.1720 and $0.1750."
    },
    {
      "title": "Bitcoin Absorbs Strong Selling Pressure On Binance Derivatives – Breakout Ahead?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-absorbs-strong-selling-pressure-on-binance-derivatives-breakout-ahead/",
      "summary": "Bitcoin (BTC) has remained range-bound between $100,000 and $110,000 since May 7, aside from a few dips to as low as $98,000 in June, which were quickly followed by daily candle closes above the $100,000 level. Recent analysis reveals that BTC has withstood sustained selling pressure on Binance Derivatives throughout this period. Bitcoin Withstands Binance Derivatives Sell-Off According to a CryptoQuant Quicktake post by contributor BorisVest, taker users on Binance Derivatives have consistently engaged in sell-side activity for at least the past 45 days. Notably, the Cumulative Volume Delta (CVD) has remained negative throughout this time. For the uninitiated, the CVD measures the net difference between market buy &#8211; aggressive buying &#8211; and market sell &#8211; aggressive selling &#8211; orders over time. It helps traders identify whether buying or selling pressure is dominating, even if price remains stable. Related Reading: Bitcoin Short-Term Holder Floor Rises Toward $100,000, Reinforcing Bullish Sentiment BorisVest noted that Binance Derivatives traders are treating each BTC bounce or rally as a selling opportunity, opening aggressive short positions via market sell orders. However, this strong sell pressure has failed to push prices lower, as BTC continues to absorb the selling activity and maintain support above $100,000. The analyst added that as long as BTC remains within its current range &#8211; between $100,000 and $110,000 &#8211; while absorbing sell pressure, the potential for upside remains intact. He explained: The CVD metric plays a crucial role here. It aggregates both taker and maker activity to provide a real-time picture of net buy/sell pressure. The fact that CVD remains in decline confirms the dominance of sell-side flow. Yet, the inability of price to drop further despite this pressure may signal that Bitcoin is being absorbed by institutional or large players in the background. That said, other analysts interpret the persistent selling pressure differently. For example, fellow CryptoQuant analyst Crazzyblockk recently observed that new buyer demand is struggling to keep pace with the combined supply pressure from newly mined BTC and selling by long-term holders. BTC Eyeing A Breakout Ahead? Bitcoin’s resilience in the face of heavy selling on Binance Derivatives has once again sparked speculation about a potential breakout. Several additional data points suggest that BTC may be poised to move into a higher price range soon. Related Reading: Bitcoin Forming Inverse Head And Shoulders Pattern – Is $150,000 The Next Target? For instance, recent on-chain data shows that &#8220;weak hands&#8221; are offloading their BTC holdings to larger, more established investors &#8211; indicating a broader shift in sentiment favoring Bitcoin. Meanwhile, institutional interest in the asset continues to grow. Additionally, the Bitcoin Yearly Percentage Trend suggests that BTC could top out around $205,000 by the end of 2025. At press time, BTC trades at $108,589, up 0.4% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "XRP Price Regains Traction — Is a Powerful Upside Break Brewing?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-regains-traction-2-32/",
      "summary": "XRP price started a fresh increase above the $2.30 zone. The price is now showing positive signs and might climb above the $2.32 resistance. XRP price started a fresh increase above the $2.280 zone. The price is now trading above $2.280 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.280 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above the $2.250 zone. XRP Price Eyes Fresh Increase XRP price started a fresh increase after it settled above the $2.2620 level, beating Bitcoin and Ethereum. The price was able to climb above the $2.280 resistance level. The recent move was positive and the bulls pushed the price above the 50% Fib retracement level of the downward move from the $2.353 swing high to the $2.251 low, and tested the $2.32 zone. Besides, there is also a key bullish trend line forming with support at $2.280 on the hourly chart of the XRP/USD pair. The price is now trading above $2.280 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $2.320 level. The first major resistance is near the $2.330 level or the 76.4% Fib retracement level of the downward move from the $2.353 swing high to the $2.251 low. A clear move above the $2.330 resistance might send the price toward the $2.350 resistance. Any more gains might send the price toward the $2.40 resistance or even $2.420 in the near term. The next major hurdle for the bulls might be near the $2.50 zone. Another Decline? If XRP fails to clear the $2.320 resistance zone, it could start another decline. Initial support on the downside is near the $2.280 level and the trend line zone. The next major support is near the $2.250 level. If there is a downside break and a close below the $2.250 level, the price might continue to decline toward the $2.220 support. The next major support sits near the $2.20 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.280 and $2.250. Major Resistance Levels – $2.330 and $2.350."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Showed Up in DC — And Washington Took Notice",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Showed-Up-in-DC-—-And-Washington-Took-Notice-fotor-2025070812361.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice\" rel=\"nofollow\"> </a></p> <p>Reflections on the Bitcoin Policy Summit in Washington DC during May 2025. </p> <p>"
    },
    {
      "title": "Bow Valley Credit Union in Canada turns on Bitcoin purchases for Albertans",
      "link": "https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_an_orange_bull_running_through_an_Alberta_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans\" rel=\"nofollow\"> </a></p> <p>BVCU’s Bitcoin Gateway, with Balance Custody and Bull Bitcoin API, simplifies buying bitcoin. “Facilitates institutional adoption,” says Francis Pouliot. </p> <p>"
    },
    {
      "title": "KULR Secures $20M Bitcoin-Backed Credit Facility from Coinbase Credit",
      "link": "https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Secures-20M-Bitcoin-Backed-Credit-Facility-from-Coinbase-Credit.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit\" rel=\"nofollow\"> </a></p> <p>The deal sets up a multi-draw loan facility worth up to $20 million to expand its Bitcoin holdings.</p> <p>"
    },
    {
      "title": "Sequans Closes $384 Million Investment To Launch Bitcoin Treasury Initiative",
      "link": "https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Sequans-Closes-384-Million-Investment-To-Launch-Bitcoin-Treasury-Initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a fabless semiconductor company focusing on 5G/4G IoT semiconductor technology, has officially closed a $384 million strategic investment to kick off its Bitcoin treasury initiative. The deal combines $195 million in equity financing and $189 million in secured convertible debentures, reflecting growing institutional appetite for Bitcoin. The Offering included the sale of over [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet Enters ‘Bitcoin Gold Rush’ with Plans to Buy 210,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Metaplanet-Enters-Bitcoin-Gold-Rush-with-Plans-to-Buy-210000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027\" rel=\"nofollow\">Metaplanet Enters &#8216;Bitcoin Gold Rush&#8217; with Plans to Buy 210,000 BTC by 2027</a></p> <p>Japan’s top bitcoin treasury firm aims to grow its holdings to 210,000 BTC by 2027 and wants to use its growing reserves to buy cash-generating businesses.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "New Zealand to Ban Crypto ATMs, Cap Transfers in AML Regime Shake-Up",
      "link": "https://decrypt.co/329228/new-zealand-bans-crypto-atms-caps-transfers",
      "summary": "With 221 machines nationwide, New Zealand joins countries reining in crypto kiosks over rising financial crime concerns."
    },
    {
      "title": "Inside North Korea's Hiring Scams Targeting Crypto Firms",
      "link": "https://decrypt.co/329225/inside-north-korea-hiring-scams-crypto-firms",
      "summary": "Companies and recruiters are warning that North Korea is hiring Europeans as fronts for job interviews, and the problem is only getting worse."
    },
    {
      "title": "Grok Glitch Inspires Wave of ‘MechaHitler’ Meme Coins",
      "link": "https://decrypt.co/329219/grok-glitch-inspires-mechahitler-meme-coins",
      "summary": "Rogue AI hallucinations by Grok have given rise to new crypto memes as well as associated tokens on Solana and Ethereum."
    },
    {
      "title": "Goblintown Heads to the Trenches With Solana Meme Coin Launch",
      "link": "https://decrypt.co/329100/goblintown-heads-trenches-solana-meme-coin-launch",
      "summary": "The creator of Ethereum NFT collection Goblintown thinks there's a better way to launch meme coins—and it just did so with GOB on Solana."
    },
    {
      "title": "Polymarket Rules 'No' on $237M Controversial Bet Over Zelenskyy's Suit",
      "link": "https://decrypt.co/329210/polymarket-rules-no-237m-bet-zelenskyys",
      "summary": "Discontent over the market’s resolution has reignited scrutiny of UMA’s dispute system and the influence of large Polymarket stakeholders."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trillion-dollar bank clears Bitwise crypto ETF for advisor-managed accounts",
      "link": "https://cryptobriefing.com/crypto-etf-approval-bitwise-bank/",
      "summary": "<p>Institutional adoption of crypto ETFs signals a shift towards mainstream acceptance, potentially increasing crypto's role in diversified portfolios.</p> <p>"
    },
    {
      "title": "Phantom introduces in-wallet perps trading powered by Hyperliquid",
      "link": "https://cryptobriefing.com/in-wallet-perps-trading-phantom/",
      "summary": "<p>Phantom's integration of perpetual futures trading could significantly enhance user engagement and broaden crypto market accessibility.</p> <p>"
    },
    {
      "title": "ProShares’ XRP futures ETF listed on DTCC under ticker UXRP",
      "link": "https://cryptobriefing.com/proshares-xrp-etf-dtcc-listing/",
      "summary": "<p>The listing of ProShares' XRP futures ETF on DTCC suggests growing institutional interest and potential market expansion for crypto ETFs.</p> <p>"
    },
    {
      "title": "Amplifi partners with AIAPE to expand AI agent capabilities",
      "link": "https://cryptobriefing.com/amplifi-aiape-ai-agent-partnership-crypto-trading/",
      "summary": "<p>This partnership could enhance AI-driven trading efficiency, potentially reshaping digital asset markets and influencing future AI integrations.</p> <p>"
    },
    {
      "title": "Cardano Foundation unveils blockchain-based tool to simplify audit compliance and enhance financial reporting",
      "link": "https://cryptobriefing.com/blockchain-esg-compliance-cardano-reeve/",
      "summary": "<p>Cardano's blockchain tool could revolutionize audit compliance, boosting transparency and trust across various sectors and enhancing ESG efforts.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin supply drops, institutions load up $164M in BTC – Will prices follow?",
      "link": "https://ambcrypto.com/bitcoin-supply-drops-institutions-load-up-164m-in-btc-will-prices-follow/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Kelvin-_58_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin demand surges as institutions and whales accumulate, signaling potential continuation of the current bullish run."
    },
    {
      "title": "Bit Digital drops Bitcoin to join the Ethereum treasury bandwagon",
      "link": "https://ambcrypto.com/bit-digital-drops-bitcoin-to-join-the-ethereum-treasury-bandwagon/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ethereum-ETH-treasury-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will exodus from BTC miners to ETH treasury fuel the altcoin's price?"
    },
    {
      "title": "SEC reveals new Crypto ETF guidelines – Will Solana, Dogecoin be the first in line?",
      "link": "https://ambcrypto.com/sec-reveals-new-crypto-etf-guidelines-will-solana-dogecoin-be-the-first-in-line/",
      "summary": "<img alt=\"SEC reveals new Crypto ETF guidelines - Will Solana, Dogecoin be the first in line?\" class=\"attachment-full size-full wp-post-image\" height=\"756\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Crypto-ETFs-in-limbo.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1344\" />A new directive might go a long way towards crypto's development and evolution."
    },
    {
      "title": "Circle’s CRCL bounces back by 14% – What’s driving the recovery?",
      "link": "https://ambcrypto.com/circles-crcl-bounces-back-by-14-whats-driving-the-recovery/",
      "summary": "<img alt=\"Circle’s CRCL bounces back by 14% - What’s driving the recovery? \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/CRCL-stock-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Wall Street analysts may be bullish on CRCL, but JP Morgan has other ideas."
    },
    {
      "title": "$1 mln flows into Hyperliquid even as HYPE slips: What can bulls do?",
      "link": "https://ambcrypto.com/1-mln-flows-into-hyperliquid-even-as-hype-slips-what-can-bulls-do/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-08T162734.767-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE faces breakdown risks and potential short squeeze setups around the critical $40 zone."
    }
  ]
}