{
  "CoinDesk": [
    {
      "title": "TON Down 8% After Israeli Strikes Against Iran",
      "link": "https://www.coindesk.com/markets/2025/06/13/ton-down-8-after-israeli-strikes-against-iran",
      "summary": ""
    },
    {
      "title": "Brazilian Firm Meliuz's Shares Fall After Planning to Raise $32.4M to Buy Bitcoin",
      "link": "https://www.coindesk.com/markets/2025/06/13/brazilian-firm-meliuzs-shares-fall-after-planning-to-raise-324m-to-buy-bitcoin",
      "summary": ""
    },
    {
      "title": "Bitcoin Miners Just Had One of Their Best Quarters on Record, JPMorgan Says",
      "link": "https://www.coindesk.com/markets/2025/06/13/bitcoin-miners-just-had-one-of-their-best-quarters-on-record-jpmorgan-says",
      "summary": ""
    },
    {
      "title": "CoinDesk 20 Performance Update: Bitcoin Price (BTC) Falls 2.2% as All Assets Decline",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/13/coindesk-20-performance-update-bitcoin-price-btc-falls-2-2-as-all-assets-decline",
      "summary": ""
    },
    {
      "title": "Bitcoin Miner Price Targets Raised to Reflect Improved Industry Economics: JPMorgan",
      "link": "https://www.coindesk.com/markets/2025/06/13/bitcoin-miner-price-targets-raised-to-reflect-improved-industry-economics-jpmorgan",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "ETF filings explode in 2025, heating hopes of an ‘altcoin summer’",
      "link": "https://cointelegraph.com/news/etf-filings-2025-altcoin-summer?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2UxM2EtYTIzNS03MmJmLTg1ODUtNWZlMjlkZjM3NzU0.jpg\" /></p><p>This year has seen an uptick in the number of altcoin ETF applications, with at least 31 filed in the first half of 2025, Research found.</p>"
    },
    {
      "title": "Blockchain is the missing trust layer in sports analytics",
      "link": "https://cointelegraph.com/news/blockchain-sports-analytics?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU5NWYtMjAzNS03MThiLThmZGQtOGM4MzVjMGM2YTEy.jpg\" /></p><p>Blockchain can reshape sports analytics as a secure, open and verifiable source of truth for performance data. From elite leagues to fantasy sports, blockchain breaks down data silos, ensures real-time accuracy and embeds trust in the sports ecosystem.</p>"
    },
    {
      "title": "How a YouTuber hacked an $800K crypto scam hub in Cebu, Philippines",
      "link": "https://cointelegraph.com/explained/how-a-youtuber-hacked-an-800k-crypto-scam-hub-in-cebu-philippines?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8xY2RhODA2ZDZlNjA4NmRiYWFiZWFkMDBiMmRkNTUzZi5qcGc=.jpg\" /></p><p>A YouTuber exposed an $800,000 crypto scam in Cebu by hacking CCTV, confronting scammers live and revealing their global fraud operation.</p>"
    },
    {
      "title": "SharpLink buys $463M in ETH, becomes largest public ETH holder",
      "link": "https://cointelegraph.com/news/sharplink-largest-public-eth-holder-463m?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY5ODQtYTIyOC03ZWY0LTkyZDAtMzUzMGU0MmI4YWNj.jpg\" /></p><p>While SharpLink has become the largest publicly traded holder of Ether globally, some entities, including the Ethereum Foundation and BlackRock, are still holding more ETH.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Walmart & Amazon eye $14B in savings by launching corporate stablecoin",
      "link": "https://cryptoslate.com/walmart-amazon-eye-14b-in-savings-by-launching-corporate-stablecoin-as-us-genius-legislation-nears/",
      "summary": "<p>Walmart and Amazon are preparing to launch their own stablecoins as the U.S. Senate advances landmark legislation that would establish a federal regulatory framework for privately issued digital dollars for the first time. The legislation, known as the GENIUS Act (S.394), has passed committee and cleared cloture, with a final Senate vote scheduled for June [&#8230;]</p> <p>"
    },
    {
      "title": "Israel-Iran tensions trigger over $7 million crypto betting volume spree on Polymarket",
      "link": "https://cryptoslate.com/israel-iran-tensions-trigger-over-7-million-crypto-betting-volume-spree-on-polymarket/",
      "summary": "<p>The Israel-Iran conflict has triggered a wave of speculation across the crypto sector, with traders pouring millions into prediction markets. On Polymarket, a decentralized platform that allows users to wager on real-world outcomes, betting volume linked to the crisis has now exceeded $7 million across over 20 markets. Tensions escalated sharply on June 13 when [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin fills CME gap after Iran strike sparks $5,000 sell-off",
      "link": "https://cryptoslate.com/bitcoin-fills-cme-gap-after-iran-strike-sparks-5000-sell-off/",
      "summary": "<p>Bitcoin&#8217;s retracement from $109,000 over the past 24 hours capped off a volatile week defined by thin weekend liquidity and sharp reactions to geopolitical stress. In the early hours of Friday, June 13, the market saw the $1,490 CME gap closed, which formed between the Friday (June 6) close at $105,060 and the Sunday (June [&#8230;]</p> <p>"
    },
    {
      "title": "XRP corporate treasury investments near $1 billion as companies embrace blockchain potential",
      "link": "https://cryptoslate.com/xrp-corporate-treasury-investments-near-1-billion-as-companies-embrace-blockchain-potential/",
      "summary": "<p>A growing number of public companies are committing significant funds to XRP treasuries, with total commitments approaching the $1 billion milestone. The move signals rising institutional interest in integrating blockchain-based assets into corporate financial strategies. Momentum builds around corporate XRP reserves On June 12, Singapore-based Web3 firm Trident Digital revealed plans to raise up to [&#8230;]</p> <p>"
    },
    {
      "title": "Cardano considers offloading $100M ADA to jumpstart lagging DeFi and stablecoin ecosystem",
      "link": "https://cryptoslate.com/cardano-considers-offloading-100m-in-ada-to-jumpstart-lagging-defi-and-stablecoin-ecosystem/",
      "summary": "<p>The Cardano ecosystem could soon undergo a strategic treasury shift to energize its DeFi and stablecoin sectors. On June 13, the network founder Charles Hoskinson suggested allocating around $100 million worth of ADA from the network&#8217;s treasury towards a mix of stablecoins and Bitcoin. According to him: &#8220;[W]e take about a hundred million worth of ADA [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin At $1 Million? CEO Says It’s The Price To Beat Gold",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-at-1-million-novogratz-says-its-the-price-to-beat-gold/",
      "summary": "According to CNBC’s Power Lunch, Galaxy Digital CEO Mike Novogratz thinks Bitcoin could climb all the way to $1 million per coin if big institutions keep piling in. The cryptocurrency hit a weekly peak of $110,290 on Tuesday. It slipped 4.5% to $104,300 by Thursday, but it’s still climbed 1.75% over the past seven days. Novogratz says this isn’t just hype. He points to firms moving cash from dollars and gold into crypto. Related Reading: BTC Is Just 0.2% Of Global Wealth — And That’s Why It’s Not Too Late: Analyst Institutional Moves Up Demand BlackRock’s iShares Bitcoin Trust (IBIT) went live in January 2024 after SEC approval. Based on reports, that fund now gives big investors a straightforward path to own Bitcoin without buying coins directly. BlackRock manages about $11.6 trillion in assets. When a player that size steps in, others notice. Novogratz says wealth managers and pension funds have started treating Bitcoin like a macro asset, on par with gold and the S&#38;P 500. Growing Corporate Interest Treasury companies are adding Bitcoin to their balance sheets. Sovereign wealth funds have begun to follow suit. Retail investors keep buying, too, thanks to easier trading apps and ETFs like IBIT. A handful of public companies have raised millions to buy Bitcoin outright. Related Reading: TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin According to filings, Metaplanet, the Blockchain Group, GameStop, and US President Donald Trump’s Media arm all announced major purchases this year. Their moves chip away at the 21 million-coin supply, making each remaining Bitcoin scarcer. Bitcoin Versus Gold Bitcoin’s 21 million supply cap is hard-wired into its code. Gold, by comparison, has a market worth north of $12 trillion and sees about 1–2% new supply each year through mining. Novogratz argues that younger investors will choose a capped digital asset over a metal bar. That switch isn’t guaranteed, but once people see Bitcoin as a store of value, its appeal could grow. At today’s $2 trillion market cap, Bitcoin has room to expand many times over if it ever rivals gold. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Challenges Ahead Regulators remain a wildcard. The SEC green-lit IBIT, but future rules on taxes or derivatives could slow things down. Bitcoin’s price swings make it riskier than bonds or gold. Institutions often chase stable returns, and Bitcoin pays no dividends or interest. Finally, moving another $10 trillion into crypto would need a massive shift in asset allocations. That kind of inflow isn’t impossible, but it won’t happen overnight. Based on reports, Novogratz sees Bitcoin’s march toward gold’s market cap as a “ball rolling down a hill.” He predicts that, over time, Bitcoin will match gold and then outpace it. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Daily Timeframe Says XRP Price Is On The Verge Of Breakout",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-on-the-verge-of-breakout/",
      "summary": "The XRP price could be preparing for its biggest rally yet, as a crypto analyst now points to a potential breakout that could send this altcoin soaring. After weeks of stabilization and momentum building, XRP is now testing key resistance levels, with the daily timeframe hinting at a possible surge above $2.33. XRP Price Gears Up For Major Breakout Dark Defender, an X (formerly Twitter) crypto analyst, has revealed in a recent analysis that XRP appears to be setting the stage for a significant price shift, with its daily chart signaling a possible upward breakout. After weeks of consolidation below a descending trendline, the altcoin is now approaching a critical level that could become the trigger point for rapid momentum growth, if confirmed. Related Reading: XRP Price Could Hit $21 This Bull Cycle With 1.618 Fib Level As Next Target Currently, the daily timeframe shows XRP testing a long-term downtrend line that has consistently rejected upward movements since early 2025. This resistance level, marked clearly on the analyst’s chart, hovers just above $2.3. Dark Defender has indicated that a daily candle close above $2.33 could effectively invalidate the downtrend and signal a breakout that may lead to further upside. Notably, the analyst’s 1-day XRP price chart shows an explosive move toward a new high of $3.39—a level not seen since the 2018 bull cycle. With XRP currently trading at $2.1, a successful rally to this bullish target would represent an impressive 61.43% surge in value. Such a move would not only break XRP out of its current consolidation phase but also confirm the emergence of a sustained uptrend. Moreover, if momentum persists, it could set the stage for even higher price levels. RSI And EMA Signals Defend XRP’s Bullish Thesis Supporting Dark Defender’s technical analysis and bullish scenario for the XRP price is a rising Relative Strength Index (RSI), which has broken above a descending trendline and continues to trend upward. This shift suggests that XRP is building momentum as buyers finally regain control. Related Reading: Crypto Pundit Says XRP Is No Longer A Speculative Asset – Here’s What It Is Additionally, the analysis shows that price action remains above key Exponential Moving Averages (EMA), which are beginning to curl upward, signaling that the market trends could be turning in favor of the bulls. Although the Ichimoku Cloud technical indicator is not visible on the chart, Dark Defender notes that it is expected to flip bullish soon, further reinforcing XRP’s bullish thesis. Combined with the support held above the 200-day EMA, highlighted by the blue line on the chart, XRP appears to be entering a favorable technical zone. If price action aligns with the analyst’s projected setup and manages to hold candle closes above $2.33, it could mark the beginning of a stronger uptrend. Dark Defender also notes that “XRP’s slingshot pressure” is intensifying rapidly, further boosting the potential strength of the upcoming bullish wave. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin’s Most Reliable Signal Just Flashed—Next Stop: $170,000",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-most-reliable-signal-next-stop-170000/",
      "summary": "The Hash Ribbon “buy” trigger – a signal embedded in Bitcoin’s network hashrate dynamics – has flashed again, and technical analyst Astronomer Zero believes it could pave the way to at least $170,000 per coin. A chart the analyst posted on X on 12 June overlays every prior weekly‐time-frame Hash Ribbon entry since 2020 on the BTC/USDT perpetual contract at Binance, illustrating why the signal is treated with almost talismanic respect by some quantitative traders. Bitcoin Surge To $170,000 Imminent? The graphic shows five earlier occurrences of the capitulation-to-recovery crossover embedded in the Hash Ribbon algorithm. Each is marked on the price pane by a cobalt-blue “Buy” dot directly beneath the weekly candles and linked to the ensuing rally by a violet measuring arrow. After the signal in late-2020, Bitcoin accelerated by 235% from the $18,000 consolidation floor to challenge the then-all-time-high zone just above $60,000 before any major pull-back unfolded. Mid-2021’s ribbon event proved more modest – roughly 59% from a $30,000 base into resistance near $48,000 – yet it still respected the rule that the market rewards the crossover with significant upside. Related Reading: Bitcoin Funding Rate Flips Again And History Says A Rally Is Around The Corner The next two signals, printed in late-2022 and early-2023, were far stronger: a 260% surge from the capitulation trough below $18,000, followed by a 175% leg in mid-2023 that carried price cleanly to the long-standing supply shelf in the $60,000 area. In mid-2024, the hash ribbon signal led to a 100% rally above $100,000. Most recently, the ribbon crossed again three weeks ago, with Bitcoin quoted at roughly $105,000 on the weekly close. The analyst annotates current price at $106,873 and draws a fresh horizontal barrier at the $160,000–$165,000 band – the level that would align with the mean magnitude of earlier post-signal advances. Were the market merely to match the smallest historical percentage move (≈ 60%) from the present crossover, spot would extend to the $170,000 region indicated in crimson on the chart. Related Reading: Bitcoin Is Wildly Undervalued, Says Bitwise: ‘Fair Price’ Today Is $230,000 Hash Ribbon logic is mechanical. When the 30-day moving average of network hashrate climbs back above the 60-day average after a period of miner capitulation, on-chain observers read it as an all-clear that forced selling pressure has exhausted. In the past, that transition has coincided with aggressive spot accumulation visible on-chain and in derivatives positioning. Sceptics will note that correlation is not causation and that a six-figure quote for Bitcoin already bakes in ETF inflows, a looming halving supply shock and a global liquidity cycle that could yet tighten. Still, Astronomer Zero’s chart underscores an objective fact: in the last half-decade the Hash Ribbon “buy” has never mis-fired. Whether history’s rhythm repeats or merely rhymes, traders are watching the $170,000 level marked on the chart as the next test of that record. At press time, BTC was down 3.1% over the past 24 hours, trading at $104,898. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Stablecoins To Hit $2 Trillion? US Treasury Hints At Explosive Growth",
      "link": "https://www.newsbtc.com/stablecoin/stablecoins-to-hit-2-trillion-us-treasury-hints-at-explosive-growth/",
      "summary": "US Treasury Secretary Scott Bessent told lawmakers that dollar-pegged stablecoins could swell to more than $2 trillion in the next few years. He spoke at a Senate hearing this week. His outlook came as Congress moved to set new rules on how these tokens must be backed. Related Reading: TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin Growth Forecast Details According to Bloomberg, Bessent said a leading industry group expects the stablecoin market cap to top $2 trillion. He called that view “very reasonable.” It would mean backing up to $2 trillion in tokens with US Treasury Bills. Based on reports, Citigroup analysts think issuers might buy an extra $1 trillion in those bills by 2030. Treasury Secretary Scott Bessent said that dollar-linked stablecoins could hit $2 trillion or even more as he reiterated the potential for these digital assets to strengthen the greenback’s position https://t.co/HwVRu0aPkT — Bloomberg (@business) June 11, 2025 Backing Rules Move Forward Lawmakers voted to advance a key amendment to the GENIUS Act, which would force stablecoin issuers to hold reserves in top-tier assets. The amendment won cloture yesterday. That clears the way for a final vote, likely early next week. Supporters say the change will boost confidence by ensuring every dollar-linked token has real backing. Market Size Today Right now, the total stablecoin market sits at about $255 billion. Dollar-pegged coins make up roughly $233 billion of that. That equals 90% of the whole market. The top nine dollar-pegged coins include USDT, USDC, USDe, DAI, USD1, FDUSD, PYUSD, TUSD, and USDD. They account for nearly all stablecoin activity. Challenges Ahead Regulators have work to do. If the GENIUS Act stalls or changes, issuers might head to friendlier markets. There’s also a risk that a handful of big players could dominate. That could create new “too big to fail” worries if a major issuer faces trouble. Plus, tech glitches and smart-contract bugs could still trigger runs on tokens. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC If stablecoin use really takes off in cross-border payments and decentralized finance, the US dollar could win new fans overseas. Every $1 trillion in token issuance backed by Treasury Bills might add to demand for US debt. But the path isn’t guaranteed. Lawmakers must iron out rules that balance safety with innovation. Issuers need strong risk plans. And users must see clear benefits beyond speculation. For now, the market is small compared with the broader financial system. But the shift toward programmable money keeps pace. Featured image from Sygnum Bank, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Crashes Below $103,000—What Triggered It?",
      "link": "https://www.newsbtc.com/news/bitcoin-price-crashes-below-103000/",
      "summary": "After hitting $110,450 on Monday, the Bitcoin price is writing its third consecutive red day as the benchmark cryptocurrency fell 5.3% from an intra-day top of $108,450 to a trough of $102,664 before clawing back to about $104,456 by press time. The sell-off coincided, almost minute-for-minute, with confirmation that Israel had conducted large-scale air-strikes on Iranian nuclear installations, sending ripples through every major asset class. Why Is Bitcoin Going Down Today? Israel’s pre-dawn operation — its first overt attack on Iranian territory since the October-2024 raids — instantly repriced global risk. Oil futures jumped more than 10%, spot gold printed a fresh record high above $3,400 an ounce, and US equity futures slid roughly 1.5%. Bitcoin’s draw-down resembled its initial reaction to Iran’s failed missile barrage on Israel in April. Related Reading: Bitcoin Nears All-Time High as Whale Behavior Suggests Further Upside “Oil up. Gold up. Bitcoin down,” Anthony Pompliano wrote on X, noting that the pattern echoes April’s missile incident, after which “Bitcoin ended up outperforming the other two over the first 48 hours.” Bitcoin educator Peter Duan argued in a separate post that “a dip in Bitcoin happens every time there is serious geopolitical [turmoil] … In the long run, this will only push more people to Bitcoin,” pointing to the 24/7 nature of crypto trading versus the still-closed equity cash markets. Macro strategist Joe Consorti drilled down on the mechanics: “Bitcoin, S&#38;P and NDX are all being panic-sold. Crude oil, natural gas, gold and US Treasuries are all spiking higher. The flight to safety trade is here.” A fresh surge in crude is precisely what US policymakers did not need. West Texas Intermediate vaulted past $77 a barrel—its first visit to that level in four months—after Israel struck Iranian nuclear facilities, erasing much of the hard-won disinflation dividend and dragging energy back to centre stage. The contract is now more than $21 above its April trough, threatening to unwind the benign price trends that had been taking hold. This comes after US inflation data once again surprised to the upside this week. May’s Consumer Price Index rose just 0.1% on the month and 2.4% year-over-year, while core CPI matched that modest 0.1% gain and held at 2.8% on an annual basis. Producer prices told a similar tale on Thursday, with the headline PPI up only 0.1% month-over-month and 2.6% on the year, both below consensus expectations. Related Reading: Bitcoin Is Wildly Undervalued, Says Bitwise: ‘Fair Price’ Today Is $230,000 Lower fuel costs had been a cornerstone of President Trump’s strategy for reining in inflation; the renewed march higher in oil now threatens that narrative. If energy continues to climb, markets will anticipate a rebound in headline inflation and the Federal Reserve may feel compelled to postpone the rate-cut cycle traders had pencilled in for September. Bitcoin, which is acutely sensitive to fluctuations in global liquidity, often underperforms when the policy outlook tilts toward tighter financial conditions—explaining its abrupt slide alongside the spike in crude. The newsflow triggered one of the heaviest forced-liquidation washes of 2025. CoinGlass data show that roughly $1.14 billion in crypto futures positions were wiped out over the past 24 hours, $1.04 billion of which were longs, as 236,788 traders were forced out of the market. The single-largest hit was a $201 million BTC-USDT long on Binance, the biggest one-ticket liquidation since January. For Bitcoin alone, long-side liquidations totalled $443 million. For the entire crypto market, this is the worst wipe-out since"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Where Could Bitcoin Peak This Cycle?",
      "link": "https://bitcoinmagazine.com/markets/where-could-bitcoin-peak-this-cycle",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Where-Could-Bitcoin-Peak-This-Cycle.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/where-could-bitcoin-peak-this-cycle\" rel=\"nofollow\"> </a></p> <p>Exploring Bitcoin’s Potential Peak: Valuation Models and Cycle Timing </p> <p>"
    },
    {
      "title": "Bitcoin Will Replace Gold And Go To $1,000,000, Says Galaxy Digital CEO Mike Novogratz",
      "link": "https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Will-Replace-Gold-And-Go-To-1000000-Says-Galaxy-Digital-CEO-Mike-Novogratz.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz\" rel=\"nofollow\"> </a></p> <p>Mike Novogratz, in an interview with CNBC, said “there have been more Bitcoins lost than will be mined for the rest of eternity.\"</p> <p>"
    },
    {
      "title": "Coinbase Announces Bitcoin Rewards Credit Card, Offering up to 4% BTC Back on Everything",
      "link": "https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-BTC-Credit-Card.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything\" rel=\"nofollow\"> </a></p> <p>Coinbase is launching its first-ever branded credit card in partnership with American Express, set to roll out this fall. Called the Coinbase One Card, it will be available only to U.S. members of Coinbase One, the platform’s monthly subscription service. The card will offer 2% to 4% back in Bitcoin on everyday purchases, along with [&#8230;]</p> <p>"
    },
    {
      "title": "France’s The Blockchain Group Secures €9.7 Million More For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Frances-The-Blockchain-Group-Secures-E9.7-Million-More-For-Its-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Adam Back, TOBAM and Ludovic Chechin-Laurans back ALTBG with €9.7 million in equity and convertible bonds.</p> <p>"
    },
    {
      "title": "Bitcoin: How To Solve the Student Loan Crisis",
      "link": "https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/studentdebt.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis\" rel=\"nofollow\"> </a></p> <p>Students are already taking out mortgage-sized loans for college. The financial jiu-jitsu of pairing bitcoin with student loans can fix the student debt crisis.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Why Did Bitcoin Dip as Gold Surged Amid Israel-Iran Tensions?",
      "link": "https://decrypt.co/325074/why-did-bitcoin-dip-as-gold-surged-amid-israel-iran-tensions",
      "summary": "Analysts told that the alpha crypto's risk-asset behavior contrasts with gold's safe-haven rally, splitting the reaction."
    },
    {
      "title": "Altcoins Plunge, Crypto Liquidations Hit $1B Amid Israel-Iran Tensions",
      "link": "https://decrypt.co/325039/altcoins-plunge-crypto-liquidations-hit-1b-amid-israel-iran-tensions",
      "summary": "Major crypto liquidations sweep the market as altcoins plummet in response to rising tensions in the Middle East."
    },
    {
      "title": "Obama Campaign Strategist David Plouffe Joins Coinbase Advisory Council",
      "link": "https://decrypt.co/325040/obama-campaign-strategist-david-plouffe-joins-coinbase-advisory-council",
      "summary": "The political mastermind joins Trump's ex-campaign manager at Coinbase as the crypto firm deepens its bipartisan strategy."
    },
    {
      "title": "Meta Invests $14 Billion in Scale AI to ‘Deepen’ its Work on Superintelligence",
      "link": "https://decrypt.co/325031/meta-invests-14-billion-in-scale-ai-to-deepen-its-work-on-superintelligence",
      "summary": "The deal values data-labeling startup Scale AI at $29 billion, as Meta aims to catch up with rivals such as OpenAI and Google."
    },
    {
      "title": "Thai Police Arrest Chinese Suspect in $6.1 Million Bitcoin Fraud Case",
      "link": "https://decrypt.co/325028/thai-police-arrest-chinese-suspect-bitcoin-fraud-case",
      "summary": "Two Chinese victims lost their Bitcoin after a business meeting in Mae Sai district, transferring funds in two separate transactions."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Cardano founder Charles Hoskinson proposes converting $100M ADA to Bitcoin and stablecoins",
      "link": "https://cryptobriefing.com/cardano-treasury-conversion-proposal/",
      "summary": "<p>Hoskinson's proposal could enhance Cardano's DeFi competitiveness, potentially increasing its market share and attracting more developers.</p> <p>"
    },
    {
      "title": "Amazon, Walmart, and Expedia consider issuing stablecoins to sidestep costly card fees: WSJ",
      "link": "https://cryptobriefing.com/retailers-embrace-stablecoins/",
      "summary": "<p>Retailers' stablecoin adoption could revolutionize payment systems, enhance cash flow, and challenge traditional financial networks.</p> <p>"
    },
    {
      "title": "Bitcoin slides, gold spikes after Israel strikes Iran, Israeli PM warns campaign will last as many days as needed",
      "link": "https://cryptobriefing.com/crypto-market-volatility-israel-iran/",
      "summary": "<p>Geopolitical tensions may drive investors to traditional safe-haven assets, impacting cryptocurrency markets and regional economic stability.</p> <p>"
    },
    {
      "title": "$USD1 stablecoin begins minting on TRON",
      "link": "https://cryptobriefing.com/usd1-stablecoin-minting-on-tron/",
      "summary": "<p>The minting of USD1 on TRON could enhance institutional trust and adoption, bolstering TRON's position in the global blockchain market.</p> <p>"
    },
    {
      "title": "Trump says Fed can raise rates if inflation returns, but warns Powell will be “too late for that too”",
      "link": "https://cryptobriefing.com/trump-fed-interest-rates-inflation/",
      "summary": "<p>Trump's remarks highlight ongoing tensions with the Fed, potentially impacting future monetary policy decisions and economic stability.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Ethereum: Smart money buys the dip as ETH dives 9% – What’s next?",
      "link": "https://ambcrypto.com/ethereum-smart-money-buys-the-dip-as-eth-dives-9-whats-next/",
      "summary": "<img alt=\"Ethereum: Smart money buys the dip as ETH dives 9% - What&#039;s next?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-13T160813.902_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can ETH hold above $2.4K with $2.64B in shorts stacked overhead?"
    },
    {
      "title": "Solana’s mixed signals: What’s next as whale inflows rise but STHs stay back",
      "link": "https://ambcrypto.com/solanas-mixed-signals-whats-next-as-whale-inflows-rise-but-sths-stay-back/",
      "summary": "<img alt=\"Solana&#039;s mixed signals: What&#039;s next as whale inflows rise but STHs stay back\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-100-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana shows long-term strength but short-term uncertainty as price dips and traders stay neutral."
    },
    {
      "title": "HyperLiquid TVL explodes – Can HYPE use this to defy the $44 wall again?",
      "link": "https://ambcrypto.com/hyperliquid-tvl-explodes-can-hype-use-this-to-defy-the-44-wall-again/",
      "summary": "<img alt=\"HyperLiquid TVL explodes - Can HYPE use this to defy the $44 wall again?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-13T093154.393-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whale activity and rising TVL fuel bullish outlook, but overheated volume signals caution."
    },
    {
      "title": "Charles Hoskinson admits, ‘What’s killing Cardano is our stablecoin situation’",
      "link": "https://ambcrypto.com/charles-hoskinson-admits-whats-killing-cardano-is-our-stablecoin-situation/",
      "summary": "<img alt=\"Charles Hoskinson admits, &#039;What&#039;s killing Cardano is our stablecoin situation&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"939\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Hoskinson-defends-Cardano.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1670\" />What’s the catch, and why is the community panicking?"
    },
    {
      "title": "Hyperliquid, ‘the first meaningful competitor’ to Binance: Jump Trading CIO",
      "link": "https://ambcrypto.com/hyperliquid-the-first-meaningful-competitor-to-binance-jump-trading-cio/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Hyperlquid-Binance-.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE gets its first Strategy-like corporate treasury firm - Will others follow suit?"
    }
  ]
}