{
  "CoinDesk": [
    {
      "title": "Trumps May Have Sold Platform Stake as U.S. Stablecoins See Wave of Good News",
      "link": "https://www.coindesk.com/policy/2025/06/20/as-u-s-stablecoins-see-wave-of-good-news-trumps-may-have-sold-platform-stake",
      "summary": ""
    },
    {
      "title": "Peter Schiff Says He 'Gets Bitcoin' But Not USD-Pegged Stablecoins, Floats Gold-Backed Token Plan",
      "link": "https://www.coindesk.com/markets/2025/06/20/peter-schiff-says-he-gets-bitcoin-but-not-usd-pegged-stablecoins-floats-gold-backed-token-plan",
      "summary": ""
    },
    {
      "title": "Semler Scientific Investors Cheered by New Hire, Lofty Bitcoin Acquisition Goals",
      "link": "https://www.coindesk.com/markets/2025/06/20/semler-scientific-investors-cheered-by-new-hire-lofty-bitcoin-acquisition-goals",
      "summary": ""
    },
    {
      "title": "Dogecoin Rebounds From 16 Cents as Triangle Pattern Signals 60% Price Swing",
      "link": "https://www.coindesk.com/markets/2025/06/20/dogecoin-rebounds-from-16-cents-as-triangle-pattern-signals-60-price-swing",
      "summary": ""
    },
    {
      "title": "Circle Started at Buy at Seaport Securities, Which Eyes $2T Opportunity in Stablecoins",
      "link": "https://www.coindesk.com/markets/2025/06/20/circle-started-at-buy-at-seaport-securities-which-eyes-2t-opportunity-in-stablecoins",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Price predictions 6/20: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, HYPE, BCH, SUI",
      "link": "https://cointelegraph.com/news/price-predictions-6-20-btc-eth-xrp-bnb-sol-doge-ada-hype-bch-sui?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhlNTQtOGM5Yi03ZDE5LTlkMmQtYzg1YjZkMGEyOTAw.jpg\" /></p><p>Bitcoin’s sell-off is accelerating, and most altcoins are following BTC’s path. Will traders buy the dips?</p>"
    },
    {
      "title": "Coinbase secures MiCA license, names Luxembourg as EU headquarters",
      "link": "https://cointelegraph.com/news/coinbase-secures-mica-license-names-luxembourg-as-eu-headquarters?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhlNjQtZTBhNS03NzJkLWE2ZGMtZDNmMGQ3Mzg0NzI1.jpg\" /></p><p>Coinbase joins other exchanges such as OKX and Bybit that have secured MiCA licenses in a bid to take advantage of regulatory clarity in Europe.</p>"
    },
    {
      "title": "Staked Ether hits record high driven by corporate crypto treasury adoption: Finance Redefined",
      "link": "https://cointelegraph.com/news/staked-ether-record-high-corporate-crypto-treasury-finance-redefined?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGY0OWMtMDRiNS03Y2EwLTljNGEtMTJiYzNlOWVhZjA1.jpg\" /></p><p>Over 28% of Ether’s supply is now locked, signaling tightening liquidity conditions, as more Nasdaq-listed companies establish corporate crypto reserves.</p>"
    },
    {
      "title": "Bitcoin should hold $100K as Q3 seasonality predicts sideways trading",
      "link": "https://cointelegraph.com/news/bitcoin-capped-at-100k-if-q3-seasonal-data-repeats?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhkZTctNGQzZi03MmQzLWJjYzUtZjE3ZmRlM2Y0ZGNk.jpg\" /></p><p>Bitcoin may hold above $100,000 throughout summer, but seasonal trading data suggests minimal upside in Q3.</p>"
    },
    {
      "title": "Uber pitches AI labeling services following Meta’s Scale acquisition — Report",
      "link": "https://cointelegraph.com/news/uber-ai-data-labeling-meta-scale-investment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhlMTAtMDYxMi03NzkwLWFhNjYtNDBlY2VmNDNjY2Yz.jpg\" /></p><p>The ride-hailing giant has reportedly offered AI “coders for hire” since at least November.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin’s falls to monthly lows triggering $464 million in liquidations amid global market jitters",
      "link": "https://cryptoslate.com/bitcoins-falls-to-monthly-lows-triggering-464-million-in-liquidations-amid-global-market-jitters/",
      "summary": "<p>Bitcoin (BTC) fell to its lowest price this month on June 20, triggering $464 million in liquidations across cryptocurrency markets as geopolitical jitters and heavy selling pressure rattled traders. Bitcoin dropped to a low of $102,225, reversing the gains recorded earlier in the day after failing to break through resistance above $106,000. Data from Coinglass [&#8230;]</p> <p>"
    },
    {
      "title": "Standard Chartered forecasts surge tokenizing real-world assets beyond stablecoins",
      "link": "https://cryptoslate.com/standard-chartered-forecasts-surge-tokenizing-real-world-assets-beyond-stablecoins/",
      "summary": "<p>Standard Chartered projected that tokenization of real-world assets (RWAs) beyond stablecoins could accelerate significantly over the next five years, driven by regulatory progress and a sharper focus on high-impact use cases, according to a June 20 report shared with . The bank’s report, titled “RWA Tokenisation — A Growth Opportunity,” highlighted that while stablecoins remain [&#8230;]</p> <p>"
    },
    {
      "title": "Norway eyes crypto mining ban amid local firms’ heavy investments in Bitcoin",
      "link": "https://cryptoslate.com/norway-eyes-crypto-mining-ban-amid-local-firms-heavy-investments-in-bitcoin/",
      "summary": "<p>Norway is reportedly planning to introduce a temporary ban on the development of new data centres linked to crypto mining, Reuters reported on June 20. According to the report, the government is expected to implement the restrictions before the end of the year, citing environmental and energy concerns. The government says the aim is to [&#8230;]</p> <p>"
    },
    {
      "title": "TikTok clashes with US congressman over alleged $300M TRUMP token bribe",
      "link": "https://cryptoslate.com/tiktok-clashes-with-us-congressman-over-alleged-300m-trump-token-bribe/",
      "summary": "<p>TikTok has publicly denied allegations that it bought $300 million worth of TRUMP memecoins to sway US President Donald Trump. The company addressed the claims on June 19 in a post on X, labeling the accusation &#8220;false and irresponsible&#8221; and aimed at misrepresenting its actions. The statement followed comments by US Congressman Brad Sherman, who [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto funding soars past $1.5 billion in June with Circle IPO boost",
      "link": "https://cryptoslate.com/crypto-funding-soars-past-1-5-billion-in-june-with-circle-ipo-boost/",
      "summary": "<p>Venture capital activity in the crypto space has seen a significant rebound this month, with total investments crossing $1.5 billion by June 20, according to DeFiLlama data. This marks the strongest monthly performance since March 2025 and signals growing confidence in blockchain startups after a quieter second quarter. The raised funds are more than double [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Price Deviates From Global M2 Money Supply, Is The Bull Run Over?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-deviates-from-global-m2/",
      "summary": "Crypto analyst Colin has highlighted the Bitcoin price’s deviation from the Global M2 money supply, raising concerns that the bull run may be over. The analyst quickly addressed concerns, noting how such deviations usually happen at some point but don’t invalidate the macro trend. Analyst Highlights Bitcoin Price’s Deviation From Global M2 Money Supply In an X post, Colin revealed that the Bitcoin price has deviated from the global M2 money supply. He noted that this deviation was short-term in an otherwise broad correlation. The analyst added that this current deviation is similar to the position that BTC was in February 2025. Related Reading: Will The Bitcoin Price Move Above $110,000 Again? Global M2 Money Supply Shows What’s Next Colin remarked that this development doesn’t mean the M2 is broken, just as it wasn’t broken back in February. Instead, he claimed that it just means that market participants haven’t zoomed out enough and are allowing for the non-correlated periods. The analyst added that non-correlation between the Bitcoin price and global M2 money supply happens 20% of the time. He then alluded to the regular chart, which shows the strong correlation between the Bitcoin price and the global M2 money supply. Colin explained that the M2 is “directionally predictive” for BTC and that it is not 1:1 price-related. The analyst further remarked that the M2 does not predict a specific BTC price. Instead, the global M2 money supply only predicts the market direction, with about 80% accuracy. Colin added that the Bitcoin price has its y-axis while the M2 is on a different y-axis. He also opined that the M2 may decouple from BTC near the cycle top. Although the analyst didn’t provide a timeline for when the cycle top will be, his analysis indicates that the cycle top is not yet in and the bull run isn’t over. Money Supply Shows No Need To Worry About BTC Price In an X post, market expert Raoul Pal suggested that the Bitcoin price’s correlation with the money supply shows that there is no need to worry about the current price action. He remarked that if 89% of BTC’s price action is explained by global liquidity, then by definition, almost all “news” and “narrative” is noise. Related Reading: Brace For Impact: Bitcoin Price Primed For Deep Correction Below $90,000 This suggests that the current geopolitical risks, heightened by the Israel-Iran conflict, are unlikely to impact the Bitcoin price as much as expected. Trading firm QCP Capital recently noted that the flagship crypto has yet to show full-blown panic, which shows how much the asset has matured. The firm remarked that BTC’s resilient price action appears underpinned by continued institutional accumulation, with companies like Strategy and Metaplanet buying the dip. The Bitcoin ETFs also continue to record positive flows. At the time of writing, the Bitcoin price is trading at around $104,700, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "TON Holds The Line: Consolidation Break Could Trigger Fresh Momentum",
      "link": "https://www.newsbtc.com/toncoin-ton/ton-eye-fresh-momentum/",
      "summary": "Toncoin (TON) has been quietly building strength, defending the $2.80–$2.95 support zone with remarkable consistency. After weeks of consolidation, the recent break above a falling trendline has caught traders&#8217; attention, hinting at a possible shift in momentum. As TON coils just above this key structure, the stage may be set for a breakout — one that could ignite fresh upside if bullish pressure continues to build. Buyers Defend Key Levels On The Chart In a recent post on X, Alts King pointed out that TON is showing notable strength as it continues to hold above the $2.80–$2.95 support zone. This range has acted as a reliable floor for several weeks, with buyers consistently stepping in to defend it. Related Reading: TON Bullish Pattern Signals Breakout Ahead — 40% Rally Loading? Furthermore, Alts King further observed that a falling trendline, which has long constrained TON’s price action, has now been broken. This technical breakout could mark the early stages of a trend reversal, opening the door for a more sustained bullish move. Looking forward, Alts King believes that if the support zone continues to hold firm, TON may be setting up for a potential rally toward the $6.87 level. To validate this bullish thesis, Alts King recommends watching for the formation of higher highs and higher lows on shorter timeframes. These structural patterns are key indicators of healthy upward movement and would confirm growing confidence among market participants as TON tries to shift out of its consolidation phase. Resistance Zones That May Test TON Momentum To $6.87 As TON begins to show signs of renewed strength, its path toward the $6.87 target isn’t without resistance. One of the first major hurdles lies around $3.04, a support level turned into resistance during the last sell-off. Price action near this range has already shown hesitation in the past, making it a critical level for bulls to reclaim convincingly. Related Reading: Toncoin Open Interest Spikes 33%—Will History Repeat With A Pullback? Above that, the $4.54 level could serve as the next challenge. This zone aligns with prior swing highs and consolidations seen on the daily chart, where TON was previously rejected before resuming downward movement. Breaking through this level would require strong volume and confirmation, especially as traders may look to take profits from lower entries near the $2.80 support base. Finally, before TON can reach the anticipated $6.87 resistance, it must clear the psychological barrier around $6.00, which also coincides with a rounded top structure observed during a prior rally. This level may attract selling pressure from short-term traders aiming to lock in gains. However, only with sustained bullish momentum and the formation of higher highs can TON overcome these layers of resistance and build a real case for a breakout beyond $6.87. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Prepares For A Decisive Move: ETH/BTC Setup Could Trigger Altseason",
      "link": "https://www.newsbtc.com/news/ethereum-prepares-for-a-decisive-move-eth-btc-setup-could-trigger-altseason/",
      "summary": "Ethereum is approaching a critical test as price action tightens, setting the stage for a decisive move above key demand. After weeks of volatile yet controlled trading, bulls are attempting to reclaim higher ground, but momentum remains limited. At the same time, bears have repeatedly failed to drive ETH below the $2,400 level, reinforcing it as a strong support zone for now. With global markets under pressure from geopolitical tensions and macro uncertainty, Ethereum’s next move could define the direction of the broader altcoin market. Related Reading: Ethereum Analyst Eyes High Timeframe Close – Range Break Above $2,800 Could Be Violent Top analyst M-log1 believes the ETH/BTC pair is the most important chart to monitor in the coming days. According to his view, a breakout—either to the upside or downside—will determine the fate of altcoins across the board. The setup has reached an inflection point after multiple tests of the lower support band, with bulls continuing to defend it against breakdown attempts. This consolidation phase, combined with suppressed volatility and rising macro tension, makes Ethereum’s current structure one of the most significant technical formations in crypto right now. All eyes are now on ETH/BTC as traders prepare for what could be a defining moment in the altcoin cycle. Ethereum Builds Pressure As Breakout Nears Ethereum continues to trade within a narrow range that began in early May, hovering between the $2,400 and $2,800 levels. This prolonged consolidation comes at a time of growing geopolitical instability, as the conflict in the Middle East escalates and macroeconomic uncertainty grips global markets. While many investors had anticipated an altseason by now, that rotation of capital into altcoins has yet to materialize. All eyes remain on Ethereum to serve as the catalyst for that next leg higher. M-log1 believes the ETH/BTC pair holds the most important signal in the coming days. “This is probably the most important chart you want to keep an eye on,” he stated, highlighting that whichever direction ETH/BTC breaks could determine the fate of the altcoin market. The chart has repeatedly tested the lower support range, with bulls successfully defending that level on at least eight occasions. According to M-log1, this persistent defense suggests that bears are losing momentum, and a breakout to the upside is more likely. “I am 80/20 in favor of the upside,” he said, citing the market’s inability to break lower as a sign of underlying strength. Related Reading: Ethereum Mirrors Bitcoin 2017-2021 Pattern – $4,000 Is The Trigger Point ETH Tests Weekly Moving Averages Ethereum (ETH) is currently trading at $2,550, maintaining its position above all major weekly moving averages—50, 100, and 200. This level marks a key technical pivot as price consolidates between $2,450 and $2,680 after a strong recovery from its April low near $1,500. Despite multiple attempts to break higher, ETH continues to face resistance just below the $2,700 mark, showing that sellers remain active near historical supply zones. Importantly, the recent weekly candles have held the 100-week and 200-week simple moving averages as support. This indicates structural strength, especially considering the broader macro uncertainty driven by Middle East tensions and tighter U.S. monetary policy. Volume remains steady, with no signs of panic selling, further supporting the idea that ETH is stabilizing. Related Reading: Bitcoin Consolidates as Realized Profits Stay Low – No Signs Of Major Sell-Off Yet The current compression in price around key moving averages typically precedes a larger directional move. A confirmed weekly close above $2,700 could open the door to a rapid push toward the psychological $3,000 level. Conversely, losing the $2,400 support would likely trigger a short-term correction back toward the 50-week SMA near $2,289. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "XRP Price In 2026? Pattern From 2017 Reveals How It Will Happen",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-2026-pattern-with-2017/",
      "summary": "The XRP price is currently trading well below $3; however, a crypto expert believes that in less than two years, this popular altcoin could enter the double-digit territory, marking a historic moment in crypto. The analyst has forecasted a potential surge to $27, pointing to a re-emerging pattern from 2017. With over six months left before 2026 begins, the expert has outlined a clear roadmap of how XRP could reach this bullish target if it completely mirrors the historic fractal. XRP Price Prediction For 2026 A new technical analysis by X (formerly Twitter) market expert Egrag Crypto suggests that XRP has yet to see its biggest breakout. The trajectory of the analyst’s chart mirrors the same technical path that XRP followed before hitting its 2018 peak and current all-time high of $3.84. Related Reading: XRP To End 7-Month Consolidation After 700% Surge – Is A Major Move Coming? Egrag Crypto highlights that XRP is on the verge of an explosive rally that may extend into 2026, with current market behavior echoing the conditions and buildup that preceded its 2017 breakout. Notably, the analyst’s price chart shows that the XRP monthly candle structure went through six candles of consolidation before it launched into a parabolic rise in late 2017. Now, the cryptocurrency has consolidated for seven monthly candles, highlighted by the green triangle in the chart. If the eight completes, the analyst expects a dramatic “KABOOM phase” to follow—one that could propel XRP to price levels not seen before. The bullish projections point to a possible blow-off top somewhere between $22 and $27, aligning with the highest blue arc on the chart. Currently, XRP is trading at $2.15, meaning a surge to $27 would represent a whopping 1,156% in less than two years. With July 2025 highlighted as the potential trigger month, Egrag Crypto believes that the breakout could extend its momentum toward the end of 2025 and peak in 2026. The formation, known as the RGB Arcs, presents a visual roadmap of this projected bullish path—reinforcing the possibility that XRP is preparing to repeat history—only bigger. XRP To Reach $4 Before $27 Target In his analysis, Egrag Crypto’s chart spanned from 2013 through 2017, connecting XRP’s peaks to a series of colored parabolic curves. The red arcs in the chart represented the macro support line, while the green arc marked historical resistance levels—reached in 2018, and now projected for 2025-2026. Related Reading: XRP Price Enters Perfect Setup After Buy Retest – Next Stop $3.7 Notably, the analyst predicts that XRP’s first breakout zone lies between $4 and $5. Once this target is hit, the cryptocurrency is expected to move into the upper green and blue arcs, positioning it for a stronger surge toward the forecasted $27 peak. Egrag Crypto has described this initial target as a measured move, where the final outcome is solely based on historical price patterns rather than pure speculation. He urges the broader XRP community to remain strong and patient until the cryptocurrency progresses toward these levels. Featured image from Shutterstock, chart from Tradingview.com"
    },
    {
      "title": "Crypto Analyst Predicts $4 Dogecoin After Exhausted Selling Phase",
      "link": "https://www.newsbtc.com/news/dogecoin/crypto-analyst-4-dogecoin-exhausted-selling-phase/",
      "summary": "Dogecoin’s six-month consolidation is a coil, not a coffin, according to the pseudonymous technician Cantonese Cat, whose 19 June video marshals multiple time-frame evidence to argue that the meme-coin’s next directional break will be up—potentially as far as $4.13 before the current cycle tops out. Dogecoin Breakout Is Only A Matter Of Time The analyst begins by addressing sentiment. Retail comment threads have turned caustic, he notes, because price has slipped from last autumn’s spike and then “done nothing for months.” Yet such fatigue is precisely what bull-market retracements are meant to produce: “A lot of people are getting really bitter about Doge … that’s exactly how higher highs and higher low type situations are supposed to get you all frustrated. This is still a bull trend until proven otherwise.” Related Reading: Dogecoin Looks Like ‘It Wants To Play Dead’—Again At the highest zoom level, Dogecoin is tracing what he calls “still a cup and … still a handle until proven otherwise.” The first thrust of that handle halted almost exactly at the 0.786 Fibonacci retracement of the 2022–24 bear range—“a very important fib level here.” Because initial attempts rarely pierce that resistance, he expected rejection. What matters is where the pullback found support: “In the case of Dogecoin, it decided to go all the way down to 0.382, which is nothing unusual … this is actually a pretty important zone of this nice Adam-and-Eve double bottom.” The market is therefore testing, not violating, an historically powerful neckline. Zooming to the monthly chart, Dogecoin sits beneath what the analyst calls “a pretty thick Ichimoku cloud.” Two breakout attempts have failed, producing a pair of wicks that look ominous to casual chart watchers. Cantonese Cat disagrees: “We had a little bit of a false breakout here on the monthly … I think a third time is going to be the charm.” Beneath the cloud, six consecutive monthly candles have nested entirely inside the tall green bar printed last November. He interprets the formation—six inside bars—as latency building for a violent move: “You’re talking about consolidation with six inside candles forming a lot of energy here.” That compression is mirrored on the weekly time frame: “If you also look at the weekly here, you can also see that you have six inside candles over here too … that tells me that there is not much bearish energy necessarily left anymore. I think we’re closer to the bottom than the top.” Key structural support is supplied by a rising 20-month simple moving average, now at $0.1737. Price currently ticks below it, but the slope is still positive. Historically, such combinations resolve in favour of the trend: “If you have a 20-month moving average that is up-sloping, most likely this is just going to be a wick.” He cites an earlier cycle when Dogecoin wicked beneath the same metric before staging a dramatic reversal. Price action, he argues, is meaningless without context. “If I end up looking at Doge here on Coinbase and I pull up the volume here, you can also see that there is no selling volume here at all.” Binance, the world’s deepest Dogecoin market, shows identical inertia. “The selling volume is essentially non-existent,” he says, concluding that supply overhang has vaporised and only demand is required to propel a reversal. Twice before—in July 2023 and February 2024—identical volume droughts preceded V-shaped rallies: “Low selling volume over here, reversal once volume comes in … low selling volume over here, reversal once volume comes in.” Related Reading: Dogecoin Shows Signs Of Life With Bottoming Signal Daily-chart oscillators are beginning to corroborate the structural read. Dogecoin has just registered what Cantonese Cat labels a “treasure bottom”—his term for a localised capitulation whose candle body is far smaller than its wick. More formally, the relative-strength index has exhibited bullish divergence: price has etched lower lows while RSI turns higher. “Last time when you have some bullish diversions was right here … that was the local bottom right there,” he says, pointing to the October 2023 reversal. The pattern repeated in March 2024 and appears again today: “I think that we might be experiencing a trend change here relatively soon.” DOGE Price Targets Should volume arrive and price claw back through the 0.5 and 0.618 retracements, Cantonese Cat’s Fibonacci ladders flag successive targets. From the Binance dataset, “$1.60, $2.26 and $4.13, all of these are possibility for Dogecoin.” A composite feed of multiple exchanges tweaks the numbers to $1.50, $2.27 and $3.94. What he does not foresee is a reprise of 2021’s parabolic blow-off, when Dogecoin tagged the 2.272 extension and briefly suggested a trajectory towards $23. “I think that $23 doge is insane … I don’t think that doge is going to end up becoming, you know, like anything like $3 trillion market cap.” A quarter- to half-trillion-dollar capitalisation, however—roughly the price zone between three and four dollars—remains “something to think about” given current monetary expansion. Cantonese Cat interprets the community’s malaise as a contrarian gift: “The market makers are giving us more time to buy while the sentiment is extremely, extremely poor.” Inside-bar ranges serve as a simple trigger. A close above the six-month range high would, in his reading, unlock the primary up-trend’s next leg. Conversely, a close below the 20-month average might delay—but not necessarily invalidate—the thesis, provided the moving average itself keeps rising. Across every lens—the macro cup-and-handle, the Adam-and-Eve neckline test, Ichimoku resistance, 20-month moving average support, volume exhaustion, daily bullish divergence—the weight of evidence converges on a bullish outcome. Timing, he concedes, is unknowable: “When is that going to be? I don’t know.” Yet none of the data justify capitulation. He closes with the maxim he repeats three times in the broadcast: “The trend is your friend, and the trend is up.” If that view holds, Dogecoin’s dormant coil may eventually unwind toward the analyst’s most ambitious extension at $4.13—a level unthinkable to today’s demoralised sellers, and precisely for that reason, he argues, still within reach. At press time, DOGE traded at $0.171. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Coinbase Secures MiCA License to Serve 450 Million Europeans",
      "link": "https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans\" rel=\"nofollow\"> </a></p> <p>Coinbase has obtained its Markets in Crypto Assets (MiCA) license from Luxembourg&#8217;s Commission de Surveillance du Secteur Financier (CSSF), marking a significant regulatory milestone that enables them to offer its complete range of services across all 27 European Union member states. The license allows Coinbase to serve approximately 450 million Europeans under a unified regulatory [&#8230;]</p> <p>"
    },
    {
      "title": "Sorted Wallet Integrates Breez SDK to Enable Bitcoin Payments on Feature Phones",
      "link": "https://bitcoinmagazine.com/news/sorted-wallet-integrates-breez-sdk-to-enable-bitcoin-payments-on-feature-phones",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Sorted-Wallet-Integrates-Breez-SDK-to-Enable-Bitcoin-Payments-on-Feature-Phones.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sorted-wallet-integrates-breez-sdk-to-enable-bitcoin-payments-on-feature-phones\" rel=\"nofollow\"> </a></p> <p>The integration brings non-custodial Lightning support to simple devices, expanding bitcoin access to an estimated 300 million users.</p> <p>"
    },
    {
      "title": "Parataxis Holdings to Create South Korea’s First Bitcoin Treasury Company",
      "link": "https://bitcoinmagazine.com/news/parataxis-holdings-to-create-south-koreas-first-bitcoin-treasury-company",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/New-York-based-investment-firm-Parataxis-enters-definitive-agreement-to-transform-Korean-biotech-company-into-institutional-Bitcoin-platform.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/parataxis-holdings-to-create-south-koreas-first-bitcoin-treasury-company\" rel=\"nofollow\">Parataxis Holdings to Create South Korea&#8217;s First Bitcoin Treasury Company </a></p> <p>Parataxis Holdings LLC has entered into a definitive agreement to acquire a controlling interest in South Korean biotech company Bridge Biotherapeutics, Inc. (KOSDAQ: 288330) for KRW 25 billion ($18.3 million), marking the creation of South Korea&#8217;s first institutionally backed Bitcoin treasury company.&#160; The transaction will see Bridge Biotherapeutics renamed to Parataxis Korea and continue trading [&#8230;]</p> <p>"
    },
    {
      "title": "KindlyMD Secures $51.5M to Accelerate Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/kindlymd-secures-51-5m-to-accelerate-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KindlyMD-Secures-51.5M-to-Accelerate-Its-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kindlymd-secures-51-5m-to-accelerate-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>KindlyMD secures a total of $763M as it prepares to merge with Bitcoin-native Nakamoto Holdings to build one of the largest public Bitcoin treasuries.</p> <p>"
    },
    {
      "title": "BitBox Announces BitBox02 Nova, A New Hardware Wallet For Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bitbox-announces-bitbox02-nova-a-new-hardware-wallet-for-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BitBox-Announces-BitBox02-Nova-A-New-Hardware-Wallet-For-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitbox-announces-bitbox02-nova-a-new-hardware-wallet-for-bitcoin\" rel=\"nofollow\"> </a></p> <p>BitBox's latest wallet introduces iOS support, Bluetooth isolation, and hardware security for Bitcoin self-custody.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Myriad Moves: Will Bitcoin Set a New All-Time High? Plus Strategy and PENGU Predictions",
      "link": "https://decrypt.co/326273/myriad-moves-bitcoin-all-time-high-strategy-pengu",
      "summary": "Will Bitcoin's next move be a spike to a fresh all-time high price, or a sharp plunge? Myriad users make their predictions on this and more."
    },
    {
      "title": "China to Restore Classic Bruce Lee, Jackie Chan and Jet Li Movies Using AI",
      "link": "https://decrypt.co/326252/china-to-restore-classic-bruce-lee-jackie-chan-and-jet-li-movies-using-ai",
      "summary": "China invests $14M in AI to restore 100 classic kung fu films, reviving Bruce Lee and Jackie Chan movies for global cultural influence."
    },
    {
      "title": "CRYPTO EDGES HIGHER, TRUMP FAMILY REDUCES WLFI STAKE, PUMPFUN TOKEN DELAYED!",
      "link": "https://decrypt.co/videos/interviews/qPEdhutt/crypto-edges-higher-trump-family-reduces-wlfi-stake-pumpfun-token-delayed",
      "summary": "FOMO HOUR LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. Crypto edges higher on volatile macro. Circle continues to push higher after GENIUS Act. Arizona passes crypto reserve bill. BTC buying surges in Japan as JPY hedge. Semler Scientific plans to buy 105k BTC in 3 years. Revolut considers its own stablecoin. Trump family reduces WLFI stake to 40%. Animoca, StanChart, HKT to collab for stablecoin. TRON flips DOGE market cap. Visa expands stablecoin to EMEA. Kraken debuts BTC staking. Fake OTC rounds see $50m stolen. Tether proposes fix to password exploits. 00:00 - Intro 01:30 - NBA going to a Game 7 02:00 - What's on todays show 03:52 - Mandos Market Report 06:27 - Iran/US news and the markets 10:38 - CRCL stocks still moving 12:00 - Trump reduces stake in WLFI 12:55 - Are we going to chop? 17:20 - BTC/ETH charts 19:00 - PumpFun Token Delayed 21:30 - Hyperliquid 25:58 - Digging into the CRCL trade 32:30 - Sharplink Gaming 34:55 - Gorbagana meme runs to $40M 37:52 - Trump WLFi tylers thoughts 40:00 - OSF and Rekt sell out 7/11 launch 42:08 - Yeet Giveaway! LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    },
    {
      "title": "Tokenized Assets ‘Expand Participation in Equity’ and Bring Wall Street On-Chain: Exodus",
      "link": "https://decrypt.co/326237/tokenized-assets-expand-participation-in-equity-and-bring-wall-street-on-chain-exodus",
      "summary": "Blockchain paves the way for 24/7 trades and lightning-fast settlement, the self-custodial crypto platform told ."
    },
    {
      "title": "Bitcoin Holds Ground as Fed’s Waller Calls for July Rate Cut",
      "link": "https://decrypt.co/326241/bitcoin-holds-ground-as-feds-waller-calls-for-july-rate-cut",
      "summary": "Fed futures traders penciled in a 14% chance that the U.S. central bank would cut rates in July on Friday."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Reddit considers using World ID to verify redditors: Semafor",
      "link": "https://cryptobriefing.com/reddit-world-id-verification-anonymity/",
      "summary": "<p>Reddit's potential use of World ID could enhance user trust and compliance with regulations while balancing privacy and authenticity concerns.</p> <p>"
    },
    {
      "title": "Coinbase secures MiCA license, unlocks access to all 27 EU countries",
      "link": "https://cryptobriefing.com/coinbase-mica-license-eu/",
      "summary": "<p>Coinbase's MiCA license enhances EU crypto market integration, boosting institutional trust and potentially accelerating regional blockchain innovation.</p> <p>"
    },
    {
      "title": "Fed’s Waller says rate cut could come as soon as July",
      "link": "https://cryptobriefing.com/fed-rate-cut-july-outlook/",
      "summary": "<p>A potential rate cut in July could signal a shift in monetary policy, impacting economic growth, inflation expectations, and market dynamics.</p> <p>"
    },
    {
      "title": "Norway to impose temporary restrictions on Bitcoin mining to save electricity",
      "link": "https://cryptobriefing.com/norway-bitcoin-mining-restrictions/",
      "summary": "<p>Norway's restrictions on Bitcoin mining highlight the tension between energy-intensive industries and sustainable energy priorities.</p> <p>"
    },
    {
      "title": "Arizona revives Bitcoin reserve bill and passes it in Senate",
      "link": "https://cryptobriefing.com/arizona-bitcoin-reserve-fund-bill/",
      "summary": "<p>Arizona's legislative actions on digital assets could set a precedent for integrating cryptocurrencies into state financial systems, despite political challenges.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "PENDLE – Institutions, whales, and what the SEC’s moves mean for DeFi",
      "link": "https://ambcrypto.com/pendle-institutions-whales-and-what-the-secs-moves-mean-for-defi/",
      "summary": "<img alt=\"PENDLE - Institutions, whales, and what the SEC&#039;s moves mean for DeFi\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-20T104742.962-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PENDLE’s institutional inflows and growing network activity could be key."
    },
    {
      "title": "Bitcoin price prediction – Will $100K hold on despite risk-off sentiment?",
      "link": "https://ambcrypto.com/bitcoin-price-prediction-will-100k-hold-on-despite-risk-off-sentiment/",
      "summary": "<img alt=\"Bitcoin price prediction - Will $100K hold on despite risk-off sentiment?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BitcoinpricepredictionFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />$100K remains a key price floor for bulls to hold on to in the short term."
    },
    {
      "title": "Is your crypto security at risk after the leak of 16 billion logins?",
      "link": "https://ambcrypto.com/is-your-crypto-security-at-risk-after-the-leak-of-16-billion-logins/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"756\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Crypto-security-at-risk.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1344\" />Cisco Talos warned against a targeted crypto malware campaign using Python-based trojans."
    },
    {
      "title": "FARTCOIN sees a $2.3 mln whale dump: Is a deeper correction coming?",
      "link": "https://ambcrypto.com/fartcoin-sees-a-2-3-mln-whale-dump-is-a-deeper-correction-coming/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-20T093749.152-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />FARTCOIN faces growing bearish pressure despite technical support."
    },
    {
      "title": "Arizona revives controversial Bitcoin Reserve bill – Here’s what it means for crypto seizures",
      "link": "https://ambcrypto.com/arizona-revives-controversial-bitcoin-reserve-bill-heres-what-it-means-for-crypto-seizures/",
      "summary": "<img alt=\"Arizona Revives Bitcoin Reserve Bill\" class=\"attachment-full size-full wp-post-image\" height=\"486\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Arizona-Revives-Bitcoin-Reserve-Bill.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"864\" />Arizona almost buried this bill, but a surprising Senate move brought it back. Now it’s gaining serious traction."
    }
  ]
}