{
  "CoinDesk": [
    {
      "title": "Vitalik Buterin Uses Privacy Tool Railgun Again, Signaling Ongoing Embrace of On-Chain Anonymity",
      "link": "https://www.coindesk.com/tech/2025/06/04/vitalik-buterin-uses-privacy-tool-railgun-again-signaling-ongoing-embrace-of-on-chain-anonymity",
      "summary": ""
    },
    {
      "title": "The Protocol: Berachain Follows Ethereum’s Pectra Upgrade With ‘Bectra’",
      "link": "https://www.coindesk.com/tech/2025/06/04/the-protocol-berachain-follows-ethereum-s-pectra-upgrade-with-bectra",
      "summary": ""
    },
    {
      "title": "Trio of Soft Economic Reports Boost Fed Rate Cut Odds, but What About Bitcoin?",
      "link": "https://www.coindesk.com/markets/2025/06/04/trio-of-soft-economic-reports-boost-fed-rate-cut-odds-but-what-about-bitcoin",
      "summary": ""
    },
    {
      "title": "JPMorgan to Accept Bitcoin ETFs as Loan Collateral in Expansion of Crypto Access: Bloomberg",
      "link": "https://www.coindesk.com/business/2025/06/04/jpmorgan-to-accept-bitcoin-etfs-as-loan-collateral-in-expansion-of-crypto-access-bloomberg",
      "summary": ""
    },
    {
      "title": "Trump's Crypto Ties at Forefront as U.S. Lawmakers Weigh Crypto Market Structure Bill",
      "link": "https://www.coindesk.com/policy/2025/06/04/trump-s-crypto-ties-at-forefront-as-u-s-lawmakers-weigh-crypto-market-structure-bill",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Senate committee to consider Trump’s pick for CFTC chair",
      "link": "https://cointelegraph.com/news/senate-committee-consider-trump-pick-cftc-chair?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNjNTYtZGFhZS03MWU4LWI4OGItNmFmMmVjZGYzNjFi.jpg\" /></p><p>Roughly four months since his nomination and amid announced departures at the CFTC, Brian Quintenz’s nomination to head the financial regulator is moving forward.</p>"
    },
    {
      "title": "Semler Scientific boosts Bitcoin reserve with $20M BTC top-up",
      "link": "https://cointelegraph.com/news/semler-scientific-acquires-20m-more-bitcoin-fortifying-reserve?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGUyZDQtNGM3Ni03NzgzLTljZTAtOWFmNTYxOGJkZGFi.jpg\" /></p><p>The company concluded its first year of Bitcoin reserve operations with 4,449 BTC on its balance sheet.</p>"
    },
    {
      "title": "MoonPay to operate in all 50 US states after NY BitLicense approval",
      "link": "https://cointelegraph.com/news/moonpay-operate-new-york-bitlicense-approval?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNiZWQtMTA3Yi03ZDJkLWI1ZjUtODBlNmZkMmZiYjkz.jpg\" /></p><p>According to the payments company, it had secured approval across a patchwork of regulatory regimes in individual US states allowing it to operate across the country.</p>"
    },
    {
      "title": "Price predictions 6/4: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, SUI, HYPE, LINK",
      "link": "https://cointelegraph.com/news/price-predictions-6-4-btc-eth-xrp-bnb-sol-doge-ada-sui-hype-link?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNiOWMtNDdhMS03YzM1LWEzNjgtZjllZTc5NzBiNDM1.jpg\" /></p><p>Bitcoin is witnessing a tough battle between the bulls and the bears at $105,000, but several altcoins are showing strength with potential breakout setups.</p>"
    },
    {
      "title": "How to use ChatGPT to analyze crypto market movements",
      "link": "https://cointelegraph.com/news/how-to-use-chatgpt-to-analyze-crypto-market-movements?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM2MTAtY2VhMC03ZjRlLWI5NjAtNGQ4ZDQ2YTU1ODJj.jpg\" /></p><p>Use ChatGPT to summarize market news, interpret on-chain data, compare token metrics, and spot sentiment shifts using structured prompts.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Brazil’s central bank plans to use CBDC data to guide interest rate decisions",
      "link": "https://cryptoslate.com/brazils-central-bank-plans-to-use-cbdc-data-to-guide-interest-rate-decisions/",
      "summary": "<p>Brazil’s Central Bank plans to treat transaction data from its central bank digital currency (CBDC) infrastructure, called Drex, as a direct input for setting the country’s interest rate benchmark. Central bank executive Henrique Videira said on June 4 at the Token Nation conference in São Paulo that every payment and asset transfer recorded on Drex’s [&#8230;]</p> <p>"
    },
    {
      "title": "Circle set to exceed IPO expectations after overwhelming investor demand",
      "link": "https://cryptoslate.com/circle-set-to-exceed-ipo-expectations-after-overwhelming-investor-demand/",
      "summary": "<p>Circle is poised to price its initial public offering above its marketed range after receiving investor orders for more than 25x the number of shares available, Bloomberg reported on June 4, citing people familiar with the matter. The stablecoin issuer and its backers are offering 32 million shares at a price range of $27 to [&#8230;]</p> <p>"
    },
    {
      "title": "US-based ETFs offering staking set for growth despite some regulatory, macro tailwinds",
      "link": "https://cryptoslate.com/us-based-etfs-offering-staking-set-for-growth-despite-some-regulatory-macro-tailwinds/",
      "summary": "<p>Upcoming exchange-traded funds (ETFs) that integrate staking yields stand to benefit significantly as US lawmakers and regulators clarify the legal status of on-chain rewards, according to a June 3 report. The report noted points to two parallel policy moves. First, the US Securities and Exchange Commission (SEC) confirmed on May 29 that staking does not [&#8230;]</p> <p>"
    },
    {
      "title": "RIAs surpass hedge funds in Bitcoin ETF holdings, manage over $10 billion in BTC",
      "link": "https://cryptoslate.com/insights/rias-surpass-hedge-funds-in-bitcoin-etf-holdings-manage-over-10-billion-in-btc/",
      "summary": "<p>New data from the latest 13F filings reveals a sharp increase in institutional interest in spot Bitcoin ETFs, with registered investment advisors (RIAs) emerging as the dominant players. Bloomberg’s senior ETF analyst, Eric Balchunas, highlighted that RIAs have now taken the lead among institutional holders of Bitcoin ETFs. Collectively, this group holds exposure to more [&#8230;]</p> <p>"
    },
    {
      "title": "JPMorgan to accept Bitcoin ETFs as loan collateral, consider digital holdings in evaluations",
      "link": "https://cryptoslate.com/jpmorgan-to-accept-bitcoin-etfs-as-loan-collateral-consider-digital-holdings-in-evaluations/",
      "summary": "<p>JPMorgan is set to begin accepting Bitcoin (BTC) exchange-traded funds as collateral for loans, Bloomberg News reported on June 4. The lender also plans to consider digital asset holdings when evaluating a client’s net worth and liquid assets, placing crypto alongside traditional categories such as equities, vehicles, and fine art when assessing lending eligibility. The [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin ATH Fails To Hype Retail—Demand Is Actually Down",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-ath-fails-hype-retail-demand-actually-down/",
      "summary": "On-chain data shows the retail interest in Bitcoin has been waning as small-holder volume has gone down during the past month. Bitcoin Retail Investor Demand Has Seen A Negative 30-Day Change In a CryptoQuant Quicktake post, an analyst has talked about the latest trend in the &#8220;Retail Investor Demand&#8221; of Bitcoin. This indicator provides an estimate for, as its name suggests, the amount of demand that the smallest of investors, the &#8216;retail,&#8217; have toward the cryptocurrency right now. The metric does so by referring to the transaction volume associated with this cohort. Considering the small wallet size attached to these holders, their transfers would typically remain under a value of $10,000, so the volume related to them can be separated from the rest of the market by only restricting to transfers below this size. Related Reading: Bitcoin 3–5 Year Holders Slow Selloff—Waiting for Higher Prices? Now, here is the chart shared by the quant that shows the 30-day percentage change in the Bitcoin Retail Investor Demand over the past year: As is visible in the above graph, the Bitcoin Retail Investor Demand saw its 30-day change enter into the positive territory when the latest bull rally first started, suggesting that the small investors increased their transfer activity. The 30-day change continued a gradual rise as the run played out, but after the cryptocurrency set its new all-time high (ATH), it noted a reversal in direction. Today, the metric has declined enough to dip back into the negative territory, meaning that retail investor volume is now going down on the monthly timeframe. From the chart, it&#8217;s also apparent that even at its peak, the 30-day change in the Retail Investor Demand never actually touched a high level this rally, which is in sharp contrast to the run from the end of 2024. Thus, it would appear that the recent price surge not only failed to ignite any notable level of interest among the small hands but also failed to maintain the attention that it did gather. The switch to a negative monthly change for the Retail Investor Demand could be down to the bearish action that the coin&#8217;s price has seen since the ATH, but the fact of the matter is that Bitcoin is currently still very much in range of this record, so it&#8217;s interesting to see this sentiment among the group. Related Reading: Bitcoin Could Go ‘Bananas’ If Price Closes Above This Level, Top Analyst Says Speaking of transaction volume, the institutional DeFi solutions provider Sentora (formerly IntoTheBlock) has talked about the latest trend in the volume share of the Bitcoin miners. As displayed in the chart, the Bitcoin miners have seen their volume share sharply go down recently and drop to the lowest level since 2022. This implies these chain validators have seen their activity plummet relative to the rest of the network. BTC Price Bitcoin has taken to sideways movement recently as its price is still trading around the $105,200 mark. Featured image from Dall-E, IntoTheBlock.com, CryptoQuant.com, chart from TradingView.com"
    },
    {
      "title": "Trump Crypto Venture Charges Into Digital Space With Wallet Launch Amid Uproar",
      "link": "https://www.newsbtc.com/altcoin/trump-crypto-venture-charges-into-digital-space-with-wallet-launch-amid-uproar/",
      "summary": "US President Donald Trump’s circle moved closer to rolling out two big crypto products this week. One announcement sparked a public mix‐up over who’s doing what. The other took a formal step toward a Bitcoin exchange‐traded fund. Both moves show the family’s push for more crypto ties. Related Reading: XRP Could Transform Your Finances Long Before $10K, Angel Investor Says Trump Token Wallet Claim Fuels Confusion According to reports, @GetTrumpMemes on X said on Tuesday that a new crypto wallet branded with US President Trump’s picture is coming."
    },
    {
      "title": "XRP Price Could Hit $21 This Bull Cycle With 1.618 Fib Level As Next Target",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-to-21-this-bull-cycle/",
      "summary": "According to expert analysts, the XRP price is showing renewed bullish momentum, with projections suggesting a potential rally to the 1.618 Fib at $21 this bull cycle. While this projection may seem ambitious, the analyst’s bullish outlook doesn’t stop there. Once XRP hits $21, it is expected to continue its upward trajectory toward its next target of $152. XRP Price Eyes Powerful Breakout To New Targets A recent technical analysis of XRP’s long-term price chart is igniting significant buzz in the crypto community, as the altcoin appears to be forming a familiar pattern that previously led to exponential gains. The chart, published by a well-known crypto expert, Javon Marks, suggests that XRP could be on the brink of a powerful price breakout, with expectations pointing toward the $21 price level and beyond. Related Reading: Wave Structure Puts XRP Price In The $18.22-$23.20 Range In The Short Term Marks’ analysis identifies two major symmetrical triangle formations in XRP’s price history—one that preceded its explosive rally in 2017 and another that concluded with a fresh breakout in 2024. In the earlier cycle, XRP surged thousands of percent after breaking out of its consolidation pattern, topping near the 2.272 Fibonacci level. This historical price movement is now being used to forecast what could come next for the altcoin. According to the chart, XRP recently rose to the 1.0 Fibonacci level near $3.31 but retraced back toward $2. If the current cycle mirrors the previous one, Marks predicts that the next significant level of interest lies at the 1.618 Fibonacci Extension level, which aligns with the $21 price target. Notably, a surge to this double-digit territory would represent an over 800% increase from current levels around $2.23. However, Marks’ optimistic projection does not stop there. Should XRP replicate the full extension it made in the past, the price is forecasted to reach the 2.272 Fibonacci level once again, this time sitting around a jaw-dropping $152. While this forecast may seem over the top, the analyst has shown strong confidence in XRP’s future price outlook, utilizing past price action as a blueprint and technical indicator to determine the altcoin’s upside potential. Analyst’s XRP Forecast Met With Skepticism On one hand, Marks’ bullish XRP price forecast was met with excitement, and on the other, the majority of crypto community members expressed doubts about the overly ambitious targets. The projection of a move to $21 and possibly even higher to $152 has been met with caution and skepticism among community members. Related Reading: Bullish Candle Formation Suggests The XRP Price Could Touch $22 While historical patterns can provide a roadmap to a potential price rally, critics responding to Marks’ analysis argue that reaching the triple-digit territory is virtually impossible for XRP currently. One member suggested that a more realistic target for the altcoin was between $13 and $20. Others questioned the feasibility of hitting these bullish targets within the proposed timeline, debating whether it could happen by the end of 2025 or even Q1 2026. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Dogecoin Caught In Compression: Descending Triangle Warns Of Potential Collapse",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-in-descending-triangle/",
      "summary": "Dogecoin (DOGE) is teetering on a critical edge as price action tightens within a descending triangle pattern, hinting at rising bearish pressure. The meme-inspired cryptocurrency has entered a phase of low volatility and narrowing price movement, a classic sign of market indecision that often precedes a significant breakout or breakdown. With the 200-period moving average applying dynamic resistance from above and horizontal support showing signs of strain, DOGE&#8217;s technical landscape suggests a potential collapse could be on the horizon if buyers fail to defend key levels. Price Coils Within Bearish Formation Ahead Of Potential Breakout Market analyst Thomas Anderson, in a recent post on X, pointed out that “DOGE is consolidating within a descending triangle pattern on the M30 timeframe,” signaling a period of indecision. This chart pattern, often seen in bearish continuations, is characterized by a flat support base with lower highs pressing from above. As Dogecoin trades deeper into this structure, the probability of a breakout, either upward or downward, is increasing with each narrowing move. Related Reading: Dogecoin’s Fate Hinges On This Price Level, Analysts Agree Anderson further explained that DOGE is “currently testing the upper resistance around $0.19998,” a key level that has capped recent bullish attempts. This resistance aligns with the descending trendline of the triangle and is strengthened by the 200 MA (red line), acting as dynamic resistance. The presence of the 200-period moving average at this level adds extra weight to the upper line, making any potential breakout attempt more challenging for the bulls in the near term. Until price action breaks decisively in either direction, DOGE remains locked in a tightening range. For now, Anderson’s observations underline the importance of this technical structure, as DOGE nears a critical inflection point. Triangle Compression Builds Tension For Dogecoin The analyst further emphasized that momentum appears to be weakening as Dogecoin’s price action tightens near the apex of the descending triangle. According to the expert’s observations, the 1-hour chart reinforces this broader consolidation phase, showing a clear compression of price within the pattern. This type of setup often leads to an explosive move once the market chooses a direction. Related Reading: Dogecoin Price Resistance In View: Why The Key Lies At $0.25 A confirmed breakout above the $0.19998 resistance could pave the way for a short-term bullish run, with higher targets potentially opening up if volume supports the move, potentially invalidating the bearish triangle pattern. However, failure to breach this resistance level may reinforce the bearish structure, increasing the likelihood of a pullback toward the lower triangle support around $0.19010, a critical area where buyers previously stepped in. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Consolidates Against BTC – Altseason Hopes Hinge On ETH/BTC Breakout",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-consolidates-against-btc-altseason-hopes-hinge-on-eth-btc-breakout/",
      "summary": "Ethereum is showing impressive resilience as it continues to hold above critical levels despite ongoing market volatility. While Bitcoin struggles to break past its all-time highs, ETH remains stable, maintaining bullish structure and fueling hopes for a broader altcoin rally. Analysts across the market are eyeing a potential altseason, with Ethereum expected to lead the charge once it clears major supply zones. Related Reading: Ethereum Daily Chart Signals Strength Amid Market Uncertainty – Analyst However, the spotlight is shifting to a less discussed but highly significant chart—ETHBTC. According to top analyst Daan, the ETHBTC pair has been consolidating in a tight range between 0.022 and 0.026 since the last squeeze. This consolidation suggests a period of accumulation and reduced volatility, but it also acts as a crucial signal for altcoin momentum. If ETHBTC breaks above the 0.026 resistance level, Daan suggests it could trigger a temporary but powerful rally in ALT/BTC pairs. Sectors closely tied to Ethereum—such as DeFi protocols, ETH-based memecoins, and Layer 2 ecosystems—could benefit most from such a move. Until then, investors are closely monitoring ETH’s performance relative to BTC, as it remains one of the most reliable indicators of capital rotation within the crypto market. ETHBTC Chart Becomes Key to Altseason Outlook Ethereum is currently trading at a pivotal range, with investors closely watching for a breakout that could lead to new highs and potentially ignite the long-anticipated altseason. Despite global tensions and continued macroeconomic uncertainty—particularly surrounding the aggressive and unstable Bond market—ETH has remained relatively strong. Bulls are optimistic, viewing the current consolidation as a healthy pause before the next leg up. One of the most important signals for altcoin momentum is not found on the USD chart, but in the ETHBTC pair. Daan points out that Ethereum’s price relative to Bitcoin has been consolidating between the 0.022 and 0.026 BTC range since the recent squeeze. This range now acts as a pressure point for the market. A breakout above 0.026 would likely catalyze a surge in altcoin strength, especially among Ethereum-related assets like DeFi protocols, ETH-based memecoins, and Layer 2 solutions. However, Daan warns that if ETHBTC drops below 0.0224, it could signal weakness for alts relative to BTC. It’s important to remember that ALT/BTC pairs can fall even if altcoin USD prices rise, particularly during aggressive BTC rallies. The same applies in reverse. For now, ETH’s position in this range remains one of the most telling signs of where the broader crypto market might head next. Related Reading: Ethereum Reclaims Pivotal Level – Key Resistance Around $2,650 Ethereum Faces Resistance As Bulls Attempt Breakout Ethereum (ETH) is currently trading around $2,640, showing signs of strength after holding its ground above the $2,500 mark. On the daily chart, ETH is forming a clear consolidation pattern just below a key resistance zone defined by the 200-day moving average (currently at $2,676). This level has repeatedly capped price action over the past few weeks, signaling strong supply pressure in this area. Despite the lack of a decisive breakout, Ethereum is maintaining a bullish structure with higher lows and consistent volume support. The 34-day EMA has turned upward and currently sits at $2,418, providing dynamic support and reinforcing the short-term uptrend. If ETH can reclaim the 200-day SMA and push above $2,700, a broader rally could follow, potentially opening the path toward $3,000 and beyond. Related Reading: Solana Reclaims Key Support After Sweeping Lows – Early Signs Of Reversal? On the downside, if price fails to break this resistance and sellers take control, immediate support lies near $2,500, followed by stronger demand around $2,350–$2,400 where the 50- and 100-day SMAs converge. For now, Ethereum remains in a balanced state, showing resilience, but still needs a strong catalyst to overcome the technical ceiling that continues to stall upward momentum. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Support The Blockchain Regulatory Certainty Act (BRCA) To Protect Noncustodial Services",
      "link": "https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Blockchain-Regulatory-Certainty-Act-Save-Our-Wallets-Bitcoin-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services\" rel=\"nofollow\"> </a></p> <p>Call your local elected officials and tell them to support the BRCA, which protects developers of noncustodial technology as well as a variety of services that preserve privacy and make it easier to scale Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: The Key To Scaling Bitcoin",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Layer2-Introduction.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bitcoin and other blockchains are robust and decentralized systems, but they do not scale. In order to make them work, a layered approach is necessary.</p> <p>"
    },
    {
      "title": "JPMorgan to Offer Clients Financing Against Bitcoin & Crypto ETFs",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-Morgan-Plans-to-Offer-Clients-Financing-Against-Crypto-ETFS.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs\" rel=\"nofollow\">JPMorgan to Offer Clients Financing Against Bitcoin &#038; Crypto ETFs</a></p> <p>JPMorgan Chase &#38; Co. plans to allow its trading and wealth-management clients to use cryptocurrency-linked assets, including spot Bitcoin exchange-traded funds (ETFs), as collateral for loans, according to Bloomberg. The bank will begin with BlackRock’s iShares Bitcoin Trust (IBIT), and additional ETFs are expected to be added over time. The policy will apply globally, spanning [&#8230;]</p> <p>"
    },
    {
      "title": "BTCPay Server: The Backbone of Bitcoin Commerce, 2025",
      "link": "https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_young_modern_wizard_male_futuristic_clothi_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025\" rel=\"nofollow\"> </a></p> <p>With plugins for Boltz swaps and WooCommerce, BTCPay Server’s open-source platform supports merchants globally, no middleman required.</p> <p>"
    },
    {
      "title": "Semler Scientific Acquires 185 Bitcoin, Increasing Total Holdings to 4,449 BTC",
      "link": "https://bitcoinmagazine.com/news/semler-scientific-acquires-185-bitcoin-increasing-total-holdings-to-4449-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Semler-Scientific-Acquires-185-Bitcoin-Increasing-Total-Holdings-to-4449-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/semler-scientific-acquires-185-bitcoin-increasing-total-holdings-to-4449-btc\" rel=\"nofollow\"> </a></p> <p>Semler Scientific now holds 4,449 BTC in their Bitcoin treasury, with an acquisition of 185 Bitcoin.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "‘Take Rent, Invest That’: How Grant Cardone Is Mixing Real Estate and Bitcoin",
      "link": "https://decrypt.co/323697/take-rent-invest-that-how-grant-cardone-is-mixing-real-estate-and-bitcoin",
      "summary": "Real estate entrepreneur Grant Cardone wants his tenants to buy Bitcoin for you."
    },
    {
      "title": "Chinese Company Takes a Shot at the Moon With $300 Million XRP Play",
      "link": "https://decrypt.co/323720/chinese-company-webus-300-million-xrp-play",
      "summary": "Nasdaq-listed travel booking firm Webus filed a Form 6-K to inform U.S. investors and regulators of its plans for a $300 million XRP treasury."
    },
    {
      "title": "Police Nab Alleged Mastermind Behind French Crypto Kidnappings: Report",
      "link": "https://decrypt.co/323693/police-arrest-alleged-amstermind-french-crypto-kidnappings-report",
      "summary": "A 24-year-old French-Moroccan national was arrested for his alleged role running a kidnapping scheme that targeted the crypto-rich in France."
    },
    {
      "title": "K-Pop Firm's Stock Soars 143% After Revealing Bitcoin Purchase Plans",
      "link": "https://decrypt.co/323671/k-pop-firms-stock-soars-115-after-bitcoin-purchase-plans",
      "summary": "The Korean firm’s stock skyrocketed on Wednesday, shortly after it announced its intentions to become the MetaPlanet of South Korea."
    },
    {
      "title": "Crypto Payments Firm MoonPay Secures New York BitLicense",
      "link": "https://decrypt.co/323657/moonpay-secures-new-york-crypto-bitlicense",
      "summary": "MoonPay has obtained New York's key BitLicense to conduct crypto business, though NYC Mayor Eric Adams recently came out against the license."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "JPMorgan Chase set to accept Bitcoin, crypto ETFs as loan collateral",
      "link": "https://cryptobriefing.com/jpmorgan-crypto-loan-collateral/",
      "summary": "<p>JPMorgan's move to accept crypto ETFs as collateral could accelerate mainstream adoption and integration of digital assets in traditional finance.</p> <p>"
    },
    {
      "title": "BlackRock’s Bitcoin ETF futures go live on Moscow Exchange as fund surpasses $70 billion AUM",
      "link": "https://cryptobriefing.com/bitcoin-futures-moscow-exchange/",
      "summary": "<p>The integration of Bitcoin ETFs into Russia's financial markets may signal a shift towards broader acceptance and regulation of crypto assets.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus files with SEC for potential $300M XRP reserve strategy, stock surges pre-market",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy/",
      "summary": "<p>Webus's strategic XRP reserve plan could enhance global payment solutions, potentially transforming cross-border transactions and boosting investor confidence.</p> <p>"
    },
    {
      "title": "Trump’s top crypto advisor meets with Pakistan blockchain chief to discuss Bitcoin",
      "link": "https://cryptobriefing.com/bitcoin-strategic-cooperation-pakistan/",
      "summary": "<p>Pakistan's strategic Bitcoin initiatives could strain IMF relations, highlighting challenges for emerging markets in crypto adoption.</p> <p>"
    },
    {
      "title": "Eric Trump threatens legal action over unauthorized Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/eric-trump-crypto-wallet-warning/",
      "summary": "<p>The incident highlights the complexities and potential legal challenges of using high-profile branding in the rapidly evolving crypto space.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Solana’s memecoin powerhouse Pump.fun eyes $1B raise at $4B valuation",
      "link": "https://ambcrypto.com/solanas-memecoin-powerhouse-pump-fun-eyes-1b-raise-at-4b-valuation/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Solana-Pumpfun-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here's experts' outlook on Pump.fun's expected token launch."
    },
    {
      "title": "Shiba Inu burn surges 2,408%: Can SHIB finally escape bearish pressure?",
      "link": "https://ambcrypto.com/shiba-inu-burn-surges-2408-can-shib-finally-escape-bearish-pressure/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-84-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SHIB’s massive burn rate fails to offset bearish on-chain signals and resistance levels."
    },
    {
      "title": "Bitcoin: How the $113K level can trigger a major price surge",
      "link": "https://ambcrypto.com/bitcoin-how-the-113k-level-can-trigger-a-major-price-surge/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-14.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bullish for now, but a long-term correction may follow."
    },
    {
      "title": "Bitcoin sellers cash out $1.5B in profits – Is this the start of a deeper correction?",
      "link": "https://ambcrypto.com/bitcoin-sellers-cash-out-1-5b-in-profits-is-this-the-start-of-a-deeper-correction/",
      "summary": "<img alt=\"Bitcoin sellers cash out $1.5B in profits - Is this the start of a deeper correction?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin realized profit surges by $1.5 billion as STHs turn to aggressive selling."
    },
    {
      "title": "GENIUS Act faces intense scrutiny – Over 60 amendments and rising",
      "link": "https://ambcrypto.com/genius-act-faces-intense-scrutiny-over-60-amendments-and-rising/",
      "summary": "<img alt=\"GENIUS Act faces intense scrutiny - Over 60 amendments and rising\" class=\"attachment-full size-full wp-post-image\" height=\"605\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/GENIUS-Act-Amendment-Talks-.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1075\" />Could amendments halt the GENIUS Act before it even reaches a vote?"
    }
  ]
}