{
  "CoinDesk": [
    {
      "title": "ADA Falls 4% on Heavy Volume, but Cardano's Upcoming Leios Upgrade Keeps Hopes Alive",
      "link": "https://www.coindesk.com/markets/2025/06/21/ada-falls-4-on-heavy-volume-but-cardano-mainnet-s-leios-upgrade-keeps-hopes-alive",
      "summary": ""
    },
    {
      "title": "ETH Under $2,500: Friday Sees Highest Outflows From Spot ETH ETFs This Month",
      "link": "https://www.coindesk.com/markets/2025/06/21/eth-under-usd2-500-friday-sees-highest-outflows-from-spot-eth-etfs-this-month",
      "summary": ""
    },
    {
      "title": "Bitcoin Falls Below $104K as Retail Investor Sentiment Returns to Liberation Day Levels",
      "link": "https://www.coindesk.com/markets/2025/06/21/bitcoin-falls-below-usd104k-as-retail-investor-sentiment-returns-to-liberation-day-levels",
      "summary": ""
    },
    {
      "title": "Spot Crypto ETF Filings for XRP, SOL, DOGE Among Those With Overwhelming SEC Approval Odds: Bloomberg",
      "link": "https://www.coindesk.com/markets/2025/06/20/spot-crypto-etf-filings-for-xrp-sol-doge-among-those-with-overwhelming-sec-approval-odds-bloomberg",
      "summary": ""
    },
    {
      "title": "Bitcoin Quickly Plunges Below $103K, With Volatility Burst Spurring $450M in Crypto Liquidations",
      "link": "https://www.coindesk.com/markets/2025/06/20/bitcoin-quickly-plunges-below-103k-with-volatility-burst-spurring-450m-in-crypto-liquidations",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin Knots gain ground: Will a chain split kill BTC price?",
      "link": "https://cointelegraph.com/news/bitcoin-knots-chain-split-kill-btc-price?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmRlMjUtNTk4Ni03ZDMwLWE2OWQtOWNjMTdlZDliNDI2.jpg\" /></p><p>A massive surge in Bitcoin Knots nodes hints at a brewing civil war in Bitcoin. If tensions escalate, the price could be the first casualty.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "‘Policy procrastination’ leaves UK trailing EU, US in crypto regulation: Experts",
      "link": "https://cointelegraph.com/news/uk-crypto-regulation-lags-behind-mica-genius-act?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkyNmItMTQwOC03NGRiLTgyNjktZmUzOTI1NmFhYzBm.jpg\" /></p><p>A new OMFIF blog warns the UK is losing its early advantage in digital asset regulation, as the EU enforces MiCA and the US advances with the Genius Act.</p>"
    },
    {
      "title": "XRP price rally’s biggest earners are selling $68.5M tokens every day",
      "link": "https://cointelegraph.com/news/xrp-price-rally-biggest-earners-selling-68-5m-tokens-every-day?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzI1MTctNzYwYy03YThiLTllODAtMDRhYzE1YTY0NDE1.jpg\" /></p><p>XRP could drop 35%, potentially revisiting the $1.35–$1.60 range, on-chain and technical metrics suggest.</p>"
    },
    {
      "title": "ZachXBT slams Bitcoin bridge Garden Finance for laundering hacked funds",
      "link": "https://cointelegraph.com/news/zachxbt-garden-finance-lazarus-laundering-allegations?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkxZTMtYmNhMi03ZjIyLThlZTAtZDVlNTliODk1ZTdk.jpg\" /></p><p>ZachXBT claims over 80% of Garden Finance’s fees are tied to crypto laundering, challenging the project’s decentralization narrative.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Pumpfun reportedly delays token auction to July amid legal troubles",
      "link": "https://cryptoslate.com/pumpfun-reportedly-delays-token-auction-to-july-amid-legal-troubles/",
      "summary": "<p>Pump.fun has delayed its public token sale once again, extending months of uncertainty for users and investors as the popular Solana-based launchpad wrestles with a flurry of lawsuits, Colin Wu reported on June 20. Pump.fun had aimed to raise $1 billion at a $4 billion valuation through its token auction originally set for June 25. The [&#8230;]</p> <p>"
    },
    {
      "title": "Alex Mashinsky forfeits rights to Celsius assets amid ongoing bankruptcy process",
      "link": "https://cryptoslate.com/alex-mashinsky-forfeits-rights-to-celsius-assets-amid-ongoing-bankruptcy-process/",
      "summary": "<p>Alex Mashinsky, the former CEO of Celsius, has agreed to surrender all rights to assets tied to the collapsed crypto lender. According to newly filed court documents, Mashinsky and entities associated with him, including AM Ventures Holdings Inc., Koala1 LLC, and Koala3 LLC, will be excluded from any future distributions under the Celsius bankruptcy plan. The [&#8230;]</p> <p>"
    },
    {
      "title": "Bloomberg analysts revise ETF approval odds to ‘90% or higher’ as SEC requests amended filings",
      "link": "https://cryptoslate.com/bloomberg-analysts-revise-etf-approval-odds-to-90-or-higher-as-sec-requests-amended-filings/",
      "summary": "<p>Bloomberg analysts have sharply increased the likelihood of U.S. regulators approving a new wave of cryptocurrency exchange-traded funds, pointing to a friendlier stance from the Securities and Exchange Commission (SEC). Bloomberg senior ETF analysts Eric Balchunas and James Seyffart said on June 20 that they now see a &#8220;90% or higher&#8221; chance that a broad [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase secures MiCA approval, shifts headquarters to Luxembourg",
      "link": "https://cryptoslate.com/coinbase-secures-mica-approval-shifts-headquarters-to-luxembourg/",
      "summary": "<p>Coinbase, the largest US-based exchange, has taken a major step in its global expansion by securing approval under the European Union’s Markets in Crypto-Assets (MiCA) regulation, according to a June 20 statement. The exchange confirmed that Luxembourg’s financial watchdog, the Commission de Surveillance du Secteur Financier (CSSF), granted it the necessary license to operate across the [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin falls to monthly lows triggering $464 million in liquidations amid global market jitters",
      "link": "https://cryptoslate.com/bitcoins-falls-to-monthly-lows-triggering-464-million-in-liquidations-amid-global-market-jitters/",
      "summary": "<p>Bitcoin (BTC) fell to its lowest price this month on June 20, triggering $464 million in liquidations across cryptocurrency markets as geopolitical jitters and heavy selling pressure rattled traders. Bitcoin dropped to a low of $102,225, reversing the gains recorded earlier in the day after failing to break through resistance above $106,000. Data from Coinglass [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Charts Signal Potential Bottom – All Eyes On Next Move",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-charts-signal-potential-bottom-all-eyes-on-next-move/",
      "summary": "Ethereum is once again trading at critical demand levels, testing the lower boundary of a six-week range that began forming in early May. After briefly climbing toward $2,800 earlier this month, ETH has retraced back to the $2,400 zone, reigniting debate about whether this is a healthy consolidation or a sign of further downside to come. Despite the pressure, Ethereum has not broken below this range, signaling that buyers continue to step in at these levels. Related Reading: Solana Analyst Sees $123 And $116 As Mid-Zone Support Levels – Here’s Why This extended consolidation period suggests a decisive move is nearing. Breakouts from tight ranges like this one often lead to strong directional momentum, and ETH’s current price structure could act as a launchpad—if bulls regain control. According to top analyst M-log1, Ethereum may have already bottomed during its most recent retrace, with the current action reflecting accumulation rather than weakness. The ETH/BTC ratio, another critical chart watched by traders, is also hovering near support levels, implying that a rotation back into altcoins may be imminent if Ethereum holds or pushes higher. For now, the market watches closely, as ETH’s next move could set the tone for broader altcoin performance in the weeks ahead. Ethereum Holds Range As Market Awaits Decisive Break Ethereum continues to trade within a tight consolidation range that began in early May, showing resilience despite growing global tensions and macroeconomic uncertainty. The price has hovered between $2,360 and $2,700, forming a narrow channel as buyers and sellers remain locked in a standoff. With conflicts in the Middle East intensifying and financial markets reacting to high interest rates and rising Treasury yields, crypto assets are under pressure, and Ethereum is no exception. The long-anticipated altseason has yet to materialize, and Ethereum is widely seen as the key to unlocking that next phase. ETH’s dominance in the smart contract and DeFi space gives it a central role in leading altcoin market momentum. Traders and analysts are closely monitoring its current range, especially after M-log1 shared analysis suggesting the recent low at $2,360 could mark a local bottom. According to M-log1, Ethereum is now consolidating just below the $2,450 level, and this zone could serve as a bullish trigger if reclaimed with strength. A decisive move in either direction will likely set the tone for the broader crypto market, with a breakout above $2,500 potentially igniting the next leg upward. Until then, market participants are watching closely. If ETH fails to hold these demand levels, the range could break to the downside, delaying any altseason rally further. But if bulls regain control and push above key resistance, it could signal the start of a much-anticipated upward move. In this environment of uncertainty, Ethereum’s next breakout-or breakdown—could prove pivotal for market sentiment heading into the second half of the year. Related Reading: Ethereum Prepares For A Decisive Move: ETH/BTC Setup Could Trigger Altseason ETH Tests Key Support As Price Retraces Ethereum is currently trading at $2,405, down 4.17% in the last session, after testing a low of $2,367. The chart reveals that ETH has retraced back to the lower boundary of a six-week range, confirming strong demand in the $2,360–$2,400 area. This zone has acted as a critical support level multiple times, with bulls stepping in each time to defend it. The price remains trapped below the 200-day moving average ($2,774), which has proven to be a strong resistance. Meanwhile, both the 50-day and 100-day moving averages are trending below price, currently sitting at $2,287 and $2,640, respectively, tightening the range even more. This compression typically leads to high volatility once a breakout occurs. Related Reading: Ethereum Mirrors Bitcoin 2017-2021 Pattern – $4,000 Is The Trigger Point Volume has remained elevated during recent sessions, suggesting that buyers and sellers are actively competing for control. A decisive close below $2,360 could trigger a cascade toward $2,100 or lower. Conversely, if bulls manage to reclaim $2,500 and sustain momentum toward the $2,700–$2,800 resistance band, it may set the stage for a breakout. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Bitcoin Net Taker Volume Enters Deep Red On Binance — What’s Next For BTC Price?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-net-taker-volume-enters-deep-red-on-binance/",
      "summary": "After another strong play for its all-time high in the past week, the price of Bitcoin has struggled to build on its recent bullish momentum. Over the last few days, the premier cryptocurrency has been specifically slow and lethargic. On Friday, June 20, the Bitcoin price took a severe hit — together with the rest of the crypto market — and fell briefly beneath the $103,000 mark. However, the latest market data suggests that the price of BTC might enjoy some stability after the recent round of long liquidations. BTC Gearing For A Run Of &#8216;Healthier Price Action&#8217;: Analyst In a Quicktake post on the CryptoQuant platform, on-chain analyst Amr Taha explained the dynamics between the Bitcoin price and its recent long liquidation event. According to the online pundit, the market leader could be preparing for more stable price action over the next few weeks. Related Reading: Is Bitcoin Gearing Up for a Breakout? On-Chain Signals Say ‘Watch This Level’ Taha revealed that the critical $103,000 liquidation cluster, which held a large volume of overleveraged long positions on Binance, has been cleared off. This cascade of long liquidations came after the price of Bitcoin plunged toward the $102,500 level on Friday evening. According to data from CryptoQuant, the price decline caused the long liquidations on Binance, the world’s largest exchange by trading volume, to exceed $160 million. The on-chain analyst noted that this long liquidation event also coincided with a major change in the Bitcoin Net Taker Volume on the cryptocurrency exchange. Taha highlighted that the Net Taker Volume has moved deep into the negative territory, falling to nearly -$100 million in the past day. As observed in the chart below, this latest plunge marks the third time the Net taker Volume has fallen to this level in the month of June. According to Taha, the change in this metric suggests that aggressive selling outweighed buying activity during the liquidation event. The on-chain analyst outlines two possible reasons for this trend, including that long positions were forced to close, pushing sell orders into the market as the Bitcoin price fell below $103,000. Taha added that some sections of Bitcoin retail traders might have pushed the panic button and filled new sell orders in fear of further losses. In the end, the crypto analyst concluded that the combination of long liquidations and extremely negative Net Taker Volume might not be completely bad for the flagship cryptocurrency. Taha said: While such events often feel devastating in the moment, they lay the groundwork for healthier price action. Given these dynamics, the path of least resistance may now shift upward as Bitcoin stabilizes above key support levels with reduced leverage overhead. Bitcoin Price At A Glance As of this writing, the price of BTC stands at around $103,450, reflecting an over 1% decline in the past 24 hours. Related Reading: Is Bitcoin Gearing Up for a Breakout? On-Chain Signals Say ‘Watch This Level’ Featured image from iStock, chart from TradingView"
    },
    {
      "title": "Tron Energy Usage Surges 108% – Smart Contract Activity Accelerates",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-energy-usage-surges-108-smart-contract-activity-accelerates/",
      "summary": "Tron (TRX) has captured investor attention once again with major developments surrounding its future. On Monday, Nasdaq-listed SRM Entertainment (SRM.O) confirmed a strategic agreement with Tron founder Justin Sun. The deal will see SRM acquire Tron tokens, rebrand itself as &#8220;Tron Inc.,&#8221; and onboard Sun as an adviser, effectively bringing Tron closer to becoming a publicly traded entity. This marks a historic shift for the blockchain industry and positions Tron in a unique space among crypto projects. Related Reading: Solana Analyst Sees $123 And $116 As Mid-Zone Support Levels – Here’s Why However, the market backdrop is anything but calm. Rising geopolitical tensions in the Middle East have sparked sharp volatility across risk assets, including Tron. While the token’s price has fluctuated significantly, long-term metrics suggest underlying strength in the network. According to new CryptoQuant data, TRON’s total daily energy consumption—an important measure of smart contract execution and user activity—has surged 108% year-over-year. It now sits at 200 billion energy units per day, compared to just 77 billion a year ago. Notably, 80% of this demand originates from staked TRX, indicating robust participation in the protocol and a significant increase in smart contract interactions. Together, these factors underscore Tron&#8217;s growing relevance as both a technical platform and a public-facing blockchain enterprise. Tron Trades Near Key Demand Amid Broader Market Pullback Tron is currently testing key demand levels after a 9% correction from its recent high near $0.295. The price had briefly surged on Monday after the announcement of Tron’s plans to go public through a deal with Nasdaq-listed SRM Entertainment. However, the excitement was short-lived. As macroeconomic uncertainty deepens and Middle East conflicts escalate, the entire crypto market has entered a retracement phase, dragging TRX below the levels it traded at prior to the news. Despite the challenging conditions, on-chain fundamentals paint a much more resilient picture. CryptoQuant data shows that Tron’s network activity remains robust, with energy consumption—used to execute smart contracts—up 108% year-over-year. Total daily energy usage now exceeds 200 billion units, compared to just 77 billion at the same time last year. This surge in energy use signals growing demand for on-chain operations and smart contract execution. Importantly, about 80% of this energy demand comes from staked TRX, pointing to strong user commitment to the network and increased participation in decentralized applications. The divergence between TRX’s on-chain strength and its current price performance suggests that the recent pullback may be more about broader market stress than any deterioration in Tron’s fundamentals. If volatility stabilizes, these robust activity metrics could help position Tron for a strong recovery. Related Reading: Ethereum Prepares For A Decisive Move: ETH/BTC Setup Could Trigger Altseason TRX Price Holds Trendline Support Despite Volatile Reversal Tron is currently trading at $0.2730, showing a modest 9% pullback from the $0.295 high reached earlier this week following the announcement of a deal involving SRM Entertainment. Price action in the chart reflects this volatile reaction—after spiking, TRX retraced sharply and is now consolidating just above the 50-day moving average (blue line), which has acted as dynamic support over the past two months. Despite this pullback, the structure remains bullish. TRX continues to respect the long-term ascending trendline formed since early March, with higher lows being maintained. Volume surged during the initial rally on the announcement but has since returned to pre-news levels, indicating fading short-term hype and a return to fundamentals. Looking at the broader setup, the 100-day and 200-day moving averages (green and red lines) remain sloped upward, reflecting sustained long-term momentum. The $0.269–$0.253 support band, defined by these MAs, will be key if further downside pressure materializes. Related Reading: Ethereum Analyst Eyes High Timeframe Close – Range Break Above $2,800 Could Be Violent A break above $0.295 would invalidate this short-term pullback and potentially ignite a move toward $0.32. Conversely, failure to hold the trendline could trigger a deeper retracement. For now, TRX holds structure—yet caution remains warranted given broader market uncertainty. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "XRP Price Crash Tests Critical Support At $2.1, Will It Break?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-crash-tests-2-1/",
      "summary": "After the market crash that sent the Bitcoin price falling toward $100,000, the XRP price also saw a notable decline, and this crash has brought it toward an important level. While the digital asset continues to hold above the $2.1 level, it remains critical support and a break below this could be negative for the price. This is outlined by crypto analyst The Alchemist Trader, who has shown what direction the XRP price could be headed in depending on what happens here. XRP Price Threatens Major Support Level After the almost 4.5% decline that ravaged the XRP price over the last week, it has been pushed down toward the next major support level, lying just above $2.09. So far, the bulls have defended this level, but the multiple tests suggest that a breakdown at this level could be in view. Related Reading: Analyst Predicts 20% Ethereum Price Crash Below $2,000, Here’s Why The analyst explains that the reason this level is so important is that it actually includes the value area low recorded in previous declines. Additionally, it is the 200-day moving average (MA) for the cryptocurrency, and also now serves as a key daily support/resistance flip. This means either camp of the bulls and bears can pull it in their direction, making it incredibly important for what happens to the XRP price in the short term. Given the importance of this level, whether it holds or breaks will carry serious implications for the XRP price. In the bearish scenario, the crypto analyst explains that a break below this support would trigger a liquidity sweep as the price dumps lower. The possibility of a break is even higher now, given that this level has already been tested multiple times. The Alchemist explains that each test weakens the level, putting it at risk of a breakdown. However, with long consolidation so far above this level, there is a bullish scenario that is rising. As bulls continue to maintain this support, further strength here could erode the possibility of a decline. If properly defended with a notable uptick in volume, in addition to a move upward into the recent local highs at $2.4, then it is likely that the XRP price continues to move up. Related Reading: Ethereum Bullish Wave Towards ATH Coming? Here Are The Targets “For bulls, a clean defense of this level with volume and a move back above recent local highs would indicate a potential rotation toward the next resistance,” the analysis read. “For bears, a breakdown without a reclaim increases the likelihood of continuation to the downside.” As for how to play the current trend, the analyst advises investors to exercise caution and wait for confirmation before taking positions. The confirmation here would either be a break below the support or a strong upward rally away from it, signaling a clear direction. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "BNB Price Breakout Could Trigger ATH Rally Repeat – Is $730 The Next Stop?",
      "link": "https://www.newsbtc.com/news/bnb-price-breakout-could-trigger-ath-rally-repeat-is-730-the-next-stop/",
      "summary": "Amid the market performance, BNB is attempting to reclaim the $650 level. Some analysts believe that a breakout toward the $700 barrier might occur next, which could lead to a bigger move to new highs. Related Reading: Solana Correction About To End? Analyst Forecasts $130 Retest Before Next Wave Up BNB Breakout To Retest $700 On Friday, BNB dropped to the $640 support after failing to hold the mid-zone of its local price range. The cryptocurrency has been trading within the $630-$690 price range following its reclaim of the $600 barrier last month. During the May breakout, BNB neared the crucial $700 resistance level, hitting a four-month high of $697. This key level propelled the altcoin’s price toward its $788 all-time high (ATH) after being broken in late 2024 and was lost during the early 2025 pullbacks. Now, the cryptocurrency is eyeing a reclaim of this area as support to continue its price recovery. Analyst Carl Runefelt from The Moon Show noted that BNB displays a one-month descending triangle pattern on the daily timeframe, with price compressing between the support and resistance levels. According to the chart, the formation’s support sits around the $635 level, while the descending resistance sits around the $650 area. To Runefelt, a bullish breakout from this pattern could propel the token 10% toward the $700 resistance. Notably, reclaiming and confirming this key area as support could also send BNB’s price toward another crucial horizontal level. Analyst Crypto Batman recently highlighted that BNB is forming a multi-month ascending triangle, “holding strong” near the ascending trendline after continuing to bounce from the $635-$640 support zone. To the market watcher, “Even with market uncertainty, BNB structure is clean after respecting the trendline and bouncing off major support, now eyeing a breakout above $700,” which could be part of a bigger move toward the $800 level. Is A Move To $800 Coming? Crypto Batman also noted that the cryptocurrency could be following the same price action as last year. He asserted that the altcoin’s price “loves testing key zones before liftoff,” adding that it is displaying the same base form as it did in Q3 2024. Last year, the token formed a three-month base around the $460-$470 area, which led to an “explosive” run over the next few months. This year, BNB formed a similar base near the $550 level, and it’s “showing strength again.” To the analyst, “If the pattern repeats, then patience will give us profits.” Additionally, he pointed out that despite the early April retraces, BNB held its macro range, trading above the range lows and multi-time-tested support. Related Reading: SUI Preparing For New Highs As Falling Wedge Breakout Targets $5 The cryptocurrency is now consolidating near the mid-zone, which could propel the price to a retest of the macro range highs around the $729 mark. He explained that “If we see a breakout above the $729 resistance, it could open the path toward a 50% move to the upside.” The analyst affirmed that BNB’s structure remains bullish as long as the cryptocurrency holds the $490-$500 levels, adding that the $600 mark is also a strong support. As of this writing, BNB is trading at $641, a 2.9% decline in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Norway Plans to Temporarily Ban New Bitcoin & Crypto Mining Centers to Conserve Energy",
      "link": "https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/NBX-Acquires-Bitcoin-Becomes-First-Public-Bitcoin-Treasury-Company-in-Norway.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy\" rel=\"nofollow\">Norway Plans to Temporarily Ban New Bitcoin &amp; Crypto Mining Centers to Conserve Energy</a></p> <p>Norway’s government will temporarily block the development of new Bitcoin and cryptocurrency mining facilities starting this year, prioritizing energy for other industries.</p> <p>"
    },
    {
      "title": "A Seed Phrase Isn’t Self Custody, It’s A Liability.",
      "link": "https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/seedlessheader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability\" rel=\"nofollow\"> </a></p> <p>Seed phrases were an improvement a decade ago. They’re long overdue for an upgrade.</p> <p>"
    },
    {
      "title": "Is the 4-Year Bitcoin Cycle Over? Rational Root Explains Why This Time Might Not Be Different",
      "link": "https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Is-the-4-Year-Bitcoin-Cycle-Over-Rational-Root-Explains.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root\" rel=\"nofollow\"> </a></p> <p>Rational Root joins Pro to debate whether the 4-year Bitcoin cycle is breaking down in the age of ETFs, passive flows, and institutions.</p> <p>"
    },
    {
      "title": "What Happens to Bitcoin When Quantum Computers Arrive?",
      "link": "https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ChaincodeReportHeader-fotor-20250620123039.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive\" rel=\"nofollow\"> </a></p> <p>A high level overview of the recent report by Chaincode Labs on the threat quantum computing poses to Bitcoin. </p> <p>"
    },
    {
      "title": "Coinbase Secures MiCA License to Serve 450 Million Europeans",
      "link": "https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans\" rel=\"nofollow\"> </a></p> <p>Coinbase has obtained its Markets in Crypto Assets (MiCA) license from Luxembourg&#8217;s Commission de Surveillance du Secteur Financier (CSSF), marking a significant regulatory milestone that enables them to offer its complete range of services across all 27 European Union member states. The license allows Coinbase to serve approximately 450 million Europeans under a unified regulatory [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "From Free NFT Mint to Drinks at 7-Eleven: Rekt Is Reaching the Masses",
      "link": "https://decrypt.co/326337/from-nft-drinks-7-eleven-rekt-reaching-masses",
      "summary": "Rekt began life as free Ethereum NFT drop and now is a rising drink brand, with cans hitting 7-Eleven stores this week."
    },
    {
      "title": "Elliptic, Internet Watch Foundation Team Up to Combat Crypto Financing of Child Abuse Material",
      "link": "https://decrypt.co/326305/elliptic-iwf-combat-crypto-financing-child-abuse-material",
      "summary": "The Internet Watch Foundation found that cryptocurrencies are the most commonly offered method of payment on child abuse websites."
    },
    {
      "title": "Solana, XRP and Dogecoin ETF Approvals in 2025 Are a Near Lock, Analysts Say",
      "link": "https://decrypt.co/326353/solana-xrp-dogecoin-etf-approvals-2025-near-lock",
      "summary": "Wall Street analysts say that SEC approvals for ETFs based on altcoins including Dogecoin, XRP, and Solana are nearly a sure thing this year."
    },
    {
      "title": "Nakamoto Holdings Rakes in $51.5 Million for Publicly Traded Bitcoin Treasury",
      "link": "https://decrypt.co/326316/nakamoto-holdings-51-5-million-publicly-traded-bitcoin-treasury",
      "summary": "The Bitcoin holdings company's merger partner KindlyMD closed the $51.5 million fundraise with private investors on Friday."
    },
    {
      "title": "Public Keys: Circle and Coinbase Get GENIUS Bump, Bitcoin Treasuries on Shaky Ground?",
      "link": "https://decrypt.co/326330/public-keys-circle-coinbase-genius-bump-bitcoin-treasuries-shaky-ground",
      "summary": "Circle skyrockets on stablecoin optimism while Bitcoin treasury firms face valuation challenges in this week's public markets roundup."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "CoinMarketCap’s front-end compromised, investigation underway",
      "link": "https://cryptobriefing.com/coinmarketcap-security-breach-investigation/",
      "summary": "<p>This incident highlights the urgent need for enhanced cybersecurity measures in the crypto industry to protect user assets and data integrity.</p> <p>"
    },
    {
      "title": "Texas governor signs bill to protect state Bitcoin reserve as a permanent fund if established",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-protection-bill/",
      "summary": "<p>Texas' move to protect a potential Bitcoin reserve could set a precedent for state-level crypto asset management, influencing future fiscal policies.</p> <p>"
    },
    {
      "title": "XRP joins Solana and Litecoin in top ETF approval tier",
      "link": "https://cryptobriefing.com/spot-crypto-etf-approval-tier/",
      "summary": "<p>The increased likelihood of crypto ETF approvals could significantly boost market legitimacy and attract institutional investment.</p> <p>"
    },
    {
      "title": "Why your business should start accepting Bitcoin today",
      "link": "https://cryptobriefing.com/accepting-bitcoin-payments-business/",
      "summary": "<p>Accepting Bitcoin can lower fees, reduce fraud risks, and simplify global payments as more consumers look to pay with crypto in 2024.</p> <p>"
    },
    {
      "title": "Reddit considers using World ID to verify redditors: Semafor",
      "link": "https://cryptobriefing.com/reddit-world-id-verification-anonymity/",
      "summary": "<p>Reddit's potential use of World ID could enhance user trust and compliance with regulations while balancing privacy and authenticity concerns.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Dogecoin down 30%, mirrors 2021 structure: Prepare for a potential…",
      "link": "https://ambcrypto.com/dogecoin-down-30-mirrors-2021-structure-prepare-for-a-potential/",
      "summary": "<img alt=\"Dogecoin down 30%, mirrors 2021 structure: Prepare for a potential...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-16.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" /> Watch out! DOGE may be setting up for its next big leg."
    },
    {
      "title": "FUNToken whales load up: Bullish signal",
      "link": "https://ambcrypto.com/funtoken-whales-load-up-bullish-signal/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"507\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-21-181622.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"764\" />While recent market observations indicate strong buying pressure and order book imbalances for FUNToken, reports [&#8230;]"
    },
    {
      "title": "$487 mln Solana on the move: What’s hidden behind this transfer?",
      "link": "https://ambcrypto.com/487-mln-solana-on-the-move-whats-hidden-behind-this-transfer/",
      "summary": "<img alt=\"$487 mln Solana on the move: What&#039;s hidden behind this transfer?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-21T094945.865-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana’s whale activity, strong fundamentals, and rising attention point to a stealth accumulation phase."
    },
    {
      "title": "Ethereum whales sell $321 mln in 60 seconds! Still, a tough battle remains",
      "link": "https://ambcrypto.com/ethereum-whales-sell-321-mln-in-60-seconds-still-a-tough-battle-remains/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-3-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Are bulls regaining control or will bearish momentum push ETH lower?"
    },
    {
      "title": "Bitcoin’s Options expiry to test BTC’s $100K floor – Will bears take control?",
      "link": "https://ambcrypto.com/bitcoins-options-expiry-to-test-btcs-100k-floor-will-bears-take-control/",
      "summary": "<img alt=\"Bitcoin&#039;s Options expiry to test BTC&#039;s $100K floor - Will bears take control?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-13.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin faces a high-volatility week. Here’s what’s at play!"
    }
  ]
}