{
  "CoinDesk": [
    {
      "title": "SUI Surges 5% on Triple Volume Breakout Amid Trade Talks Between U.S. and China",
      "link": "https://www.coindesk.com/markets/2025/06/09/sui-surges-5-on-triple-volume-breakout-amid-trade-talks-between-u-s-and-china",
      "summary": ""
    },
    {
      "title": "Circle Goes Full Circle",
      "link": "https://www.coindesk.com/opinion/2025/06/09/circle-goes-full-circle",
      "summary": ""
    },
    {
      "title": "Can Crypto Unlock the Vibe Launch?",
      "link": "https://www.coindesk.com/opinion/2025/06/09/can-crypto-unlock-the-vibe-launch",
      "summary": ""
    },
    {
      "title": "The End of Bitcoin Maximalism",
      "link": "https://www.coindesk.com/opinion/2025/06/09/the-end-of-bitcoin-maximalism",
      "summary": ""
    },
    {
      "title": "Ethereum Blockchain Is Useful Technology That 'Deserves Love,' Bernstein Says",
      "link": "https://www.coindesk.com/markets/2025/06/09/ethereum-blockchain-is-useful-technology-that-deserves-love-bernstein-says",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin price rebounds to $108K as millionaire whale goes 20x long on BTC",
      "link": "https://cointelegraph.com/news/bitcoin-price-108k-whale-goes-long-20x-long-btc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU1MzQtM2FkMC03ZjJhLWJiZTEtZmVmMjBjOWRlNmEx.jpg\" /></p><p>Analysts say Bitcoin could break its all-time high within 1–2 weeks, following breakout patterns seen recently in gold and the S&amp;P 500.</p>"
    },
    {
      "title": "Empty seats could hamper CFTC’s ability to regulate crypto",
      "link": "https://cointelegraph.com/news/cftc-regulate-crypto-bill-us?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzU1YTYtNzg2ZS03ODNlLTkwZDEtMzgzMmU3YmU0Njdj.jpg\" /></p><p>New legislation in Washington would have the CFTC regulate crypto, but is it currently able to provide effective rulemaking?</p>"
    },
    {
      "title": "Tether plans to open-source Bitcoin mining OS; CEO says &#039;no need&#039; for 3rd party vendors",
      "link": "https://cointelegraph.com/news/tether-bitcoin-mining-software-open-source?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU1M2ItNmI2ZC03NjVjLTg5ZTQtYTYzYTFjNTdjOTRm.jpg\" /></p><p>The USDt issuer plans to launch its open-source project by the fourth quarter of 2025, according to CEO Paolo Ardoino.</p>"
    },
    {
      "title": "Hodling in 2025: The most widely used Bitcoin strategy, explained",
      "link": "https://cointelegraph.com/explained/hodling-in-2025-the-most-widely-used-bitcoin-strategy-explained?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9lYTgzOGEyNTU0NTY4ZmVmZDI1YTYwMmFlNzcyN2UyMS5qcGc=.jpg\" /></p><p>Despite market volatility and evolving investment tools, hodling remains the go-to strategy for Bitcoin believers in 2025.</p>"
    },
    {
      "title": "Trump Wallet scandal: Is Magic Eden really involved or just dragged in?",
      "link": "https://cointelegraph.com/explained/trump-wallet-scandal-is-magic-eden-really-involved-or-just-dragged-in?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9mNWMxZDcyYjE0MDhmZjFiNjZmODRhMTRjMzUxMTE1NS5qcGc=.jpg\" /></p><p> Magic Eden publicly promoted the Trump Wallet, but conflicting claims and legal fallout raise questions about how clearly the partnership was understood. </p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Kadena issues first grant from $25M real estate tokenization fund in Bank of England pilot",
      "link": "https://cryptoslate.com/kadena-issues-first-grant-from-25m-real-estate-tokenization-fund-in-bank-of-england-pilot/",
      "summary": "<p>Public PoW blockchain Kadena makes its first capital deployment from a $50 million grants program, backing UK startup CurveBlock in the Bank of England’s Digital Securities Sandbox. Kadena has awarded the first grant from its new $50 million ecosystem fund, allocating $400,000 to CurveBlock, a UK-based startup building tokenized real estate inside a regulated financial [&#8230;]</p> <p>"
    },
    {
      "title": "Could Marathon be readying to team with Exxon or Aramco on flare gas Bitcoin mining?",
      "link": "https://cryptoslate.com/could-marathon-be-readying-to-team-with-exxon-or-aramco-on-flare-gas-bitcoin-mining/",
      "summary": "<p>Could Marathon Digital Holdings be in exploratory talks with Exxon Mobil and Saudi Aramco to colocate Bitcoin mining units at oilfields, directly tapping flare-gas for power? Crypto Twitter thinks it&#8217;s possible, and if confirmed, the partnership could turbocharge the scale and legitimacy of gas-to-Bitcoin operations, turning waste methane into a monetized digital asset while addressing [&#8230;]</p> <p>"
    },
    {
      "title": "Why is Bitcoin’s mempool so quiet while its price surges?",
      "link": "https://cryptoslate.com/why-is-bitcoins-mempool-so-quiet-while-its-price-surges/",
      "summary": "<p>The number of transactions waiting in Bitcoin&#8217;s mempool has been thin since mid-May, a rare event in bull markets. This prolonged quiet spell has pushed median fee rates down to 1 sat/vB or less, left many blocks underfilled, and revived long-term questions about the health of Bitcoin&#8217;s fee market. Some reports showed that the 7-day [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin spot trading hits four-year low as investors prioritize HODLing",
      "link": "https://cryptoslate.com/insights/bitcoin-spot-trading-hits-four-year-low-as-investors-prioritize-hodling/",
      "summary": "<p>Bitcoin spot trading on centralized exchanges has fallen to its lowest point in over four years, according to data from CryptoQuant. Crypto analyst Axel Adler Jr. noted that current spot volumes mirror levels last seen in October 2020. According to him, this shift points to a broader market trend in which Bitcoin holders are refraining [&#8230;]</p> <p>"
    },
    {
      "title": "Circle’s CRCL stock skyrockets 22% in pre-market trading amid fervent institutional interest",
      "link": "https://cryptoslate.com/circles-crcl-stock-skyrockets-22-in-pre-market-trading-amid-fervent-institutional-interest/",
      "summary": "<p>Circle&#8217;s CRCL shares are drawing strong interest following the company&#8217;s recent listing on the New York Stock Exchange. The firm, best known for issuing the USDC stablecoin, has seen its stock price rise sharply since launch. Data from Yahoo Finance shows Circle&#8217;s stock climbed nearly 22% in pre-market trading, reaching above $130 before retracing slightly [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "$106K Bitcoin A ‘Safer’ Buy Than $25K—XRP Lawyer Drops Bombshell",
      "link": "https://www.newsbtc.com/news/bitcoin/106k-bitcoin-a-safer-buy-than-25k-xrp-lawyer-drops-bombshell/",
      "summary": "A well-known cryptocurrency attorney and XRP advocate, John Deaton, is urging investors to stay bullish on Bitcoin even as it hovers near $106,000. He’s put about 80% of his net worth into BTC at an average price below $25,000. Rather than fret over today’s high sticker, he says the odds favor more gains ahead than losses. Related Reading: Blank Pi Network Wallets Spark Outcry—What’s The Network Hiding? Deaton’s Big Bet According to Deaton, buying at six figures isn’t too late. He calls today’s price range “more asymmetrical,” meaning the upside is greater than the downside. He’s put 80% of his wealth into Bitcoin. His average entry cost was less than $25,000. Still, he sees room to run even from around $106,000. Macro Concerns Drive Interest Based on reports, Deaton worries about soaring national debt in the US and fresh tariffs from US President Donald Trump’s time in office. He flags endless money printing by central banks as a red flag. I’m not in favor of telling people living paycheck to paycheck (me until 15 years ago) to take out a mortgage on their primary home to buy Bitcoin (I’m not suggesting that that’s what David is recommending either), but I am in the process of selling real estate, and although my… https://t.co/JMB1zgeazW — John E Deaton (@JohnEDeaton1) June 8, 2025 He says all these moves are chipping away at trust in fiat cash. With only 21 million BTC ever to be mined, Bitcoin can’t be inflated away. That fixed supply, he argues, makes it a solid hedge against a shaky dollar. Corporate And State Adoption Institutional demand is also on the rise. MicroStrategy—now called Strategy—holds more than 200,000 BTC, worth tens of billions of dollars. And in the last seven days, 16 companies have added Bitcoin to their balance sheets. On the government side, Rep. Tim Burchett introduced a bill to turn a Trump executive order into law, creating a US Strategic Bitcoin Reserve. Countries like Pakistan, Ukraine, and Ireland are weighing similar steps. They want to see if holding Bitcoin could protect their foreign exchange plans. Skeptics Voice Worries Not everyone agrees with Deaton’s rosy outlook. Economist Peter Schiff, a gold advocate, says Bitcoin has no real value and is too wild to be a safe haven. He tweeted that today’s rally is just hype. Deaton doesn’t shy away from such criticism. He admits he has “confirmation and wealth-preservation bias.” He still insists Bitcoin is the best store of value during today’s economic storms. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Deaton warns against buying with money you can’t afford to lose. He tells people living paycheck-to-paycheck not to risk their homes or take out loans just to buy crypto. His basic message is simple: look past daily price swings and ask where the world’s money is headed. If you share his concerns about the dollar and believe institutions will keep piling in, his bet on Bitcoin could pay off. But anyone on the sidelines should be ready for big swings and should only invest what they can handle. Featured image from Pexels, chart from TradingView"
    },
    {
      "title": "Bitcoin Weekly Chart Flexes Strength—Is The Moonshot Just Getting Started?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-chart-flexes-strength/",
      "summary": "Bitcoin is making waves once again, flashing strength on the weekly chart as it closes well above key moving averages. With momentum indicators still favoring the bulls and no signs of exhaustion in sight, the current setup hints that the rally might be far from over. Could this be the beginning of an even bigger breakout? Bitcoin Stays Elevated: Bulls Show No Signs of Fatigue In a recent update shared on X, Shaco AI highlighted Bitcoin’s continued bullish momentum, pointing to strong weekly performance on the BTC/USDT chart. The analyst noted that BTC has “ballooned past recent expectations,” closing the week at an impressive $105,700. Related Reading: Bitcoin At A Crossroads: $97,000 Cost Basis Holds Key To Next Breakout This places the asset well above its 25-week Simple Moving Average (SMA) of $95,009.55 and the 50-week SMA at $83,318.12, an encouraging technical signal that suggests Bitcoin’s uptrend remains firmly intact. As Shaco AI put it, “The party isn’t over yet,” hinting that bullish sentiment could carry BTC even higher. Technical indicators further support this upbeat outlook. The Relative Strength Index (RSI) currently reads 63.51, indicating that buying momentum remains robust without entering overbought territory. This suggests that traders are still comfortable accumulating at current levels, and the market hasn&#8217;t yet reached a point of exhaustion. Furthermore, the Moving Average Convergence Divergence (MACD) remains firmly in positive territory at 5835.33. The MACD&#8217;s positioning reflects steady buyer interest and a favorable trend structure, both of which are crucial for sustaining an upward move. Volume Slackens While Price Nears Critical Resistance Zone The analyst went on to point out that despite the bullish setup currently seen on Bitcoin’s chart, the enthusiasm might be tempered by softening trading volume. Specifically, trading volume has only reached 95,302, significantly lower than the average volume of 179,421. Related Reading: Bitcoin Price Slips Again, Triggering Fresh Fears of a Deeper Correction This discrepancy signals a noticeable dip in market participation, raising the question of whether the ongoing price rally has enough fuel to sustain its momentum in the short term. As the analyst emphasized, this drop in volume is worth watching closely since it may influence the momentum of next week’s price action. Looking at the broader picture, Bitcoin is approaching a major resistance level at $111,980. This key barrier represents a potential turning point; either it gets broken and paves the way for further upside, or it holds and prompts a short-term correction. Should a pullback occur, the analyst noted that BTC appears to have a comfortable support zone at $49,000, which could act as a solid cushion. In any case, the analyst suggests keeping a close eye on how these technical levels play out, as they could dictate Bitcoin’s next big move. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "XRP Price Remains Bullish Above $2, This Falling Channel Says $3.8 Is Coming",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-remains-bullish-above-2/",
      "summary": "The XRP price is holding strongly above $2, maintaining its momentum as technical indicators show signs of a bullish trend. Notably, a distinct Falling Channel on the XRP price chart suggests that a breakout could be brewing, with a potential rally toward $3.8 in sight. XRP Price Holds Steady As Bulls Target $3.8 A technical analysis by Rose Premium Signals reveals that XRP is currently flashing strong bullish signals following a breakout from a long-term Falling Channel. Earlier in January, XRP broke past $3 but experienced a strong correction that has kept its price down ever since. Despite the ongoing downtrend, XRP has been firmly holding above the $2 threshold as it prepares for new all-time highs. Related Reading: What Happens To The XRP Price If The 2017 Fractal Plays Out Again? Previously, XRP traded within a descending range for several months, forming lower highs and lower lows. However, recent price action has seemingly invalidated this downtrend structure with a decisive breakout above the upper boundary of the Falling Channel, indicating a potential trend reversal and the beginning of a bullish continuation. The chart shared by Rose Premium Signals on X (formerly Twitter) shows that after the breakout, XRP has been consolidating above the former resistance-turned-support zone, around the $2 level. The analyst confidently states that XRP’s outlook remains inherently bullish despite past downtrends, suggesting that the recent consolidation pattern indicates that bulls are still in control. Notably, the breakout above the Falling Channel is significant, as it typically implies a strong upside move, especially on higher time frames. Projected price targets based on technical formation are positioned at $2.9520, $3.3967, and $3.8767. Interestingly, the highest projected target exceeds XRP’s all-time high of $3.84 and reflects a 73.54% increase from current price levels. It’s important to note that these bullish targets forecasted by Rose Premium Signals align with historical resistance zones and measured moves from the Falling Channel breakout. If momentum sustains and market conditions remain favorable, XRP could rally toward these targets over the coming weeks, potentially offering significant upside for long-term holders and traders. Analyst Says Buy The Dip, With Ideal Entry At $1.85 While forecasting several optimistic targets for XRP, Rose Premium Signals emphasized a strategy of buying the altcoin during dips. This method aims to capitalize on low price points to maximize potential gains as XRP rebounds. Related Reading: Wave Count Analysis Reveals The XRP Price Trigger Point For Take-Off The analyst‘s chart highlights the $1.85 support level with a clear “Buy Here” label, suggesting that this level is considered an ideal entry point should the price revisit it. Currently, XRP is trading at $2.23, meaning a drop to $1.85 would represent a 17.04% decrease. According to the analysis, this support level also marks the base of the recent Falling Channel breakout, providing a favorable risk-reward setup for those looking to enter or expand their positions. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "Don’t Risk Frozen Funds: Coinbase Has a Major Issue, So Choose Non-Custodial Best Wallet Instead",
      "link": "https://www.newsbtc.com/news/coinbase-account-freezing-issue-best-wallet-alternative/",
      "summary": "Coinbase CEO Brian Armstrong has acknowledged that the unexpected freezing of user accounts has been a major issue for the cryptocurrency exchange. In a recent announcement on X, Armstrong stated that the company has successfully reduced these unnecessary account restrictions by 82% and is committed to further improvements. The progress comes after significant investment in upgrading the platform’s machine learning models and infrastructure, according to Dor Levi, a product team member at Coinbase. The enhancements have improved the precision of the Coinbase security systems, leading to fewer legitimate accounts being mistakenly flagged and frozen. Despite these advancements, Armstrong and Levi confirmed that Coinbase will continue to comply with court orders and legal sanctions requiring account restrictions. The Custodial Dilemma: When Your Crypto Isn’t Yours Despite the platform’s efforts, the announcement has been met with continued frustration from many customers. Some users on social media reported being unable to access funds for months, and in some cases, over two years, leading many to abandon the platform. Compounding the issue are complaints made on X about the difficulty of reaching a human customer service representative to resolve matters. The situation is a stark reminder of the inherent risks associated with custodial wallets, where a third party, like Coinbase, holds the user’s private keys and thus has ultimate control over their funds. Given these challenges, the principle of ‘not your keys, not your crypto’ has never been more relevant. The only way to guarantee immunity from third-party freezes, breaches, or restrictions is by using a non-custodial wallet like Best Wallet, where you retain complete control of your private keys and digital assets. Best Wallet: Security You Control, Freedom You Deserve If you’re looking to escape these custodial risks, Best Wallet offers a powerful solution built on the principle of true ownership. As a leading non-custodial wallet, it ensures your private keys are stored directly on your device, not a central server. This eliminates the risk of a third party freezing your account, as users have experienced with Coinbase. Beyond its security, Best Wallet is a feature-rich powerhouse. You can seamlessly manage a diverse portfolio with its multi-chain support and display your prized digital collectibles in the integrated NFT gallery. Forget complex exchanges; the built-in swap feature allows you to trade assets instantly and securely right within the wallet. With Best Wallet, you are your own bank, empowered with true financial sovereignty and the cutting-edge tools to navigate the world of digital assets. It’s more than just security; it’s the freedom to manage, trade, and display your entire portfolio on your terms. Best Wallet Token ($BEST): Rewarding Your Financial Freedom At the heart of this user-centric ecosystem is the Best Wallet Token ($BEST), a key that unlocks the ecosystem’s full potential. $BEST is more than just a digital asset; it’s a utility token designed to reward its holders. By owning $BEST, you unlock instant access to premium features and valuable financial benefits within the Best Wallet ecosystem. Enjoy significantly reduced fees on in-app swaps and transactions, maximizing the value of every trade. $BEST is also your ticket to higher yields, granting you access to boosted staking rewards on various assets. One of the most appealing benefits of holding $BEST is its early access to the best new crypto presale tokens from up-and-coming projects, allowing you to invest before they hit the market. Beyond personal gain, holding $BEST gives you a voice. It grants you governance rights, allowing you to vote on key proposals and help shape the future development of the Best Wallet platform. $BEST is available in presale for $0.025155, but we predict it could reach $0.035215 by the end of 2025, an impressive 39.99% gain if you invest now. $BEST isn’t just an asset; it’s your all-access pass to a more powerful, rewarding, and community-driven crypto experience. Ready to join? Our step-by-step guide on how to buy Best Wallet Token will walk you through the process. As non-custodial wallets like Best Wallet and its native token $BEST could unlock many impressive features and overcome issues that custodial wallets face, you must remember to research before making any investments."
    },
    {
      "title": "TrueNorth Pioneers AI Investing in Angel Round: Snorter Token Trading Bot to Explode?",
      "link": "https://www.newsbtc.com/news/truenorth-pioneers-ai-investing-angel-round-snorter-token-trading-bot-explode/",
      "summary": "Many crypto traders still manually wade through hundreds of token profiles, candlestick charts, and market cap pages each day. Sure, everyone has their favorite analytics website and their tried-and-tested metrics to simplify their work. But it’s still a lot of data for any individual investor to parse. Fortunately, trading could soon be changing. Imagine: Personalized search engines to find and highlight tokens with trading patterns that perfectly fit your preferred strategies, Bots to crawl specific platforms and detect emerging 5x, 10x, and 100x opportunities, Automated trading with built-in risk management. This is the new era of crypto trading, led by projects like TrueNorth and the Snorter Bot, which promise a streamlined approach that could revolutionize the crypto landscape. TrueNorth Announces Crypto-AI Discovery Engine Still spending ages looking around for the best crypto fits for your investment strategy? What if AI could do that for you? TrueNorth is pioneering so-called ‘agentic workflows for AI-native investing,’ a solution to harness AI’s power for market research, insights, and strategizing. An early group of 500 beta investors – dubbed ‘Truthsayers’ – are already testing this new technology. The Singapore-based company just launched an angel round to kick-start its early growth, raising $1M for advanced testing in the process. Once the project goes live, it will bring high-level trading strategies and advanced analytics to crypto traders of all levels. In fact, by combining the AI agent with reinforcement learning and a generative UI/UX, TrueNorth wants to deliver not just an AI trading tool, but a fully fledged AI assistant. It&#8217;s an attempt to create a hyper-personal trading AI that thinks and trades like you do, vastly expanding any individual trader&#8217;s toolbox. And TrueNorth isn’t the only one trying to bring crypto trading to the masses. Snorter Token ($SNORT): Sniff Out 100x Meme Coins with Snorter Bot Thousands of meme coins launch on Solana every day – and some of the big winners won’t ever make it to your local CEX. This is where projects like $SNORT come in. The Snorter Token ($SNORT) powers the Telegram-based Snorter Bot, an advanced crypto trading algorithm designed to find the best meme coin opportunities in real-time. The Snorter Bot then lets you bag and profit off of these opportunities through features like: Automatic sniping through sub-second swaps, Stop loss/take profit orders, Honeypot detection, Rugpull detection, Copy trading. Speed and automation tools like sniping and limit orders protect your investment strategy. Avoiding honeypots (scam tokens that can’t be sold) and rugpulls (tokens held by a small number of investors and dumped on the market) is critical to staying safe when looking for new low-cap coins. Beyond Solana, the Snorter trading bot will soon expand to cover several other chains, including Ethereum, BNB, Polygon, and Base. The $SNORT token will give you exclusive access to this bot. You can also currently stake the coin for 504% dynamic APY. You can read more about the staking and claiming processes in the Snorter Token whitepaper. $SNORT tokens currently cost $0.0949, and the presale has raised more than $628K in a few weeks. Visit the official Snorter Token presale page. AI, Bots, and Crypto – A New Trading Future? The future of crypto trading doesn’t have to be manual, tedious, and boring. Rather than delving deep into endless charts and metrics, TrueNorth lets you leverage AI analysis to automatically guide your investment strategy. And in the wild and woolly world of crypto meme coins, Snorter Bot will sniff out under-the-radar cryptos with 1000x potential, supercharging your meme coin portfolio while filtering out scams. This isn’t financial advice – crypto is always volatile, so do your own research."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "BitMine Immersion Technologies Buys 100 Bitcoin in First Treasury Acquisition",
      "link": "https://bitcoinmagazine.com/news/bitmine-immersion-technologies-buys-100-bitcoin-in-first-treasury-acquisition",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitmine-Accumulates-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitmine-immersion-technologies-buys-100-bitcoin-in-first-treasury-acquisition\" rel=\"nofollow\"> </a></p> <p>BitMine Immersion Technologies, Inc., a Bitcoin focused technology company, has taken its first step into treasury accumulation with the open market purchase of 100 Bitcoin. The acquisition marks the launch of BitMine’s formal Bitcoin Treasury business. The 100 BTC were purchased using funds raised through BitMine’s recent public stock offering, which closed on June 6, [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Technology Joins Bitcoin for Corporations, Increases Holdings to 920 BTC",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-joins-bitcoin-for-corporations-increases-holdings-to-920-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Joins-Bitcoin-for-Corporations-Increases-Holdings-to-920-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-joins-bitcoin-for-corporations-increases-holdings-to-920-btc\" rel=\"nofollow\"> </a></p> <p>KULR Technology announced today that it has joined the Bitcoin for Corporations initiative and its recent purchase of $13 million more Bitcoin.</p> <p>"
    },
    {
      "title": "Strategy Buys $110 Million Worth of Bitcoin",
      "link": "https://bitcoinmagazine.com/news/strategy-buys-110-million-worth-of-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/02/Michael-Saylor-Signals-Strategys-Next-Bitcoin-Buy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/strategy-buys-110-million-worth-of-bitcoin\" rel=\"nofollow\"> </a></p> <p> </p> <p>"
    },
    {
      "title": "The Blockchain Group Accelerates Bitcoin Treasury Strategy with €300M Raise",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-accelerates-bitcoin-treasury-strategy-with-e300m-raise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Blockchain-Group-Launches-E300M-ATM-Type-Program-to-Accelerate-its-Bitcoin-Treasury.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-accelerates-bitcoin-treasury-strategy-with-e300m-raise\" rel=\"nofollow\"> </a></p> <p>The Blockchain Group launches €300M ATM raise with TOBAM to scale its Bitcoin treasury—aimed at increasing BTC per share over time.</p> <p>"
    },
    {
      "title": "Bitcoin 2025 Las Vegas: Here’s What Went Down",
      "link": "https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-2025_ig.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-2025-las-vegas-heres-what-went-down\" rel=\"nofollow\"> </a></p> <p>My name is Jenna Montgomery, and maybe you’ve read some of my news articles here before, or seen me on the TikTok. But today, I wanted to switch it up and give you an inside look at the Bitcoin 2025 Conference in Las Vegas through my eyes as an intern, hired just one [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "BTC edges Higher, Plasma ICO today, Inflation Data this week",
      "link": "https://decrypt.co/videos/interviews/5r1bL3Cx/btc-edges-higher-plasma-ico-today-inflation-data-this-week",
      "summary": "FOMO HOUR EP374 BTC: 107.7k (+3%), ETH: 2540 (+2%), SOL: 155 (+5%). Top Gainers: ICP, SPX, FARTCOIN, VIRTUAL, BONK. BTC ETFs: -$48mn, ETH ETFs: +$25mn. BTC edges higher, dominance rises to 65%. ETH ETFs on 15 day inflow streak. Plasma ICO today, expecting to raise $50m. Deutsche Bank considers issuing stablecoin. UK FCA to lift crypto ETN ban for retail. Strategy raises $980m in equity sale. Saylor dismisses Bitcoin Quantum Fears. Blockchain Group to raise $340m to buy BTC. Apple & Google consider integrating stablecoins. BTC is a proven store of value: Uber CEO. Nasdaq expands crypto benchmark to 9 assets. Gemini files for IPO. X collabs with Polymarket for prediction markets. Cetus protocol relaunches on SUI. Dubai records $399m tokenized RE sales in May. FOMO HOUR brings you the biggest daily news, updates and events from inside and outside of the crypto and macro spheres! Join hosts Farokh, Mando and Tyler as they cover some of the biggest topics at present with some of the biggest names in the ecosystem. Streaming live 5 days per week, Monday to Friday 10:00 AM EST to 11:00 AM EST on YouTube and X. JOIN YEET = https://yeet.com/register?aff=fomohour PLAYLIST = https://www.youtube.com/playlist?list=PLGSgoImPFTiVpkHhLXF78cE_Z3uG7VNGL PODCAST = https://x.com/i/spaces/1kvKpydgqMQGE LIVE SPACE = https://x.com/i/spaces/1ynJOlOgYAQxR Links: https://linktr.ee/fomohour https://twitter.com/fomohour https://www.rug.fm/ https://x.com/rugradio Hosts: https://twitter.com/farokh https://twitter.com/rektmando https://twitter.com/tyler_did_it Myriad: https://myriad.markets https://x.com/MyriadMarkets #bitcoin #crypto #podcast"
    },
    {
      "title": "Avalanche Meme Coin Trenches Heat Up as AVAX Lambo Token Touches $25 Million",
      "link": "https://decrypt.co/324194/avalanche-meme-coin-trenches",
      "summary": "Traders have bridged to Avalanche to start trading meme coins, as SocialFi app The Arena sees activity explode."
    },
    {
      "title": "Strategy Buys $110 Million in Bitcoin as BTC Holdings Near $63 Billion",
      "link": "https://decrypt.co/324193/strategy-buys-110-million-in-bitcoin-as-btc-holdings-near-63-billion",
      "summary": "The Tysons Corner, Virginia-based firm announced a Bitcoin purchase for the ninth week in a row."
    },
    {
      "title": "Ethereum ETFs Have Seen 15 Straight Days of Green—Here's Why",
      "link": "https://decrypt.co/324191/ethereum-etfs-15-days-green-heres-why",
      "summary": "Ethereum ETFs notch 15-day winning streak with $837M inflows as institutional investors shift focus from speculative Bitcoin to ETH infrastructure."
    },
    {
      "title": "Australia Charges Four Over $123M Crypto Money Laundering Ring",
      "link": "https://decrypt.co/324182/australia-charges-four-over-123m-crypto-money-laundering-ring",
      "summary": "Crypto, cash, and property were seized after raids on a Gold Coast firm accused of running a laundering network via fake businesses."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Tether to open-source Bitcoin Mining Operating System to empower small, mid-sized miners, says Paolo Ardoino",
      "link": "https://cryptobriefing.com/tether-bitcoin-mining-open-source/",
      "summary": "<p>Tether's open-source MOS could democratize Bitcoin mining, enhancing decentralization and security while enabling smaller players to compete.</p> <p>"
    },
    {
      "title": "Bitcoin rises as key US-China trade talks commence in London",
      "link": "https://cryptobriefing.com/bitcoin-market-reaction-us-china-trade/",
      "summary": "<p>Bitcoin's rebound highlights its sensitivity to geopolitical events, underscoring its potential as a barometer for global economic tensions.</p> <p>"
    },
    {
      "title": "Circle rejected Ripple’s $5 billion buyout — now valued at over $20 billion after NYSE debut",
      "link": "https://cryptobriefing.com/circles-21-billion-valuation/",
      "summary": "<p>Circle's successful IPO highlights the growing legitimacy of stablecoins, potentially accelerating regulatory clarity and institutional adoption.</p> <p>"
    },
    {
      "title": "VanEck, 21Shares, and Canary urge SEC to revert to ‘first to file, first to approve’ standard for crypto ETFs",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec-standard/",
      "summary": "<p>The shift from a \"first-to-file\" to simultaneous approval for crypto ETFs may hinder innovation and favor larger firms, impacting market fairness.</p> <p>"
    },
    {
      "title": "Best way of staking USDT in 2025: Loopring AI-powered staking platform",
      "link": "https://cryptobriefing.com/ai-powered-staking-usdt-loopring/",
      "summary": "<p>Loopring's AI-powered staking platform offers up to 20% daily on USDT, leveraging AI &#38; Ethereum Layer 2 for optimal returns.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Why BlackRock’s move could bring Ethereum’s $3K price closer than ever!",
      "link": "https://ambcrypto.com/why-blackrocks-move-could-bring-ethereums-3k-price-closer-than-ever/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-8.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BlackRock is the prophet; is its $50 million buy the prophecy signaling Ethereum’s $3k destiny?"
    },
    {
      "title": "Could Bitcoin’s bull run be far from over? – Here’s what the charts say",
      "link": "https://ambcrypto.com/could-bitcoins-bull-run-be-far-from-over-heres-what-the-charts-say/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The 1000 period RSI could be one to watch, and can help mark the end of the Bitcoin bull run."
    },
    {
      "title": "Metaplanet’s stock pumps by 26% after revealing $5.4 billion Bitcoin buying plan",
      "link": "https://ambcrypto.com/metaplanets-stock-pumps-by-26-after-revealing-5-4-billion-bitcoin-buying-plan/",
      "summary": "<img alt=\"Metaplanet&#039;s stock pumps by 26% after revealing $5.4 billion Bitcoin buying plan\" class=\"attachment-full size-full wp-post-image\" height=\"669\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Metaplanet.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1190\" />Metaplanet has new plans for its BTC acquisition."
    },
    {
      "title": "FinCEN certified AIXA Miner machine leads the green cloud mining revolution!",
      "link": "https://ambcrypto.com/fincen-certified-aixa-miner-machine-leads-the-green-cloud-mining-revolution/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"553\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-09-190532.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"743\" />As the cryptocurrency market continues to heat up in 2025, AIXA Miner has completely changed [&#8230;]"
    },
    {
      "title": "Can Ethereum outpace Bitcoin in Q3? – THESE datasets say yes",
      "link": "https://ambcrypto.com/can-ethereum-outpace-bitcoin-in-q3-these-datasets-say-yes/",
      "summary": "<img alt=\"ethereum circle\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-4-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Around 60% of USDC's circulating supply rests in the Ethereum mainnet."
    }
  ]
}