{
  "CoinDesk": [
    {
      "title": "Bitcoin Trades Within Descending Channel as CME Gap Gets Filled",
      "link": "https://www.coindesk.com/markets/2025/07/02/bitcoin-trades-within-descending-channel-as-cme-gap-gets-filled",
      "summary": ""
    },
    {
      "title": "Instant Payments Fintech Ivy Adds Circle’s USDC, EURC Stablecoins",
      "link": "https://www.coindesk.com/business/2025/07/02/instant-payments-fintech-ivy-adds-circle-s-usdc-eurc-stablecoins",
      "summary": ""
    },
    {
      "title": "U.S. M2 Money Supply Hits Record High of Nearly $22T",
      "link": "https://www.coindesk.com/markets/2025/07/02/u-s-m2-money-supply-hits-record-high-of-nearly-usd22t",
      "summary": ""
    },
    {
      "title": "Crypto Lender Nexo Sponsors Europe's Premier Golf Tour for Eight-Figure Sum",
      "link": "https://www.coindesk.com/business/2025/07/02/crypto-lender-nexo-sponsors-europes-premier-golf-tour-for-eight-figure-sum",
      "summary": ""
    },
    {
      "title": "Public Companies Buy More Bitcoin Than ETFs for Third Consecutive Quarter",
      "link": "https://www.coindesk.com/markets/2025/07/02/public-companies-buy-more-bitcoin-than-etfs-for-third-consecutive-quarter",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "ECB to pilot blockchain-based euro settlement system by 2026",
      "link": "https://cointelegraph.com/news/ecb-launches-two-track-dlt-settlement-plan-2026?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWQ3NTMtOTQ1MC03OTRjLWFkNzktYWUyY2Y5N2NjZWM2.jpg\" /></p><p>The European Central Bank will launch a blockchain settlement pilot by late 2026 under its new “Pontes” initiative, aiming to connect DLT platforms with the eurozone’s core payment systems.</p>"
    },
    {
      "title": "Bybit, OKX expand crypto services in Europe under MiCA",
      "link": "https://cointelegraph.com/news/bybit-okx-launch-mica-compliant-crypto-platforms-europe?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2NhMTYtZThlMC03ZTliLWE4ZjgtNzI3MGFhYzIyYjM4.jpg\" /></p><p>Bybit and OKX have both launched MiCA-compliant crypto exchanges in the EU, marking a significant push into Europe’s newly unified regulatory landscape.</p>"
    },
    {
      "title": "Standard Chartered expects Bitcoin to hit new highs of $135K in Q3",
      "link": "https://cointelegraph.com/news/standard-chartered-bitcoin-price-135000-q3-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2IwNWMtZjhmMy03ZTk5LTg4NmItMjU3YTg2MmU2Yzcx.jpg\" /></p><p>The Bitcoin halving cycle is unlikely to hurt the BTC price in the second half of 2025 due to strong ETF and corporate buying, Standard Chartered forecasts.</p>"
    },
    {
      "title": "Bitcoin profit-taking makes $140K key BTC price point: Research",
      "link": "https://cointelegraph.com/news/bitcoin-profit-taking-makes-140k-key-btc-price-point-new-research?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2NhMzktZGFlNy03OTlkLTg2YzYtYWExYzdhYTlkYzEz.jpg\" /></p><p>Bitcoin realized profits this year have yet to match 2024 levels, and BTC price action would notionally need to rise 30% as a result, said research from CryptoQuant.</p>"
    },
    {
      "title": "Judge lets Celsius $4B Bitcoin lawsuit against Tether move forward",
      "link": "https://cointelegraph.com/news/celsius-tether-lawsuit-4b-bitcoin-sale?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWRiZDktNzcwZC03MWU1LTgzNGYtMTI4MTJmMjA2NjU0.jpg\" /></p><p>A US judge has allowed Celsius’s lawsuit over Tether’s $4 billion Bitcoin liquidation to move forward, rejecting key parts of Tether’s dismissal bid.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "XRP Ledger payment use surges 430% in 2 years, gains ground in DeFi and tokenization",
      "link": "https://cryptoslate.com/xrp-ledger-payment-usage-surges-430-in-2-years-gains-ground-in-defi-and-tokenization/",
      "summary": "<p>The XRP Ledger (XRPL) is entering a new growth phase, combining its legacy as a fast and efficient payment network with growing traction in decentralized finance and tokenization. According to data from Dune Analytics, weekly payment transactions have grown by more than 430% in under two years to over 8 million this year. These payments [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin realized market cap stacking shows silent strength beneath price action",
      "link": "https://cryptoslate.com/bitcoin-realized-market-cap-stacking-shows-silent-strength-beneath-price-action/",
      "summary": "<p>Bitcoin&#8217;s market cap reached a new all-time high in late May, touching $2.22 trillion before retreating to $2.13 trillion at the end of June. But while the headline price wavered, a closer look at Bitcoin&#8217;s full valuation stack reveals a much deeper and more resilient layer of capital inflows. Realized, delta, and thermo cap expanded [&#8230;]</p> <p>"
    },
    {
      "title": "Arizona governor vetoes bill for state-run digital assets reserve for third time",
      "link": "https://cryptoslate.com/arizona-governor-vetoes-bill-for-state-run-digital-assets-reserve-for-third-time/",
      "summary": "<p>Arizona Governor Katie Hobbs has vetoed a proposed law establishing a state-run Bitcoin and digital assets reserve fund. On July 1, Governor Hobbs informed House Speaker Steve Montenegro in a letter that she opposed House Bill 2324, which sought to establish a &#8220;Digital Assets Reserve Fund&#8221; funded by criminal asset forfeiture. In her veto letter, [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin holder unlocks $10 million from rare Casascius bar bought for $500",
      "link": "https://cryptoslate.com/bitcoin-holder-unlocks-10-million-from-rare-casascius-bar-bought-for-500/",
      "summary": "<p>A long-time Bitcoin holder has finally cracked open one of the rarest physical Bitcoin collectibles in existence—a Casascius bar loaded with 100 BTC. The collector, who goes by the name John Galt on the Bitcoin Talk forum, originally bought the bar in 2012 for just $500. 13 years later, he redeemed it when the top [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum dev Zack Cole launches initiative to fund ‘tokenless’ projects, promote ETH burning mechanisms",
      "link": "https://cryptoslate.com/ethereum-dev-zack-cole-launches-initiative-to-fund-tokenless-projects-promote-eth-burning-mechanisms/",
      "summary": "<p>Ethereum developer Zak Cole is spearheading a new initiative called the Ethereum Community Foundation (ECF), which will primarily work to enhance the digital asset&#8217;s economic value. The initiative was announced during the Ethereum Community Conference in Cannes, France. Founded by Cole and a group of ecosystem supporters, the ECF has reportedly already raised &#8220;millions&#8221; and [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Seasonality: Why Summer 2025 Will Catch Everyone Off Guard",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-seasonality-summer-2025/",
      "summary": "A growing number of Bitcoin and crypto market participants have fallen victim to a dangerous assumption: that summer in the crypto markets is synonymous with stagnation. However, crypto analyst Cristian Chifoi warns that this summer may follow a drastically different script. In a video analysis released on July 1, Chifoi lays out a compelling case that 2025 fits a historical pattern that has previously delivered some of Bitcoin’s strongest summer performances. Summer 2025 Could Flip Bitcoin’s Script Chifoi’s thesis is based on a concept he has long explored: Bitcoin seasonality—a recurring, cyclical behavior in Bitcoin’s price action across the calendar year, especially in relation to the four-year halving cycles. According to Chifoi, there is an identifiable seasonal window from mid-January to mid-March where Bitcoin historically shows explosive movement in one direction, only to reverse course in the subsequent months. Related Reading: Bitwise Just Sounded The Alarm—Bitcoin Could Explode Soon This pattern has held across multiple years and cycles. In 2021, for example, Bitcoin rallied from $28,000 to $60,000 between January and March before collapsing back to $28,000 by summer. The opposite occurred in 2023, when Bitcoin dumped in Q1 and reversed upwards during summer. “From January 22nd to March 11th [2024], we had a 2x on Bitcoin,” Chifoi noted. “And if the price moves in one direction in this window, it tends to do the exact opposite after that. That’s the seasonality reversal.” Chifoi highlighted this tendency across previous cycles as well, identifying the same trend flip in 2022, 2023, and most notably in 2021. Critically, Chifoi warns that while most traders are anchored to the recent past—recalling three consecutive “boring” summers—this year is historically aligned with a different kind of setup. “Nobody is prepared for this summer,” he said. “Because people only look at the past three years. But those were not the years to look at.” Instead, Chifoi compares 2025 to three historical analogues: 2013, 2017, and 2021—all years that followed a halving and saw significant summer rallies. In each of those years, after early-year volatility or corrections, Bitcoin posted dramatic gains from mid-July into early September. In 2017, Bitcoin rallied 160% in that timeframe. In 2021, the move was 77%. “The common factor in those years? They were one year after a halving, with a post-March reversal in trend,” Chifoi explained. “Now we are in the same window again. And people are not looking at it.” First Crash, Then Surge? The analyst also emphasized that current price action fits his broader fractal thesis. After Bitcoin’s local top at $109K earlier this year and the rejection that followed, the market appears to be chopping sideways—something he predicted back in late 2024. He expects this phase to continue into July 20, potentially ending with a sudden flush to the downside. But this, he argues, would be the setup for the next leg higher. “Don’t be surprised if the drop comes with a lot of bad news,” he said. “Every time there’s a dump before a rally, the media has a narrative ready. That doesn’t mean it’s real. It just means the market is doing what it always does—shake out the majority.” Related Reading: Analyst Calls For Bitcoin Crash As Price Pulls Above $108,000 — Details Chifoi also addressed broader market confluences, notably pointing out similar behavior in the S&#38;P 500, where a corrective move in early July appears to align with his crypto timing model. He expects a pullback in both markets to precede the next upward thrust, targeting a Fibonacci resistance zone that historically acts as a pause point during price discovery. Despite his bullishness, Chifoi made it clear he’s not buying Bitcoin right now. “I already bought below $20K,” he said. “At this point, I’m watching altcoin charts, looking for pullbacks to accumulate.” He expressed frustration at the prevailing narratives circulating among large X accounts, particularly those pushing for rotating altcoins into Bitcoin under the assumption that dominance will rise indefinitely. “This is very stupid,” he said bluntly. “The market is behaving exactly as it should—for the fewest number of people to make money.” In closing, Chifoi cautioned that those who insist on saying this time is different will likely find themselves on the wrong side of the trade. “Only if this time is different will this not play out. But if you base your strategy on those words, I can guarantee you 99% of the time, you won’t make money.” As the July 20 pivot approaches, Chifoi’s analysis suggests that Bitcoin’s next move may catch a complacent market off guard. Whether or not history rhymes once more, the veteran analyst has made his stance clear: this is not a summer to sleep through. At press time, BTC traded at $106,880. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Crypto Startups Raise $1.15B Last Month: Will Crypto ICOs like $BTCBULL Take Off Next?",
      "link": "https://www.newsbtc.com/news/crypto-startups-raise-1-15b-last-month-will-crypto-icos-like-btcbull-take-off-next/",
      "summary": "June was a strong month for the crypto and Web3 sectors, with related startups successfully raising a collective $1.15B across 140 deals. This represents a 3% increase in raised capital and a 9% increase in the number of deals compared to May, according to crypto market intelligence firm, Messari. The upward trend highlights growing confidence among angel investors in the potential of decentralized technologies. Big winners this round include Kalshi, a predictions market, which secured an $185M round, and Digital Asset, which raised $135M to develop its Canton blockchain. Private token sales also saw a resurgence, with World Liberty Finance bringing in $100M and Eigen Labs securing $70M. These figures paint a vibrant and expanding picture of growth and innovation within the crypto industry. Key Innovations Driving Investor Confidence Diving beyond the figures, the nature of the startups points to a focus on innovative and foundational technologies. Crypto startup, Zama FHE, for example, successfully closed a $57M Series B round, achieving a $1B valuation for its fully homomorphic encryption (FHE) technology. Investments in privacy solutions show a growing recognition of the importance of secure and scalable infrastructure for the future of Web3. Increasing deal counts and interest in core technological advancements are strong signals of the health and growth of blockchain and Web3 applications. Investors seek opportunities that align with market trends and demonstrate innovation and institutional confidence. Enter BTCBULL Token ($BTCBULL), a crypto ICO that offers direct pathways to capitalize on the market&#8217;s upward trajectory, making it one of the best crypto presales of 2025. Harnessing Bitcoin’s Momentum with BTCBULL Token ($BTCBULL) As the crypto landscape evolves, new low-cap projects emerge that leverage the strength of established assets. Among these, BTCBULL Token ($BTCBULL) provides a new and low-cost way for retail investors to capitalize on Bitcoin’s ascent. Just days from the end of its presale, $BTCBULL tracks and benefits from Bitcoin’s price movements, letting holders participate in the market’s bullish cycles. It’s built on the Ethereum blockchain, giving investors broad compatibility and accessibility, and leans into a bullish character, taking charge, helping $BTC reach $1M. Diverse Pathways to $BTC-Backed Returns Investing in $BTCBULL offers benefits beyond token appreciation. The biggest is the Bitcoin airdrops. As Bitcoin reaches significant price milestones ($150K and £200K), $BTCBULL holders who use Best Wallet (one of the leading non-custodial crypto wallets) can receive actual $BTC directly into their wallets. If that wasn’t enough, $BTCBULL has a deflationary model implemented through milestone token burns. At specific $BTC price thresholds, a portion of the $BTCBULL supply is permanently removed from circulation, aiming to increase scarcity and potentially the value of the remaining tokens. If you&#8217;re looking for a passive-income vehicle, the $BTCBULL presale offers attractive staking rewards with competitive APYs available (currently 52%). However, you need to get in fast, as the presale ends on July 7. Looking ahead, the multi-faceted rewards system should incentivize long-term holding and engagement. If you buy $BTCBULL today for $0.002585, you could see a return of 2401% if it reaches our end-of-2025 price prediction of $0.06467. Seize the Market by the Horns June’s crypto start-up funding figures and the continued push towards innovation paint a positive picture for the crypto market. For the savvy investor, picking projects like BTCBULL Token ($BTCBULL) to leverage the market’s movements could be a smart move. Just be sure to act fast, as the presale is moments from closing, and with it, your chances of securing that free $BTC. Remember, this is not financial advice, and you should do your own research before making any investment decisions."
    },
    {
      "title": "Expert Explains Why Bitcoin Remains Stuck Below $120,000 Despite Wall Street’s Billions",
      "link": "https://www.newsbtc.com/bitcoin-news/expert-explains-why-bitcoin-remains-stuck-below-120000-despite-wall-streets-billions/",
      "summary": "As Bitcoin (BTC) experiences another dip, falling 5% below its record high of $111,800 reached during May’s crypto rally, analysts are probing the reasons behind its stagnation in the $100,000 to $110,000 range. In a recent post on X (formerly Twitter), crypto analyst DanteX outlined the factors contributing to this price resistance and what it could mean for the remainder of 2025. What’s Holding Bitcoin Back? Despite the substantial influx of nearly $5 billion in Bitcoin acquired through exchange-traded funds (ETFs) in just a few weeks, the price of Bitcoin has failed to surpass the $120,000 target identified by analysts. Public companies, Strategy and GameStop, have joined the ranks of institutional buyers, marking a significant shift in corporate interest toward Bitcoin. This growing demand indicates that there are substantial buyers ready to purchase at prices above $100,000. Related Reading: BitMine Stock Soars 700% After $250 Million Raise For Ethereum Treasury However, DanteX asserts that the market has been characterized by an unusual phenomenon: the analyst alleges that someone appears to be “strategically offloading” Bitcoin in the $100,000 to $110,000 range, effectively absorbing the demand and preventing upward movement. This selling pressure seems to come from a major player—reportedly hedge funds or early investors—actively liquidating positions to offset the inflow of institutional capital. Market Exhaustion Or Distribution? As the market enters the latter half of summer, a historically weak period for cryptocurrencies, concerns arise about liquidity and retail interest. DanteX noted that if the Bitcoin price cannot rally now, amid significant buying and market enthusiasm, the outlook may dim as trading volumes decline. The analyst further shared that the current price stagnation at near-record highs often indicates either market exhaustion or a distribution phase, suggesting that while demand exists, it is being countered by strategic selling. Despite the overall positive macroeconomic environment—where stock markets are soaring, real yields are declining, and liquidity is increasing—DanteX highlights that the Bitcoin price remains unresponsive. The analyst stated that it could imply that current holders may not be ready for a breakout or are intentionally limiting potential gains. Interestingly, when Bitcoin price movements stall, capital tends to flow into altcoins, which are often viewed as higher-risk, higher-reward investments. DanteX believes that the current skepticism surrounding the likelihood of an altcoin season amid the current market condition, could actually set the stage for one, as many investors remain “under-positioned.” Record ETF Inflows Fail To Translate Into Price Gains The role of ETFs cannot be overlooked, DanteX further said. He said that while record inflows into ETFs signal strong institutional interest, they do not always correlate with immediate price increases, especially when met with significant selling pressure. DanteX notes that much of the exchange-traded fund exposure may be hedged or arbitraged, resulting in a complex market dynamic where asset growth does not immediately reflect in Bitcoin&#8217;s spot price. Related Reading: Bitcoin Shopping Spree: Strategy Continues Accumulation With $530M Purchase Looking ahead, the analyst suggests monitoring the activity of large wallets, especially those exhibiting selling patterns that align with recent price suppression. Watching macroeconomic indicators, such as potential Federal Reserve rate cuts or shifts in the value of the dollar, is also said to be crucial as these factors could influence market sentiment. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Altcoin Season Starting Soon? Analyst Predicts 37% Crash In Bitcoin Dominance",
      "link": "https://www.newsbtc.com/altcoin/altcoin-season-bitcoin/",
      "summary": "The Bitcoin dominance remaining on the high side has been one of the major hindrances for the altcoin season. Going by past performances, the Bitcoin dominance would have to crash for altcoins to have a chance to rally, but with the dominance still climbing, the chances of an altcoin season remain slim. As this trend continues, a crypto analyst has predicted a possible turn in the tide for the Bitcoin dominance, predicting a crash that could give altcoins a chance. Bitcoin Dominance Rejection From Trendline Is Key Over the years, the Bitcoin dominance has been following a trendline that has often marked the point of resistance. This trendline rises from 2017 and has sloped down past 2021 and now into the year 2025. The significance behind this is the breakdown from the trendline and the Bitcoin dominance receding sharply from here. Related Reading: Pundit Warns Bitcoin Is Setting Up Liquidity Traps As It Campaigns For New ATHs Presently, the Bitcoin dominance is still sitting high above 65% at the time of this writing, but this recent rise has seen it touch the resistance trendline. According to crypto analyst CoreCrypto, this is a critical inflection point, especially on the weekly chart. More importantly, this is usually the point where dominance recedes, giving rise to altcoin dominance. Some major developments that the analyst tells investors to watch on the dominance chart include a rejection from the resistance trendline, where the dominance currently lies above 65%. There is also support for the dominance, as shown by the yellow line in the chart below. A break below this support is critical for the fall in the dominance. Another development to watch out for is for rising Ethereum strength. In the past, the Ethereum price starting to outperform the Bitcoin price has often signaled the start of the altcoin season. So, as the ETHBTC chart begins to strengthen and Bitcoin succumbs to sideways movement, it opens the door for altcoins to rally into the next altcoin season. Related Reading: Bitcoin Price At $145,000 In September? Bullish Dojis Suggest Upward Move In the event of a break from the resistance trendline, the analyst sees the possibility of a sharp decline. CoreCrypto predicts a 36.91% drop to the 42%-45% levels. This is lower compared to previous altcoin seasons, but follows the declining trend of a 50.79% drop in 2017 compared to a 45.10% drop in 2021. “If BTC.D gets rejected from this resistance again, it could mark the start of the long-awaited Altseason 2025,” the crypto analyst explained. “A breakdown from this wedge would likely result in capital rotation from BTC into altcoins — just like in previous cycles.” Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana (SOL) at Crossroads — Bounce Likely If $142 Remains Intact",
      "link": "https://www.newsbtc.com/analysis/solana-sol-at-crossroads-142/",
      "summary": "Solana started a fresh decline and retested the $145 support zone. SOL price is now recovering and might aim for a fresh increase above the $150 zone. SOL price started a fresh decline after it failed to clear $160 against the US Dollar. The price is now trading below $150 and the 100-hourly simple moving average. There was a break above a key bearish trend line with resistance at $147 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could start a fresh increase if it clears the $152 resistance zone. Solana Price Trims Gains Solana price struggled to continue higher above $160 and started a fresh decline, like Bitcoin and Ethereum. SOL declined below the $155 and $152 support levels. It even dipped below $150 and tested the $145 zone. A low was formed at $144 and the price is now correcting some losses. There was a move above the 23.6% Fib retracement level of the downward move from the $160 swing high to the $144 low. Besides, there was a break above a key bearish trend line with resistance at $147 on the hourly chart of the SOL/USD pair. Solana is now trading below $150 and the 100-hourly simple moving average. On the upside, the price is facing resistance near the $150 level. The next major resistance is near the $152 level. It is close to the 50% Fib retracement level of the downward move from the $160 swing high to the $144 low. The main resistance could be $155. A successful close above the $155 resistance zone could set the pace for another steady increase. The next key resistance is $160. Any more gains might send the price toward the $165 level. Another Decline in SOL? If SOL fails to rise above the $150 resistance, it could start another decline. Initial support on the downside is near the $145 zone. The first major support is near the $142 level. A break below the $142 level might send the price toward the $136 zone. If there is a close below the $136 support, the price could decline toward the $125 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bearish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $145 and $142. Major Resistance Levels – $152 and $155."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Wallet of Satoshi Partners With Spark To Offer Self-Custodial Bitcoin Lightning Experience",
      "link": "https://bitcoinmagazine.com/news/wallet-of-satoshi-partners-with-spark-to-offer-self-custodial-bitcoin-lightning-experience",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Wallet-of-Satoshi-Partners-With-Spark-To-Offer-Self-Custodial-Bitcoin-Lightning-Experience.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/wallet-of-satoshi-partners-with-spark-to-offer-self-custodial-bitcoin-lightning-experience\" rel=\"nofollow\"> </a></p> <p>Wallet of Satoshi will be in a beta version, bringing self-custody lightning wallets to Spark platform.</p> <p>"
    },
    {
      "title": "Figma Reveals $70M Bitcoin ETF Holdings, Plans to Buy $30M More",
      "link": "https://bitcoinmagazine.com/news/figma-reveals-70m-bitcoin-etf-holdings-plans-to-buy-30m-more",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Figma-Reveals-70M-Bitcoin-ETF-Holdings-Plans-to-Buy-30M-More.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/figma-reveals-70m-bitcoin-etf-holdings-plans-to-buy-30m-more\" rel=\"nofollow\"> </a></p> <p>The design software company invested $55M in a Bitwise Bitcoin ETF and got board approval to convert $30M USDC into Bitcoin.</p> <p>"
    },
    {
      "title": "DDC Enterprise Finalizes $528 Million Financing to Accelerate Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/DDC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DDC Enterprise Limited (NYSE: DDC) has officially closed its $528 million financing deal to expand its corporate Bitcoin strategy. The funding, led by Anson Funds with participation from Animoca Brands, Kenetic Capital, and others, is one of the largest Bitcoin-focused capital raises by a NYSE-listed company.&#160; “This maximum aggregate $528 million capital commitment marks a [&#8230;]</p> <p>"
    },
    {
      "title": "Eric Trump’s American Bitcoin Raises $220 Million in Private Stock Sale To Buy More BTC",
      "link": "https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Gryphon-to-Merge-with-Eric-Trumps-American-Bitcoin-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc\" rel=\"nofollow\"> </a></p> <p>The Hut 8 sold over 11 million shares to investors, securing $215 million in net proceeds to expand its Bitcoin holdings and mining operations.</p> <p>"
    },
    {
      "title": "The One Big Beautiful Act Passes in the U.S. Senate — Without Bitcoin Tax Amendment",
      "link": "https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/One-Big-Beautiful-Act-Bitcoin-Magazine.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment\" rel=\"nofollow\"> </a></p> <p>Despite a push from Senator Cynthia Lummis (R-WY), an amendment regarding de minimus capital gains exemption on crypto spending was not included in the version of the One Big Beautiful Act that passed in the Senate.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin ETFs Shed $342 Million As 15-Day Streak Ends",
      "link": "https://decrypt.co/328161/bitcoin-etfs-shed-342-million-as-15-day-streak-ends",
      "summary": "With the Fed signaling it will maintain its restrictive monetary policy stance, investors are rethinking their exposure to Bitcoin ETFs."
    },
    {
      "title": "OFAC Sanctions Russian Hosting Provider for Enabling Crypto Theft",
      "link": "https://decrypt.co/328139/ofac-sanctions-russian-hosting-provider-crypto-theft",
      "summary": "The U.S. Treasury has targeted a Russian firm linked to ransomware, infostealers, and darknet drug markets involving crypto."
    },
    {
      "title": "Why On-Chain Metrics Miss the Full Picture of Institutional Bitcoin Buying",
      "link": "https://decrypt.co/328136/chain-metrics-miss-full-picture-institutional-bitcoin-buying",
      "summary": "Bitcoin hit a record monthly close in June, but experts say on-chain data is missing the scale of institutional demand via ETFs and OTC desks."
    },
    {
      "title": "Arizona Governor Yet Again Rejects Bitcoin Reserve Using Seized Crypto",
      "link": "https://decrypt.co/328133/arizona-governor-rejects-bitcoin-reserve-seized-crypto-again",
      "summary": "Mounting crypto-related vetoes point to the state's cautious approach, but a future governor could hold an opposing view, was told."
    },
    {
      "title": "Figma Eyes Further Bitcoin Exposure in Run-Up to Hopeful NYSE Debut",
      "link": "https://decrypt.co/328130/figma-bitcoin-exposure-nyse-debut",
      "summary": "Figma’s $69.5 million Bitcoin ETF holding now accounts for 4.5% of its cash and securities portfolio, the company revealed Tuesday."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Arizona governor rejects Bitcoin reserve bill HB 2324, says it hurts asset forfeiture cooperation",
      "link": "https://cryptobriefing.com/arizona-bitcoin-reserve-bill-veto/",
      "summary": "<p>The veto highlights ongoing tensions between state innovation in digital finance and traditional law enforcement funding priorities.</p> <p>"
    },
    {
      "title": "Kraken elected as Super Representative on the TRON network",
      "link": "https://cryptobriefing.com/tron-super-representative-kraken-election/",
      "summary": "<p>Kraken's role as a Super Representative on TRON enhances network security and efficiency, boosting institutional trust and blockchain adoption.</p> <p>"
    },
    {
      "title": "Figma IPO filing shows $70M in BTC ETFs, gets board nod for $30M more",
      "link": "https://cryptobriefing.com/bitcoin-corporate-treasury-figma/",
      "summary": "<p>Figma's S-1 reveals $70M in Bitcoin ETFs and board approval for $30M BTC via USDC, highlighting its Bitcoin corporate treasury strategy.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus inks $100M funding deal with Ripple Strategy Holdings to support XRP reserve strategy, stock jumps 130% intraday",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy-funding/",
      "summary": "<p>Webus' strategic funding deal could enhance its market position in crypto mobility, potentially influencing blockchain adoption in related sectors.</p> <p>"
    },
    {
      "title": "SEC approves Grayscale’s proposal to convert BTC, ETH, XRP, ADA large-cap fund into a spot ETF",
      "link": "https://cryptobriefing.com/crypto-spot-etf-sec-approval/",
      "summary": "<p>The SEC's approval signals growing acceptance of crypto assets in traditional finance, potentially boosting market legitimacy and investor access.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "FARTCOIN loses $8.4 mln to whale exits – Can buyers hold on to the $1 support?",
      "link": "https://ambcrypto.com/fartcoin-loses-8-4-mln-to-whale-exits-can-buyers-hold-on-to-the-1-support/",
      "summary": "<img alt=\"FARTCOIN loses $8.4 mln to whale exits - Can buyers hold on to the $1 support?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-23.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With whales gone and retail spooked, who’s still left to buy the dip?"
    },
    {
      "title": "Bitcoin’s historic July strength meets its biggest test in 3 years",
      "link": "https://ambcrypto.com/bitcoins-historic-july-strength-meets-its-biggest-test-in-3-years/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin’s July hike: One last push or the start of descent?"
    },
    {
      "title": "BCH outperforms BTC: Can Bitcoin Cash continue its bull run beyond $600?",
      "link": "https://ambcrypto.com/bch-outperforms-btc-can-bitcoin-cash-continue-its-bull-run-beyond-600/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-Cash-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BCH broke $448, then charged up. With $600 in sight, will resistance fold or fight back?"
    },
    {
      "title": "SPX6900 crashes 10% as buyers vanish, but a breakout can still happen IF…",
      "link": "https://ambcrypto.com/spx6900-crashes-10-as-buyers-vanish-but-a-breakout-can-still-happen-if/",
      "summary": "<img alt=\"SPX6900 crashes 10% as buyers vanish, but a breakout can still happen IF...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250701_153547_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will spot buyers step in again near the $1.08 level?"
    },
    {
      "title": "Michael Saylor’s Strategy adds $531 mln BTC – Why Bitcoin barely moved",
      "link": "https://ambcrypto.com/michael-saylors-strategy-adds-531-mln-btc-why-bitcoin-barely-moved/",
      "summary": "<img alt=\"Michael Saylor&#039;s Strategy adds $531 mln BTC - Why Bitcoin barely moved\" class=\"attachment-full size-full wp-post-image\" height=\"713\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/MichaelSaylor.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1267\" />Is Bitcoin losing its sensitivity to big buys like Strategy?"
    }
  ]
}