{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Analysts Say BTC’s Long-Term Focus Is Easing War Jitters",
      "link": "https://www.coindesk.com/markets/2025/06/24/asia-morning-briefing-analysts-say-btcs-long-term-focus-is-easing-war-jitters",
      "summary": ""
    },
    {
      "title": "Hut 8 Doubles Bitcoin-Backed Loan With Coinbase to $130M, Locks in Lower Rate",
      "link": "https://www.coindesk.com/markets/2025/06/24/hut-8-doubles-bitcoin-backed-loan-with-coinbase-to-130m-locks-in-lower-rate",
      "summary": ""
    },
    {
      "title": "BCH Stumbles at $467 After Triple Rejection, Ends Slightly Down Despite High-Volume Rebound",
      "link": "https://www.coindesk.com/markets/2025/06/24/bch-stumbles-at-usd467-after-triple-rejection-ends-slightly-down-despite-high-volume-rebound",
      "summary": ""
    },
    {
      "title": "ZKsync’s Airbender zkVM Proves Ethereum Blocks in 35 Seconds",
      "link": "https://www.coindesk.com/tech/2025/06/24/zksyncs-airbender-zkvm-proves-ethereum-blocks-in-35-seconds",
      "summary": ""
    },
    {
      "title": "Chainlink's LINK Surges 13% as Mastercard Partnership Fuels Rally Amid Crypto Recovery",
      "link": "https://www.coindesk.com/markets/2025/06/24/chainlinks-link-surges-13-as-mastercard-partnership-fuels-rally-amid-crypto-recovery",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Anthony Pompliano’s crypto venture buys $386M in Bitcoin",
      "link": "https://cointelegraph.com/news/anthony-pompliano-crypto-venture-buys-386m-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY4YTUtMTU5YS03MDZiLTg5OGUtNjU1YzU3MjVkZDFj.jpg\" /></p><p>Anthony Pompliano’s crypto firm ProCap has purchased 3,724 Bitcoin after announcing a $1 billion plan to go public later this year.</p>"
    },
    {
      "title": "Norway deep-sea mining firm plans $1.2B Bitcoin buy",
      "link": "https://cointelegraph.com/news/norwegian-deep-sea-mining-firm-adopting-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E1MDYtZmYwMC03ODA5LThmYjUtMWJmZDI5ZTNkZjQy.jpg\" /></p><p>Green Minerals says it will raise $1.2 billion to buy Bitcoin and plans to adopt blockchain technology in areas such as supply chain transparency and operational efficiency.</p>"
    },
    {
      "title": "Polymarket set for $200M raise at $1B valuation: Reports",
      "link": "https://cointelegraph.com/news/polymarket-set-for-200m-raise-1b-valuation-reports?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E0ZTctNmU1Zi03MGFmLWEzYTktZjk5Mzg4ZmQzYWYx.jpg\" /></p><p>Betting platform Polymarket is reportedly set to be valued at $1 billion in a $200 million raise led by Peter Thiel’s Founders Fund.</p>"
    },
    {
      "title": "US crypto stocks surge amid fragile Iran-Israel ceasefire",
      "link": "https://cointelegraph.com/news/us-crypto-stocks-surge-donald-trump-iran-israel-ceasefire?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E0YmItMDhmNS03ZmE2LWI1YWYtNGY1OTA2MGQ4NmVm.jpg\" /></p><p>US crypto stocks surged on Tuesday amid a shaky Donald Trump-brokered ceasefire agreement between Iran and Israel.</p>"
    },
    {
      "title": "Coinbase claims ‘key role’ in Secret Service’s biggest-ever crypto seizure",
      "link": "https://cointelegraph.com/news/coinbase-key-role-secret-service-crypto-seizure?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5Mzc2MTYtNTdjYi03MjMyLWFkNTEtZGQ2MWQ1NWNmYzcy.jpg\" /></p><p>Coinbase says it helped the US Secret Service seize $225 million in crypto allegedly stolen by scammers, the largest crypto seizure in the agency’s history.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US academic institutions urge SEC to implement stringent crypto staking rules, oversight",
      "link": "https://cryptoslate.com/us-academic-institutions-urge-sec-to-implement-stringent-crypto-staking-rules-oversight/",
      "summary": "<p>Representatives from multiple universities met with the US Securities and Exchange Commission’s (SEC) Crypto Task Force on June 23 to discuss a staking rulebook. The meeting included representatives from the University of California, Berkeley School of Law, Georgetown University Law Center, the University of Chicago Law School, and venture firm Placeholder. According to the logs, [&#8230;]</p> <p>"
    },
    {
      "title": "Senate Banking Committee pushes for rapid legislative action on crypto market framework",
      "link": "https://cryptoslate.com/senate-banking-committee-pushes-for-rapid-legislative-action-on-crypto-market-framework/",
      "summary": "<p>The Senate Banking Committee released a seven-point framework for digital asset market structure and heard testimony urging Congress to translate those principles into statute without delay on June 23. Committee Chair Tim Scott and Senators Cynthia Lummis, Thom Tillis, and Bill Hagerty set out a plan that draws a statutory line between digital asset securities [&#8230;]</p> <p>"
    },
    {
      "title": "WazirX gains crucial extension to revive post-hack restructuring plan",
      "link": "https://cryptoslate.com/wazirx-gains-crucial-extension-to-revive-post-hack-restructuring-plan/",
      "summary": "<p>WazirX, once India’s largest crypto exchange by trading volume, has secured a crucial extension from Singapore’s High Court as it struggles to recover from a devastating $234 million hack and a year of growing user frustration. In a statement posted on social media, WazirX confirmed that the court will allow it to present new arguments [&#8230;]</p> <p>"
    },
    {
      "title": "Spot Ethereum ETFs record $1B inflows in 15 trading days, hitting $4B for the first time",
      "link": "https://cryptoslate.com/spot-ethereum-etfs-record-1b-inflows-in-15-trading-days-hitting-4b-for-the-first-time/",
      "summary": "<p>Spot Ethereum (ETH) exchange-traded funds (ETFs) listed in the US crossed $4 billion in cumulative net inflows on June 23, only eleven months after their market debut. The products launched on July 23, 2024, and required 216 US trading sessions to accumulate their first $3 billion by May 30. Following the $3 billion mark, spot [&#8230;]</p> <p>"
    },
    {
      "title": "Grayscale launches Space and Time Trust to capture surging interest in data infrastructure",
      "link": "https://cryptoslate.com/grayscale-launches-space-and-time-trust-to-capture-surging-interest-in-data-infrastructure/",
      "summary": "<p>Grayscale has unveiled a new single-asset investment vehicle centered on the Space and Time (SXT) token, according to a June 24 announcement. The fund, officially named the Space and Time Trust, offers accredited investors direct exposure to one of the crypto sector’s newest data infrastructure projects. Individual and institutional participants can subscribe to the Trust [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Tron’s 374% Profit-Taking Spree Uncovered—Here’s Who Was Behind It",
      "link": "https://www.newsbtc.com/news/tron-trx/trons-374-profit-taking-spree-who-was-behind-it/",
      "summary": "On-chain data shows Tron (TRX) observed a large profit-taking spike earlier in the month. Which type of holder was responsible for the move? Tron SOPR Saw A Huge Spike Earlier In The Month In a CryptoQuant Quicktake post, analyst Maartunn has talked about the recent trend in the Spent Output Profit Ratio (SOPR) of Tron. The SOPR refers to an on-chain indicator that tells us about whether the TRX investors are moving or selling their coins at a profit or loss. The indicator works by going through the transfer history of each coin being moved to see what price it was last transacted at. Coins that have this cost basis above the current spot price are contributing to loss realization, while those with the opposite setup to profit realization. Related Reading: Crypto Bears Rekt: $359M Gone As Bitcoin, Ethereum Rebound The SOPR takes the ratio between the spent value and cost basis, and sums it up for all coins being sold on the blockchain to find a net situation for the market as a whole. When the value of the indicator is greater than 1, it means the investors are, on average, realizing a profit through their transactions. On the other hand, the metric being under this threshold suggests the dominance of loss realization in the market. Now, here is the chart shared by the quant that shows the trend in the Tron SOPR over the past year: As displayed in the above graph, the Tron SOPR saw a huge spike above the 1 mark earlier in the month, implying investors took part in a significant amount of profit-taking. From the chart, it&#8217;s also visible that there were other profit realization spikes during the past year, but the current one stands out for its scale. The latest peak in the metric saw its value go to 4.74, corresponding to a profit margin of 374%. &#8220;With TRX priced at $0.268 at the time, the average acquisition price for those coins would have been around $0.0566,&#8221; explains Maartunn. Interestingly, Tron hasn&#8217;t seen extended periods around this price mark since late 2022, meaning that the tokens would have been held for a good while before being finally transacted this month. Usually, when dormant hands break their silence, it&#8217;s likely to be for selling-related purposes. That said, it&#8217;s not the only reason they may do so. &#8220;The activity could be tied to early investors realizing gains, internal transfers, or reallocation decisions,&#8221; notes the analyst. Related Reading: This Bitcoin Zone Could Be Market’s Next True ‘Pivot,’ Says Glassnode In some other news, the USDT supply on the Tron network has reached a new milestone, as institutional DeFi solutions provider Sentora (formerly IntoTheBlock) has pointed out in an X post. There is now over $80 billion in USDT supply circulating on Tron, the second-most out of any cryptocurrency network. TRX Price At the time of writing, Tron is trading around $0.273, up 0.5% over the last 24 hours. Featured image from Dall-E, IntoTheBlock.com, CryptoQuant.com, chart from TradingView.com"
    },
    {
      "title": "XRP Price Fails to Hold Above $2.20 — Is Support Building on Pullbacks?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-fails-to-hold-2-20/",
      "summary": "XRP price started a fresh increase from the $2.050 zone. The price is back above $2.10 and might struggle to continue higher above the $2.20 zone. XRP price started a fresh increase above the $2.120 zone. The price is now trading above $2.150 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2.080 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could continue to move up if it closes above the $2.20 resistance zone. XRP Price Faces Hurdles XRP price remained supported above the $2.00 zone and started a fresh increase, like Bitcoin and Ethereum. The price recovered above the $2.020 and $2.080 resistance levels. The pair even cleared the $2.150 resistance and spiked above the $2.20 barrier. However, the bears were active above the $2.20 zone. A high was formed at $2.215 and the price is now correcting some gains. There was a move below the $2.00 level, but the price is still above the 23.6% Fib retracement level of the upward move from the $1.910 swing low to the $2.2150 high. The price is now trading above $2.150 and the 100-hourly Simple Moving Average. Besides, there is a bullish trend line forming with support at $2.080 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.20 level. The first major resistance is near the $2.220 level. The next resistance is $2.250. A clear move above the $2.250 resistance might send the price toward the $2.320 resistance. Any more gains might send the price toward the $2.350 resistance or even $2.420 in the near term. The next major hurdle for the bulls might be $2.50. Another Drop? If XRP fails to clear the $2.20 resistance zone, it could start another decline. Initial support on the downside is near the $2.150 level. The next major support is near the $2.080 level. If there is a downside break and a close below the $2.080 level, the price might continue to decline toward the $2.020 support or the 61.8% Fib retracement level of the upward move from the $1.910 swing low to the $2.2150 high. The next major support sits near the $1.950 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.150 and $2.080. Major Resistance Levels – $2.20 and $2.250."
    },
    {
      "title": "Injective Prepares For Bullish Reversal Amid 25% Recovery – Analyst Forecasts Massive Breakout",
      "link": "https://www.newsbtc.com/news/injective-prepares-for-bullish-reversal-amid-25-recovery-analyst-forecasts-massive-breakout/",
      "summary": "Injective (INJ) is leading the crypto market with a 26% recovery from the recent lows, suggesting a “strong” rally could be around the corner. Some analysts forecast further upside for the token if it reclaims a key price area. Related Reading: Cardano Headed For $0.32 If This Level Isn’t Reclaimed – Is ADA’s Rally Over? Injective Sees Strong Daily Move On Tuesday, Injective saw a massive recovery from its recent drop to the $9 mark, and it’s attempting to reclaim a crucial resistance level. The cryptocurrency has been in a downtrend this month, driven by the increasing global geopolitical tensions. Since hitting its December high of $35.26, INJ has retraced over 65%, dropping below the $10 support multiple times during the 2025 retraces. However, the April-May rally saw the cryptocurrency break out of its multi-month downtrend and climb to its $10-$15 local price range. Following Monday night’s news of a potential ceasefire between Israel and Iran, Injective, alongside the rest of the market, reclaimed some of its recently lost levels, surging to the $11 area on Tuesday morning and nearing a crucial resistance. Notably, INJ recorded a 26% rally intraday to hit the $12.02 mark, becoming one of the leading tokens during the crypto market’s rebound. Analyst Crypto Rand noted that the cryptocurrency is now pushing over the June downtrend resistance following its price recovery, suggesting an explosive surge. According to"
    },
    {
      "title": "Ethereum Price Targets Upside Break — Will Momentum Carry It Past the Hurdles?",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-targets-upside-2500/",
      "summary": "Ethereum price started a fresh increase above the $2,220 zone. ETH is now showing positive signs and might aim for a move above the $2,550 zone. Ethereum started a fresh upward move above the $2,220 level. The price is trading above $2,320 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support at $2,390 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it settles above the $2,500 resistance zone in the near term. Ethereum Price Eyes More Gains Ethereum price started a fresh increase above the $2,200 support level, like Bitcoin. ETH price was able to clear the $2,220 and $2,250 resistance levels to move into a positive zone. The bulls even pushed the price above the 61.8% Fib retracement level of the downward wave from the $2,568 swing high to the $2,115 low. However, they are now facing hurdles near the $2,480 and $2,500 levels. Ethereum price is now trading above $2,320 and the 100-hourly Simple Moving Average. The price is now just above the 76.4% Fib retracement level of the downward wave from the $2,568 swing high to the $2,115 low. On the upside, the price could face resistance near the $2,500 level. The next key resistance is near the $2,550 level. The first major resistance is near the $2,565 level. A clear move above the $2,565 resistance might send the price toward the $2,650 resistance. An upside break above the $2,650 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,720 resistance zone or even $2,800 in the near term. Another Decline In ETH? If Ethereum fails to clear the $2,500 resistance, it could start a fresh decline. Initial support on the downside is near the $2,390 level and the trend line. The first major support sits near the $2,350 zone. A clear move below the $2,350 support might push the price toward the $2,320 support. Any more losses might send the price toward the $2,250 support level in the near term. The next key support sits at $2,150. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,350 Major Resistance Level – $2,500"
    },
    {
      "title": "Bitcoin Poised For Rally As Geopolitical Tensions Ease And Inflation Expectations Fall",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-poised-for-rally-as-geopolitical-tensions-ease-and-inflation-expectations-fall/",
      "summary": "Leading crypto exchange Binance witnessed a significant outflow of Bitcoin (BTC) and Ethereum (ETH) on June 23, with investors pulling out over 4,000 BTC and 61,000 ETH in a single day. This shift comes amid easing geopolitical tensions and declining inflation, fuelling speculation about a renewed rally. Bitcoin Likely To Rally As Global Tensions Simmer According to a recent CryptoQuant Quicktake post by contributor Amr Taha, Bitcoin is likely to resume its upward trajectory, bolstered by a series of recent macroeconomic and geopolitical developments. The analyst highlighted multiple positive signals that could propel the top digital asset closer to its all-time high (ATH). Related Reading: Bitcoin Yearly Trend Suggests Cycle Top Near $205,000 By Year-End, Analyst Says One of the key developments was an announcement by US President Donald Trump, who stated that a ceasefire agreement had been reached between Israel and Iran. This deal removes the immediate threat of Iran closing the Strait of Hormuz, a vital chokepoint for global oil supply. The ceasefire had an immediate and positive effect on global equity markets, with the S&#38;P 500 index surpassing 6,000 for the first time since February 2025. This recovery signals growing investor confidence as geopolitical risks subside. In addition, crude oil prices dropped by 14%, adding to the disinflationary narrative. Lower energy costs help reduce production and transportation expenses, thereby supporting a broader decline in inflationary pressures. Taha concluded: The convergence of significant crypto outflows from Binance, falling oil prices, a bullish breakout in US equities, and the reduction of Middle Eastern tensions presents a striking scenario. With the geopolitical overhang removed, inflation easing, and macro markets stabilizing, Bitcoin is now well-positioned to resume its upward trajectory. Meanwhile, Bitcoin whales &#8211; wallets holding large amounts of BTC &#8211; appear to be quietly accumulating in anticipation of a breakout. In another CryptoQuant post, contributor Mignolet noted that whale accumulation has been rising steadily since BTC bottomed in April. Mignolet pointed out that whale activity typically increases during periods of low market attention or heightened fear, often foreshadowing bullish reversals. Historical data supports this trend, showing that increased accumulation often precedes significant price surges. Bullish Quarter For BTC In an X post published today, seasoned crypto analyst Titan of Crypto stated that BTC is set to close a bullish monthly candle, reinforcing the long-term uptrend for the flagship cryptocurrency. Several other on-chain and technical indicators also suggest further upside potential. For example, Bitcoin Binary CDD shows that long-term holders are continuing to hold rather than sell, indicating strong conviction in BTC’s long-term value. Related Reading: Bitcoin Forming Inverse Head And Shoulders Pattern – Is $150,000 The Next Target? At the same time, the number of short positions is climbing as BTC consolidates between $100,000 and $110,000. This dynamic raises the probability of a short squeeze, potentially propelling Bitcoin to a new ATH. At press time, BTC trades at $105,408, up 5.2% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant, X, and TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Panelists at Senate Banking Hearing on Crypto Market Structure Call for Regulation ASAP",
      "link": "https://bitcoinmagazine.com/news/panelists-at-senate-banking-hearing-on-crypto-market-structure-call-for-regulation-asap",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/US-Senate-Hearing-on-Crypto-Market-Structure.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/panelists-at-senate-banking-hearing-on-crypto-market-structure-call-for-regulation-asap\" rel=\"nofollow\"> </a></p> <p>Members of the crypto industry and digital asset specialists argue that if the U.S. doesn’t pass legislation on digital asset market structure soon, it might cede authority to legal regimes from other countries.</p> <p>"
    },
    {
      "title": "Lightning Labs Releases Taproot Assets v0.6 With Updates to Stablecoin Support On Bitcoin",
      "link": "https://bitcoinmagazine.com/news/lightning-labs-releases-taproot-assets-v0-6-with-updates-to-stablecoin-support-on-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Lightning-Labs-Releases-Taproot-Assets-v0.6-With-Updates-to-Stablecoin-Support-On-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lightning-labs-releases-taproot-assets-v0-6-with-updates-to-stablecoin-support-on-bitcoin\" rel=\"nofollow\"> </a></p> <p>The update adds grouped asset identifiers, improves Lightning Network payment flows, and expands support for stablecoin transactions on Bitcoin.</p> <p>"
    },
    {
      "title": "Republican Senators Scott, Lummis, Tillis, Hagerty Push For Digital Asset Market Structure Rules",
      "link": "https://bitcoinmagazine.com/news/republican-senators-scott-lummis-tillis-hagerty-push-for-digital-asset-market-structure-rules",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Republican-Senators-Scott-Lummis-Tillis-Hagerty-Push-For-Digital-Asset-Market-Structure-Rules.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/republican-senators-scott-lummis-tillis-hagerty-push-for-digital-asset-market-structure-rules\" rel=\"nofollow\"> </a></p> <p>Republican senators have released principles to guide digital asset market structure legislation, marking a significant step toward regulatory clarity that could benefit Bitcoin and the broader crypto industry. Senate Banking Chairman Tim Scott (R-SC), along with Senators Cynthia Lummis (R-WY), Thom Tillis (R-NC), and Bill Hagerty (R-TN), announced the framework balancing innovation with consumer protection.&#160; [&#8230;]</p> <p>"
    },
    {
      "title": "Anthony Pompliano’s ProCap BTC Buys $386M in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/anthony-pomplianos-procap-btc-buys-386m-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Anthony-Pomplianos-ProCap-BTC-Buys-386M-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pomplianos-procap-btc-buys-386m-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>ProCap BTC acquires 3,724 bitcoin as part of a strategy to build a $1 billion Bitcoin treasury.</p> <p>"
    },
    {
      "title": "The Smarter Web Company Expands Bitcoin Holdings With £15.2M Purchase",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-expands-bitcoin-holdings-with-15-2m-purchase",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Smarter-Web-Comp._imresizer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-expands-bitcoin-holdings-with-15-2m-purchase\" rel=\"nofollow\"> </a></p> <p>The Smarter Web Company, a web design, development, and online marketing services provider, has announced another Bitcoin purchase, acquiring 196.90 Bitcoin for £15,185,259 as part of its &#8220;10 Year Plan&#8221; treasury strategy. The London listed technology company paid an average price of £77,122 per Bitcoin ($103,290 per Bitcoin) for the acquisition.&#160; This purchase brings The [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Athena Bitcoin Clears Way For Early Investors to Sell Shares",
      "link": "https://decrypt.co/326869/athena-bitcoin-clears-way-early-investors-sell-shares",
      "summary": "Athena has filed to register shares previously issued through debt conversions, enabling early investors to exit without raising new capital."
    },
    {
      "title": "Senate Banking Committee Sets Out Plan For Crypto Market Rules",
      "link": "https://decrypt.co/326866/senate-banking-committee-plan-crypto-market-rules",
      "summary": "The principles aim to define digital asset oversight as debates over Trump-linked crypto profits and federal legislation intensify."
    },
    {
      "title": "Bernie Sanders Blasts AI Firms Over Jobs Displacement: ‘They Couldn’t Care Less’",
      "link": "https://decrypt.co/326863/bernie-sanders-blasts-ai-firms-job-displacement",
      "summary": "Vermont Senator Bernie Sanders warned that AI will uproot workers unless reforms shift power from CEOs to the American people."
    },
    {
      "title": "NYSE Files for Rule Change to List Trump Bitcoin Ethereum ETF",
      "link": "https://decrypt.co/326858/nyse-files-rule-change-list-trump-bitcoin-ethereum-etf",
      "summary": "NYSE applied for a rule change enabling the listing of a BTC-ETH ETF proposed by President Donald Trump’s media and tech company."
    },
    {
      "title": "Norwegian Mineral Mining Firm Eyes $1.2 Billion Raise for Bitcoin Treasury",
      "link": "https://decrypt.co/326856/norwegian-mineral-mining-firm-1-2-billion-raise-bitcoin-treasury",
      "summary": "Green Minerals has adopted the Bitcoin treasury strategy as a step towards broader blockchain implementation."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Binance co-founder Yi He dismisses rumors of CZ receiving pardon from President Trump: Report",
      "link": "https://cryptobriefing.com/cz-presidential-pardon-binance/",
      "summary": "<p>The incident highlights the volatility of crypto markets and the impact of misinformation on investor sentiment and asset prices.</p> <p>"
    },
    {
      "title": "Metaplanet raises $517M in a single day to buy more Bitcoin",
      "link": "https://cryptobriefing.com/metaplanet-bitcoin-investment-strategy/",
      "summary": "<p>Metaplanet's massive Bitcoin investment could accelerate global corporate adoption, influencing market dynamics and digital asset strategies.</p> <p>"
    },
    {
      "title": "Majority Whip Tom Emmer says House will vote on GENIUS stablecoin bill if paired with CLARITY Act",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house-vote/",
      "summary": "<p>The potential passage of these bills could significantly shape the regulatory landscape for digital assets, impacting innovation and market dynamics.</p> <p>"
    },
    {
      "title": "CME XRP futures hit $542 million volume in first month, strengthening case for spot XRP ETFs",
      "link": "https://cryptobriefing.com/cme-xrp-futures-global-demand/",
      "summary": "<p>The surge in XRP futures trading volume bolsters the likelihood of SEC approval for spot XRP ETFs, potentially transforming crypto investment.</p> <p>"
    },
    {
      "title": "Mastercard and Chainlink team up to enable nearly 3 billion cardholders to buy crypto on-chain",
      "link": "https://cryptobriefing.com/mastercard-chainlink-partnership-crypto/",
      "summary": "<p>This collaboration could significantly accelerate mainstream crypto adoption, bridging traditional finance with decentralized finance seamlessly.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "New bill targets Trump’s crypto empire – Will COIN Act put a ‘stop to this corruption?’",
      "link": "https://ambcrypto.com/new-bill-targets-trumps-crypto-empire-will-coin-act-put-a-stop-to-this-corruption/",
      "summary": "<img alt=\"New bill targets Trump&#039;s crypto empire - Will COIN Act put a &#039;stop to this corruption?&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Trump-crypto-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The COIN Act targets the President, the VP, family and top officials from issuing or supporting crypto assets."
    },
    {
      "title": "FUNToken sees a 200% rise in 7 days of trading!",
      "link": "https://ambcrypto.com/funtoken-sees-a-200-rise-in-7-days-of-trading/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"615\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-24-at-5.12.37 PM-e1750765411565.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1200\" />FUNToken has seen a 200% rise in the past week of trading, establishing itself in [&#8230;]"
    },
    {
      "title": "Is Sui’s recovery sustainable? How $2.08 will define the road ahead",
      "link": "https://ambcrypto.com/is-suis-recovery-sustainable-how-2-08-will-define-the-road-ahead/",
      "summary": "<img alt=\"Is Sui&#039;s recovery sustainable? How $2.08 will define the road ahead\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Sui-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite the bullish weekly structure, the buying pressure behind SUI remained weak."
    },
    {
      "title": "Is Bitcoin becoming too valuable to trade? THIS reveals…",
      "link": "https://ambcrypto.com/is-bitcoin-becoming-too-valuable-to-trade-this-reveals/",
      "summary": "<img alt=\"Is Bitcoin becoming too valuable to trade? THIS reveals...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-10-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is Bitcoin finally becoming the asset its believers always claimed it was?"
    },
    {
      "title": "Can Dogecoin break THIS bearish pattern after 155M DOGE dump?",
      "link": "https://ambcrypto.com/can-dogecoin-break-this-bearish-pattern-after-155m-doge-dump/",
      "summary": "<img alt=\"Will Dogecoin break its bearish pattern after 155M DOGE dump?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-24T160807.915_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A whale dumped 155 million DOGE as the price reached the upper boundary of a descending channel pattern."
    }
  ]
}