{
  "CoinDesk": [
    {
      "title": "ETH Surges 9% as Crypto Market Celebrates Trump's Ceasefire Announcement",
      "link": "https://www.coindesk.com/markets/2025/06/24/eth-surges-9-as-crypto-market-celebrates-trump-s-peace-deal-announcement",
      "summary": ""
    },
    {
      "title": "Bitcoin Busts Past $106K on Reported Iran/Israel Ceasefire",
      "link": "https://www.coindesk.com/markets/2025/06/23/bitcoin-busts-past-106k-on-reported-iranisrael-ceasefire",
      "summary": ""
    },
    {
      "title": "Circle Hits New Record With Market Cap Nearing That of Coinbase",
      "link": "https://www.coindesk.com/markets/2025/06/23/circle-hits-new-record-with-market-cap-nearing-that-of-coinbase",
      "summary": ""
    },
    {
      "title": "Stablecoins Are a Monetary Revolution in the Making",
      "link": "https://www.coindesk.com/opinion/2025/06/23/stablecoins-are-a-monetary-revolution-in-the-making",
      "summary": ""
    },
    {
      "title": "Cipher Mining Begins Bitcoin Production at 300 MW Black Pearl Data Center",
      "link": "https://www.coindesk.com/markets/2025/06/23/cipher-mining-begins-bitcoin-production-at-300-mw-black-pearl-data-center",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin rebounds to $106K amid Middle East ceasefire and rate cut bets",
      "link": "https://cointelegraph.com/news/bitcoin-rebounds-to-106k-amid-middle-east-ceasefire-and-rate-cut-bets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzllZjctODM5ZS03NzcyLWI0ZWMtMmE2NDliOWEwZThl.jpg\" /></p><p>Bitcoin bounced to $106,000 as traders bet on higher chances of Fed interest rate cuts due to tensions in the Middle East.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Anchorage adds DeFi capability for institutions with Uniswap wallet integration",
      "link": "https://cointelegraph.com/news/anchorage-adds-defi-capability-institutions-uniswap-wallet-integration?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzllODktZjllZC03YzQ5LWE5M2EtYmQxZDQ4ZGY2OGI2.jpg\" /></p><p>Anchorage Digital is expanding its Porto wallet with Uniswap integration, giving institutions direct access to DeFi swaps and liquidity.</p>"
    },
    {
      "title": "Trump Media says $400M stock buyback won’t affect BTC treasury plans",
      "link": "https://cointelegraph.com/news/trump-media-share-buyback-bitcoin-treasury?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzQ2NjYtY2NhZi03Yzk5LTk3NGYtYjdlMTczYzEwZWI4.jpg\" /></p><p>Trump Media’s recently announced $400-million buyback plan will not alter its strategy of using $2.3 billion to invest in Bitcoin, according to the company.</p>"
    },
    {
      "title": "Circle stock becomes largest component of VanEck’s digital asset index",
      "link": "https://cointelegraph.com/news/circle-stock-becomes-largest-vaneck-digital-asset-index?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjZjNGYtODdhMi03NjhjLWExYzMtMjZhMjk0ZDBiNTI5.jpg\" /></p><p>Shares of the stablecoin issuer account for roughly 13% of the MVDAPP, said VanEck’s Mathew Sigel.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Dark market activity on Telegram persists despite $27B Huione ban – Elliptic",
      "link": "https://cryptoslate.com/dark-market-activity-on-telegram-persists-despite-27b-huione-ban-elliptic/",
      "summary": "<p>Telegram-based dark markets rapidly filled the gap left by Huione Guarantee after the $27 billion marketplace disappeared on May 13, according to a June 23 Elliptic report. Elliptic noted that Telegram banned thousands of Huione Guarantee channels and usernames once researchers traced billions of USDT-denominated sales to pig-butchering scams. However, data shows that merchants immediately [&#8230;]</p> <p>"
    },
    {
      "title": "FTX fights back against 3AC’s ‘unreasonable and unsupportable’ $1.53B claim",
      "link": "https://cryptoslate.com/ftx-fights-back-against-3acs-unreasonable-and-unsupportable-1-53b-claim/",
      "summary": "<p>FTX’s bankruptcy lawyers have pushed back forcefully against a $1.53 billion claim filed by failed crypto hedge fund Three Arrows Capital (3AC), calling the demand “illogical” and warning that it would unfairly drain funds from FTX’s legitimate creditors. In new court documents submitted on June 20, FTX’s legal team asked a Delaware bankruptcy judge to [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin whipsaws back to $104k after losing six-figures as Iran’s failed attack signals end of tensions",
      "link": "https://cryptoslate.com/bitcoin-whipsaws-back-to-104k-after-losing-six-figures-as-irans-failed-attack-signals-end-of-tensions/",
      "summary": "<p>Bitcoin (BTC) whipsawed below $100,000 at about 4 p.m. UTC on June 23 and reclaimed nearly $104,000 three hours later as traders processed news of an Iranian missile strike on a US air base in Qatar that caused no casualties. As of press time, Bitcoin was trading at $103,801.74, up 4.5% over the past 24 [&#8230;]</p> <p>"
    },
    {
      "title": "Survey: 82% of US wealthy investors favor advisers who can deliver informed crypto strategies",
      "link": "https://cryptoslate.com/survey-82-of-us-wealthy-investors-favor-advisers-who-can-deliver-informed-crypto-strategies/",
      "summary": "<p>Wealthy US investors say they are more likely to hire financial advisers who provide crypto guidance, according to a June 2025 CoinShares survey of 500 individuals with at least $500,000 in investable assets. A vast majority (88%) of investors already work with an adviser, and 58% rank advisers as their most trusted source for digital [&#8230;]</p> <p>"
    },
    {
      "title": "Fed joins regulators dropping reputational risk factor, clearing banks to serve crypto firms",
      "link": "https://cryptoslate.com/fed-joins-regulators-dropping-reputational-risk-factor-clearing-banks-to-serve-crypto-firms/",
      "summary": "<p>The Federal Reserve Board on June 23 removed reputational risk from its bank supervision program, ordering staff to strike the term from examination manuals and to concentrate on measurable financial exposures. The Fed move positions the central bank alongside the Federal Deposit Insurance Corporation (FDIC) and the Office of the Comptroller of the Currency, which [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin STHs Capitulate: 14,700 BTC Moved To Exchanges At Loss",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-sths-capitulate-14700-btc-exchanges-loss/",
      "summary": "As volatility engulfs the cryptocurrency market amid war tensions, on-chain data shows that the Bitcoin short-term holders are selling at a loss. Bitcoin Short-Term Holders Just Made Large Exchange Inflows At A Loss In a new post on X, CryptoQuant author Axel Adler Jr has talked about how the Bitcoin short-term holders have reacted to the price volatility that has come alongside rising tensions in the Middle East following US strikes on three nuclear facilities in Iran. Related Reading: Consolidation Takes Its Toll: Bitcoin Investors No Longer Greedy The short-term holders (STHs) refer to the BTC investors who purchased their coins within the past 155 days. The other side of the network, the holders with a holding time greater than 155 days, are termed as the long-term holders (LTHs). The former group contains the new entrants and low conviction holders, who generally panic easily whenever some change occurs in the market. On the other hand, the latter cohort includes the veterans of the market, who tend to sit tight through crashes and rallies alike. As such, given the recent sharp price action that has occurred in the sector, the STHs are likely to have made some moves. And indeed, on-chain data would confirm so. The above chart, shared by the analyst, shows the data for the profit and loss exchange deposit transactions that the STHs as a whole are making. Investors usually transfer to these centralized platforms when they want to sell, so inflows going to them can provide hints about whether selling is elevated or not. From the graph, it&#8217;s visible that the loss transactions going to the exchanges from this cohort have amounted to 14,700 BTC, which, although lower than the two major capitulation events from the past couple of months, is significant. Thus, it would appear that some of the STHs have reacted to the news by exiting the market, even if it means taking a loss. Related Reading: Dogecoin Gears Up For 60% Move—Will It Be Up Or Down? It&#8217;s also apparent from the chart that the profitable transfers have remained relatively low at 3,100 BTC. This is likely down to the fact that the STHs are left with little profit following the price decline, as the on-chain analytics firm Glassnode has pointed out in an X post. In the chart, the trend of the STH Realized Price is displayed. This indicator keeps track of the Bitcoin cost basis or acquisition level of the average STH. During the crash, the price almost retested the line, and even after the rebound, it remains close to it, meaning the profit margin for the cohort is still tight. BTC Price At the time of writing, Bitcoin is trading around $101,300, down over 5% in the last week. Featured image from Dall-E, Glassnode.com, CryptoQuant.com, chart from TradingView.com"
    },
    {
      "title": "The BNB Paradox: Bearish Breakdown Meets Bullish Flag, Which Will Prevail?",
      "link": "https://www.newsbtc.com/analysis/bnb/bnb-bearish-breakdown/",
      "summary": "BNB finds itself at a pivotal crossroads where conflicting signals collide — a bearish breakdown challenging key support levels, yet a bullish flag pattern hints at a potential upward surge. This paradox leaves traders and investors weighing which force will ultimately dominate the market’s next move. As pressure mounts from both sides, understanding the technical nuances behind this tug-of-war becomes crucial to anticipating BNB’s trajectory in the near term. BNB Faces Pressure From Key Technical Levels Analyzing the BNBUSD setup on the M30 timeframe, Thomas Anderson in an X post highlighted that the price is currently testing the yellow support line at $626.95, following a decisive drop below the cyan price line at $633.99. This breakdown has shifted short-term sentiment, suggesting that sellers are beginning to exert stronger control over the price action. Related Reading: BNB Price Breakout Could Trigger ATH Rally Repeat – Is $730 The Next Stop? According to Anderson, the 200 MA (red line), positioned between $642 and $645, is now acting as a dynamic resistance zone overhead. With price trading below this moving average, any attempts at recovery may face immediate rejection. He also pointed out that the H1 chart confirms the ongoing bearish momentum, with the price continuing to trade below both the cyan level and the 200 MA. This alignment between the M30 and H1 timeframes strengthens the case for further downside movement, especially if the current support at $626.95 fails to hold. Until buyers manage to reclaim key resistance levels, the overall outlook remains weak, and traders should keep an eye on how the price behaves around the current support to gauge the next likely move. BNB’s Price Outlook Strengthened By Bullish Continuation Signal Despite the bearish outlook presented by Thomas Anderson, eL Zippo expressed a more optimistic stance in his latest X tweet regarding BNB. He believes that BNB still has the potential to rise in value, challenging the prevailing negative sentiment around its recent price action. Related Reading: BNB Price Eyes Comeback: Can It Regain Momentum and Rally Higher? EL Zippo’s view is supported by the formation of a bullish flag pattern on the chart. This pattern is widely recognized as a continuation signal, indicating that the asset may resume its prior upward trend after a period of consolidation. For eL Zippo, the presence of this structure suggests that BNB could be setting up for another leg higher if market conditions align. At the time of writing, BNB was trading around the $623 mark, reflecting steady price action. The asset’s market capitalization stood at approximately $87.7 billion, signaling strong investor interest. Additionally, BNB recorded a 24-hour trading volume of roughly $1.8 billion, with price and volume showing percentage gains of 2.11% and 13.22%, respectively—an indication of renewed activity and positive sentiment in the market. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "XRP Price At Risk Of 20% Crash To $1.55 If This Level Fails To Hold",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-risk-20-crash-to-1-55/",
      "summary": "XRP has once again landed at an important support level that places it in view of a rebound upwards or at risk of a further 20% crash. According to technical analyst CasiTrades, the recent drop was anticipated for weeks, and the precision with which XRP touched the $2.01 zone has added weight to its importance. The analyst noted that the drop out of the symmetrical triangle consolidation was clean and technically sound, and the $2.01 level has so far acted as the level for an upward bounce. Technical Setup Says Danger Zone Below $2.00 Still Active XRP price action in the past few days has been marked by a downtrend. XRP lost the $2.13 price level over the weekend before eventually cascading to a crash below $2 in the past 24 hours. Particularly, XRP crashed to bottom out at $1.92 before staging a rebound back above $2, at least at the time of writing. Related Reading: XRP To End 7-Month Consolidation After 700% Surge – Is A Major Move Coming? As it stands, XRP is now back to trading at $2.01, a price level that holds utmost importance for its price action in the coming days. According to a technical analysis posted on the social media platform X by crypto analyst CasiTrades, $2.01 is important for XRP, as it coincides with a major 0.618 Fib support level. Supporting this view is a visible bullish divergence forming on both the 15-minute and 1-hour Relative Strength Index (RSI), as depicted on the price chart below. However, the analyst was quick to warn that confirmation is still lacking on the higher 4-hour and daily timeframes. Without these confirmations, the bounce could still be nonexistent, and XRP could crash strongly below $2. XRP is currently at risk unless buyers manage to push its price into higher confirmation zones, specifically into the $3.00 range. According to CasiTrades, if any bounce at $2.01 fails to carry through, XRP could be headed for its next supports at $1.90 and then $1.55. The latter represents a rough 23% drop from current levels, a scenario that would invalidate the bullish RSI divergence on the smaller timeframes. Geopolitical Tensions Causing XRP Price Volatility The timing of XRP’s sharp drop over the weekend coincided with reports of geopolitical unrest, particularly the reported bombing of Iran by the US. This event caused widespread volatility in the crypto market, which was opened over the weekend. Related Reading: Why The XRP Price Risks A Crash To $0.9 As Bearish Pressures Mount Although the decline seems to be pausing in recent trading hours, it does not yet qualify as a bounce. XRP price is currently fragile, and without a reaction from buyers or confirmation across higher timeframes, the structure is bearish. Selling pressure from new geopolitical tensions or algorithmic moves could potentially lead to deeper declines during the new week, especially if $2.00 fails to hold. In that case, XRP could be on track to retest the $1.90 support and even collapse toward the $1.55 before the end of the week. At the time of writing, XRP is trading at $2.01, down by 2.6% in the past 24 hours. Featured image from Pexels, chart from Tradingview.com"
    },
    {
      "title": "Dogecoin Crash Far From Over? Analyst Reveals The Target",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-crash-far-from-over-analyst/",
      "summary": "The price of Dogecoin continues to bleed, and crypto analyst Kevin (@Kev_Capital_TA) warns that the worst may still lie ahead. Citing an earlier bearish pattern, Kevin emphasized over the weekend that Dogecoin’s Head and Shoulders formation—identified nearly two weeks ago—is rapidly approaching its technical “measured move” target. But he also made it clear that the full downside potential has not yet played out. Dogecoin Collapse Far From Over? “I didn’t say we are there now,” Kevin clarified in a follow-up post, “the orange circle represents a zone of where the measured move could go, with a precise measured move target of the .786 fib at .119.” This $0.119 level aligns with a broader confluence of technical supports that are quickly becoming critical for DOGE’s structure. “The Head n Shoulders I pointed out on Dogecoin almost a couple of weeks ago is almost at its measured move target range. Certain daily indicators are also starting to enter inciting levels. Watching closely along with BTC and USDT Dominance for further confirmations,” he wrote. Kevin also highlighted the importance of the weekly 200 Simple Moving Average (SMA) and Exponential Moving Average (EMA), along with the macro .382 Fibonacci retracement and a long-term descending trendline. Related Reading: Crypto Analyst Predicts $4 Dogecoin After Exhausted Selling Phase Together, these levels form what he described as the “must-hold” zone, specifically between $0.1434 and $0.1265. A sustained breakdown below that region would likely confirm a macro bearish shift for the meme asset. What To Monitor Now Zooming out, Kevin sees Dogecoin’s fate as inseparably tied to Bitcoin and the wider altcoin market, which he describes as being in its weakest state in years. “So far 2025 has been more bearish for altcoins than 2024 and 2023,” he noted. “Worst year for Alts since the bear market in 2022.” The overwhelming strength of Bitcoin’s dominance has been a key factor in that trend. That dominance, Kevin argues, is not a temporary spike. “Fresh highs for BTC Dominance on the back of restrictive monetary policy and an uncertain geopolitical environment,” he wrote, referring to global macro conditions including persistent quantitative tightening (QT). He has long warned that without a pivot in central bank policy, any talk of a true “altseason” is premature. Related Reading: Dogecoin Looks Like ‘It Wants To Play Dead’—Again “Been saying since late 2023, early 2024—when AI coins were running crazy and people were saying it was #Altseason—that until QT ends and the terminal rate comes down, you will not see real sustainable altcoin outperformance. That continues to hold true.” His caution extends well beyond Dogecoin. In previous posts, Kevin identified key danger zones for Bitcoin and Ethereum, which he argues must be reclaimed to prevent broader market deterioration. “As long as BTC cannot break the $106.8K level and show real follow-through on 3D-1W time frames, then the market is in real danger,” he wrote. “Same for ETH not being able to break the $2700-2800 level.” For Dogecoin traders, the message is clear. The meme coin’s fate rests not just on its own technical health, but on a wider macro and intermarket structure that remains fragile. As long as Bitcoin struggles to hold above key breakout levels and US monetary conditions remain tight, the probability of a deeper Dogecoin correction remains high. Whether DOGE can stabilize above the $0.1265 level will be closely watched by traders in the days and weeks ahead. A loss of that zone, especially in conjunction with renewed Bitcoin weakness, could mark the beginning of a deeper and more painful phase for the once-beloved meme coin. At press time, DOGE traded at $0.152. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Battles Key Support: Daily EMA-100 Must Hold to Prevent Deep Correction",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-battles-key-support-daily-ema-100-must-hold-to-prevent-deep-correction/",
      "summary": "Bitcoin briefly fell below the critical $100,000 level over the weekend, reaching a low of approximately $98,200 and triggering a wave of panic selling across crypto markets. The sharp drop came after news broke of US military strikes on Iranian nuclear facilities, a move that significantly escalated the already volatile conflict between Israel and Iran. The geopolitical shock sent global markets into risk-off mode, with Bitcoin reacting quickly to the growing uncertainty. Related Reading: Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106 Despite the weekend dip, BTC has since reclaimed the $100K mark, but sentiment remains fragile. Investors are now watching key technical levels closely to determine the next move. According to top analyst Ted Pillows, Bitcoin must hold the daily EMA-100 to avoid further downside pressure. A decisive close below this level could open the door for a deeper correction, especially if macroeconomic and geopolitical risks persist. As volatility spikes and fear grows, Bitcoin’s ability to maintain support at these levels may define whether the bull cycle continues or enters a prolonged consolidation phase. All eyes are now on the $100K zone, which has become a critical battleground for bulls and bears in a market driven by both technicals and global tension. Bulls Defend $100K As Dominance Rises and Market Faces Crucial Test Bitcoin is once again at a pivotal moment. After dipping below the psychological $100,000 level over the weekend amid growing geopolitical tensions, BTC quickly reclaimed this critical threshold, offering a glimmer of hope to market participants. Although bulls managed to push the price back up, the overall structure remains fragile, and technical indicators now carry more weight than ever. Ted Pillows noted in a recent update that Bitcoin must hold its daily EMA-100 to preserve bullish momentum. A daily close below $99,000 would confirm a break below this key support zone, likely triggering a retest of the $92,000–$94,000 region. Such a move could create significant downside pressure, particularly on altcoins, which are already lagging behind in performance. In Pillows&#8217; words, “If Bitcoin loses this level, alts will be annihilated.” Despite the looming risks, fundamentals remain solid. Bitcoin dominance continues to hover near its highest levels of the year, reflecting growing investor preference for BTC over high-beta assets during uncertain times. On-chain metrics still indicate strong holder conviction, and macro narratives continue to favor Bitcoin as a hedge amid fiat instability and rising geopolitical uncertainty. If Bitcoin can hold the $100K level and reclaim momentum, it could lead to renewed strength and eventually a push toward the $109K resistance zone. For now, however, bulls are on the defensive. Price action over the next few days will likely define the trajectory for the remainder of Q3, with a close watch on EMA support, macro headlines, and risk sentiment across global markets. Related Reading: Ethereum Weekly Chart Nears Tower Top Formation As US Launches Attack On Iran – Details Bitcoin Struggles Below Resistance Amid Bearish Price Structure The 12-hour chart for Bitcoin reveals a bearish structure following the breakdown below the $103,600 support zone. After forming a symmetrical triangle throughout mid-June, BTC failed to break upward and instead reversed direction, confirming a downward breakout. This move triggered a sharp decline to $98,200 over the weekend, followed by a modest recovery to the current $101,250 level. The price is now trading below both the 50 and 100-period simple moving averages, which are beginning to curl downward, signaling a shift in momentum away from bulls. The 200-period SMA, currently near $95,600, stands as the next major support if downside pressure continues. Volume has picked up notably on the red candles, adding weight to the bearish case and confirming active selling during the recent drop. Related Reading: Ethereum Charts Signal Potential Bottom – All Eyes On Next Move Bitcoin must reclaim the $103,600 zone and hold above it to invalidate the bearish pattern and regain control. Failure to do so could result in further downside toward $95,000 and possibly even $92,000. As long as BTC remains below the broken triangle support and the $103K resistance, the path of least resistance remains downward. Bulls face an uphill battle, and confidence may erode quickly if the $100K psychological level is breached again. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Sequans Launches $384M Bitcoin Treasury Initiative with Swan Bitcoin Partnership",
      "link": "https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Sequans-Launches-384M-Bitcoin-Treasury-Initiative-with-Swan-Bitcoin-Partnership.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a France-based developer of 5G and IoT semiconductor technology, has announced a move into Bitcoin with a new treasury initiative backed by a $384 million private placement.&#160;&#160; The funding includes $195 million in equity securities and $189 million in convertible secured notes. Sequans plans to allocate this capital toward building a Bitcoin position [&#8230;]</p> <p>"
    },
    {
      "title": "The Blockchain Group Acquires 75 BTC After €7.2M Raise",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/10.4B-Bitcoin-Firm-Unchained-Announces-First-Regulated-Bitcoin-Native-Trust-Company-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise\" rel=\"nofollow\"> </a></p> <p>Total holdings reach 1,728 BTC as YTD yield climbs to 1,231.7%, reinforcing its Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Fintech Company DigiAsia Corp to Launch Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Southeast-Asian-fintech-company-aims-to-raise-100-million-for-long-term-Bitcoin-holdings-as-part-of-their-corporate-treasury-initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DigiAsia Corp, a leading Southeast Asian Fintech-as-a-Service platform, has signed an indicative term sheet for up to $3 million in non-recourse debt financing to kickstart its Bitcoin treasury acquisition strategy. The funding comes from High West Capital Partners and is expected to close within 45 days.&#160; The $3 million facility represents the first phase of [&#8230;]</p> <p>"
    },
    {
      "title": "ECD Automotive Design Secures $500M Facility to Acquire Bitcoin",
      "link": "https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ECD-Automotive-Design-Secures-500M-Facility-to-Acquire-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin\" rel=\"nofollow\"> </a></p> <p>Luxury auto builder will grow its Bitcoin treasury, expand operations, and offer $21,000 in upgrades to early customers who pay with Bitcoin and other crypto.</p> <p>"
    },
    {
      "title": "Anthony Pompliano Announces $1 Billion Merger in Record Bitcoin Treasury Company Fundraise",
      "link": "https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ProCap-Financial-has-raised-over-750-million-in-the-largest-initial-funding-round-for-a-public-Bitcoin-treasury-company.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise\" rel=\"nofollow\"> </a></p> <p>Anthony Pompliano announced a $1 billion merger creating ProCap Financial through a Special Purpose Acquisition Company (SPAC) transaction with Columbus Circle Capital Corp. (CCCM). The deal represents the largest initial fundraise in history for a public Bitcoin treasury company, raising $516.5 million in equity and $235 million in convertible notes.&#160;&#160; ProCap Financial will operate with [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "How AI Is Has Turned Propaganda Into a Potent Weapon",
      "link": "https://decrypt.co/326589/ai-propaganda-potent-weapon",
      "summary": "AI-generated videos and fake personas are flooding social media from Tel Aviv to Tehran, turning it into a digital battlefield of deception."
    },
    {
      "title": "Senator Introduces Bill to Halt Trump’s Crypto Activity—But Voted to Allow It Last Week",
      "link": "https://decrypt.co/326576/senator-introduces-bill-halt-trump-crypto-activity-voted-allow",
      "summary": "Adam Schiff (D-CA) is the latest Democrat to propose a bill banning President Trump from engaging in crypto activity. Like the others, it's unlikely to pass anytime soon."
    },
    {
      "title": "Bitcoin, Ethereum and XRP Spike as Trump Says Iran, Israel Agree to Ceasefire",
      "link": "https://decrypt.co/326577/bitcoin-ethereum-xrp-spike-trump-says-iran-israel-ceasefire",
      "summary": "Crypto prices are surging again—with Bitcoin back above $105K—after President Trump said that Iran and Israel have agreed to a ceasefire."
    },
    {
      "title": "Donald Trump and Bitcoin: From 'Not a Fan' to Crypto President—With His Own Meme Coin",
      "link": "https://decrypt.co/240580/donald-trump-bitcoin-evolution-timeline-president",
      "summary": "President Donald Trump used to slam Bitcoin as \"a scam.\" Now he's back in the White House and making pro-crypto moves."
    },
    {
      "title": "Midnight Network Plots NIGHT Airdrop for Users of Bitcoin, Ethereum, Cardano and Beyond",
      "link": "https://decrypt.co/326566/midnight-network-night-airdrop-bitcoin-ethereum-cardano",
      "summary": "Cardano-powered privacy network Midnight will offer NIGHT tokens in an airdrop to millions of crypto users on Bitcoin, Ethereum, and beyond."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin drops below $100K, then rebounds after Iran reportedly fires missiles toward US military targets in Qatar and Iraq",
      "link": "https://cryptobriefing.com/bitcoin-price-drop-mideast-tensions/",
      "summary": "<p>Geopolitical tensions can significantly impact cryptocurrency markets, highlighting their volatility and sensitivity to global events.</p> <p>"
    },
    {
      "title": "Crypto fund veterans to raise $100M to build BNB strategic reserve",
      "link": "https://cryptobriefing.com/bnb-treasury-strategy-listed-company/",
      "summary": "<p>The initiative could diversify crypto investment strategies, potentially increasing BNB's market influence and public company crypto adoption.</p> <p>"
    },
    {
      "title": "Fintech giant Fiserv to launch FIUSD stablecoin and digital asset platform with Circle, Paxos, and Solana",
      "link": "https://cryptobriefing.com/fiusd-stablecoin-platform-launch/",
      "summary": "<p>Fiserv's FIUSD launch could revolutionize digital payments, enhancing real-time transactions and expanding blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Michael Saylor’s Strategy makes smallest Bitcoin purchase since mid-March",
      "link": "https://cryptobriefing.com/strategy-bitcoin-acquisition-record/",
      "summary": "<p>Saylor's ongoing Bitcoin acquisitions highlight a strategic commitment to digital assets, potentially influencing market dynamics and investor sentiment.</p> <p>"
    },
    {
      "title": "Hackers exploit Trezor’s website to send phishing emails",
      "link": "https://cryptobriefing.com/trezor-security-alert-phishing-warning/",
      "summary": "<p>This incident highlights the growing sophistication of phishing attacks, underscoring the need for enhanced cybersecurity measures in crypto platforms.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Metaplanet buys $118M in Bitcoin during dip – Now holds over $1B in BTC",
      "link": "https://ambcrypto.com/metaplanet-buys-118m-in-bitcoin-during-dip-now-holds-over-1b-in-btc/",
      "summary": "<img alt=\"Metaplanet buys $118M in Bitcoin during dip - Now holds over $1B in BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/MetaplanetBTCFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Metaplanet's latest purchase is just the latest in a series of them."
    },
    {
      "title": "PEPE: $3.45M whale buy could trigger a 112% rally, ONLY IF…",
      "link": "https://ambcrypto.com/pepe-3-45m-whale-buy-could-trigger-a-112-rally-only-if/",
      "summary": "<img alt=\"PEPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-1-7.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The massive accumulation of PEPE by Cumberland could be a precursor for A 112% move."
    },
    {
      "title": "Mantra: Assessing impact of $2.17M whale dump on OM’s price",
      "link": "https://ambcrypto.com/mantra-assessing-impact-of-2-17m-whale-dump-on-oms-price/",
      "summary": "<img alt=\"OM\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-23T125852.459-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />OM’s outlook weakens as bearish metrics overpower oversold signals and address growth."
    },
    {
      "title": "Bitcoin: What these KEY datasets say about BTC’s market direction",
      "link": "https://ambcrypto.com/bitcoin-what-these-key-datasets-say-about-btcs-market-direction/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-7-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As Bitcoin dropped to $98k, STHs turned to selling, offloading 17.8k BTC as bearish sentiment surged."
    },
    {
      "title": "Whale grabs $39M in Ethereum as ETH bleeds – Recovery in sight?",
      "link": "https://ambcrypto.com/whale-grabs-39m-in-ethereum-as-eth-bleeds-recovery-in-sight/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika5-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is ETH gearing up for a stealth Q3 rally while everyone else panic sells?"
    }
  ]
}