{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: BTC Reclaims 100K as Markets Shrug off Iran Strike",
      "link": "https://www.coindesk.com/markets/2025/06/22/asia-morning-briefing-btc-reclaims-100k-as-markets-shrug-off-iran-strike",
      "summary": ""
    },
    {
      "title": "Solana's SOL Falls 8% as Traders Brace for Fallout From a Spike in Oil Price",
      "link": "https://www.coindesk.com/markets/2025/06/22/solana-s-sol-falls-over-8-as-traders-brace-for-fallout-from-a-spike-in-oil-price",
      "summary": ""
    },
    {
      "title": "Bitcoin Price Slips Below $100K, Hinting Oil-Led Risk-Off on Wall Street",
      "link": "https://www.coindesk.com/markets/2025/06/22/bitcoin-slips-below-usd100k-hinting-oil-led-risk-off-on-wall-street",
      "summary": ""
    },
    {
      "title": "Iran Mulls Closure of Strait of Hormuz; Digital Oil Memecoin Soars 400%",
      "link": "https://www.coindesk.com/markets/2025/06/22/iran-s-parliament-has-reportedly-approved-closure-of-strait-of-hormuz-digital-oil-memecoin-soars-400",
      "summary": ""
    },
    {
      "title": "ADA Takes a Hard Fall as Traders Feel the Heat of War in the Middle East",
      "link": "https://www.coindesk.com/markets/2025/06/22/ada-takes-a-hard-fall-as-traders-feel-the-heat-of-war-in-the-middle-east",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Traders watch XRP, ETH, SOL and HYPE now that Bitcoin trades below $100K",
      "link": "https://cointelegraph.com/news/traders-watch-xrp-eth-sol-and-hype-now-that-bitcoin-trades-below-100k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk4YTgtNjgyYi03MmM5LTkyZGEtNTcyNTkxMjQ0ZjM5.jpg\" /></p><p>Bitcoin’s drop below the $100,000 support pulled ETH, XRP, SOL, and HYPE lower, but a relief rally may be around the corner.</p>"
    },
    {
      "title": "Ethereum whale stacks $39M despite ETH falling harder than Bitcoin",
      "link": "https://cointelegraph.com/news/ethereum-whale-stacks-39m-eth-despite-ether-falling-harder-than-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk3MmMtMDI0NS03OWM3LTg2NzAtNzk3YThlYzYxZjJi.jpg\" /></p><p>Technical patterns point to a potential 25% rebound in Ether’s price, with whales scooping $263.5 million worth of ETH during the price dip.</p>"
    },
    {
      "title": "Intents fix crypto&#039;s UX crisis and pave the way for agentic DeFi",
      "link": "https://cointelegraph.com/news/intents-fix-crypto-ux-crisis?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM1OWMtNDZiMS03ODlkLTg3YTAtZWVmZDZmM2QyZDlj.jpg\" /></p><p>Intents overhaul crypto's clunky user experience by letting people state what they want while the system handles the complexity behind the scenes. This outcome-driven approach opens the door to mainstream adoption and agent-driven financial automation.</p>"
    },
    {
      "title": "Break Singapore’s new crypto rules and you could face $200K fine or jail",
      "link": "https://cointelegraph.com/explained/break-singapores-new-crypto-rules-and-you-could-face-200k-fine-or-jail?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy84NGJjMGNiYWM0NzFhZDFlZDMxNTVkMTg0NjZhMDRlYi5qcGc=.jpg\" /></p><p>Singapore is tightening its grip on crypto misconduct. Under new rules, unlicensed promotions or shady practices could lead to steep fines or prison time.</p>"
    },
    {
      "title": "Lummis’ RISE Act is ‘timely and needed’ but short on details",
      "link": "https://cointelegraph.com/news/rise-act-cynthia-lummis-needed-but-vague?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhkYjYtZDkzNS03ZTNkLWI2MjUtZDI5MGVmNDI1YTY5.jpg\" /></p><p>Senator Lummis’ RISE Act may be a good start, but does it ask too much of doctors, lawyers and engineers — while shielding AI developers?</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Gracy Chen, the rare but glorious woman behind Bitget’s epic growth",
      "link": "https://cryptoslate.com/gracy-chen-the-rare-but-glorious-woman-behind-bitgets-epic-growth/",
      "summary": "<p>Welcome to Slate Sundays, ’s weekly feature showcasing in-depth interviews, expert analysis, and thought-provoking op-eds that go beyond the headlines to explore the ideas and voices shaping the future of crypto. Gracy Chen leaves quite an impression. As the only female CEO among the top 10 crypto exchanges, she’s well aware of the challenges facing women [&#8230;]</p> <p>"
    },
    {
      "title": "Solana network extensions will redefine blockchain scaling",
      "link": "https://cryptoslate.com/solana-network-extensions-will-redefine-blockchain-scaling/",
      "summary": "<p>The following is a guest post and opinion from Aryan Sheikhalian, Head of Research at CMT Digital. Ethereum is betting big on a future filled with rollups. But in typical Solana fashion, the network is taking a different route—one that doesn’t just scale more blockspace, but bespoke execution environments with first-class developer control. Enter Network [&#8230;]</p> <p>"
    },
    {
      "title": "Oil markets tense amid U.S. airstrikes on Iran, while Bitcoin price holds steady",
      "link": "https://cryptoslate.com/oil-markets-tense-amid-u-s-airstrikes-on-iran-while-bitcoin-price-holds-steady/",
      "summary": "<p>Global oil markets are on high alert following U.S. airstrikes on three of Iran’s nuclear facilities, Fordow, Isfahan, and Natanz, with fears mounting over a potential closure of the critical Strait of Hormuz. The military action, announced by President Donald Trump last night, has intensified geopolitical tensions in the Middle East and raised concerns about [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto has grown up: Why the Rolex rally is on pause in 2025",
      "link": "https://cryptoslate.com/crypto-has-grown-up-why-the-rolex-rally-is-on-pause-in-2025/",
      "summary": "<p>The following is a guest post and opinion from Gracy Chen, CEO of Bitget. There was a time not too long ago when the pulse of the crypto market could be measured not only by candlestick charts but by the waitlists at luxury watch boutiques. During the 2020–2022 bull cycle, the correlation between Bitcoin and [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase CEO highlights 3 key reasons why the world needs crypto",
      "link": "https://cryptoslate.com/coinbase-ceo-highlights-3-key-reasons-why-the-world-needs-crypto/",
      "summary": "<p>As the world faces increasing economic woes from soaring debt and stubborn inflation to dwindling trust in financial institutions, Coinbase CEO says, “The world needs crypto, now more than ever.” He adds: “Debt is growing exponentially, inflation is crippling entire nations, economic freedom is declining.” Armstrong points to the astronomical level of U.S. federal debt, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "$96k Or $144k? Bitcoin Mayer Multiple Chart Price Target Options",
      "link": "https://www.newsbtc.com/news/bitcoin/96k-or-144k-bitcoin-mayer-multiple-chart-price-target-options/",
      "summary": "Bitcoin (BTC) has registered a slight uptick in the last few hours after US President Donald Trump announced a successful airstrike on Iranian nuclear facilities, a move aimed at de-escalating rising tensions in the Middle East after several days of conflict between Iran and Israel. Despite the short-term price reaction, BTC remains in a corrective phase, having struggled to break through the $110,000 resistance level over the past month with market sentiment being largely shaped by both global uncertainty and technical stagnation. Amid this backdrop, a crypto analyst with X pseudonym On-Chain College has highlighted two prospective price targets based on on-chain data. Related Reading: Bitcoin Price Breakdown Spurs Sell-Offs, Analyst Reveals What Will Happen If BTC Hits 92,800 Market Odds Favor Further Upside For Bitcoin &#8211; Analyst In a recent X post on June 21, On-Chain College shares a positive long-term Bitcoin price outlook using the Mayer Multiple, an on-chain metric that measures relationship between Bitcoin’s price and its 200-day moving average (200DMA). By tracking key valuation bands, the Mayer Multiple helps determine whether Bitcoin is overvalued, undervalued, or fairly valued, based on historical price behavior. Since the bull market commenced in Q4 2024, Bitcoin has consistently moved between 1.0x band i.e. the 200DMA (blue line) and the 1.5x band (orange line) representing the mid price range zone. Notably, the Bitcoin price struggles in the past have generated speculations of potential market top at the current market high. However, the Mayer Multiple chart shows that BTC has only ever attained a cycle price peak after hitting the 2.5x band (red line). Therefore, there is still room for price growth in the current bull market. However, the immediate price targets for premier cryptocurrency lies at $96,000 (1.0x) or $144,000 (1.5x). Notably, there is significant potential to rediscover its bullish form and surge towards $144,000 in line with its defined-range bound movement. However, there are also equal chances of a return to $96,000 which On-Chain College states would aid in flushing out weak hands before a full-scale bullish price reversal. Related Reading: XRP Daily New Addresses Plunge 80% In 2025 — Bearish On-Chain Metrics Raise Alarm Bitcoin Price Outlook At the time of writing, Bitcoin is valued at $102,700 following a 1.50% decline in the last 24 hours. Meanwhile, the maiden cryptocurrency also reports losses of 2.94% and 8.08% on the weekly and monthly chart, respectively. According to CoinCodex, the general market sentiment remains neutral. However, CoinCodex analysts foresee an impending price breakout with an audacious projection of $136,472 within the next five days. Interestingly, it’s worth noting that this level may represent or come close to the cycle market top, as long-term forecasts include $138,379 in three months and $116,115 in six months. Featured image from Pexels, chart from Tradingview"
    },
    {
      "title": "$312M ETH Transfer Triggers Sell-Off Fears As Ethereum Price Crashes Below Support",
      "link": "https://www.newsbtc.com/news/ethereum/312m-eth-ethereum-price/",
      "summary": "Blockchain tracking service Whale Alert posted a major alert showing that 129,392 ETH was transferred from an unidentified wallet to Coinbase as the Ethereum price tumbled. On-chain data from Etherscan shows that this particular wallet had not been involved in the transfer of large ETH volumes since November 2022. This sudden reactivation and deposit into a centralized exchange opens up speculation of a looming selloff, especially given the timing of the transfer. Massive ETH Transfer As Middle East Tensions Escalate Whale transaction tracker Whale Alerts, which initially reported the transfer on the social media platform X, noted that at the time of the transfer, these 129,392 ETH were worth $312,981,377. The timing of the transfer is noteworthy because it occurred when the price of Ethereum failed to hold above $2,500 and had already begun to struggle to stay above $2,400. Related Reading: XRP On-Chain Activity Down 80% In 5 Months, Experts Argue Bullish/Bearish Implications Etherscan&#8217;s tracking of on-chain transactions indicates that the unknown wallet &#8220;0xd47b,&#8221; which was involved in the transfer, has been relatively inactive since late 2022. Particularly, its last transaction was an inflow of 6,469 ETH from another wallet linked to Coinbase. The latest transfer into Coinbase leans more towards the possibility of a selloff through the exchange. Since then, the Ethereum price has lost a key support level at $2,450. Its price has fallen notably in the past 48 hours. Although other factors are clearly contributing to the dip, particularly new geopolitical tensions after the US launched attacks on Iran, this whale deposit into Coinbase may have increased the downward pressure. Exchange inflows of this magnitude are a precursor to liquidation, particularly now that investor sentiment is on edge. Bearish Setup Confirms Downside Targets The technical picture for Ethereum is now turning bearish, at least in the short term. Technical analysis of Ethereum&#8217;s 4-hour chart on the TradingView platform shows a clear bearish breakdown setup after Ethereum broke below a crucial support line at $2,362. That support level has now been breached, and confirmation of the breakdown amplifies a bearish case moving forward. Related Reading: Bitcoin Price Breakdown Spurs Sell-Offs, Analyst Reveals What Will Happen If BTC Hits 92,800 Chart Image From TradingView The chart above, which includes overlays of the Ichimoku Cloud, shows a fading bullish momentum in the past few days. Previous failed attempts to break resistance have left Ethereum in a vulnerable zone, and the recent whale selloff may have delivered the final push needed to trigger this leg down. If the current trajectory continues, Ethereum could be on its way to retesting lows below $2,000. According to the TradingView analysis, potential reversal targets are at $2,151 and $1,954, with a third possible level at $1,750 if the selloff is more than expected. At the time of writing, Ethereum is trading at $2,290, down by 5.5% and 10% in the past 24 hours and seven days, respectively. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Closes Daily Price Below 50MA – Final Bearish Signal?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-closes-daily-price-below-50ma-final-bearish-signal/",
      "summary": "Bitcoin (BTC) continues to experience an extensive price correction losing over 7% of its market value in the last month. The flagship cryptocurrency has struggled to regain its bullish form after setting a new all-time high leading to speculations of a potential market top. Interestingly, popular market analyst and the host of The Wolf of All Streets Podcast, Scott Melker has recently shared a market development that supports such bearish notions. Related Reading: Bitcoin CBD Heatmap Marks $95,500–$97,000 As Make-Or-Break Zone – Details Bitcoin Set For 26% Crash? In an X post on June 21, Scott Melker shares a cautionary insight on the Bitcoin market hinting at a bearish long-term outlook. The season analyst reports that data from TradingView shows that Bitcoin’s has now closed below the 50-day moving average (50 MA) on the daily trading chart, a development that last occurred two months ago when Bitcoin traded around $84,000. The 50MA is a commonly used technical indicator that represents the average closing price of an asset over the past 50 days. As a lagging indicator, it helps traders identify the prevailing market trend. When the price remains above the 50 MA, it typically signals a bullish trend, while a move below the 50 MA may indicate bearish momentum or a potential trend reversal. Interestingly, Melker notes that Bitcoin last lost the 50 MA as a support zone in early February trading around $100,000. However, the loss of this price floor triggered an immense selling pressure forcing Bitcoin into prolonged market correction to reach market low of $74,000 in April. Amidst the current market uncertainty, the recent daily price close below 50 MA strengthens bearish sentiments suggesting Bitcoin is due for another potential 26% crash. In that case, investors could expect a downside target of around $76,200. To invalidate such bearish projections, Bitcoin must continue to hold above the $100,000 resistance level, fueling the chances to retest the current all-time high, and perhaps re-enter price discovery mode. Related Reading: XRP On-Chain Activity Down 80% In 5 Months, Experts Argue Bullish/Bearish Implications Bitcoin Price Overview At press time, Bitcoin is trading at $102,889 after a 1.43% decline in the last day. In tandem, the asset’s daily trading volume has crashed by 29.30% and is presently valued at $35.15 billion. With a market cap of $2.02 trillion, the “digital gold” continues to rank as the largest cryptocurrency and fifth largest asset in the world. However, according to prominent market analyst Ali Martinez, Bitcoin may actually be slipping into bearish territory as similarly predicted by Scott Melker. Based on insights from the MVRV pricing bands, if the market lose the current support at $102,000, it opens the door to a potential decline toward $82,000. Featured image from Pexels, chart from Tradingview"
    },
    {
      "title": "Texas Just Backed Bitcoin: Best Crypto to Buy as States Embrace $BTC Reserves",
      "link": "https://www.newsbtc.com/news/texas-just-backed-bitcoin-best-crypto-to-buy-as-states-embrace-btc-reserves/",
      "summary": "On Saturday, Texas became the first-ever US state to commit public funds towards the purchase of Bitcoin. Governor Greg Abbott signed Senate Bill 21 (SB21), officially authorizing the establishment of the Texas Strategic Bitcoin Reserve. Keep reading to learn more about this development, increasing investor and government confidence in Bitcoin&#8217;s long-term potential, and what&#8217;s the best crypto to buy now in order to ride the upcoming crypto wave. Texas Passes Groundbreaking Bitcoin Reserve Bill &#8216;We can buy land, we can buy gold; I think the state of Texas should have the option of evaluating the best performing asset over the last 10 years.&#8217; This is what the Texas Bitcoin bill&#8217;s author, State Senator Charles Schwertner, said in February. Four months later, Texas has put its faith in the &#8216;digital gold&#8217; to strengthen its financials and act as an effective hedge against inflation. It&#8217;s worth noting that although Texas is the third US state to create a Bitcoin reserve (after Arizona and New Hampshire), it&#8217;s the first to create a publicly-funded reserve. Neither of the other two has allocated public funds for the purchase of Bitcoin. By putting actual taxpayer dollars into $BTC, Texas has not only officially recognized Bitcoin as a store of value but also signaled its unwavering trust and long-term commitment to the digital asset. A publicly-funded reserve is also likely to increase demand for Bitcoin. It&#8217;s also worth mentioning that large public companies like Michael Saylor’s Strategy have aggressively bought Bitcoin over the past few months. With here are some of the best new cryptos you can buy to benefit from Bitcoin&#8217;s growing acceptance among corporations and government agencies. 1. BTC Bull Token ($BTCBULL) – Best Crypto to Buy Now, Get Free $BTC Airdrops BTC Bull Token ($BTCBULL) is the best crypto to invest in if you want to eke out the maximum amount of returns possible from Bitcoin&#8217;s bull run. $BTCBULL&#8217;s biggest selling point is that it&#8217;s the ONLY crypto on the market right now, offering free (and completely legit) $BTC to its token holders. If you&#8217;re a $BTCBULL holder who has stored his tokens in Best Wallet, you&#8217;ll receive your share of free $BTC (depending on your $BTCBULL holdings) every time the king cryptocurrency reaches a landmark, such as $150K and $200K, for the first time. Thanks to its never-before-seen approach to rallying behind Bitcoin and community rewards, BTC Bull Token is predicted to explode 270% and reach $0.0096 by 2026. A huge reason behind this is the project&#8217;s deflationary model, which will burn a part of the total $BTCBULL token supply at regular intervals, creating a supply shortage and hiking prices. The best part? $BTCBULL is currently in presale, where it has raised over $7.2M. Each token is priced at $0.002575, and here&#8217;s how to buy it. 2. Bitcoin Hyper ($HYPER) – Building Layer 2 on Bitcoin for Scalability &#38; Fast Transactions Despite being the OG blockchain, Bitcoin has been struggling with slow transaction speeds and high fees, as well as limited compatibility with decentralized applications and Web3. Enter Bitcoin Hyper ($HYPER). By building a Bitcoin Layer 2 and connecting it to the Layer 1 using a Canonical Bridge and Solana Virtual Machine (SVM) integration, Bitcoin Hyper aims to bring programmability and scalability to the Bitcoin ecosystem. Plus, it will do so without impacting the network&#8217;s security and decentralization benefits. Here&#8217;s how it works: You send $BTC through the Canonical Bridge, which converts it into wrapped $BTC on the L2. You can use wrapped $BTC to access high-speed DeFi apps, pay for transactions on the L2, etc. When you&#8217;re done, just raise a withdrawal request on the L2 network. It will again use a smart contract to verify the transaction and convert wrapped $BTC back to original $BTC. Luckily for you, one $HYPER is currently available for just $0.011975 (the token could soar 2,000% by 2030), and the project has in total raised over $1.5M. Here&#8217;s how to buy it. 3. Tutorial ($TUT) – Educating Folks About Everything Crypto Tutorial ($TUT) has been one of the biggest beneficiaries of crypto&#8217;s growth and increasing awareness among the masses. That&#8217;s because it&#8217;s an AI-powered tool that educates people about different crypto-related topics and tools, including setting up a crypto wallet. Other &#8216;tutorials&#8217; in its repertoire include teaching people how to write smart contracts, trade on the best decentralized exchanges, and learn everything there is to know about the BNB chain ecosystem. $TUT has been on a sensational run of late, gaining more than 25% over just the past 7 days. It&#8217;s currently trading at $0.03583, offering a discounted entry point before it explodes to mimic crypto&#8217;s rise. As States Back $BTC, Altcoins Emerge as Attractive Investments With regulated, state-backed crypto holdings becoming increasingly mainstream, we&#8217;re clearly headed towards a world where diversified crypto assets (the best altcoins included) are looked at as both stores of value and investment opportunities. However, make sure you do your own research and due diligence before investing in crypto. The market is highly uncertain, and our article isn&#8217;t financial advice."
    },
    {
      "title": "Bears Will Be Washed Out Of Bitcoin If This Happens",
      "link": "https://www.newsbtc.com/news/bitcoin/bears-washed-out-bitcoin/",
      "summary": "Bitcoin’s narrow price movement over the past week contradicts a much different development in the futures market. According to Axel Adler Jr., an analyst at on-chain analytics platform CryptoQuant, a sharp rise in the long liquidation dominance metric could set the stage for a significant shift in sentiment that may completely wash out bears from the market. Adler shared the data in a recent post on X, accompanied by a chart showing previous points that resemble the current setup. Long Liquidation Spike Without Price Crash The dominance of long liquidations has jumped from 0% to +10% over the past seven days, a move that typically shows distress among bullish traders. However, what makes the current development especially noteworthy is the absence of a steep crash in Bitcoin’s price. Instead, in the just concluded week, Bitcoin held mostly within the $103,000 to $106,000 range until a recent drop, despite facing increasing pressure from long-side liquidations. Related Reading: XRP Daily RSI Trendline Breaks Down – What It Means For Price Axel Adler Jr. explained that this sustained liquidation of long positions without a full-blown price collapse indicates sustained buyer support. According to data from CryptoQuant, BTC’s long liquidations hit 2,200 BTC, the highest in the past week. Usually, a surge in long liquidations suggests that traders who were anticipating a price rally are being pushed out of their positions under pressure. The CryptoQuant chart below shows how spikes in long liquidation dominance, especially in the 15% to 20% range, have always preceded bullish reversals. According to the analyst, if this metric rises by another 5–7%, it could cause a high-probability scenario where bearish positions are washed out and flip Bitcoin’s price movements in favor of the bulls. Image From X: @AxelAdlerJr Large Wallets Accumulate As Retail Exits Data from Santiment, another on-chain analytics platform, shows an interesting dynamic playing out among Bitcoin holders. Over the past ten days, wallets holding over 10 BTC have increased by 231 addresses, which is a 0.15% rise. Meanwhile, smaller retail wallets containing between 0.001 and 10 BTC have dropped by 37,465 in the same timeframe. This trend highlights a divergence in sentiment between large and retail holders. Related Reading: XRP Price Crash Tests Critical Support At $2.1, Will It Break? According to Santiment, the shift where whales and sharks accumulate while retail exits is a bullish combination for Bitcoin. Bitcoin’s market value is hovering just below $104,000 during this accumulation phase, and there could be an eventual upward breakout once retail holders begin to reenter. Image From X: Santiment Despite the underlying on-chain strength, Bitcoin’s spot price has taken a short-term hit in the past 48 hours. During this timeframe, Bitcoin&#8217;s price has slipped below support levels between $106,000 and $103,000. At the time of writing, Bitcoin is trading at $102,670, down by 2.6% in the past 24 hours. The decline can be largely attributed to recent U.S. strikes on Iran. The U.S. military strikes on Iranian nuclear facilities (June 21-22) caused immediate risk aversion across markets. Bitcoin fell 3.2% after announcements of the strikes, much like its 6% drop during similar 2020 Iran tensions. Featured image from Dall.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Norway Plans to Temporarily Ban New Bitcoin & Crypto Mining Centers to Conserve Energy",
      "link": "https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/NBX-Acquires-Bitcoin-Becomes-First-Public-Bitcoin-Treasury-Company-in-Norway.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy\" rel=\"nofollow\">Norway Plans to Temporarily Ban New Bitcoin &amp; Crypto Mining Centers to Conserve Energy</a></p> <p>Norway’s government will temporarily block the development of new Bitcoin and cryptocurrency mining facilities starting this year, prioritizing energy for other industries.</p> <p>"
    },
    {
      "title": "A Seed Phrase Isn’t Self Custody, It’s A Liability.",
      "link": "https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/seedlessheader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability\" rel=\"nofollow\"> </a></p> <p>Seed phrases were an improvement a decade ago. They’re long overdue for an upgrade.</p> <p>"
    },
    {
      "title": "Is the 4-Year Bitcoin Cycle Over? Rational Root Explains Why This Time Might Not Be Different",
      "link": "https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Is-the-4-Year-Bitcoin-Cycle-Over-Rational-Root-Explains.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root\" rel=\"nofollow\"> </a></p> <p>Rational Root joins Pro to debate whether the 4-year Bitcoin cycle is breaking down in the age of ETFs, passive flows, and institutions.</p> <p>"
    },
    {
      "title": "What Happens to Bitcoin When Quantum Computers Arrive?",
      "link": "https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ChaincodeReportHeader-fotor-20250620123039.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive\" rel=\"nofollow\"> </a></p> <p>A high level overview of the recent report by Chaincode Labs on the threat quantum computing poses to Bitcoin. </p> <p>"
    },
    {
      "title": "Coinbase Secures MiCA License to Serve 450 Million Europeans",
      "link": "https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans\" rel=\"nofollow\"> </a></p> <p>Coinbase has obtained its Markets in Crypto Assets (MiCA) license from Luxembourg&#8217;s Commission de Surveillance du Secteur Financier (CSSF), marking a significant regulatory milestone that enables them to offer its complete range of services across all 27 European Union member states. The license allows Coinbase to serve approximately 450 million Europeans under a unified regulatory [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin Rebounds as Markets Price in 'Short-Lived' Iran Conflict",
      "link": "https://decrypt.co/326424/bitcoin-rebounds-markets-price-short-lived-iran-conflict",
      "summary": "Bitcoin rose back above $100,000 as markets shrugged off U.S. strikes on Iran, with oil and equities remaining largely unchanged."
    },
    {
      "title": "This Week in Crypto Games: B3's Self-Destruct PC, Avalanche Battle Pass",
      "link": "https://decrypt.co/325851/this-week-crypto-games-self-destruct-pc-avalanche-battle-pass",
      "summary": "Ethereum gaming protocol B3 is launching a PC with self-destruct storage, Avalanche dropped a battle pass with rewards for players, and more."
    },
    {
      "title": "7 Classic Video Games That Defined Their Consoles",
      "link": "https://decrypt.co/326159/7-classic-video-games-defined-consoles",
      "summary": "From analog sticks to motion controls, these are the games that didn’t just launch on a console; they defined what it could do."
    },
    {
      "title": "Bitcoin Plunges Below $100K as XRP and Dogecoin Prices Hit 2-Month Lows",
      "link": "https://decrypt.co/326405/bitcoin-plunges-below-100k-xrp-dogecoin",
      "summary": "Following U.S. strikes on Iran nuclear facilities, crypto prices are falling harder, with Bitcoin diving below $100K and Ethereum down 10%."
    },
    {
      "title": "Which Crypto IPOs Could Be Next Following Circle?",
      "link": "https://decrypt.co/326369/which-crypto-ipos-could-be-next-following-circle",
      "summary": "Following Circle’s hugely successful IPO, big names in the crypto industry are preparing listings as investor demand soars."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin crashes as Iranian Parliament approval of Hormuz Strait closure threatens oil disruption, stokes global inflation",
      "link": "https://cryptobriefing.com/bitcoin-oil-disruption-inflation/",
      "summary": "<p>The potential closure of the Strait of Hormuz could trigger global economic instability, with rising oil prices exacerbating inflationary pressures.</p> <p>"
    },
    {
      "title": "Trump announces US airstrikes on Iran’s nuclear sites, Bitcoin dumps, then pumps",
      "link": "https://cryptobriefing.com/us-iran-airstrikes-nuclear-sites/",
      "summary": "<p>The airstrikes heighten geopolitical tensions, potentially destabilizing the region and impacting global markets and cryptocurrency volatility.</p> <p>"
    },
    {
      "title": "Texas governor signs Bitcoin reserve bill into law",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-law/",
      "summary": "<p>Texas' Bitcoin reserve law could bolster financial resilience and set a precedent for other states to integrate crypto into fiscal strategies.</p> <p>"
    },
    {
      "title": "CoinMarketCap’s front-end compromised, investigation underway",
      "link": "https://cryptobriefing.com/coinmarketcap-security-breach-investigation/",
      "summary": "<p>This incident highlights the urgent need for enhanced cybersecurity measures in the crypto industry to protect user assets and data integrity.</p> <p>"
    },
    {
      "title": "Texas governor signs bill to protect state Bitcoin reserve as a permanent fund if established",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-protection-bill/",
      "summary": "<p>Texas' move to protect a potential Bitcoin reserve could set a precedent for state-level crypto asset management, influencing future fiscal policies.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Injective slumps 12% – Assessing if you should buy INJ now",
      "link": "https://ambcrypto.com/injective-slumps-12-traders-should-you-buy-now-assessing/",
      "summary": "<img alt=\"INJ\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250622_130948_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />INJ long-term holders return, shaking up the market."
    },
    {
      "title": "Bitcoin spot volume soars 10X, yet traders should be cautious – Why?",
      "link": "https://ambcrypto.com/bitcoin-spot-volume-soars-10x-yet-traders-should-be-cautious-why/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-22T130900.596-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Binance’s dominance surges, but cooling network metrics and rising inflows could threaten Bitcoin’s upside."
    },
    {
      "title": "Crypto market’s weekly winners and losers – KAIA, BCH, SPX, FARTCOIN",
      "link": "https://ambcrypto.com/crypto-market-weekly-review-22-june/",
      "summary": "<img alt=\"Crypto weekly winner and loser\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika2-6.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here’s how some of your favorites wrapped up the week."
    },
    {
      "title": "Celestia: THESE signs reveal why TIA inflows surged despite BTC’s fall",
      "link": "https://ambcrypto.com/celestia-these-signs-reveal-why-tia-inflows-surged-despite-btcs-fall/",
      "summary": "<img alt=\"Celestia: Downturn? No, THESE signs reveal why TIA inflows surged despite Bitcoin’s fall\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250622_095816_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TIA drops 11%, but whales may be loading up, know why!"
    },
    {
      "title": "Bitcoin: Amid U.S.- Iran conflict, can BTC hold $100K, if so, what next?",
      "link": "https://ambcrypto.com/bitcoin-amid-u-s-iran-conflict-can-btc-hold-100k-if-so-what-next/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-15.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Macro FUD strikes back. What’s next for Bitcoin at $100k?"
    }
  ]
}