{
  "CoinDesk": [
    {
      "title": "NEAR Protocol Plunges 5% as Resistance Holds, Bitwise ETP Launches",
      "link": "https://www.coindesk.com/markets/2025/07/04/near-protocol-plunges-5-as-resistance-holds-bitwise-etp-launches",
      "summary": ""
    },
    {
      "title": "Bank of Canada Identifies Technical Path for Retail CBDC in New Research Paper",
      "link": "https://www.coindesk.com/business/2025/07/04/bank-of-canada-identifies-technical-path-for-retail-cbdc-in-new-research-paper",
      "summary": ""
    },
    {
      "title": "BONK Eyes Breakout as ETF Buzz and Burn Trigger Spark Fresh Rally",
      "link": "https://www.coindesk.com/markets/2025/07/04/bonk-eyes-breakout-as-etf-buzz-and-burn-trigger-spark-fresh-rally",
      "summary": ""
    },
    {
      "title": "Hackers Behind $140M Brazil Banking Heist Turn to Crypto to Launder Their Loot",
      "link": "https://www.coindesk.com/business/2025/07/04/hackers-behind-usd140m-brazil-banking-heist-turn-to-crypto-to-launder-their-loot",
      "summary": ""
    },
    {
      "title": "ATOM Tumbles 4% as Sellers Target Critical $4 Support Level",
      "link": "https://www.coindesk.com/markets/2025/07/04/atom-tumbles-4-as-sellers-target-critical-usd4-support-level",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin treasury playbook faces ‘far shorter lifespan’ — Analyst",
      "link": "https://cointelegraph.com/news/bitcoin-treasury-strategy-plan-limited-lifespan-forecast-crypto-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzUwNzYtYmZjMi03MTY5LTljY2YtODliMzc3ZGMyMDVm.jpg\" /></p><p>Crypto analyst James Check says the Bitcoin treasury strategy is getting to the point where new firms will find it hard to gain momentum “without a serious niche.”</p>"
    },
    {
      "title": "Bitcoin price falls to $107K despite $1B spot BTC ETF inflow — What’s behind the move?",
      "link": "https://cointelegraph.com/news/bitcoin-price-falls-to-dollar107k-despite-dollar1b-btc-etf-inflow?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Q3NzYtZmM4OC03MDc5LWJmYTAtNjY2MzRhZDViOGUx.jpg\" /></p><p>Bitcoin's pullback reflects the market’s anxiety about the US economy and dormant BTC wallets shifting billions worth of BTC.</p>"
    },
    {
      "title": "Brazil’s central bank service provider hacked, $140M stolen",
      "link": "https://cointelegraph.com/news/brazil-central-bank-service-provider-hacked-140-million?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Q3MTUtOWI3Ny03Y2M3LTkyNGEtN2E2NDc5YjViZWJi.jpg\" /></p><p>The theft occurred after the hackers allegedly compromised an employee of C&amp;M, a software service provider, by buying the employee’s login credentials.</p>"
    },
    {
      "title": "Sweden’s justice minister says to ‘turn up the pressure’ on crypto seizures",
      "link": "https://cointelegraph.com/news/sweden-pressure-crypto-confiscated?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWQ5NTAtMDhjMC03YzdkLTlhOGYtNTFkNTE4ZmY3ODAx.jpg\" /></p><p>Gunnar Strömmer reportedly said that Swedish authorities had confiscated more than $8.3 million worth of criminal profits since a law related to seizures was passed in 2024.</p>"
    },
    {
      "title": "Crypto Biz: Peter Thiel eyes the SVB throne",
      "link": "https://cointelegraph.com/news/peter-thiel-erebor-bank-svb-collapse-crypto-startups?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Q2MjAtYmEyOC03YjViLTg3MTktMWRhZmFlOGJjNzg3.jpg\" /></p><p>Peter Thiel and other billionaires are planning Erebor, a new bank to fill the void left by Silicon Valley Bank’s collapse — with crypto firms and startups in focus.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Hackers steal $140M from Brazilian central bank reserve accounts via partner breach",
      "link": "https://cryptoslate.com/hackers-steal-140m-from-brazilian-central-bank-reserve-accounts-via-partner-breach/",
      "summary": "<p>Hackers siphoned about R$800 million ($140 million) from six reserve accounts connected to Brazil’s central bank after breaching São Paulo-based software vendor C&#38;M Software on June 30, according to blockchain investigator ZachXBT and reports from local news outlets. Police said C&#38;M employee João Nazareno Roque sold his corporate login for R$15,000 ($2,770) and later developed [&#8230;]</p> <p>"
    },
    {
      "title": "Turkey blocks access to PancakeSwap, 45 crypto websites in regulatory crackdown",
      "link": "https://cryptoslate.com/turkey-blocks-access-to-pancakeswap-45-crypto-websites-in-regulatory-crackdown/",
      "summary": "<p>Turkish financial regulators have blocked access to decentralized exchange PancakeSwap and 45 other crypto-related websites as part of a broader crackdown on unauthorized digital asset services. In a July 3 bulletin, the Capital Markets Board (SPK) announced legal action against the websites, citing provisions of Turkey’s Capital Markets Law. The regulator said the targeted platforms [&#8230;]</p> <p>"
    },
    {
      "title": "Investor poll shows 73% approval for Trump’s crypto policy, bullish views on prices increase",
      "link": "https://cryptoslate.com/investor-poll-shows-73-approval-for-trumps-crypto-policy-bullish-views-on-prices-increase/",
      "summary": "<p>Over 70% of US crypto investors approve of President Donald Trump&#8217;s administration&#8217;s approach to crypto policy, according to a recent survey conducted by research firm HarrisX. HarrisX polled 1,096 adults online from June 18 to June 19, including 230 self-identified crypto investors. Among that cohort, 81% said they follow the administration&#8217;s crypto actions, 73% approved of the [&#8230;]</p> <p>"
    },
    {
      "title": "Russian defense conglomerate Rostec to launch ruble-pegged stablecoin on TRON",
      "link": "https://cryptoslate.com/russian-defense-conglomerate-rostec-to-launch-ruble-pegged-stablecoin-on-tron/",
      "summary": "<p>Rostec, the Russian defense and technology conglomerate, announced on July 3 that it will introduce a ruble-pegged stablecoin and a linked payment network this year, utilizing Tron infrastructure. According to the Russian news agency TASS, Rostec named the token RUBx and set a one-to-one exchange rate with the ruble. Deputy General Director Alexander Nazarov stated that the corporation [&#8230;]</p> <p>"
    },
    {
      "title": "Trump-backed World Liberty Financial seeks community vote on token mobility",
      "link": "https://cryptoslate.com/trump-backed-world-liberty-financial-seeks-community-vote-on-token-mobility/",
      "summary": "<p>World Liberty Financial, the decentralized finance platform linked to U.S. President Donald Trump’s family, has unveiled a proposal that would allow its WLFI governance token to become transferable and tradeable across the wider crypto market. Currently confined within its own protocol, the WLFI token cannot be traded externally, restricting price discovery and limiting participation in [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Shiba Inu Supply Most Centralized Among Top Coins—62% Held By Just 10 Whales",
      "link": "https://www.newsbtc.com/shiba-inu-news/shiba-inu-centralized-top-coins-62-just-10-wallets/",
      "summary": "On-chain data shows Shiba Inu (SHIB) has its supply more concentrated on the largest holders than other assets like Ethereum (ETH) and Pepe (PEPE). Shiba Inu Has 62% Of Its Supply Controlled By Top 10 Whales In a new post on X, the on-chain analytics firm Santiment has shared how some top coins currently compare against each other in terms of the percentage of supply held by the ten largest wallets on the respective networks. Below is a chart showing the trend in this metric for eight cryptocurrencies: Shiba Inu, Ethereum, Pepe, USDT, USDC, DAI, Chainlink (LINK), and Uniswap (UNI). As is visible in the graph, the stablecoin USDC has the lowest amount of supply concentrated on the top 10 addresses among these assets at around 27%. Chainlink and DAI come close with the metric sitting at 32% and 33%, respectively. Others like Uniswap and Ethereum, however, have a more significant part of their supply under the control of these humongous entities: 51% and 49%, respectively. One asset that particularly stands out is Shiba Inu, with a massive 62% of its supply belonging to the ten largest whales on the network. For comparison, the other memecoin on the list, Pepe, has the same metric at 39%. Generally, the centralization of supply on just a few hands isn&#8217;t a constructive sign for any cryptocurrency&#8217;s stability, as tokens signify power on the network. It&#8217;s especially relevant in the case of a proof-of-stake (PoS) asset like Ethereum. As Santiment explains, As a retail trader, it&#8217;s generally safer to hold coins with less supply held by the most elite whales. There is less risk of sudden dumps or price manipulation should an asset&#8217;s largest whales decide to exit their positions. Given this, the assets like Ethereum, Uniswap, and Shiba Inu that currently have a majority of their supply or close to it in the hands of the top 10 whales may not be in the best position right now. In some other news, the cryptocurrency market sentiment is on the verge of extreme greed, according to the Fear &#38; Greed Index. The Fear &#38; Greed Index is an indicator created by Alternative that inputs a few different factors to determine the investor mentality as a score lying between zero and hundred. As displayed above, the cryptocurrency Fear &#38; Greed has a value of 73 at the moment. This corresponds to the presence of a strong sentiment of greed present among the traders. Historically, markets have often moved in the direction that goes contrary to the expectations of the crowd. The probability of a contrary move is especially strong in the extreme ends of the index. For now, the market is still outside of the extreme greed zone, but only by a couple of units. SHIB Price At the time of writing, Shiba Inu is trading around $0.0000115, up over 3% in the last seven days. Featured image from Dall-E, Alternative.me, chart from TradingView.com"
    },
    {
      "title": "Ethereum Approaches Wyckoff ‘Liftoff’ Phase – Can ETH Reach A New High?",
      "link": "https://www.newsbtc.com/ethereum-news/ethereum-approaches-wyckoff-liftoff-phase-can-eth-reach-a-new-high/",
      "summary": "Ethereum (ETH) is up 4.2% over the past seven days, trading in the mid-$2,500 range at the time of writing. Although the digital asset remains down 19% on a year-over-year (YoY) basis, some analysts are optimistic that it’s ready for a liftoff. Ethereum Enters Wyckoff ‘Liftoff’ Phase In an X post published today, crypto trader Merlijn The Trader noted that Ethereum appears to be following the Wyckoff Accumulation pattern and has successfully cleared both the ‘creek’ and ‘spring’ phases, potentially entering the ‘liftoff’ phase characterized by parabolic price action. Related Reading: Ethereum Breakout Imminent? Broadening Wedge Hints At $4,200 Surge In the Wyckoff accumulation pattern, the ‘creek’ represents overhead resistance where price struggles to break higher, while the ‘spring’ is a false breakdown below support, meant to trap bears and confirm strong hands. The ‘liftoff’ phase follows the spring, marked by a sharp recovery and breakout above resistance, signaling the start of a new bullish trend. The analyst shared the following Ethereum daily chart, which shows the cryptocurrency on the verge of a potential breakout, with its next major resistance at the $3,700 level. A successful breakout and retest of this level could set the stage for a new all-time high (ATH). Fellow crypto analyst Crypto GEMs also pointed toward Ethereum getting ready for a significant move to the upside. The analyst shared the following chart which compares ETH’s price action in 2025 to that in 2024. If Ethereum mirrors its 2024 performance, it could break above the $3,000 mark in the near term. However, not all analysts share this bullish outlook. For instance, noted crypto analyst Carl Moon shared a four-hour Ethereum chart showing the asset trading within a rising wedge pattern. He cautioned that unless ETH breaks out of this formation, it may face a drop to $2,200. To explain, a rising wedge pattern is a bearish chart formation where price moves upward within converging trendlines, indicating weakening bullish momentum. It often signals an upcoming breakdown, as buyers lose control and sellers push the price lower after the wedge is breached. ETH Network Sees Renewed Activity In a separate X post, crypto analyst CryptoGoos remarked that daily transactions on Ethereum are nearing ATH level for the first time since 2021. Typically, heightened network activity tends to precede major price movements. Analyst Crypto Rover echoed this view, noting that active addresses across the Ethereum network have hit a new all-time high. They added that ETH below $3,000 is &#8220;an absolute steal.&#8221; Related Reading: Ethereum Flashes Golden Cross On Daily Chart – Is A New ATH Within Reach? Meanwhile, Ethereum liquid staking is also inching toward historic levels, with 35.5 million ETH now locked. At press time, ETH trades at $2,522, down 3.8% in the past 24 hours. Featured image from Unsplash, charts from X and TradingView.com"
    },
    {
      "title": "Dogecoin Social Surge: Rising Buzz And Network Use Spark New Interest",
      "link": "https://www.newsbtc.com/altcoin/dogecoin-social-surge-rising-buzz-and-network-use-spark-new-interest/",
      "summary": "Dogecoin’s price action caught traders’ attention this week. After dipping toward the $0.13–$0.15 demand zone, the meme‑coin shot higher, and a surge in derivatives data suggests many expect more gains. Related Reading: Ethereum Network Awakens—Massive On-Chain Moves Signal What’s Coming Trader Interest Climbs Around $0.19 Resistance According to market data, Open Interest jumped by 16% to reach over $2 billion. Options volume exploded by 400%. That kind of rise often points to big bets on upward swings. Right now, many eyes are on the $0.20 resistance level. If DOGE can close a daily candle above that line, it may clear the way toward $0.27. Dogecoin’s technical setup is drawing fresh looks from chart watchers. The Stochastic RSI crossed above 80, which can mark an overbought zone. Yet coins have stayed above overbought readings before when buyers kept pushing. Traders will want to see real volume behind any move above that descending trendline near $0.19. Without it, the rally may stall or give back gains. Whales Return With Spot Inflows Based on reports, Dogecoin saw a net inflow of $8.20 million into spot wallets. That marks a big shift after weeks of outflows. Large holders have been moving coins onto exchanges in the past, but now they’re pulling more in. In other cycles, fresh whale buys have lined up with mid‑term rallies. On‑chain metrics add another layer. Dogecoin’s MVRV Z‑score climbed back to 0.355 after hitting near‑historical lows late in June. That figure measures how much profit holders stand to make on average. A rising score hints that fewer holders are underwater, and that might draw in new buyers. Still, MVRV is backward‑looking. It can’t predict if price will break through key resistance. Network Activity Shows Mixed Signals Network stats tell a mixed story. Daily active addresses slid to 34 K, and transaction counts dropped to 15K as of July 3. That’s a sharp fall from the more than 500K addresses and transactions seen in the last week of June. Lower usage could sap the rally’s legs if retail traders don’t reengage soon. Related Reading: The Silent Bitcoin Accumulation: Public Companies’ Surprising H1 2025 Lead Even with these mixed signals, the mood toward Dogecoin is brighter than it was a week ago. Traders piling into options and hikes in Open Interest show speculative appetite is up. Large spot inflows show that whales have stepped back in. But network usage is lagging. If daily addresses and transactions don’t bounce back, bulls may find it harder to sustain the push. Featured image from Meta, chart from TradingView"
    },
    {
      "title": "Whales Are Loading Up on Chainlink (LINK), But Retail Investors Are Still Missing the Signal",
      "link": "https://www.newsbtc.com/news/chainlink/whales-are-loading-chainlink-link-but-retail-investors-are-still-missing-the-signal/",
      "summary": "Chainlink (LINK) is trading at $13.36, following a 3% drop in the past 24 hours, which places the altcoin approximately 74% below its all-time high of $52.70, recorded in May. Despite this short-term dip, LINK has held onto weekly gains of around 2.4%, suggesting broader market participants may still be weighing its long-term potential. While price remains rangebound, recent on-chain data indicates that LINK’s price action could be the result of diverging behavior between retail and institutional investors. Related Reading: Chainlink (LINK) On Standby: Bitcoin’s Next Move Holds The Key Chainlink Institutional Accumulation and Supply Pressure CryptoQuant contributor “Banker” highlighted a growing structural dynamic in the LINK ecosystem in a recent QuickTake analysis titled “LINK’s Accumulation Standoff: Whales Build, Retail Waits.” The report outlines how LINK is currently in a consolidation phase between $12 and $15, where institutional actors have been steadily accumulating tokens, while retail users remain largely passive. This discrepancy may be playing a key role in capping upward momentum despite persistent LINK outflows from centralized exchanges. According to Banker, exchange netflows for LINK have remained negative at roughly -100,000 LINK per week, signaling that more tokens are being withdrawn from trading platforms than deposited. This behavior is typically associated with accumulation activity, particularly from larger holders or “whales” who may be positioning for longer-term appreciation. Historical spikes in retail deposits, such as the +5 million LINK deposited in March 2025, have proven to be exceptions rather than the norm, as retail activity has since remained subdued. Supporting this view, active LINK addresses have hovered consistently between 28,000 and 32,000 per day, while transaction counts average around 9,000 daily. These figures have not rebounded from previous activity peaks seen in late 2024, even as Chainlink’s oracle usage has expanded. Meanwhile, elevated levels of exchange withdrawals, peaking at over 3,000 per day in Q4 2024, remain a dominant force. With leverage metrics staying neutral, whales have been able to withdraw LINK without introducing significant price volatility, resulting in a 40% year-to-date drop in exchange reserves. Market Outlook Hinges on Retail Reentry or Whale Fatigue As LINK’s consolidation persists, the path forward may depend on a shift in market dynamics. Banker points out that a meaningful breakout will likely require renewed participation from retail traders, as evidenced by a spike in active wallet addresses and transaction volume. Related Reading: Chainlink Holders Set Record As 1-Yr MVRV Signals ‘Opportunity’ If these metrics rise and price breaks above the $15 price mark, momentum could build for a stronger upward trend. On the other hand, a decline in whale-driven withdrawals or an increase in exchange inflows could weaken accumulation, potentially pushing LINK back down toward the $10 level. Banker added: Until catalysts emerge, whales silently build positions, echoing Bitcoin’s 2023 consolidation before its 2024 surge. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "XRP’s Time Is Now, Says Pundit—Don’t Snooze On The ‘Biggest Transfer Of Wealth’",
      "link": "https://www.newsbtc.com/altcoin/xrps-time-is-now-says-pundit-dont-snooze-on-the-biggest-transfer-of-wealth/",
      "summary": "Proponents of XRP are stepping up their pitch this week, calling the token “one of the greatest wealth transfers in history.” They argue it’s more than just another crypto. You’ll hear claims that XRP is already reshaping global finance and leaving old systems in the dust. According to influencer Coach JV, Ripple is building a whole new rails for money. He says XRP isn’t here to compete with banks. It’s here to replace them. Related Reading: Ethereum Network Awakens—Massive On-Chain Moves Signal What’s Coming He points out that transactions on the XRP Ledger settle in 3–5 seconds and cost fractions of a penny. That beats SWIFT transfers, which can take days and cost up to $50 per payment. XRP still trades around $2,25 but that figure, he argues, won’t stay low for long if the token keeps winning regulatory approvals and new partners. XRP is the most disruptive financial technology of our lifetime. Ripple isn’t just competing with the banking system, it’s replacing it. The old system is dead. The new financial rails are being laid right before your eyes. Stay asleep and you’ll miss the greatest wealth transfer… — Coach, JV (@Coachjv_) July 2, 2025 Ripple’s Technology Versus Legacy Rails Based on reports, RippleNet now counts more than 300 financial institutions in its network. Yet daily on‑chain volumes for XRP hover around $1 billion—small next to global cross‑border flows of roughly $150 billion per day. Banks are testing the tech, but most haven’t shifted large sums yet. That gap between tests and real‑world use is one reason XRP’s price has stayed below its all‑time high for seven years. Push For Regulatory Clarity XRP backers are watching the US carefully. They see growing buzz around spot XRP ETFs. Analysts like Eric Balchunas have given those filings up to 95% odds of approval by year‑end. If an ETF hits a US exchange, they say, more money will pour in. Ripple has also been chasing money‑transmitter licenses in Europe and Asia. Every new license, they believe, brings Ripple a step closer to mainstream use. Community Calls For Patience Coach JV keeps telling followers not to panic over a stagnant price. He uses phrases like “greatest wealth transfer in history” to drive home his point. In an earlier tweet, he promised “unimaginable wealth” for anyone who holds on. Other voices, such as commentator Edoardo Farina, point out that only about 1 to 2 million people hold XRP today. That number, they say, leaves room for 100 million or more newcomers—and more buyers often means higher prices. Related Reading: The Silent Bitcoin Accumulation: Public Companies’ Surprising H1 2025 Lead Analysts Caution Over Hype Even so, some experts urge caution. They note that bold forecasts don’t guarantee buy‑in from big banks or regulators. An ETF approval won’t force funds to rush in overnight. And test programs don’t always turn into full rollouts. For now, XRP remains a high‑risk play. Investors should track on‑chain metrics and regulatory milestones before getting swept up in the hype. Featured image from Meta, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Treasury Companies Are Bubbles",
      "link": "https://bitcoinmagazine.com/bigread/the-bitcoin-treasury-companies-bubble",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/BM-Big-Read-07-04-25.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/bigread/the-bitcoin-treasury-companies-bubble\" rel=\"nofollow\"> </a></p> <p>BM Big Read: You are the yield that the bitcoin treasury companies are chasing. Their earnings stem not from revenue but from new investors.</p> <p>"
    },
    {
      "title": "Why Liquidity Matters More Than Ever For Bitcoin",
      "link": "https://bitcoinmagazine.com/markets/why-liquidity-matters-for-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Why-Liquidity-Matters-More-Than-Ever-For-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/why-liquidity-matters-for-bitcoin\" rel=\"nofollow\"> </a></p> <p>Global M2 vs. BTC: A key chart showing how liquidity drives Bitcoin's price, with historical rallies tied to M2 expansions.</p> <p>"
    },
    {
      "title": "Senator Lummis’ New Bill Enables Tax-Exempt Bitcoin Spending — But Thresholds Are Too Low",
      "link": "https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Senator-Lummis-at-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start\" rel=\"nofollow\"> </a></p> <p>Long-time Bitcoin advocate Senator Cynthia Lummis (R-WY) has drafted a bill that allows Bitcoin enthusiasts to spend small amounts of bitcoin without incurring capital gains taxes (which is very cool), but many — including myself — feel that the spending limits in the bill are too low.</p> <p>"
    },
    {
      "title": "Senator Lummis Introduces Digital Asset Tax Legislation",
      "link": "https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/US-Senator-Cynthia-Lummis-Discusses-Bitcoin-Reserve-Stablecoin-Legislation-and-Market-Structure-Bill-at-Bitcoin-2025-Conference.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation\" rel=\"nofollow\"> </a></p> <p>The bill proposes a $300 exemption for small Bitcoin and crypto transactions, defers taxes on mining and staking until assets are sold.</p> <p>"
    },
    {
      "title": "Bitcoin Miner Riot Produces 450 Bitcoin In June",
      "link": "https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Miner-Riot-Produces-450-Bitcoin-In-June.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june\" rel=\"nofollow\"> </a></p> <p>The company saw a 76% year-over-year increase in production, earned $5.6 million in power credits, and ended the month holding 19,273 Bitcoin.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin Dives on OG Whale FUD, But Charts Remain Bullish: Analysis",
      "link": "https://decrypt.co/328731/bitcoin-price-dives-og-whale-fud-charts-bullish-analysis",
      "summary": "A dormant Bitcoin whale woke up and chose violence—by spooking skittish BTC traders with an $8 billion move. The charts though? They tell a different story."
    },
    {
      "title": "Russian Arms Maker Wants Its Own Stablecoin Too—On Tron",
      "link": "https://decrypt.co/328715/russia-military-rostec-stablecoin-tron",
      "summary": "Russian state-owned manufacturing firm Rostec has said it will roll out a ruble-pegged token called RUBx on Tron. And a payments platform to boot."
    },
    {
      "title": "Another Solo Bitcoin Miner Beats the Odds, Winning $350K Jackpot",
      "link": "https://decrypt.co/328699/solo-bitcoin-miner-beats-odds-350k-jackpot",
      "summary": "The lucky solo Bitcoin miner processed a block with a reward of 3.137 BTC, or $349,028, late Thursday night."
    },
    {
      "title": "How a Hacker Spent Only $2.7K to Steal $140 Million From Brazilian Banks",
      "link": "https://decrypt.co/328700/hacker-spent-2k-steal-140-million-brazil-central-bank",
      "summary": "The hackers laundered roughly $40 million worth of the stolen funds using Bitcoin, Ethereum, and Tether, according to a blockchain investigator."
    },
    {
      "title": "Sweden Orders Police to Increase Seizures of Criminal Crypto Profits",
      "link": "https://decrypt.co/328687/sweden-orders-police-to-increase-seizures-of-criminal-crypto-profits",
      "summary": "Sweden's Minister of Justice has called on the authorities to make greater use of forfeiture legislation to seize cryptocurrency."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Dormant Bitcoin whale activates after 14 years and moves 60,000 BTC",
      "link": "https://cryptobriefing.com/ancient-bitcoin-whale-movement/",
      "summary": "<p>The reactivation of dormant Bitcoin could signal market volatility or strategic repositioning, impacting investor sentiment and market dynamics.</p> <p>"
    },
    {
      "title": "Russia’s military-industrial powerhouse Rostec to launch ruble-backed token on Tron",
      "link": "https://cryptobriefing.com/ruble-backed-token-rostec-tron/",
      "summary": "<p>Rostec's ruble-backed token on Tron could enhance Russia's digital finance landscape, fostering innovation and integration with global systems.</p> <p>"
    },
    {
      "title": "cheqd and ASI Alliance team up to address AI identity crisis with verifiable credentials",
      "link": "https://cryptobriefing.com/cryptographic-verification-ai-impersonation/",
      "summary": "<p>The collaboration could significantly enhance trust and security in AI systems, mitigating risks of fraud and manipulation in a rapidly growing market.</p> <p>"
    },
    {
      "title": "TRON DAO joins EthCC as WAGMI Sponsor, co-hosts events with MetaMask and Arkham",
      "link": "https://cryptobriefing.com/tron-eth-partnership-ethcc/",
      "summary": "<p>TRON DAO's active role at EthCC highlights its strategic push for cross-chain collaboration and strengthening ties within the blockchain community.</p> <p>"
    },
    {
      "title": "Trump’s ‘Big Beautiful Bill’ clears Congress after narrow House vote, what could this mean for Bitcoin?",
      "link": "https://cryptobriefing.com/trump-tax-bill-congress-vote/",
      "summary": "<p>The bill's passage may lead to a liquidity squeeze, impacting Bitcoin's price volatility and potentially increasing national debt concerns.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "PENGU rallies 68% in a week! – Mapping its road to $0.018 and beyond",
      "link": "https://ambcrypto.com/pengu-rallies-68-in-a-week-mapping-its-road-to-0-018-and-beyond/",
      "summary": "<img alt=\"PENGU\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-04T141020.094-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PENGU eyes a breakout past $0.018 as momentum and trader interest continue rising."
    },
    {
      "title": "Why Bitcoin miners slashed production in June – Power curbs & storms to blame!",
      "link": "https://ambcrypto.com/why-bitcoin-miners-slashed-production-in-june-power-curbs-storms-to-blame/",
      "summary": "<img alt=\"Why Bitcoin miners slashed production in June – Power curbs &amp; storms to blame!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Power grid programs, extreme weather, and curtailments hit top miners."
    },
    {
      "title": "Shiba Inu price prediction – Why SHIB’s recovery hinges on $0.0000136",
      "link": "https://ambcrypto.com/shiba-inu-price-prediction-why-shibs-recovery-hinges-on-this-level/",
      "summary": "<img alt=\"Shiba Inu price prediction- Situation still bleak for popular meme coin, buyers beware\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Shiba-Inu-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite an attempted breakout, SHIB failed and remains near the $0.0000111 range low. What next for the memecoin?"
    },
    {
      "title": "Fidelity snaps up 1% of all Bitcoin as institutional buying surges",
      "link": "https://ambcrypto.com/fidelity-snaps-up-1-of-all-bitcoin-as-institutional-buying-surges/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/BitcoinFidelityBTCETF.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Fidelity outpaces BlackRock in ETF inflows, but broader BTC demand slump limits upside momentum."
    },
    {
      "title": "Solana’s price slumps, yet traders scoop $27M in SOL – WHY?",
      "link": "https://ambcrypto.com/solanas-price-slumps-yet-traders-scoop-27m-in-sol-why/",
      "summary": "<img alt=\"SOLANA\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250704_121636_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SOL remains down, yet investors haven’t backed out."
    }
  ]
}