{
  "CoinDesk": [
    {
      "title": "Glassnode on ETH Whales: ‘This Scale of Buying Hasn’t Been Seen Since 2017’",
      "link": "https://www.coindesk.com/markets/2025/06/17/glassnode-on-eth-whales-this-scale-of-buying-hasn-t-been-seen-since-2017",
      "summary": ""
    },
    {
      "title": "ATOM Plunges 6% as North Korea Links Trigger Security Concerns",
      "link": "https://www.coindesk.com/markets/2025/06/17/atom-plunges-6-as-north-korea-links-trigger-security-concerns",
      "summary": ""
    },
    {
      "title": "SOL Drops Below $150 After Sell-Off Despite Growing Institutional Adoption Narrative",
      "link": "https://www.coindesk.com/markets/2025/06/17/sol-drops-below-usd150-after-sell-off-despite-growing-institutional-adoption-narrative",
      "summary": ""
    },
    {
      "title": "XRP Gets Another DeFi Boost Through Flare’s FAssets and FXRP, Messari Says",
      "link": "https://www.coindesk.com/markets/2025/06/17/xrp-gets-another-defi-boost-through-flare-s-fassets-and-fxrp-messari-says",
      "summary": ""
    },
    {
      "title": "Latin America Oil, Gas Deal Worth $75M Gets Tokenized as RWA Momentum Builds",
      "link": "https://www.coindesk.com/business/2025/06/17/latin-america-oil-gas-deal-worth-75m-gets-tokenized-as-rwa-momentum-builds",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Solana Foundation, Bitget Wallet join Ondo Finance’s ‘market alliance’",
      "link": "https://cointelegraph.com/news/solana-foundation-bitget-join-ondo-finance-market-alliance?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdlODItYzM1NS03NTI4LTk2OTItMTkwNDc5NGU5OTIw.jpg\" /></p><p>Eight crypto exchanges, custodians and wallets have joined a group formed to accelerate the adoption of tokenized assets.</p>"
    },
    {
      "title": "Bitcoin threatens $104K &#039;rug pull&#039; as trader says major move yet to come",
      "link": "https://cointelegraph.com/news/bitcoin-104k-rug-pull-trader-says-major-move?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzBiMWQtYjNjMC03ZTc4LTkzZmYtMzZlZmVlZTY4MmFk.jpg\" /></p><p>Bitcoin order book liquidity spoofing is back as analysis says that a key BTC price event is still \"brewing\" — can bulls protect $104,000?</p>"
    },
    {
      "title": "The secret map whales use to liquidate you (learn how to read it)",
      "link": "https://cointelegraph.com/news/how-to-read-a-bitcoin-liquidation-map-without-getting-liquidated?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTI0ZjktM2U5Mi03NmE2LWFiODEtMmQ2M2Y3ZjE1MzA0.jpg\" /></p><p>Bitcoin liquidation maps help track whale moves, predict price swings and stay safe from forced liquidations in volatile crypto markets.</p>"
    },
    {
      "title": "How Michael Saylor’s Strategy became the largest Bitcoin holder",
      "link": "https://cointelegraph.com/explained/how-michael-saylors-strategy-became-the-largest-bitcoin-holder?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy83ODUwYjZjZGJkZTRlNTdkOWViMTVmNWYyZGYzNzU3MC5qcGc=.jpg\" /></p><p>Michael Saylor turned a software company into a Bitcoin powerhouse by converting corporate reserves into digital gold. </p>"
    },
    {
      "title": "The crypto fund domicile decision: EU or the UK?",
      "link": "https://cointelegraph.com/news/crypto-domicile-eu-uk?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM1MDctNjc3MC03Y2U2LTg2M2ItMDBhZjQ0YmYxNTRl.jpg\" /></p><p>As the EU’s MiCA regulation and the UK’s evolving crypto laws diverge, fund managers face a key choice: to opt for the EU’s legal certainty and passporting or the UK’s flexible, innovation-driven approach.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Thailand’s government unveils five-year crypto tax exemption for investors",
      "link": "https://cryptoslate.com/thailands-government-unveils-five-year-crypto-tax-exemption-for-investors/",
      "summary": "<p>Thailand has announced a significant tax reform to position itself as a leading crypto-friendly nation. On June 17, the country&#8217;s Cabinet approved a five-year personal tax exemption on profits from selling digital assets, including Bitcoin. The measure takes effect from January 2025 and will run until December 2029. Deputy Finance Minister Julapun Amornvivat explained on [&#8230;]</p> <p>"
    },
    {
      "title": "Over $91B in staked ETH makes Ethereum nearly impossible to attack",
      "link": "https://cryptoslate.com/insights/over-91b-in-staked-eth-makes-ethereum-nearly-impossible-to-attack/",
      "summary": "<p>Ethereum staking has reached a new milestone, with over 35 million ETH now locked across various platforms, according to Dune Analytics data. This accounts for nearly one-third of the crypto’s total supply and reflects a growing preference among holders to earn passive rewards by securing the network. Lido remains the largest staking provider, holding 8.94 [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin ETFs heat up with $1.7 billion inflows as Middle East tensions return",
      "link": "https://cryptoslate.com/insights/bitcoin-etfs-heat-up-with-1-7-billion-inflows-as-middle-east-tensions-return/",
      "summary": "<p>Over the past seven trading days, spot Bitcoin ETFs saw $1.7 billion in total inflows, marking their strongest weekly streak in over a month. The reversal from late May&#8217;s outflows culminated with escalating military tensions between Israel and Iran, indicating a shift in investor behavior toward Bitcoin in periods of geopolitical uncertainty. Between June 10 [&#8230;]</p> <p>"
    },
    {
      "title": "A16z backs EigenLayer’s EigenCloud rollout with $70 million EIGEN investment",
      "link": "https://cryptoslate.com/a16z-backs-eigenlayers-eigencloud-rollout-with-70-million-eigen-investment/",
      "summary": "<p>EigenLayer has introduced a new platform called EigenCloud, designed to bring verifiability and transparency to both blockchain-native and traditional applications. The launch, announced on June 17 in a statement shared with , introduces a unified system that leverages the power of EigenLayer&#8217;s ecosystem, including its native EIGEN token. Eigen Labs CEO Sreeram Kannan stated that [&#8230;]</p> <p>"
    },
    {
      "title": "Ark Invest dumps $51M in Circle shares amid 400% rally and valuation concerns",
      "link": "https://cryptoslate.com/ark-invest-dumps-51m-in-circle-shares-amid-400-rally-and-valuation-concerns/",
      "summary": "<p>Ark Invest, the investment management firm led by Cathie Wood, has sold off over $50 million of its holdings in Circle Internet Group (CRCL), the issuer of the USDC stablecoin. On June 16, Ark dumped 342,658 CRCL shares valued at approximately $51.7 million, based on the day&#8217;s closing price of $151.06, according to Yahoo Finance [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Must Complete Right Shoulder Before Takeoff—But How Low First?",
      "link": "https://www.newsbtc.com/xrp-news/xrp-complete-right-shoulder-before-takeoff-how-low/",
      "summary": "XRP bulls appear to be facing one last test of conviction before the market’s next explosive phase, according to CryptoInsightUK’s video analysis released on 16 June. The British analyst argues that the token is sculpting an inverse head-and-shoulders formation whose right shoulder “still needs to form around the high-$1.80s” before any sustained rally can commence. How Low Must XRP Go? In the broadcast, he emphasised that “dense liquidity is below us,” pointing to a confluence of resting bids and stop-loss clusters between roughly $1.92 and $1.80. “I still think it comes down to make the right shoulder which is around 1.88,” he said, adding that a swift wash-out into that pocket would “flush the lows, tap in there and send it.” At present, XRP is changing hands near $2.24, up about 3% over the past 24 hours, which implies a prospective drawdown of roughly 20% if the market fulfills his downside scenario. From the analyst’s vantage point, such a retreat is less a cause for alarm than a prerequisite for the next major leg higher: “If we come down first, we’ve done the downside part. Otherwise I’m still going to be worried about going down even if we come up to $2.42 or higher.” Related Reading: What Are The Implications For XRP If Ripple Captures 14% Of SWIFT’s Volume? He linked the bearish short-term bias to structural forces beyond the XRP Ledger’s ecosystem. Bitcoin dominance, he noted, has crept toward a historical inflection zone that previously triggered alt-seasons: “Anywhere in this box could be the start of alt-season… That would probably coincide with Bitcoin dropping to between $100,000 and $93,000.” A dominance spike fed by a late-cycle Bitcoin dip, he argued, would typically inflict outsized percentage losses on major altcoins—including XRP—before liquidity rotates back into them. Within XRP’s own order book, CryptoInsightUK highlighted a “liquidity vacuum” created by May’s capitulation candle. Although the token has since retraced most of that single-session collapse, he described the rebound as “choppy corrective price action,” lacking the conviction and volume that accompanied earlier impulse waves. The right-shoulder flush, in his view, would neutralise residual leverage, particularly among traders who re-loaded longs too aggressively during the $2.15–$2.40 bounce. How High Can XRP Explode? The inverse head-and-shoulders thesis also features prominently on his long-range chart, stretching back to mid-May. The analyst first published the pattern on X, showing a left shoulder near $2.42, a head at $1.47, and a neckline just above $2.50. Completing a symmetrical right shoulder near $1.88 would, by classical pattern-measuring rules, project an upside target above $3.50—a level not visited since late-2021’s cycle top. Related Reading: Still Sleeping On XRP? Analyst Says $8 Breakout Is ‘Just Waiting’ Liquidity dynamics across the broader market reinforce his caution. Open interest in perpetual swaps for Ether, he observed, remains “as high as it’s ever been,” suggesting that any sudden drop in majors could spark a forced-liquidation cascade across altcoin pairs. “These people will be flushed out,” he warned, calling attention to negative-funding episodes that hint at an overcrowded short base waiting to be squeezed—once the final downside pocket has been filled. Despite the near-term jitters, CryptoInsightUK reiterated a resolutely bullish macro stance. “The next stage I’m most certain about is that we’re going to go significantly higher for crypto,” he told viewers. Drawing parallels with gold’s record weekly close, he argued that an undercurrent of global risk aversion is quietly supporting non-sovereign stores of value, positioning both Bitcoin and XRP for accelerated appreciation once the technical reset concludes. For long-term holders, his advice was unequivocal: avoid wholesale portfolio shifts and instead treat any sub-$2.00 wick as a final accumulation window. “Dollar-cost averaging from here is a good thing to do,” he said, revealing that 97% of his own capital remains in spot positions, with only a single-digit percentage reserved for surgical bids in the $1.80–$1.92 zone. Whether XRP respects that script will become clear in the days ahead. Should the market indeed sweep into the high-$1.80s and rebound with the aggressive thrust the analyst expects, the right shoulder will be complete—and the runway clear—for the long-awaited take-off. At press time, XRP traded at $2.23. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Analyst Predicts Bitcoin Price Crash As War Tensions Mount In Middle East",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-crash-as-war-tensions/",
      "summary": "Bitcoin’s recent price activity has been characterized by sharp swings as global uncertainties persist, particularly following the escalation of tensions between Israel and Iran. After plunging by nearly 5% amid the rising geopolitical strain, Bitcoin managed to recover, bouncing back above $105,000 and currently trading around $106,800. The past 24 hours have been highlighted by Bitcoin recovering toward $108,000 briefly again, but with escalating tensions in the Middle East, there&#8217;s a good chance it could crash soon. This aligns with an outlook from a crypto analyst, who noted that Bitcoin might crash toward $100,000. Resistance Band Faces Test For Bitcoin According to crypto analyst Pejman_Zwin on the TradingView platform, Bitcoin is hovering within a confluence of resistance and short liquidation zones, stretching from $105,330 to $107,120. This range, he notes, is not only a structural resistance zone but also corresponds with the cumulative short liquidation leverage area. Related Reading: Bitcoin Price Forms Descending Triangle Pattern Amid Israel-Iran Tensions Basically, this means there&#8217;s a high possibility of an intensified price volatility if this zone is challenged or broken. The charts also reveal the presence of a possible contracting triangle pattern, which is a bearish continuation setup in the context of a larger correction. According to the analyst, if Bitcoin fails to reclaim $106,600 convincingly, the structure could shift from a corrective triangle to a five-wave downward impulse. This would cause a deeper retracement, especially as the price is already forming lower highs within the triangle. As such, the longer Bitcoin lingers in this resistance range without a breakout, the higher the likelihood of a rapid downward move. Bearish And Bull Targets If Bitcoin were to confirm this breakdown, the analyst noted the first major target around the lower boundary of the support zone, which lies between $105,330 and $103,162. This zone is reinforced by the monthly pivot point and also overlaps with the cumulative long liquidation leverage region. The 1-hour candlestick timeframe chart further highlighted a potential short setup from the reversal zone near $107,100 and a projected target close to $104,300. Related Reading: Bitcoin Bears Back In Control After $110,000 Rejection, What Comes Next? Further downside could pull the price toward the next support band around $102,600 or even down to $101,000, should liquidation pressure persist. Pejman, on the other hand, pointed out that a sustained breakout above the $107,120 resistance line could initiate a bullish reversal and push Bitcoin back towards the heavy resistance cluster above $108,000. A strong daily close above $108,000 could cancel the bearish outlook. However, failure to break above here could lead to a rejection and another downside move. Although Bitcoin is starting to show some signs of bullishness, its price action is still vulnerable to a quick pullback, especially if the tensions in the Middle East continue to unfold. At the time of writing, Bitcoin is trading at $106,638, down 0.02% in the past 24 hours. This subdued price action shows its current consolidation nature. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Solana ETF Nears Approval – Don’t Miss Your Chance to Buy Solaxy, the First $SOL Layer-2",
      "link": "https://www.newsbtc.com/news/solana-etf-is-next-last-chance-to-buy-solaxy/",
      "summary": "Here’s a list of the people who think a Solana ETF is incoming: everyone. And here’s a list of the people who think a $SOL ETF could send Solana – and Solaxy, a much-needed Solana Layer 2 – sky-high: also everyone. That’s right, Solana is gaining serious momentum. Cantor Fitzgerald&#8217;s analysts report that Solana-focused firms DeFi Development, Upexi, and SOL Strategies will raise each raise $250M this year for various crypto-related efforts, including $SOL treasuries. Both the pending $SOL ETFs and current treasury efforts underscore SOL&#8217;s strengths: a unified, low‑cost, and high‑throughput blockchain that enables native staking yields and positions it as an attractive treasury asset. And how does this impact side projects like Solaxy, Solana&#8217;s first-ever Layer-2 chain? Let&#8217;s discuss below. Solana’s TVL Climbs as ETFs Loom Solana’s Total Value Locked (TVL) now exceeds $8B, and it maintains a vibrant developer base. Today&#8217;s treasury strategies are shifting accordingly, favoring scalable, productive blockchains alongside traditional reserve assets like Bitcoin. Simultaneously, CoinShares joined other financial heavyweights in filing for a spot Solana ETF, featuring staking components and third-party custody via Coinbase and BitGo. The filing aims to address SEC concerns about redemption and staking. While there’s no timeline on the SEC’s response and potential approval, analysts anticipate potential approvals in late summer or early fall 2025. It’s worth noting that CoinShares’s filing was one of 8 on the same day for new $SOL ETFs. Why the rush? In part because Solana is enjoying steadily growing adoption, despite relatively lackluster $SOL price performance. Strategy’s Treasury Strategy Expands to Solana As the drumbeat of Michael Saylor’s Bitcoin strategy goes on, companies beyond (Micro)Strategy are joining the bandwagon. After all, who doesn’t want their very own pile of crypto? And in this case, companies are applying it to $SOL as well. DeFi Development Corp notified the SEC back in April that it intended to sell $1B in securities to purchase $SOL. SOL Strategies, based in Canada, did the same in late May. What does this mean for investors? At least three possibilities: ⬆️ SOL could be moving into the mainstream, attracting attention as a yield-generating asset thanks to its staking model and institutional embrace. ✅ Approval of spot $SOL ETFs would dramatically lower barriers to $SOL exposure through traditional brokerage venues. 📊Continued technological adoption and treasury-level interest could propel SOL further, though regulatory black swans and market volatility remain risks. Solana stands at a pivotal junction, even as $SOL treasuries take off and Solana meme coins continue to get attention. And the core Solana technical advantages – low fees, fast transactions – will get supercharged as Solaxy wraps up a dynamite presale. Solaxy ($SOLX) – $54M Raised as Time Runs Out for Groundbreak Layer-2 Presale $53.9M raised in its official presale – but with interest still sky-high, Solaxy ($SOLX) has opened a six-day window for investors to join the action. Solana loyalists and meme coin enthusiasts, drawn by Solaxy’s potential as the first-ever Solana Layer 2, have added another $2M after the presale ended on Monday. That potential is taking shape with the Testnet Block Explorer and Bridge already live. The full launch schedule kicks in with the Token Claim on June 23, then builds out with a Mainnet Launch and bridge connecting Solana, Ethereum, and Solaxy. Multichain functionality is built into Solaxy from launch, with full Layer 2 deployment as the crowning achievement of a red-hot crypto presale. With Solana interest peaking at just the right time, how far could Solaxy go? Our own price prediction shows the token could reach $0.032, up 1,700% from its current $0.001766. What is Solaxy? It’s the future of an already dynamic blockchain, combining Solana’s speed and low costs with Ethereum’s rock-solid framework and incredible ability to scale. Learn how to buy Solaxy, but don’t delay – this truly is the last chance to buy. Visit the Solaxy Presale Page. Solana Climbs Adoption Ladder – Will Solaxy Price Follow? Curiously, Solana’s price seems to lag its adoption. Even as institutions flock to $SOL treasuries and ETFs, the token price lags far behind $BTC’s impressive performance. Will Solaxy’s Layer 2 send both $SOLX and $SOL surging? Do your own research. This isn’t financial advice – crypto markets are always volatile."
    },
    {
      "title": "Wild XRP Prediction: Crypto Founder Sees $10K Price Tag—Here’s When",
      "link": "https://www.newsbtc.com/news/wild-xrp-prediction-crypto-founder-sees-10k-price-tag-heres-when/",
      "summary": "According to Digital Ascension Group’s Managing Director Jake Claver, XRP could reach a price level that brings a dramatic shift in how value moves on its network. He argues that higher token prices make the system more efficient. Claver even lays out a bold target of $10,000 per XRP, and he says that can happen within 24 months. The idea has reignited talk of crypto’s next big rally. Related Reading: Record‑High Ethereum Open Interest Signals Institutional Confidence Price And Liquidity Efficiency According to Claver, moving large sums on the XRP ledger depends on token price. At $1 per XRP, you need 1,000,000 tokens to shift $1 million. If the price rose to $10, only 100,000 tokens would do the job. And in a world where one XRP costs $1 million, a single token could cover that same $1 million transfer. This math shows why Claver believes price and network efficiency go hand in hand. Does XRP need to be a certain price to move large amounts of money? pic.twitter.com/tbqBbvST4y — Jake Claver, QFOP (@beyond_broke) May 27, 2025 Market Cap Implications XRP trades near $2.24 today, with a market cap of about $131.7 billion. At $10,000 per token, that cap would swell to over $585 trillion. Claver treats that huge number as a sign of strength rather than a warning. He says market cap rules don’t apply the same way to XRP. But critics point out you can’t assume that every token sits ready to trade. Actual liquidity comes from orders on exchanges and funds in liquidity pools, not just a headline market cap. Timeline And Skepticism Claver doesn’t shy away from timing. He told his followers that the $10,000 mark could arrive within 24 months. Some hear that as a call to buy now. Others see it as wildly optimistic. To reach that level, XRP would need to climb more than 500,000% from today’s price. Even Bitcoin, with far more adoption, took about four years to go from $1,200 to $68,000 in the last cycle. Cranking out a similar or bigger gain in half the time would require huge new demand. Community Reaction And Risks Based on reports, Claver’s claim has attracted both cheers and jeers. Some XRP fans embrace the vision. Others worry it sets unrealistic hopes. Alex Caraco, former CEO of an Australian stock market firm, summed up a common view: “It’s sad to see buyers sold the story of $10,000 XRP happening tomorrow.” Critics say such talk distracts from real issues like regulatory hurdles, exchange listings and developer growth. Related Reading: Amid Bitcoin Hype, Seasoned Trader Predicts Sudden Drop To This Level XRP Price Forecast XRP is expected to dip slightly—by around 0.70%—with projections placing its value at $2.23 by July 17, 2025. Current indicators paint a neutral market mood, with the Fear &#38; Greed Index leaning heavily toward Neutral at a score of 57. Over the past month, XRP has closed in the green on 16 out of 30 days, experiencing a modest 3.70% in price swings. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Bear Signal Lingers On Dogecoin—Here’s Why That’s Bullish",
      "link": "https://www.newsbtc.com/news/dogecoin/bear-signal-dogecoin-why-thats-bullish/",
      "summary": "Dogecoin’s Market-Value-to-Realised-Value (MVRV) Z-Score is printing just 0.28 – a level normally associated with capitulation, not euphoria. Yet the price of the ninth-largest cryptocurrency keeps carving a succession of higher highs and higher lows on the weekly chart, trading near $0.17 with a market capitalisation of roughly $26 billion in Monday’s late-New-York session. The juxtaposition between lethargic on-chain sentiment and resilient spot bids was laid bare in a chart posted to X by Kevin, the pseudonymous analyst behind @Kev_Capital_TA. “Dogecoin MVRV Score is still at bear-market levels while price continues to make higher highs and higher lows on higher time frames,” he wrote. Kevin also pointed out that previous cycle tops saw the Z-Score blow off at ≈11 in 2017 and ≈16 in 2021, whereas the current advance has so far peaked at 3.5. “#DOGE … has not seen a real bull run yet. This delay in durable Altcoins out-performance is very much due to restrictive monetary policy… It will change at some point and Alts will have their day in the sun.” The Macro Backdrop For Dogecoin The “restrictive monetary policy” Kevin cites remains the single most important head-wind for the entire alt-coin complex. In the US, the Federal Reserve has held the fed-funds target at 4.25 %–4.50% since January, having already delivered three cuts in 2024. Related Reading: Dogecoin Must Hold This Level—Or Risk A 30% Price Crash Futures markets this week imply the first additional reduction “around September or later,”after soft May inflation but a still-solid economy At the same time the Fed is only slowing — not stopping — quantitative tightening: beginning 1 April the monthly Treasury run-off cap fell to $5 billion from $25 billion, but Chair Jerome Powell made clear “there is no sign yet the Fed is ready to end QT.” In Europe, the ECB has started to nudge borrowing costs lower, slicing the deposit rate to 2% on 5 June. President Christine Lagarde nevertheless insisted the Governing Council was “in a good position” to move gradually and would keep quantitative easing “in the toolbox,” rather than redeploying it. Vice-President Luis de Guindos was more explicit yesterday, telling Reuters that the ECB had “learned much more about side effects” of money printing and that the bar for new QE is now “higher.” The net result is a world in which policy rates are still comfortably above neutral, liquidity is being drained by the Fed, and European officials are determined not to repeat the 2015-21 experiment of perpetual bond-buying. In Kevin’s words, this “delay” in easy money explains why alt-coins have under-performed Bitcoin so far in the 2024-25 cycle. Reading The MVRV Tea Leaves MVRV compares the aggregate market value of all coins with the value at which they last moved on-chain (their realised value). A Z-Score normalises that ratio against its own multi-year mean and standard deviation. Historically for Dogecoin, values above +9 have coincided with secular tops (January 2018; May 2021), values between –1 and +1 have appeared during long lateral “crypto winters,” and values below –1 have signalled deep capitulation and, in hindsight, exceptional long-term entry points. Related Reading: $8 Dogecoin? Analyst Says You’ll Regret Sleeping On This Chart Today’s 0.28 sits squarely inside the winter band even though spot DOGE is up roughly 5x from its 2022 lows. The same disparity is visible within the chart: the blue line (market cap) has been rising since late 2023, while the red Z-Score remains pinned near zero because the orange line (realised cap) is climbing almost in lock-step as dormant supply changes hands at higher cost basis. In plain English, the average on-chain holder is not yet sitting on the kind of paper profits that breed euphoria. When Could Policy Turn From Restrictive To Supportive? Futures markets now look for two quarter-point Fed cuts by December, taking policy to roughly 3.75%. Market-implied odds of a September move fluctuate with each inflation print; should shelter and services dis-inflation stall, traders will push expectations into 2026. However, neither the Fed nor the ECB is openly contemplating new asset purchases. Powell told reporters in March that the slower pace of QT is designed to “extend how far the central bank can run QT before needing to stop,” not to hint at a reversal. In Frankfurt, de Guindos stressed that “sometimes it’s much easier to start using [QE] than to withdraw it,” signalling that any relaunch would require either a financial-stability shock or a deep recession. With QT still active and rate-cut trajectories shallow, a powerful systemic tail-wind for DOGE may not materialise until after the first Fed or ECB pause in balance-sheet contraction. If consensus is correct that QT ends late-2025 or early-2026, any prospective QE would be a story for the next downturn, not this upswing. Kevin’s interpretation hinges on potential energy. Because the Z-Score has not yet detached from its mean, Dogecoin can, in theory, absorb a fresh wave of retail and leverage-driven inflows without immediately flashing the kind of overheated signal that coaxed sellers in 2017 and 2021. Put differently, DOGE’s spring has not been compressed. Macro, however, remains the gating factor. “Buy them low and sell them high. Never get attached to your Alts,” the analyst reminds followers. For now, low MVRV suggests structural downside is limited, but cyclicality implies explosive upside will likely coincide with a convincing turn in global liquidity – a turn that the Fed and the ECB, by their own admission, are not yet ready to deliver. At press time, DOGE traded at $0.17387. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Thailand Approves Five Year Bitcoin And Crypto Tax Break",
      "link": "https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Thailand-Approves-Tax-Exemption-on-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break\" rel=\"nofollow\"> </a></p> <p>Thailand has approved a five year tax exemption on capital gains from cryptocurrency trading made through licensed digital asset platforms. The exemption will be in effect from January 1, 2025, through December 31, 2029. Deputy Finance Minister Julapun Amornvivat announced the measure, calling it a move to increase investment, stimulate economic activity, and drive long [&#8230;]</p> <p>"
    },
    {
      "title": "DDC Enterprise Secures $528 Million to Expand Bitcoin Holdings",
      "link": "https://bitcoinmagazine.com/news/ddc-enterprise-secures-528-million-to-expand-bitcoin-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/DDC-Enterprise-Secures-528-Million-to-Expand-Bitcoin-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ddc-enterprise-secures-528-million-to-expand-bitcoin-holdings\" rel=\"nofollow\"> </a></p> <p>Anson Funds, Animoca Brands, Kenetic Capital, and QCP Capital are funding a $528 million raise to expand DDC Enterprise Limited corporate Bitcoin treasury.</p> <p>"
    },
    {
      "title": "Flash Releases Free Bitcoin Invoicing Tool with No Fees, KYC, or Custody",
      "link": "https://bitcoinmagazine.com/news/flash-releases-free-bitcoin-invoicing-tool-with-no-fees-kyc-or-custody",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Flash-Releases-Free-Bitcoin-Invoicing-Tool-with-No-Fees-KYC-or-Custody-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/flash-releases-free-bitcoin-invoicing-tool-with-no-fees-kyc-or-custody\" rel=\"nofollow\"> </a></p> <p>The new tool lets freelancers issue professional Bitcoin invoices without platform fees, identity checks, or third party control.</p> <p>"
    },
    {
      "title": "H100 Group Receives 144.8 BTC in Convertible Loan Deal",
      "link": "https://bitcoinmagazine.com/news/h100-group-receives-144-8-btc-in-convertible-loan-deal",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/H100-Group-Receives-144.8-BTC-in-Convertible-Loan-Deal-Now-Holds-169.2-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/h100-group-receives-144-8-btc-in-convertible-loan-deal\" rel=\"nofollow\"> </a></p> <p>H100 Group, Swedish health-tech firm, has received 144.8 BTC as part of a settlement tied to its convertible loan agreement, according to a company press release issued Monday. With this latest transaction, the Stockholm-based firm now holds a total of 169.2 BTC on its balance sheet. The 144.8 BTC was transferred as a part of [&#8230;]</p> <p>"
    },
    {
      "title": "Trump Media Files to Launch Bitcoin and Ethereum ETF",
      "link": "https://bitcoinmagazine.com/news/trump-media-files-to-launch-bitcoin-and-ethereum-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Trump-Media-Files-to-Launch-Bitcoin-and-Ethereum-ETF.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/trump-media-files-to-launch-bitcoin-and-ethereum-etf\" rel=\"nofollow\"> </a></p> <p>Trump Media &#38; Technology Group has filed a registration statement with the U.S. Securities and Exchange Commission to launch the Truth Social Bitcoin and Ethereum ETF, B.T. The ETF will directly hold Bitcoin and Ether, with an initial allocation of 75% Bitcoin and 25% Ether. Shares of the fund will be offered to investors to [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "TRUMP SPOOKS MARKETS, JP MORGAN STABLECOIN COMING, TRON TO IPO",
      "link": "https://decrypt.co/videos/interviews/yoCwDWyG/trump-spooks-markets-jp-morgan-stablecoin-coming-tron-to-ipo",
      "summary": "- FOMO HOUR LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. Crypto falls after Trump’s comments on Tehran. Strategy buys $1.08b BTC. JP Morgan files trademark for stablecoin. Tron to IPO after US pauses probe in its founder. Eric Trump could take a role at Tron. Trump’s Truth Social files for dual BTC, ETH ETF. Coinshares files S-1 for spot SOL ETF. BTC Maximalism era coming to an end: Garzik. SOL tech better than ETH tech: Cantor Fitzgerald. France could integrate BTC mining into energy infra 00:00 - Introduction and Current Events 00:51 - Market Reactions and Concerns 09:04 - Discussion on US-Iran Relations 11:09 - Market Analysis and Predictions 13:43 - Crypto Market Updates 15:55 - Regulatory Developments and Company News 17:44 - Market Dynamics and Trading Strategies 19:09 - Interview with DK from DFDV 53:56 - Giveaway and Closing Remarks LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    },
    {
      "title": "EigenLayer Gets $70M From a16z to Launch Off-Chain Verifiability Platform",
      "link": "https://decrypt.co/325503/eigenlayer-70m-a16z-verifiability-platform",
      "summary": "EigenLayer has secured $70 million for a platform that enables blockchain-grade verification for off-chain apps in AI, finance, and beyond."
    },
    {
      "title": "Ethereum and Solana Meme Coins PEPE, FLOKI, WIF Lead Losses as Market Dips",
      "link": "https://decrypt.co/325539/ethereum-solana-meme-coins-pepe-floki-wif-losses",
      "summary": "Meme coins Pepe, Floki Inu and Dogwifhat have led losses as the crypto market experiences a 3.5% pullback Tuesday morning."
    },
    {
      "title": "Bitcoin Price Holds Steady Amid Iran Conflict Fears",
      "link": "https://decrypt.co/325536/bitcoin-price-holds-steady-amid-iran-conflict-fears",
      "summary": "Analysts told they expect Bitcoin to remain stable until there is more clarity about the U.S. response to Middle East tensions."
    },
    {
      "title": "CRYPTO REBOUNDS AFTER MIDDLE EAST CONFLICT, HYPE KEEPS GOING HIGHER!",
      "link": "https://decrypt.co/videos/interviews/PIycV1Ic/crypto-rebounds-after-middle-east-conflict-hype-keeps-going-higher",
      "summary": "- FOMO HOUR LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. SOL lead rebound in majors after Iran-Israel news. HYPE hits another ATH. DRW Investments invests $100m in Trump Media. Metaplanet to issue $210m debt to buy BTC. Whales leading accumulation of ETH vs retail. Fidelity files S-1 for SOL ETF. Bybit launches on-chain liquidity network on SOL. Bybit adds gold, stocks & FX trading. Crypto near tipping point toward systemic risk: FSB. Coinbase, Gemini to receive MiCA licenses. Gotbit founder jailed on wash trading. Vietnam officially recognises crypto for regulations. Saylor set to advise Pakistan on BTC. 00:00:00 Kick Streaming Launches with Tyler Mando 00:04:32 Highlights From Recent Football Matches 00:09:06 Potential Escalation in the Strait of Hormuz 00:14:17 SPX and Bitcoin Market Update 00:19:06 Crypto Market Trends: Golden Bull Run and Alt Season Evolution 00:23:51 Tron's IPO and Controversial Investments 00:28:31 Giveaway and Raffle Entry Instructions 00:33:36 Potential Geopolitical Escalations: Iran and Global Markets 00:38:21 Meme Tokens Surge and Market Highlights LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Kraken-backed layer 2 Ink to launch $INK token",
      "link": "https://cryptobriefing.com/kraken-ink-token-launch/",
      "summary": "<p>The launch of $INK could significantly enhance DeFi ecosystems by fostering user-driven governance and expanding on-chain capital markets.</p> <p>"
    },
    {
      "title": "Coinbase plans to offer tokenized equities to rival Robinhood, Charles Schwab",
      "link": "https://cryptobriefing.com/coinbase-tokenized-equities-sec-approval/",
      "summary": "<p>Coinbase's move into tokenized equities could reshape financial markets by increasing competition, innovation, and accessibility in trading.</p> <p>"
    },
    {
      "title": "NYSE-listed DayDayCook to raise up to $528 million for Bitcoin treasury expansion",
      "link": "https://cryptobriefing.com/bitcoin-treasury-expansion-ddc-enterprise/",
      "summary": "<p>DayDayCook's significant Bitcoin investment could influence corporate treasury strategies, highlighting growing institutional interest in digital assets.</p> <p>"
    },
    {
      "title": "Thailand exempts Bitcoin, crypto gains from tax to support entrepreneurs and innovation",
      "link": "https://cryptobriefing.com/thailand-crypto-tax-relief-innovation/",
      "summary": "<p>Thailand's tax exemption on crypto gains could boost its digital economy, attract global investors, and enhance entrepreneurial growth.</p> <p>"
    },
    {
      "title": "SEC, Ripple ask court to delay appeal proceedings pending August 15 update",
      "link": "https://cryptobriefing.com/sec-ripple-settlement-delay-request/",
      "summary": "<p>The delay in appeal proceedings could signal a potential shift towards more collaborative resolutions in regulatory disputes within the crypto industry.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin Cash: Can BCH continue its bullish run after recent 20% surge?",
      "link": "https://ambcrypto.com/bitcoin-cash-can-bch-continue-its-bullish-run-after-recent-20-surge/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-17T155053.836_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Traders are currently over-leveraged at $458.7 on the lower side and $486.9 on the upper [&#8230;]"
    },
    {
      "title": "Ripple and SEC want appeals paused – Is a breakthrough ruling coming soon?",
      "link": "https://ambcrypto.com/ripple-and-sec-want-appeals-paused-is-a-breakthrough-ruling-coming-soon/",
      "summary": "<img alt=\"Ripple XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-15.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Paused appeals, rising confidence - Is the verdict already priced in?"
    },
    {
      "title": "Solana’s ETF case strengthens: Are the numbers backing it up?",
      "link": "https://ambcrypto.com/solanas-etf-case-strengthens-are-the-numbers-backing-it-up/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-28.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana gains ground as a serious ETF contender with rising DeFi activity, SEC filing updates, and institutional moves."
    },
    {
      "title": "Top 13 Telegram games of June 2025",
      "link": "https://ambcrypto.com/top-13-telegram-games-of-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1445\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/riho-kroll-m4sGYaHYN5o-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Telegram has become much more than just a messaging platform, and its importance in the [&#8230;]"
    },
    {
      "title": "ONDO whale dumps 2.69 mln tokens as bearish concerns persist: What now?",
      "link": "https://ambcrypto.com/ondo-whale-dumps-2-69-mln-tokens-as-bearish-concerns-persist-what-now/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-25.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ONDO whale sells 2.69 million tokens worth $2.13 million amid concerns over more losses."
    }
  ]
}