{
  "CoinDesk": [
    {
      "title": "Coinbase's Base Sees Over $4B in Capital Outflows Through Cross-Chain Bridges; Ethereum Registers Inflows of $8.5B",
      "link": "https://www.coindesk.com/markets/2025/07/04/coinbase-s-base-sees-over-usd4b-in-capital-outflows-ethereum-registers-inflows-of-usd8-5b",
      "summary": ""
    },
    {
      "title": "Bitcoin Long-Term Holders Signal Patience in Market",
      "link": "https://www.coindesk.com/markets/2025/07/04/bitcoin-long-term-holders-signal-patience-in-market",
      "summary": ""
    },
    {
      "title": "PEPE Slips 6% as Whales Load Up, Technicals Hint at Possible Bounce Amid Market Jitters",
      "link": "https://www.coindesk.com/markets/2025/07/04/pepe-slips-6-as-whales-load-up-technicals-hint-at-possible-bounce-amid-market-jitters",
      "summary": ""
    },
    {
      "title": "Nano Labs Buys $50M in BNB in $1B Plan to Hold Up to 10% of Supply",
      "link": "https://www.coindesk.com/markets/2025/07/04/nano-labs-buys-50m-in-bnb-in-1b-plan-to-hold-up-to-10-of-supply",
      "summary": ""
    },
    {
      "title": "JD.com, Ant Group Push for Yuan-Based Stablecoins to Counter Dollar Rule: Reuters",
      "link": "https://www.coindesk.com/policy/2025/07/04/jdcom-ant-group-push-for-yuan-based-stablecoins-to-counter-dollar-rule-reuters",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Multibillion-dollar HODL: Bitcoin whales awaken after 14 years",
      "link": "https://cointelegraph.com/news/multi-billion-dollar-hodl-bitcoin-whales-awaken-after-14-years?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg0MGYtMmZiOC03MTFmLThiNWMtMGYyY2Y1MDkxNDc5.jpg\" /></p><p>Bitcoin whales have awoken after 14 years of dormancy, holding their BTC since it was trading below $0.78 a coin in 2011.</p>"
    },
    {
      "title": "How to buy a home with a crypto-backed loan",
      "link": "https://cointelegraph.com/news/how-to-buy-a-home-with-a-crypto-backed-loan?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjdiODktMThlYi03NGU4LWEzZmMtY2M1NGMwYjNkNTAz.jpg\" /></p><p>Discover platforms offering crypto-backed mortgages, allowing you to use digital assets like BTC and ETH to finance real estate purchases without selling your holdings.</p>"
    },
    {
      "title": "Bitcoin&#039;s third flop at $110K puts bulls at risk: BTC price levels to watch",
      "link": "https://cointelegraph.com/news/bitcoin-third-flop-110k-puts-bulls-at-risk-btc-price-levels?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Q1MDMtZWZkMS03Yjg2LTliZDktMzk3Yjg1YmNkYzU0.jpg\" /></p><p>Bitcoin price rally stalls at $110,000 after strong US employment data, with big overhead resistance at $112,000 and several key support levels below.</p>"
    },
    {
      "title": "Phoenix FIRE investors allege exit scam; owner moves to dismiss case",
      "link": "https://cointelegraph.com/news/fire-investors-allege-fund-grab-ceo-moves-to-dismiss-case?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzEyMmUtYmM4My03NzgwLTg1OTAtYjY0OTgyMDFjODFi.jpg\" /></p><p>Daniel Ianello has asked a Tennessee court to dismiss a lawsuit accusing him of orchestrating an exit scam after taking over a crypto project.</p>"
    },
    {
      "title": "Bitcoin price can hit $150K in weeks thanks to Trump’s ‘Big Beautiful Bill’",
      "link": "https://cointelegraph.com/news/bitcoin-price-can-hit-150k-trump-big-beautiful-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Q0ZDYtOWNiYi03NGU4LWFmODEtNTMyMWRjZDg4MTNi.jpg\" /></p><p>Bitcoin has historically posted double-digit gains in the weeks following the passage of major US debt-expanding bills. Will 2025 follow the same pattern?</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "The four times Bitcoin price fell by Independence Day each year",
      "link": "https://cryptoslate.com/insights/the-four-times-bitcoin-price-fell-by-independence-day-each-year/",
      "summary": "<p>Bitcoin&#8217;s price history shows four instances of year-over-year declines on July 4, interrupting its general uptrend. These decreases occurred during broader market corrections and periods of distress for the digital asset industry. The most recent drop was in 2022, when the price fell to $19,750, a sharp contrast to the $34,973 level seen one year [&#8230;]</p> <p>"
    },
    {
      "title": "Polymarket bettors forecast 75% chance Bitcoin reaches $120k in 2025 as prediction volume jumps 30%",
      "link": "https://cryptoslate.com/polymarket-bettors-forecast-75-chance-bitcoin-reaches-120k-in-2025-as-prediction-volume-jumps-30/",
      "summary": "<p>Prediction market data shows traders are wagering millions on the price of Bitcoin reaching levels above $120,000 in 2025. On the decentralized platform Polymarket, a market asking what price Bitcoin will hit in 2025, has attracted over $15.5 million in volume. Traders assign a 75% probability that the asset will exceed $120,000 by the end [&#8230;]</p> <p>"
    },
    {
      "title": "MARA’s $5.4B Bitcoin treasury grows to 50k BTC as miners adopt a HODL strategy",
      "link": "https://cryptoslate.com/maras-5-4b-bitcoin-treasury-grows-to-50k-btc-as-miners-adopt-a-hodl-strategy/",
      "summary": "<p>MARA (formerly Marathon Digital) reports its Bitcoin holdings have increased to 49,940 BTC, bringing the digital asset miner to the edge of a major corporate milestone and reinforcing a broader market trend of miners retaining their produced assets. MARA&#8217;s holdings position it as the second-largest public corporate holder of Bitcoin, with a treasury valued at [&#8230;]</p> <p>"
    },
    {
      "title": "Dormant Bitcoin holder moves $2 billion BTC from 2011 for potential 14,000,000% gain",
      "link": "https://cryptoslate.com/dormant-bitcoin-holder-moves-2-billion-btc-from-2011-for-potential-14-million-percent-gain/",
      "summary": "<p>Two Bitcoin wallets inactive for 14 years transferred a combined 20,000 BTC, valued at approximately $2.18 billion, on July 4. The transactions originated from separate addresses that held 10,000 BTC since April 3, 2011, when the asset price was roughly $0.78. The analytics account Lookonchain first flagged the on-chain movements, which detailed the two separate [&#8230;]</p> <p>"
    },
    {
      "title": "DeFi TVL breaks above $116B as lending roars back",
      "link": "https://cryptoslate.com/defi-tvl-breaks-above-116b-as-lending-roars-back/",
      "summary": "<p>The DeFi market has rebounded at the beginning of July, with total value locked (TVL) rising to $116.416 billion, a level last seen in April. The 24-hour increase of 4.95% reflects rising crypto asset prices and renewed deposit flows into lending protocols, restaking services, and yield-bearing primitives. As Ethereum and Solana continue to absorb most [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "The $1 Dogecoin Dream Is Alive: Chartist Lays Out Parabolic Scenario",
      "link": "https://www.newsbtc.com/news/dogecoin/1-dogecoin-dream-chartist-parabolic-scenario/",
      "summary": "The improbable $1 price target for Dogecoin has returned to the spotlight after independent crypto analyst Cantonese Cat (@cantonmeow) shared a bold new Ichimoku-based projection on July 3. In a chart posted to X, the analyst outlined a parabolic price trajectory for DOGE using 2-week candles, suggesting that the memecoin could begin an explosive ascent in late 2025, eventually reaching the symbolic one-dollar mark. The $1 Dogecoin Dream The projection rests on DOGE’s ability to maintain current bullish structure above the Ichimoku cloud, with a brief retest later this year during liftoff. “DOGE 2-week candles, Ichimoku cloud shown. Why am I buying doge? Because I’m delusional and this is what I’m thinking,” the trader wrote, pairing tongue-in-cheek self-awareness with conviction in a longer-term breakout scenario. At the time of the chart’s publication, Dogecoin was trading at $0.172, up nearly 14% on the fortnight. The price action shows a clean bounce off the top of the green Ichimoku cloud, suggesting that DOGE is holding bullish structure on a high timeframe, a key technical criterion in Ichimoku trend-following theory. Related Reading: Dogecoin’s Quiet Setup Could Detonate Shorty, Says Analyst—Here’s The Target The Ichimoku Cloud (Kumo) on the 2-week timeframe, calculated with the traditional 9/26/52/26 settings, shows the Leading Span A (Senkou A) currently above Leading Span B (Senkou B), forming a green cloud—indicative of a bullish trend outlook. DOGE’s price is above the cloud, which acts as dynamic support. This is critical: Ichimoku practitioners consider price above the cloud to be in a bullish regime, especially on higher timeframes. The analyst’s hand-drawn black curve on the chart begins near $0.17 and initially curves downward, touching the upper boundary of the Kumo in the near future, likely near the $0.15–0.16 zone. This suggests an expected retest of the cloud support, a common setup in trend continuation trades. Rather than projecting a breakdown, the curve depicts this contact as a springboard for a rapid vertical rally. Related Reading: Dogecoin Under $0.20 ‘Is Free,’ Says Analyst—Predicts 2,000% Upside Once the price completes its cloud retest, the trajectory steepens dramatically, punching through overhead resistance near $0.29—the approximate flat Kijun-sen level—then continuing past prior 2024 highs. The final stretch of the curve accelerates toward the $1 level sometime in 2026, consistent with the behavior seen in prior memecoin mania phases. Interestingly, Cantonese Cat’s conviction comes despite several bearish near-term signals. Just two days prior to publishing the chart, the analyst wrote: “DOGE closed the month below the 20-month SMA, with a bearish engulfing candle! I would care if the volume wasn’t so pathetic…” That statement acknowledged structural weakness but dismissed it on the basis of low participation, hinting that sellers lacked conviction. The same day, the trader disclosed renewed entries into DOGE and Avalanche, stating, “I don’t know if I’m doing it right, but I bought AVAX and DOGE again this morning.” Broader Context DOGE’s memetic status makes it particularly susceptible to sentiment shifts, and it remains uncorrelated to fundamentals in the traditional sense. Still, in the 2021 and 2024 bull markets, DOGE served as a proxy for retail risk appetite, often outperforming once attention rotated from majors like Bitcoin and Ethereum. The green cloud forecast and the rising trajectory into 2026 may reflect not just technical setups, but a broader cyclical expectation: that another wave of liquidity, speculative mania, or cultural relevance could return DOGE to the spotlight. For now, however, the price must hold the cloud before the market can validate this roadmap. At press time, DOGE traded at $0.1678. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Altcoin Season Not Remotely Close, Bitcoin Dominance Still Too High: Market Expert Says",
      "link": "https://www.newsbtc.com/altcoin/altcoin-season-bitcoin-dominance-2/",
      "summary": "The wait for altcoin season continues as the crypto market is still showing signs of bearish movement. Expectations are high that the altcoin market will begin to rally soon, but not everyone is optimistic that the altcoin season is coming. One of those is market analyst and expert Stockmoney Lizards, who has said that it is not happening soon. Altcoin Season Is Not Happening Soon In an X (formerly Twitter) post, Stockmoney Lizards informed their over 160,000 followers that the altcoin season could not be happening anytime soon. The analyst said that it is “not even remotely close”, pointing to the rising Bitcoin dominance as the reason why the altcoin season is still far off. Related Reading: Analyst Says Cycle Is Not Finished Amid 2 Years Of Bitcoin Sideways Movement Analyzing the chart, the market expert explains that despite the Bitcoin dominance having fallen by around 2%, it still doesn’t mean much. This is because the dominance is still very strong and continues to trade inside the channel. This channel also charts a possible increase in the Bitcoin dominance from here, which would be detrimental for altcoins. So far, the Bitcoin dominance has also managed to hold above 65%. While this is not the highest it has ever been, it is still incredibly high, with previous altcoin seasons not happening until the dominance had fallen toward 40%. The analyst doesn’t entirely rule out the possibility of an altcoin season, saying it will still come. However, for now, Bitcoin continues to dominate, as he explains that “BTC is the measure of all things.” Altcoin Dominance Reaches 2021 Levels As the Bitcoin dominance has risen and the altcoin dominance has fallen, they have gone toward levels not seen in years. For example, the last time the Bitcoin dominance was above 65% was back in 2021 before it crashed to usher in the altcoin season, according to data from CoinMarketCap. Related Reading: AI Founder Puts XRP Price As High As $20-$30 Even worse is the Ethereum dominance, which has dropped to 5-year lows. Sitting at only 8%, it is now at levels recorded back in 2020 before the market rebounded from the COVID-19 crash. This has greatly diminished Ethereum’s ability to pull the altcoin market up with it. In the same vein, the altcoin dominance, excluding Ethereum, has now dropped to 26%. The last time that the OTHERS dominance was this low was in 2021. However, this was right around when the altcoin season was starting, suggesting that the current market could be at the cusp of another altcoin run. Nevertheless, for there to be any sustainable altcoin season, the Bitcoin dominance must first crash. Going by what happened back in 2017 and 2021, at least a 40% crash in the Bitcoin dominance is required to usher in the altcoin season. Featured image from Getty Images, chart from TradingView.com"
    },
    {
      "title": "SUI Prepares For Bullish Flag Breakout Amid $3 Reclaim – Analyst Doubles The Target",
      "link": "https://www.newsbtc.com/news/sui-prepares-for-bullish-flag-breakout-amid-3-reclaim-analyst-doubles-the-target/",
      "summary": "After recovering from the recent pullbacks, SUI is attempting to reclaim a crucial resistance, which could trigger a breakout from its bullish formation. Some analysts believe that the cryptocurrency’s imminent rally could target significantly higher levels. Related Reading: Ethereum Eyes Key Resistance As Price Reclaims $2,550 – Here Are The Levels To Watch SUI Eyes Key Area Reclaim On Thursday, SUI has surged more than 10% from its $2.70 support toward the crucial $3.00 barrier. The cryptocurrency has been attempting to reclaim this area throughout Thursday, hovering between the $2.95 and $3.08 levels. Notably, the altcoin ended its multi-month downtrend after breaking above its descending resistance at the end of March, fueling its rally toward the $4.29 high in May. Since the Q2 breakout, SUI has been trading within the $2.33-$4.10 range. Nonetheless, the June pullbacks, driven by the global geopolitical tensions, sent the token below the $3.00 mid-range support to its local low of $2.22 nearly two weeks ago, before reclaiming the $2.80-$2.90 area. Amid the start-of-month retracement, the altcoin briefly lost its local range, but the Wednesday pump reignited bullish sentiment and potentially set the stage for a rally continuation. Analyst Alex Clay noted that SUI is currently testing the confluence of the 50-day, 100-day, and 200-day Exponential Moving Averages (EMAs) resistances alongside its bullish flag resistance. According to the chart, the cryptocurrency has been trading within a bullish flag formation since May, and lost the technical indicators throughout the June pullbacks. Now, the indicators and the patterns’ upper boundary sit as resistance around the $3.00-$3.10 area. If the altcoin reclaims these key levels, the analyst considers that a rally to the $5.00 resistance would be “an easy trade.” Is A Breakout To $10 Nearby? Analyst Marcus pointed out that SUI “just snapped back from the 0.786 Fib zone sharp, clean and confident.” He added that the cryptocurrency’s structure held despite the correction, which confirmed a “healthy pullback, not a breakdown.” To the analyst, the current bounce could be the higher low that sets the stage for SUI’s next major move, as “all signs point to a setup that’s not done yet.” Meanwhile, market Watcher Crypto Yhodda affirmed that SUI is “in a big accumulation right now,” pointing to an eight-month triangle formation. According to the analyst, a breakout from this pattern “can help it reach the dream target of $10.” Similarly, Kaleo highlighted SUI’s bounce on its trading pairs against Bitcoin (BTC) and USD. He explained that there are many similarities between the base the altcoin is currently building and the base from the April lows that propelled the token to its local high. The cryptocurrency bounced off the High timeframe (HTF) ascending support line on both occasions, suggesting a massive rally could be ahead. To the analyst, the $10 target is “a magnet.” Related Reading: Bitcoin Holds Key Level Amid $108,000 Rejection, But Analysts Suggest Caution This Quarter Crypto Batman also highlighted this ascending support, noting that the recent pullback marks the third time the cryptocurrency has bounced from it since August. Following the previous two retests, the token rallied for weeks toward higher levels, signaling that a breakout could be nearby. Additionally, he considers that SUI displays a “solid-looking setup,” as it is trading above the key $2.30-$2.40 area that has served as resistance and support on the weekly chart. As of this writing, SUI trades at $3.09, a 15% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Analyst Sees a Bitcoin Market Shift — Here’s What’s Happening",
      "link": "https://www.newsbtc.com/bitcoin-news/analyst-sees-a-bitcoin-market-shift-heres-whats-happening/",
      "summary": "The Bitcoin market now appears to be seeing a notable surge in its momentum, with the asset finally breaching the $110,000 mark to inch really close to its all-time high. The asset has so far registered a 24-hour high of $110,117, less than 3% increase away from its all-time high of $111,814 registered in May. At the time of writing, BTC trades back at $109,000 levels, marking a 1.3% increase in the past day. While the price action alone has fueled speculation of an imminent breakout, several analysts suggest that deeper structural shifts within the market are at play. On-chain data particularly reveals changes in whale activity, exchange flows, and stablecoin dynamics that could offer clues about the market’s next move. Related Reading: Bitwise Just Sounded The Alarm—Bitcoin Could Explode Soon Signs of Reduced Bitcoin Selling Pressure and Upward Bias CryptoQuant analyst Crypto Dan shared a detailed view of the current state of Bitcoin’s price structure, emphasizing a broader directional change in the market that began in April. According to the analyst, Bitcoin’s recent price resilience can be attributed to a noticeable decline in selling pressure from US-based institutional investors and whales. These large players, who were previously offloading significant holdings, have shifted into accumulation mode in recent months. Dan explained that Bitcoin appears to be in a transitional phase. He observed a gradual fade in sell-side activity from major US wallets since April, and that drop has been met with stable buying pressure. This suggests that institutions are no longer offloading positions but are maintaining or adding to their holdings. Dan added that the current consolidation, marked by Bitcoin&#8217;s price hovering above the $100,000 range, is allowing short-term overheated indicators to cool down. Dan noted: While the possibility of a correction remains, the broader market direction continues to be upward, so I will maintain my perspective and look forward to the second half of 2025. Overall, this could mean that the ongoing price action in the market may be the calm before a longer-term move upward, assuming macro conditions remain supportive. Exchange Outflows and Liquidity Trends Paint a Risk-On Picture Adding further context, another CryptoQuant contributor, Novaque Research, pointed to recent shifts in on-chain flows and broader liquidity conditions. According to their data, exchange outflows have picked up notably since late June, with some days seeing over 10,000 BTC withdrawn. Such behavior typically signals long-term investor confidence and a reduced likelihood of near-term sell pressure. Additionally, the report noted that miners have remained largely inactive in terms of selling despite BTC trading above $100,000. Related Reading: Whales Are Quietly Repositioning, Here’s What Bitcoin’s $107K Price Isn’t Telling You This suggests confidence in price sustainability and possible anticipation of more favorable financial conditions. Meanwhile, stablecoin activity has also shown key changes. Both USDC and USDT supply ratios on exchanges have been trending downward since mid-June, indicating capital is sitting idle rather than flowing into spot markets. Novaque noted that investors may be on the sidelines waiting for confirmation, but the structural behavior is leaning toward accumulation. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin Latest Rally Backed By Stronger Purchasing Power: Report",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-rally-backed-stronger-purchasing-power/",
      "summary": "Data of the Bitcoin Stablecoin Supply Ratio suggests investors have stronger purchasing power today than during the previous bull rally. Bitcoin Stablecoin Supply Ratio Showing Neutral Purchasing Power In its latest weekly report, the on-chain analytics firm Glassnode has talked about the latest trend in the Stablecoin Supply Ratio (SSR) of Bitcoin. This indicator measures the ratio between the Bitcoin supply and the supply of stablecoins. Related Reading: Dogecoin Bounces Back With 8% Gain—Is $0.26 In Sight? Stablecoins are cryptocurrencies that have their price tied to a fiat currency. The SSR specifically measures the supply of the stablecoins tied to the US Dollar (USD). As for the role that these assets play in the sector, Glassnode explains: Stablecoins have become a critical component of the digital asset ecosystem, serving as the primary quote asset for trading across both centralized and decentralized venues. Functionally, they represent readily available capital, or &#8220;dry powder&#8221;, available for digital asset purchases. As such, the SSR compares the Bitcoin supply against this available dry powder. In other words, it tells us about how the cryptocurrency compares against the investor&#8217;s purchasing power. When the value of the metric is high, it means the BTC supply is high compared to the stablecoin supply. In other words, the trader&#8217;s purchasing power is weak. On the other hand, the indicator being low suggests there is high dry powder available relative to the BTC supply. In the context of the current discussion, the SSR itself isn&#8217;t of focus, but rather a modified indicator called the SSR Oscillator. According to the analytics firm, the metric measures &#8220;how the 200d SMA of the SSR moves within the Bollinger Bands BB(200, 2).&#8221; Now, here is a chart that shows the trend in the Bitcoin SSR Oscillator over the last few years: As displayed in the above graph, the Bitcoin SSR Oscillator has been close to the zero mark during the last couple of months, indicating the investor purchasing power is more or less neutral compared to the size of the BTC supply. Related Reading: Bitcoin Short-Term Upper Bound Is $117,000, Glassnode Says From the chart, it&#8217;s visible that the trend was different during the rally beyond $100,000 that occurred late last year. Back then, the SSR Oscillator took on a highly positive value, suggesting the stablecoin supply was low relative to BTC. The cryptocurrency is currently also trading around the same levels as then, yet the SSR is showing a different story. &#8220;Despite similar price levels, this shift suggests that investor purchasing power has improved markedly, reflecting stronger underlying demand conditions,&#8221; notes the report. BTC Price At the time of writing, Bitcoin is trading around $109,500, up over 2% in the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Senator Lummis’ New Bill Enables Tax-Exempt Bitcoin Spending — But Thresholds Are Too Low",
      "link": "https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Senator-Lummis-at-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start\" rel=\"nofollow\"> </a></p> <p>Long-time Bitcoin advocate Senator Cynthia Lummis (R-WY) has drafted a bill that allows Bitcoin enthusiasts to spend small amounts of bitcoin without incurring capital gains taxes (which is very cool), but many — including myself — feel that the spending limits in the bill are too low.</p> <p>"
    },
    {
      "title": "Senator Lummis Introduces Digital Asset Tax Legislation",
      "link": "https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/US-Senator-Cynthia-Lummis-Discusses-Bitcoin-Reserve-Stablecoin-Legislation-and-Market-Structure-Bill-at-Bitcoin-2025-Conference.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation\" rel=\"nofollow\"> </a></p> <p>The bill proposes a $300 exemption for small Bitcoin and crypto transactions, defers taxes on mining and staking until assets are sold.</p> <p>"
    },
    {
      "title": "Bitcoin Miner Riot Produces 450 Bitcoin In June",
      "link": "https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Miner-Riot-Produces-450-Bitcoin-In-June.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june\" rel=\"nofollow\"> </a></p> <p>The company saw a 76% year-over-year increase in production, earned $5.6 million in power credits, and ended the month holding 19,273 Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin at UATX: A New Era of Intellectual Sovereignty",
      "link": "https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_A_majestic_depiction_of_the_Texas_State_Ca_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty\" rel=\"nofollow\"> </a></p> <p>UATX’s Bitcoin Endowment and hands-on curriculum defy academia’s past. Students mine with Antminer S9s — could this shape Bitcoin’s academic future? </p> <p>"
    },
    {
      "title": "Blue Star Capital Secures £1.25M For Bitcoin and Crypto Treasury Expansion",
      "link": "https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Blue-Star-Capital-Secures-1.25M-For-Bitcoin-and-Crypto-Treasury-Expansion.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion\" rel=\"nofollow\"> </a></p> <p>The funding will be used to expand SatoshiPay’s Bitcoin and crypto treasury and enhance its crypto operations. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Altcoins XRP, SOL, DOGE Slump as Trump Reignites Trade Tensions, Passes ‘Big, Beautiful Bill’",
      "link": "https://decrypt.co/328596/altcoins-xrp-sol-doge-slump-as-trump-reignites-trade-tensions-passes-big-beautiful-bill",
      "summary": "Altcoins are down after U.S. President Donald Trump announced plans to send letters to trading partners setting out tariff rates."
    },
    {
      "title": "Bitcoin ETF Inflows Surge Past $600 Million for First Time Since May",
      "link": "https://decrypt.co/328589/bitcoin-etf-inflows-surge-past-600-million-for-first-time-since-may",
      "summary": "BlackRock’s IBIT and Fidelity’s FBTC led Thursday’s inflows as investors repositioned around Trump’s tax bill and shifting market conditions."
    },
    {
      "title": "Detroit Sues Crypto Real Estate Platform Over Safety, Health Violations",
      "link": "https://decrypt.co/328586/detroit-sues-crypto-real-estate-platform-safety-health-violations",
      "summary": "The city alleges the asset tokenization platform left hundreds of properties in disrepair, even as it promised significant returns."
    },
    {
      "title": "UK and Singapore Forge New AI and Tokenization Pact in London Talks",
      "link": "https://decrypt.co/328583/uk-singapore-ai-tokenization-pact-london-talks",
      "summary": "Officials are exploring cooperation in digital finance, ranging from asset tokenization to artificial intelligence."
    },
    {
      "title": "Japan's Minna Bank Explores Stablecoins on Solana in Fireblocks-Led Study",
      "link": "https://decrypt.co/328372/japans-minna-bank-stablecoins-solana-fireblocks-study",
      "summary": "The study will examine whether stablecoins are suitable for modernizing payments and cross-border finance in Japan."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "TRON DAO joins EthCC as WAGMI Sponsor, co-hosts events with MetaMask and Arkham",
      "link": "https://cryptobriefing.com/tron-eth-partnership-ethcc/",
      "summary": "<p>TRON DAO's active role at EthCC highlights its strategic push for cross-chain collaboration and strengthening ties within the blockchain community.</p> <p>"
    },
    {
      "title": "Trump’s ‘Big Beautiful Bill’ clears Congress after narrow House vote, what could this mean for Bitcoin?",
      "link": "https://cryptobriefing.com/trump-tax-bill-congress-vote/",
      "summary": "<p>The bill's passage may lead to a liquidity squeeze, impacting Bitcoin's price volatility and potentially increasing national debt concerns.</p> <p>"
    },
    {
      "title": "Senator Lummis proposes to exempt small crypto transactions from taxes, ending double taxation for miners and stakers",
      "link": "https://cryptobriefing.com/crypto-tax-reform-innovation-users/",
      "summary": "<p>The proposed tax reform could boost crypto adoption, enhance U.S. competitiveness in digital finance, and simplify tax compliance for users.</p> <p>"
    },
    {
      "title": "TON builder The Open Platform raises $28.5 million, reaches $1 billion valuation in extended Series A",
      "link": "https://cryptobriefing.com/ton-blockchain-funding-unicorn-status/",
      "summary": "<p>The funding and valuation boost for The Open Platform could accelerate global blockchain adoption, leveraging Telegram's extensive user base.</p> <p>"
    },
    {
      "title": "IMF denies Pakistan’s proposal to offer cheap power to Bitcoin, crypto miners",
      "link": "https://cryptobriefing.com/crypto-mining-electricity-pakistan-imf/",
      "summary": "<p>The IMF's rejection highlights challenges in balancing economic growth with sustainable energy policies in developing nations.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Cardano whales are back! – Assessing how ADA can reach $0.91 next",
      "link": "https://ambcrypto.com/cardano-whales-are-back-assessing-how-ada-can-reach-0-91-next/",
      "summary": "<img alt=\"ADA\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-04T112035.682-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ADA’s rally faces resistance as valuation concerns emerge despite strong buyer activity."
    },
    {
      "title": "Bitcoin – THIS could be the breakout setup that changes everything!",
      "link": "https://ambcrypto.com/bitcoin-this-could-be-the-breakout-setup-that-changes-everything/",
      "summary": "<img alt=\"bitcoin binance\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Traders pile in ahead of strong jobs data; but can risk appetite survive macro reality?"
    },
    {
      "title": "What is Shibacoin (SHIC)? How to Mine Shibacoin (SHIC)",
      "link": "https://ambcrypto.com/what-is-shibacoin-shic-how-to-mine-shibacoin-shic/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"540\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/photo_2025-07-04-15.13.57-1.jpeg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1080\" />Dogecoin and Shiba Inu are two popular meme coins often compared by users. However, their [&#8230;]"
    },
    {
      "title": "Why Solana and Ethereum are set to rally soon – Crypto VC weighs in",
      "link": "https://ambcrypto.com/why-solana-and-ethereum-are-set-to-rally-soon-crypto-vc-weighs-in/",
      "summary": "<img alt=\"SOL ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/SOLETHFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Wall Street could FOMO on SOL and ETH as stablecoin and tokenized stocks momentum grows."
    },
    {
      "title": "A Bitcoin ATH in the making? – Here’s why KEY data suggests…",
      "link": "https://ambcrypto.com/a-bitcoin-ath-in-the-making-heres-why-key-data-suggests/",
      "summary": "<img alt=\"A new Bitcoin all-time high could be brewing, here are the signs that support this\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Bitcoin-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A 40% decrease in coins flowing to exchanges, according to the flow multiple, showed decreased short-term inflows and implied exhausted sellers."
    }
  ]
}