{
  "CoinDesk": [
    {
      "title": "Anthony Pompliano’s ProCap to Go Public in $1B Bitcoin Treasury SPAC Deal",
      "link": "https://www.coindesk.com/business/2025/06/23/anthony-pomplianos-procap-to-go-public-in-1b-bitcoin-treasury-spac-deal",
      "summary": ""
    },
    {
      "title": "Veda Raises $18M to Expand DeFi Vault Infrastructure Powering Over $3.7B in Assets",
      "link": "https://www.coindesk.com/business/2025/06/23/veda-raises-usd18m-to-expand-defi-vault-infrastructure-powering-over-usd3-7b-in-assets",
      "summary": ""
    },
    {
      "title": "5G Chipmaker Sequans Joins the Bitcoin Treasury Strategy Rush",
      "link": "https://www.coindesk.com/business/2025/06/23/5g-chipmaker-sequans-announces-it-will-raise-usd384m-to-kickstart-bitcoin-treasury",
      "summary": ""
    },
    {
      "title": "NEAR Protocol Surges 7% After Volatility Test, Establishes Key Support",
      "link": "https://www.coindesk.com/markets/2025/06/23/near-protocol-surges-7-after-volatility-test-establishes-key-support",
      "summary": ""
    },
    {
      "title": "XRP Reclaims $2 Level After Sharp Sell-Off, Futures Volume Hits $4B",
      "link": "https://www.coindesk.com/markets/2025/06/23/xrp-reclaims-2-level-after-sharp-sell-off-futures-volume-hits-4b",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin becomes less volatile than stocks in the Iran-Israel conflict: Data",
      "link": "https://cointelegraph.com/news/bitcoin-becomes-less-volatile-than-stocks-in-iran-israel-conflict?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzljNDAtMGU1OC03OWFhLTk0YTctMzZmY2VkZjhmNWJj.jpg\" /></p><p>Long-term Bitcoin holders now control a record 14.53 million BTC, tightening supply as institutional demand rises despite geopolitical tensions.</p>"
    },
    {
      "title": "Trezor warns users about phishing emails mimicking customer support",
      "link": "https://cointelegraph.com/news/hardware-wallet-trezor-warns-customers-of-phishing-through-fake-support-emails?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzljN2EtMjgyYS03NjgyLWEzMjEtOGU3OWUxZmNlMjY2.jpg\" /></p><p>Trezor warned of ongoing phishing attempts exploiting its support contact form.</p>"
    },
    {
      "title": "Investor makes nearly $30M from Bitcoin bought in 2013",
      "link": "https://cointelegraph.com/news/investor-makes-nearly-30m-from-bitcoin-bought-in-2013?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzA5YzMtMmVlYi03ZTRhLWIwNmItNDVkOTRlMzM1MjFh.jpg\" /></p><p>The savvy Bitcoin investor made a 496-fold return on his initial $60,000 investment in 2013.</p>"
    },
    {
      "title": "Strategy buys $26M Bitcoin as prices bleed on geopolitical fears",
      "link": "https://cointelegraph.com/news/strategy-buys-245-bitcoin-as-btc-bleeds-amid-geopolitical-fears?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU0OGEtZWMyOS03MDZiLTkyZTMtODU5YWVmMzg3ZWM1.jpg\" /></p><p>Michael Saylor’s Strategy bought another 245 Bitcoin last week after doubling down on his long-term BTC price prediction, forecasting BTC to hit $21 million in 21 years.</p>"
    },
    {
      "title": "Is XRP price going to crash again?",
      "link": "https://cointelegraph.com/news/is-xrp-price-going-to-crash-again?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzZkOGMtODJiNC03ZTE1LTk3ZjgtNDhhZDZhYzkxYWRi.jpg\" /></p><p>XRP price risks a possible 41% plunge to $1.18 if a descending triangle pattern is confirmed on the charts.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin and Ethereum inflows surge past $1.2B despite rising geopolitical risks",
      "link": "https://cryptoslate.com/bitcoin-and-ethereum-inflows-surge-past-1-2b-despite-rising-geopolitical-risks/",
      "summary": "<p>Digital asset investment products recorded their tenth straight week of inflows, bringing in $1.24 billion last week, according to data from CoinShares. This continued streak has pushed year-to-date (YTD) inflows to $15.1 billion, a new record for this year. The inflows come at a time of heightened geopolitical tension, particularly following Israel&#8217;s military action against [&#8230;]</p> <p>"
    },
    {
      "title": "OKX’s US comeback may reportedly lead to an IPO launch amid wave of interest",
      "link": "https://cryptoslate.com/okxs-us-comeback-may-reportedly-lead-to-an-ipo-launch-amid-wave-of-interest/",
      "summary": "<p>The crypto exchange OKX is reportedly considering an initial US public offering (IPO) as the wave of crypto firms entering public markets gains momentum. Although the exchange has not officially confirmed these plans, Chief Marketing Officer Haider Rafique hinted at the possibility during a conversation with The Information, suggesting an IPO could be on the [&#8230;]</p> <p>"
    },
    {
      "title": "Kazakhstan launches Central Asia’s first Solana Economic Zone to boost crypto hub ambitions",
      "link": "https://cryptoslate.com/kazakhstan-launches-central-asias-first-solana-economic-zone-to-boost-crypto-hub-ambitions/",
      "summary": "<p>Kazakhstan has officially launched Central Asia’s first Solana Economic Zone (SEZ), marking a major step toward its ambition to become a regional crypto and blockchain hub. The new zone was introduced during the 2025 International Forum in Kazakhstan and follows through on the country’s Memorandum of Understanding (MOU) with the Solana Foundation, the non-profit organization [&#8230;]</p> <p>"
    },
    {
      "title": "Over $1.79 billion liquidated from crypto market as Bitcoin dipped below $100k after US bombed Iran",
      "link": "https://cryptoslate.com/over-1-79-billion-liquidated-from-crypto-market-as-bitcoin-dipped-below-100k-after-us-bombed-iran/",
      "summary": "<p>The sudden escalation in Middle East tensions over the weekend triggered sharp moves across global markets, with Bitcoin plunging below the $100,000 mark for the first time since May. The drop followed a surprise U.S. airstrike on Iranian nuclear facilities and a retaliatory vote by Tehran’s parliament to authorize the closure of the Strait of [&#8230;]</p> <p>"
    },
    {
      "title": "Cointelegraph and CoinMarketCap front ends compromised with scam links over the weekend",
      "link": "https://cryptoslate.com/cointelegraph-and-coinmarketcap-front-ends-compromised-with-scam-links-over-the-weekend/",
      "summary": "<p>Cointelegraph, one of the leading crypto media platforms, has confirmed a front-end security breach that exposed its users to a malicious pop-up urging them to connect their wallets. The incident, which occurred on June 22, involved scammers promoting a fake Cointelegraph token (CTG) and a counterfeit initial coin offering (ICO) campaign. Scam Sniffer, a blockchain [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Analyst Puts XRP Cycle High At $20-$30, Here’s Why",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-cycle-high-at-20-30/",
      "summary": "The XRP price could be preparing for a historical rally, as a prominent crypto analyst has boldly predicted that the cryptocurrency could reach a fresh cycle top between $20 and $30. The forecast, which presents a massive upside for the altcoin, is based on the Elliott Wave Theory—a key technical analysis tool. XRP Wave Map Signals Cycle Top Ahead Crypto analyst, XForceGlobal on X (formerly Twitter) has presented a bold new forecast for XRP, projecting a cycle high between $20 and $30. The analyst shared a chart that dissects XRP’s price action over the last several months, suggesting that the cryptocurrency is currently in the final stages of a corrective wave before beginning a powerful multi-leg impulsive rally. If this wave count plays out as the market expert says, XRP could be on the verge of its most aggressive breakout to date. Related Reading: XRP Price Targets $3.61 In Short Term As ‘Cup’ Turns Hot The analysis focuses on XRP’s medium-term correction, which has taken the form of a complex WXY structure. According to the chart, XRP is nearing the completion of Wave 2, a corrective phase that began after the last upward impulse. XForceGlobal has pinpointed a key Fibonacci confluence zone between $1.60 and $1.90, where XRP’s pullback is expected to find support. The chart clearly marks this area as a potential springboard for the next bullish phase, as long as the price does not fall below the $1.618 level, which serves as the invalidation point for the current setup. Despite XRP’s historical track record of sluggish performance and ongoing skepticism within the crypto community about the bullish forecast, XForceGlobal maintains confidence that the cryptocurrency will reach the ambitious $20-$30 cycle top—a move he believes could unfold well into 2026. Intermediate Targets First, Cycle High Later According to XForceGlobal’s chart, once XRP completes its current corrective move, the analyst predicts that the first leg of this upcoming rally may take the cryptocurrency past the $5 mark in Wave 3, followed by a deeper Wave 4 pullback and a final thrust into Wave 5 toward $6 or more. Related Reading: XRP 5-Wave Count Shows When The Price Will Hit All-Time Highs Above $5 While these targets represent an intermediate-term bullish setup, on a macro scale, the long-term wave map implies that the whole structure could later culminate in a parabolic cycle top rally that sends XRP between $20 and possibly even $30. This optimistic outlook gains further credibility, as the analyst notes that XRP’s internal wave count for the flat scenario has taken longer to resolve than initially expected. Beyond technicals, XForceGlobal highlights that market psychology plays a central role in its bullish forecast. He notes that the XRP community has weathered regulatory battles, market crashes, and years of stagnation, most notably the US SEC lawsuit. This prolonged adversity has turned XRP holders into “battle-tested veterans” who are largely immune to fear-driven selling. This resilience, according to the analyst, could be the key to the next bullish phase of XRP’s price action. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "Cointelegraph and CoinMarketCap Hacked: Why Non-Custodial Wallets Are Necessary",
      "link": "https://www.newsbtc.com/news/cointelegraph-and-coinmarketcap-hacked-why-non-custodial-wallets-are-necessary/",
      "summary": "Want to check on Bitcoin’s latest price moves? Just pop over to CoinMarketCap and… enter your wallet info? On June 20, 2025, visitors to a number of major crypto sites, including CoinTelegraph and CoinMarketCap, were prompted to connect their crypto wallets before accessing the site. The pop-up was a hack, a wallet-stealer designed to siphon information away from users. CoinMarketCap users can create accounts and connect wallets to track their portfolios, so the pop-up itself might not have seemed entirely out-of-place. Users quickly uncovered the hack, and affected sites moved rapidly to limit the damage. The incident highlights a new potential vulnerability in the growing crypto ecosystem. With such attacks, phishing can occur even on trusted platforms. What Wallet? Hacks Exploited Common Wallet Connectivity Features The incident involved the injection of malicious JavaScript code into CoinMarketCap’s homepage. When unsuspecting users visited the site, they were greeted with a realistic-looking ‘Connect Wallet to Verify’ popup, mimicking standard Web3 wallet connection prompts. Users who clicked the popup and approved the transaction gave attackers full access to their wallets. The CMC hack reportedly had 39 victims with over $18K in losses. The script was since removed, and CMC has patched the vulnerability. Cointelegraph Also Targeted Just days later, on June 23, Cointelegraph, another prominent crypto news outlet, faced a similar attack. In this case, attackers managed to compromise an ad-serving network, injecting code that produced a fake token airdrop popup promoting a nonexistent ‘Cointelegraph token&#8217; or &#8216;CTG.&#8217; The popup redirected users to a phishing site designed to harvest wallet signatures. Once again, users who interacted and signed the transaction lost access to their funds. Cointelegraph quickly issued a warning across its social media channels and disabled the malicious script. Both the CMC and CT hacks are part of a growing category of crypto hacks focused on compromising wallets. Per CertiK’s quarterly report, these attacks produce the largest losses (over $1.450M in Q1 2025 alone). Wallet compromises are not as successful as other attacks, ranking last by incident count. But when they work, hackers can make off with vast amounts quickly. Vigilance and Knowing the Warning Signs: Key to Avoid Losses Binance founder and former CEO Changpeng Zhao (CZ) took to X and warned users to ‘be careful when authorizing wallet connect.’ Both the CMC and CT hacks used pop-ups, one for a simple wallet connect prompt, and one for a purported crypto airdrop. Cointelegraph&#8217;s official account also posted a warning, urging users to not click the pop-ups, connect wallets, or provide their personal information. Crypto airdrops and crypto presales are often used by legitimate projects to develop early interest and generate buzz about new projects, making such phishing attacks more convincing. Scammers create fakes in order to encourage investors to give away wallet information. The supposed project or token – in this case ‘CTG’ – never existed. How do investors stay safe? Avoiding any unexpected or unusual pop-ups, even from trust sources, is a first step. And when it comes to the crypto ICOs and presales, it&#8217;s important to get your info from trusted sources. This is where a new solution, Best Wallet, stands out. This new app is the only Web3 wallet with a presale directory where you can browse only audited, secure presale tokens. The wallet also employs Multi-Party Computation technology, protecting your key from phishing attacks and hacks. Best Wallet Token ($BEST) – The World’s First and Only Crypto Presale Wallet The evolution of crypto hacks is unfortunately part of crypto&#8217;s growing market and popularity. New Web3 solutions, like Best Wallet, are evolving to tackle these security challenges, becoming a critical part of the crypto economy. And the Best Wallet Token ($BEST) is here to power-up the Best Wallet ecosystem and provide additional perks for holders. With $BEST, token holders can trade and swap tokens more easily, participate in community governance, and earn higher staking rewards. The token also allows early access to the best crypto presales, gathered and vetted by Best Wallet in their ‘Upcoming Tokens’ section. Here, investors can find upcoming crypto projects, as well as all the key information, such as whitepapers and tokenomics, needed to do research before investing. That makes Best Wallet&#8217;s platform and token some of the handiest tools for crypto investors who want to avoid shady pop-ups and still stay ahead of the markets. Most importantly, Best Wallet is non-custodial and privacy-focused; investors control all their wallet keys and can sign up and swap crypto without KYC. The Best Wallet token presale has raised $13.5M so far, with the coin currently priced at $0.025225. Note that, given its sought-after, privacy-oriented wallet, the $BEST token could reach $0.05 by the end of 2026 after a successful launch, delivering 102% returns to early investors. If you&#8217;re interested in supporting the project, now&#8217;s the right opportunity to buy the Best Wallet Token at the lowest price. Visit Best Wallet&#8217;s Token presale today. Security in the Age of Web3 The recent front-end Cointelegraph and CoinMarketCap hacks mark a dangerous new phase in crypto security threats. Unlike traditional hacking methods that target backend systems or databases, these exploits weaponize the user interface, where trust is assumed but rarely verified. Secure Web3 wallets like Best Wallet can go a long way towards mitigating such growing risks. As always, do your own research before investing or choosing a crypto service provider. This article isn&#8217;t financial advice."
    },
    {
      "title": "XRP To $30 Beyond 2026? Analyst Reveals Key BTC Ratio To Watch",
      "link": "https://www.newsbtc.com/xrp-news/xrp-to-30-beyond-2026-analyst-reveals-key-btc-ratio-to-watch/",
      "summary": "The market technician known on X as Dr Cat (@DoctorCatX) has published a post that condenses years of his XRP/BTC work into one number—2,041 satoshis—and a set of time-stamped price targets that reach as high as $30 per XRP once Bitcoin hits $270,000. In"
    },
    {
      "title": "Bitcoin Down But Not Out—Analyst Sees Recovery Ahead Amid Middle East War",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-down-but-not-out-arthur-hayes-sees-recovery-ahead/",
      "summary": "Bitcoin briefly slid to $98,974 late on Sunday after US airstrikes targeted Iranian nuclear facilities. That was its weakest point since early May. But by Monday morning in Asia, the leading cryptocurrency topped $101,000 again. Traders are weighing whether this was just a hiccup or the start of a fresh trend. Related Reading: Stablecoin Wars Ignite: Peter Schiff Champions Gold-Backed Digital Assets Source: CoinMarketCap Arthur Hayes Sees Temporary Weakness According to Arthur Hayes, co-founder of BitMEX, the fall is only a short pause. On X, he wrote that “weakness shall pass” and predicted Bitcoin will “leave no doubt as to its safe haven status.” He said fresh money printing by central banks will be the main force driving prices back up. His view suggests that big dips can turn into buying chances when broader liquidity is rising. Do you hear that? … it’s the sound of the money printers revving up to do their patriotic duty. This weakness shall pass and $BTC will leave no doubt as to its safe haven status. pic.twitter.com/PTfZaAXFp7 — Arthur Hayes (@CryptoHayes) June 22, 2025 Market Dips On Geopolitical News Based on reports, it was US strikes on Iran that triggered the initial slide. The price drop happened late Sunday, pushing Bitcoin below six figures for the first time since early May. Yet buyers stepped in quickly, snapping up coins and lifting the price back above $101,000 during the first hours of trading in Asia. That pattern shows how headline shocks can spark fast moves, but also how quickly sentiment can flip. Altcoins Take A Hit Meanwhile, over the past 12 hours, most altcoins fell about 1.4%, dragging total crypto market cap down by roughly $50 billion to $3.20 trillion, according to data. Experts expect that trend to reverse once major headlines calm down. Market analysts pointed out that altcoins might start to outperform if macro risks ease. They said smaller tokens are already showing signs of strength, even as Bitcoin stalls. Key Technical Levels Hold Traders are watching two key lines: the short-term realized price at $98,000 and the trend support at $102,000. The realized price reflects the average breakeven point for holders, so it often acts like a floor. Related Reading: Pump.fun’s Big Launch Put On Ice Over Legal Drama The $102,000 has capped rallies over the past weeks. As long as Bitcoin stays in that $98,000–$102,000 range, there are chances for quick rallies. But a break below $98,000 could force more focus on cutting losses. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Crypto Bull Run Over? Here’s What A Top Trader Just Said",
      "link": "https://www.newsbtc.com/news/crypto-bull-run-over-what-top-trader-just-said/",
      "summary": "With Bitcoin precariously recovering above the $100,000 mark and altcoins bleeding momentum, traders are asking the obvious: Is the crypto bull run over? According to systematic trader Adam Bakay (@abetrade), the answer is not so clear-cut. In a detailed market breakdown posted June 22, Bakay offered a technically grounded, cautiously defensive assessment—one that acknowledges geopolitical risks but stays rooted in positioning and price structure. Is The Bitcoin Bull Run Over? “Looking at the monthly and weekly timeframes, we are still technically in an uptrend,” Bakay wrote, noting that “no key swing low was broken, and the 365-day rolling VWAP has been respected during the pullback in April.” Despite this, he admits that “the failure to make new all-time highs similar to the top in 2021” is a concern—especially given the accumulation by players like BlackRock, which now holds around 3.5% of Bitcoin’s total supply. It’s that divergence—between strong institutional interest and a market struggling to break higher—that has made Bakay more cautious in recent weeks. “This is why I have been very defensive and kept most of my trades short-term,” he said. Related Reading: Crypto Gets A Green Light From Spanish Banking Giant His trading view focuses on two potential technical scenarios: either a reclaim of the $100,000 support area—“likely if the conflict in the Middle East does not further escalate”—or a dip into the $97,000–$95,000 range, where strong technical support resides in the form of the 200-day moving average, local price structure, and the 90-day rolling VWAP. Still, Bakay made it clear he’s not shorting the market. “I am not currently considering any short trades due to my current positioning,” he emphasized, adding that open interest is dropping and that we are starting to see the “first signs of clear spot bid interest since the April lows.” The options market, meanwhile, is flashing early caution: the 25-delta risk reversal skew sits around -5, not yet at panic levels, but trending more negative. Crypto Bull Run In Jeopardy On Ethereum, Bakay was notably blunt. “ETH almost had its moment, but of course had to become a disappointment,” he said. He attributes the failed breakout in part to how quickly the “DeFi Summer 2025” narrative went viral. “People are getting too horny, and market made sure to punish them,” he noted, referencing his own tweet from a few days earlier. Related Reading: Crypto’s Unlikely Ally: Top Analyst Reveals War As A Surprising Bullish Force The technical picture on ETH doesn’t inspire confidence either. “During significant market moves, like we had at the beginning of May, the last thing you want to see is price retracing throughout that area,” he explained, saying the next meaningful support lies near $1,800. On the daily chart, Ethereum is sitting right at a confluence of support—both the 90-day rolling VWAP and what he calls a “pivotal level.” Still, much like Bitcoin, Bakay sees Ethereum’s short-term fate as largely dependent on developments in the Middle East. On positioning, ETH also shows signs of an oversold environment, though Bakay believes high volatility in ETH options has caused traders to use spreads instead of outright directional bets. “Positioning is now very clearly pointing towards the possible upside reversal in both perpetual and spot,” he said. Altcoins received no reprieve. “Altcoins have not been having fun for quite a while,” Bakay wrote, pointing out that “every time it starts to look better, it will almost immediately get worse.” He notes that the expected rotation from Bitcoin into altcoins hasn’t materialized, and the real rotation now seems to be into crypto-related equities, which better reflect the ETF-driven macro trade. Even strong names like Solana are fading. “SOL has almost retraced the entire rally from April,” he warned. The key level to watch is $100. “There is not much of a technical support sub-$100,” and if “shit hits the fan,” Bakay would look to bid around that round number. Bakay also briefly touched on two newer altcoins—Hype and Fartcoin—saying one offers a solid product and the other draws interest through volatility and liquidity. “Fartcoin would become attractive if it could reclaim the $1 or $0.50 area. Hype could find a bounce sub-$30.” His closing thoughts were pragmatic: “We are not in easy market conditions, with a lot of geopolitical uncertainty, and markets can be significantly affected by a single news release.” While he believes the market may be “getting too short at the moment,” he remains highly conscious of the possibility that a multi-month correction is already in play. “I don’t think there is a need to be a hero and try to catch a falling knife,” he concluded. “I would much rather wait for some positive news and signs of lower timeframe reversals.” In essence, Bakay doesn’t call the top. But his post makes one thing clear: this is not a market for bravado. It’s a time for restraint, tight risk management, and respect for volatility—especially when the bullish case no longer has momentum on its side. At press time, BTC traded at $101,847. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Genesis Digital Assets Limited Acquires 1000 Air-Cooled Miners to Mine Bitcoin",
      "link": "https://bitcoinmagazine.com/news/genesis-digital-assets-limited-acquires-1000-air-cooled-miners-to-mine-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Genesis-Digital-Assets-Limited-Acquires-1000-Air-Cooled-Miners-to-Mine-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/genesis-digital-assets-limited-acquires-1000-air-cooled-miners-to-mine-bitcoin\" rel=\"nofollow\"> </a></p> <p>GDA bought Auradine’s air-cooled Miners and plans to install all of them at its 40 MW data center in Glasscock County, Texas.</p> <p>"
    },
    {
      "title": "Strategy Buys $26 Million Worth Of Bitcoin",
      "link": "https://bitcoinmagazine.com/news/strategy-buys-26-million-worth-of-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/02/Michael-Saylor-Signals-Strategys-Next-Bitcoin-Buy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/strategy-buys-26-million-worth-of-bitcoin\" rel=\"nofollow\"> </a></p> <p>Enterprise software firm acquires 245 BTC amid market volatility, bringing total holdings to 592,345 BTC as institutional adoption continues to accelerate.</p> <p>"
    },
    {
      "title": "Metaplanet Buys Additional ¥17.2 Billion Worth Of Bitcoin",
      "link": "https://bitcoinmagazine.com/news/metaplanet-buys-additional-%c2%a517-2-billion-worth-of-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2024/11/japan-scaled.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/metaplanet-buys-additional-%c2%a517-2-billion-worth-of-bitcoin\" rel=\"nofollow\"> </a></p> <p>Japanese public firm acquires 1,111 BTC at ¥15.5 million per coin, bringing total holdings to 11,111 BTC as institutional adoption accelerates.</p> <p>"
    },
    {
      "title": "Norway Plans to Temporarily Ban New Bitcoin & Crypto Mining Centers to Conserve Energy",
      "link": "https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/NBX-Acquires-Bitcoin-Becomes-First-Public-Bitcoin-Treasury-Company-in-Norway.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy\" rel=\"nofollow\">Norway Plans to Temporarily Ban New Bitcoin &amp; Crypto Mining Centers to Conserve Energy</a></p> <p>Norway’s government will temporarily block the development of new Bitcoin and cryptocurrency mining facilities starting this year, prioritizing energy for other industries.</p> <p>"
    },
    {
      "title": "A Seed Phrase Isn’t Self Custody, It’s A Liability.",
      "link": "https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/seedlessheader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability\" rel=\"nofollow\"> </a></p> <p>Seed phrases were an improvement a decade ago. They’re long overdue for an upgrade.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Teen Has 'Strong Incentives to Flee' After Pleading Guilty to $245M Bitcoin Heist, Gov Says",
      "link": "https://decrypt.co/326468/teen-has-strong-incentives-to-flee-after-pleading-guilty-to-245m-bitcoin-heist-gov-says",
      "summary": "The government argued that Veer Chatel’s co-conspirators could help him to flee the country to prevent him testifying against them."
    },
    {
      "title": "Metaplanet’s Symbolic 1,111 Bitcoin Buy Puts it at 10% of 2026 Target",
      "link": "https://decrypt.co/326458/metaplanets-symbolic-1111-bitcoin-buy-puts-it-at-10-of-2026-target",
      "summary": "The Japanese firm has achieved 11% of its ambitious 100,000 BTC goal for 2026 following its latest Bitcoin purchase."
    },
    {
      "title": "Crypto Exchange OKX Plans to Go Public in the US: Report",
      "link": "https://decrypt.co/326447/crypto-exchange-okx-public-us",
      "summary": "Broader interest in the crypto industry to capitalize on favorable U.S. market conditions is taking root, following Circle's IPO this month."
    },
    {
      "title": "Coinbase Secures MiCA License, Expanding Crypto Services Across EU",
      "link": "https://decrypt.co/326438/coinbase-mica-license-crypto-services-eu",
      "summary": "Approval from Luxembourg grants Coinbase access to 27 EU countries, raising questions about regulation shopping in smaller member states."
    },
    {
      "title": "Cointelegraph Website Hacked in Fake Airdrop Phishing Attack",
      "link": "https://decrypt.co/326435/cointelegraph-website-hacked-fake-airdrop-phishing-attack",
      "summary": "Cointelegraph is the latest in a wave of phishing attacks targeting crypto platforms via exploits that lure users with fake token rewards."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Michael Saylor’s Strategy makes smallest Bitcoin purchase since mid-March",
      "link": "https://cryptobriefing.com/strategy-bitcoin-acquisition-record/",
      "summary": "<p>Saylor's ongoing Bitcoin acquisitions highlight a strategic commitment to digital assets, potentially influencing market dynamics and investor sentiment.</p> <p>"
    },
    {
      "title": "Hackers exploit Trezor’s website to send phishing emails",
      "link": "https://cryptobriefing.com/trezor-security-alert-phishing-warning/",
      "summary": "<p>This incident highlights the growing sophistication of phishing attacks, underscoring the need for enhanced cybersecurity measures in crypto platforms.</p> <p>"
    },
    {
      "title": "Bitcoin crashes as Iranian Parliament approval of Hormuz Strait closure threatens oil disruption, stokes global inflation",
      "link": "https://cryptobriefing.com/bitcoin-oil-disruption-inflation/",
      "summary": "<p>The potential closure of the Strait of Hormuz could trigger global economic instability, with rising oil prices exacerbating inflationary pressures.</p> <p>"
    },
    {
      "title": "Trump announces US airstrikes on Iran’s nuclear sites, Bitcoin dumps, then pumps",
      "link": "https://cryptobriefing.com/us-iran-airstrikes-nuclear-sites/",
      "summary": "<p>The airstrikes heighten geopolitical tensions, potentially destabilizing the region and impacting global markets and cryptocurrency volatility.</p> <p>"
    },
    {
      "title": "Texas governor signs Bitcoin reserve bill into law",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-law/",
      "summary": "<p>Texas' Bitcoin reserve law could bolster financial resilience and set a precedent for other states to integrate crypto into fiscal strategies.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "HYPE defies trends: $17.5M whale play, $286K liquidations – Is $36 next?",
      "link": "https://ambcrypto.com/hype-defies-trends-17-5m-whale-play-286k-liquidations-is-36-next/",
      "summary": "<img alt=\"HYPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-23T115131.532-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE rallies against the trend as whales and liquidations strengthen its bullish structure."
    },
    {
      "title": "Gate’s nearly 70% MoM growth in derivatives volume tops global charts, featured in CoinDesk’s latest report",
      "link": "https://ambcrypto.com/gates-nearly-70-mom-growth-in-derivatives-volume-tops-global-charts-featured-in-coindesks-latest-report/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"516\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-23-175207.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"929\" />Gate has once again demonstrated its strong momentum and competitive edge in the crypto trading [&#8230;]"
    },
    {
      "title": "Bitcoin: What a 27% dip in BTC hashrate means for miners",
      "link": "https://ambcrypto.com/bitcoin-what-a-27-dip-in-btc-hashrate-means-for-miners/",
      "summary": "<img alt=\"Bitcoin hashrate\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BitcoinhashrateFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Assessing potential impact of hashrate decline on BTC's market sentiment"
    },
    {
      "title": "Ethereum dominance surges 12%, yet ETH struggles to hold $2K – Why?",
      "link": "https://ambcrypto.com/ethereum-dominance-surges-12-yet-eth-struggles-to-hold-2k-why/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-6-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum dominance against other altcoins surges despite struggles on ETH's price charts."
    },
    {
      "title": "ETHMilan returns for Its third edition on June 24, 2025, at the Museum of Science Technology",
      "link": "https://ambcrypto.com/ethmilan-returns-for-its-third-edition-on-june-24-2025-at-the-museum-of-science-technology/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"613\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-23-152549.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"928\" />ETHMilan, Italy’s largest international conference dedicated to Ethereum and Web3, returns for its highly anticipated [&#8230;]"
    }
  ]
}