{
  "CoinDesk": [
    {
      "title": "Ripple to Drop Cross-Appeal Against SEC, Ending Years-Long Legal Battle With SEC",
      "link": "https://www.coindesk.com/policy/2025/06/27/ripple-to-drop-cross-appeal-against-sec-ending-years-long-legal-battle-with-sec",
      "summary": ""
    },
    {
      "title": "Bitvavo Secures a MiCA License From the Netherlands",
      "link": "https://www.coindesk.com/policy/2025/06/27/bitvavo-secures-a-mica-license-from-the-netherlands",
      "summary": ""
    },
    {
      "title": "Gemini Rolls Out Tokenized Stocks in EU, Starting With Strategy Shares",
      "link": "https://www.coindesk.com/business/2025/06/27/gemini-rolls-out-tokenized-stocks-in-eu-starting-with-strategy-shares",
      "summary": ""
    },
    {
      "title": "Anchorage to Phase Out USDC, Agora USD Citing Risks, Stirring Fierce Backlash",
      "link": "https://www.coindesk.com/business/2025/06/27/anchorage-to-phase-out-usdc-agora-usd-citing-risks-stirring-fierce-backlash",
      "summary": ""
    },
    {
      "title": "Core Scientific Could Top $30 on CoreWeave Buyout Deal: Cantor Fitzgerald",
      "link": "https://www.coindesk.com/markets/2025/06/27/core-scientific-could-top-30-on-coreweave-buyout-deal-cantor-fitzgerald",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Fake IT insiders behind $1M in crypto losses across NFT protocols — ZackXBT",
      "link": "https://cointelegraph.com/news/it-insiders-responsible-1-million-losses-week?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2IyZjAtNGY0Yi03ZjExLTg2ZGEtOTg1NGM1M2IwYTUz.jpg\" /></p><p>Hackers and threat actors continue to infiltrate companies, blockchain projects and Web3 firms by exploiting remote work arrangements.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Crypto backers eye New York City mayoral race as next battleground",
      "link": "https://cointelegraph.com/news/crypto-backers-new-york-city-mayoral-race?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2IzNjEtMTcwMS03MjRiLWI4MzctNTY4NDg1ZmQ5NTBi.jpg\" /></p><p>Zohran Mamdani defeated Andrew Cuomo in the Democratic primary for New York City’s mayoral election, but he’ll be competing in a field where digital assets could be an issue.</p>"
    },
    {
      "title": "Solana ranks second in DEX volumes — Will SOL price follow?",
      "link": "https://cointelegraph.com/news/solana-ranks-second-in-dex-volumes-will-sol-price-follow?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5Njg3NDItYTQ4OC03OWEwLTlhNmYtMDFjZDQ5ZTJlMGUz.jpg\" /></p><p>Solana increased its DEX market share and moved ahead of Ethereum, but will SOL price follow anytime soon?</p>"
    },
    {
      "title": "Aptos sees surge in tokenization as asset managers go onchain",
      "link": "https://cointelegraph.com/news/aptos-tokenized-assets-traditional-managers?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2IyYzMtZjQ5MS03ODY2LWI4ZTMtYWE2MGI2NDIxM2Qw.jpg\" /></p><p>Aptos’ tokenized economy is being fueled by issuers such as Berkeley Square, Franklin Templeton and BlackRock.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Crypto payments soar 630% in Bolivia, central bank reports $430M since lifting ban",
      "link": "https://cryptoslate.com/crypto-payments-soar-630-in-bolivia-central-bank-reports-430m-since-lifting-ban/",
      "summary": "<p>The Bolivian central bank reported on June 27 that domestic crypto transactions totaled $430 million in the 12 months since regulators reopened formal payment rails, a 630% jump over the previous year. The Banco Central de Bolivia (BCB) reported that users processed 10,193 operations worth BOB 611 million as of May 31, 2025, approximately $88 [&#8230;]</p> <p>"
    },
    {
      "title": "Ripple, SEC agree to mutually abandon appeals, ending 5-year legal battle",
      "link": "https://cryptoslate.com/ripple-sec-agree-to-mutually-abandon-appeals-ending-5-year-legal-battle/",
      "summary": "<p>Ripple will drop its cross-appeal in its prolonged legal battle with the U.S. Securities and Exchange Commission, signaling an end to one of the crypto industry’s most consequential court cases. Ripple CEO Brad Garlinghouse announced the move on social media on June 27 and also revealed that the SEC is expected to drop its appeal [&#8230;]</p> <p>"
    },
    {
      "title": "FATF sounds alarm over rising stablecoin misuse as global crypto rules lag",
      "link": "https://cryptoslate.com/fatf-sounds-alarm-over-rising-stablecoin-misuse-as-global-crypto-rules-lag/",
      "summary": "<p>The Financial Action Task Force (FATF) said in a report released this week that global efforts to regulate virtual assets and service providers have improved but remain incomplete, with illicit use of stablecoins accelerating sharply in 2025. The intergovernmental watchdog’s sixth targeted update on the implementation of its standards found that although 73% of jurisdictions [&#8230;]</p> <p>"
    },
    {
      "title": "Moonshot unveils memecoin creation with just a photo and Apple Pay",
      "link": "https://cryptoslate.com/moonshot-unveils-memecoin-creation-with-just-a-photo-and-apple-pay/",
      "summary": "<p>Moonshot added Apple Pay support for launching new memecoins on June 27, expanding its iOS application beyond buying and trading tokens to include a creation workflow that requires only a photo upload and a tap on the “Create” tab. Branded Moonshot Create, the product allows any user to mint a Solana-based coin by submitting an [&#8230;]</p> <p>"
    },
    {
      "title": "Pepe meme creator’s NFT projects hit for $1 million as contract hijackers drain collections",
      "link": "https://cryptoslate.com/pepe-meme-creators-nft-projects-hit-for-1-million-as-contract-hijackers-drain-collections/",
      "summary": "<p>Projects tied to Pepe meme creator Matt Furie and the NFT studio ChainSaw lost roughly $1 million to contract takeover exploits last week, according to on-chain investigator ZachXBT. On June 27, ZachXBT reported transaction records showing that the attacker seized control of the “Replicandy” contract at 4:25 a.m. UTC on June 18 by transferring ownership [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Fading Spot Volumes And Muted Futures Sentiment Threaten To Send Bitcoin Below $99,000 Again",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-to-go-below-99000/",
      "summary": "Bitcoin returned to its familiar price range over the week after a dip last weekend brought its price to just under $99,000. This was followed by a bounce to the $106,000 price level, which has given bulls a reason to remain hopeful. However, on-chain data shows some deeper cracks are forming beneath the surface. The latest on-chain data from analytics firm Glassnode shows growing signs of fatigue in both spot and futures markets. These are conditions that may again cause Bitcoin price to retest $99,000. Price Support Holds, But Momentum is Clearly Fading Bitcoin has gone through multiple price swings in recent days, but it has found its way back to the narrow $100,000 to $110,000 band that has defined market structure since early May. On-chain data from Glassnode shows that strong accumulation between $93,000 and $100,000, which is visible on the Cumulative Volume Delta (CBD) Heatmap, has so far served as a buffer zone that helped Bitcoin&#8217;s prices bounce during the most recent geopolitical volatility. However, market volume indicates that this structural support may soon face additional pressure. Related Reading: Is The Bitcoin Top In? Bitcoin MVRV-Score Has The Answer According to the latest weekly report by Glassnode, investor profitability and engagement surrounding Bitcoin are cooling rapidly. Specifically, a third major wave of profit-taking is causing the 30-day realized profit average to taper, and on-chain activity has decreased significantly. The 7-day moving average of on-chain transfer volume has dropped by about 32%, from a peak of $76 billion in late May to $52 billion over the recent weekend. Current spot volume trading, which is now at just $7.7 billion, is far below the volumes seen during previous rallies. The lack of strong buying enthusiasm on the spot market shows that bullish sentiment has been replaced by caution. As such, the risk of a breakdown below $99,000 grows unless another wave of demand re-enters. Futures Market Also Cooling Off The slowdown in sentiment is not limited to the spot market. Although Bitcoin is attracting interest on derivatives exchanges, there are clear signs that futures sentiment is waning. Open interest dropped by 7% over the weekend, from 360,000 BTC to 334,000 BTC, and funding rates have been declining steadily since Bitcoin hit its Q1 2025 all-time high. Related Reading: Bitcoin Price Could Rally To $110,000 ATH As These Macroeconomic Factors Align Futures market participants had been very active through Bitcoin’s climb to $111,800 in May, but their conviction appears to be fading now. A further indication of a growing reluctance to hold long positions is the sharp decline in both the annualized funding rate and the 3-month rolling basis. Without stronger directional conviction, the futures markets may not provide the upside needed to push Bitcoin to new highs. This situation may instead contribute to additional downward pressure. So far, Bitcoin has respected the $93,000 to $100,000 support zone, which was heavily accumulated during the Q1 2025 top formation. However, with low spot volumes, on-chain activity slowing, and fading futures sentiment, this support could become tested again. If market participants with a cost basis in this zone begin to sell, the resulting pressure could drag Bitcoin below $99,000 again next week. At the time of writing, Bitcoin is trading at $107,100. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Forms 4-Year Inverse H&S Pattern – Neckline Break Could Send It Parabolic",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-forms-4-year-inverse-hs-pattern-neckline-break-could-send-it-parabolic/",
      "summary": "Bitcoin is showing resilience above the $105,000 mark, holding firm despite ongoing volatility and economic uncertainty. While bulls struggle to break above the all-time high at $112,000, the market remains in a high-stakes consolidation phase. Macroeconomic conditions remain unstable, with weak global growth forecasts and elevated inflation pushing investors into risk-off assets. Still, Bitcoin appears to be thriving under these pressures, strengthening its case as a hedge against traditional financial instability. Related Reading: Ethereum Fakes Out Bears – Altcoin Rally Depends On Key Level Breakout Top analyst Carl Runefelt recently highlighted a compelling technical development: Bitcoin is forming a massive inverse head and shoulders pattern spanning the last four years. This rare and long-term formation typically signals a bullish reversal and, if confirmed, could mark the beginning of a powerful breakout into price discovery. Runefelt notes that the neckline of this pattern aligns with current resistance just below $112K, making the coming weeks crucial for market direction. As the crypto market digests geopolitical tensions, central bank policy shifts, and on-chain accumulation trends, Bitcoin’s ability to stay elevated signals growing investor conviction. All eyes are now on whether BTC can complete this historic pattern and launch the next leg of the bull run. Bitcoin At A Critical Crossroads Bitcoin is trading at a pivotal level that could determine the market’s next major move — a breakout into new all-time highs or a retrace toward lower demand zones. After surging over 10% since last Sunday, the bullish sentiment is building rapidly, but the price remains stuck in a tight range between $100,000 and $110,000. Bulls are confident and in control of momentum, yet they’ve repeatedly failed to push BTC above the key $110K resistance. At the same time, bears have been unable to take the price below the $100K psychological support, signaling equilibrium and mounting pressure for a breakout. This standoff has kept volatility high, with macroeconomic uncertainty and geopolitical instability adding fuel to the fire. Still, the current market structure appears constructive for Bitcoin. If bulls can finally break above the $110K level and push into price discovery, it would confirm the strength behind this rally and potentially spark a new phase of exponential growth. Carl Runefelt believes a major breakout may be on the horizon. His technical analysis reveals a massive inverse head and shoulders pattern forming over the last four years — a rare and highly bullish setup. According to Runefelt, traders should be “ready for a crazy pump” if Bitcoin breaks through the neckline near $112K. Historically, this type of pattern precedes explosive rallies, and given the long-term nature of this one, the upside potential could be significant. As long-term holders accumulate and market liquidity builds, the coming weeks may determine whether Bitcoin cements its breakout or returns to test deeper support. Either way, this moment is shaping up to be one of the most decisive junctures in the current bull cycle. Related Reading: Ethereum Reclaims $2,444 Level – Bullish Continuation In Focus BTC Price Analysis: Key Resistance Blocks Price Discovery Bitcoin is currently trading at $107,144 on the daily chart, showing modest gains but facing strong resistance as it nears the $109,300 level. The chart highlights a clearly defined horizontal structure between $103,600 and $109,300 — a range Bitcoin has respected for nearly two months. Bulls remain in control short term, having reclaimed all three major moving averages: the 50-day ($105,800), 100-day ($96,784), and 200-day ($96,136) SMAs. The most recent bounce off the $103,600 support zone was followed by rising volume, indicating a potential shift in momentum back to the upside. However, BTC has yet to close convincingly above $109,300, which continues to cap any price discovery attempts. A breakout above this level could open the door to new all-time highs and trigger an aggressive bullish continuation. Related Reading: Chainlink Reclaims Key Structure – Quiet Accumulation Could Fuel $25–$30 Surge On the downside, failure to breach resistance and a drop below $105K could reintroduce bearish pressure and trigger a retest of the lower range. For now, Bitcoin remains range-bound with bullish bias, but buyers need to follow through with strong volume and a clean break above the $109K barrier to fully confirm market intent. Until then, caution is warranted as indecision prevails near key resistance. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Chainlink (LINK) On Standby: Bitcoin’s Next Move Holds The Key",
      "link": "https://www.newsbtc.com/news/chainlink/chainlink-link-on-standby/",
      "summary": "Chainlink (LINK) ended its latest session in a holding pattern, with indecisive candles and choppy intraday action pointing to a lack of clear direction. Traders now look to Bitcoin’s next move for guidance; any meaningful shift in BTC dominance could quickly tilt LINK’s price action. Until the market leader shows its hand, LINK remains on standby, hovering near key support while waiting for a decisive cue. Falling Wedge Holds The Key To Chainlink Next Big Move In a recent X post, CRYPTOWZRD provided an update on Chainlink&#8217;s daily technical outlook, noting that the daily candles for both LINK and LINKBTC closed indecisively. This indecision reflects uncertainty in the market as traders await clearer direction. The lack of a strong trend suggests a pause before the next significant move. Related Reading: Chainlink Bears Push Toward $12.50 As Weekend Volatility Looms The analyst highlighted that LINKBTC is currently forming a falling wedge pattern, which is generally considered a bullish formation, especially when it appears in oversold conditions. He stressed that a breakout from this wedge is essential for Chainlink to trigger the next impulsive move upward, signaling a potential shift in momentum. CRYPTOWZRD explained that this breakout is more likely to occur once Bitcoin dominance begins to decline. As Bitcoin’s grip loosens, altcoins like LINK tend to gain strength and follow suit. Therefore, monitoring Bitcoin dominance will be key in anticipating LINK’s next move. Regarding support levels, CRYPTOWZRD identified $12.50 as the critical next support target. A strong reversal from this point could ignite a rally toward the $16 resistance level or higher. This level will serve as a crucial testing ground for bullish momentum. He concluded by mentioning that his focus remains on lower-timeframe charts to identify quick scalp opportunities. While the broader trend is developing, CRYPTOWZRD is looking to capitalize on shorter-term movements, keeping a close eye on price action and volatility. Choppy Intraday Action Keeps Bulls Cautious Wrapping up the analysis, the analyst highlighted that LINK’s intraday chart remained sluggish and choppy, offering little in terms of clear directional bias. A possible retest of the $12.85 support level—or even a minor dip below it—could still present a bullish reversal opportunity, potentially paving the way for a push toward the $14.40 resistance target. Related Reading: Chainlink Holders Set Record As 1-Yr MVRV Signals ‘Opportunity’ However, the analyst warned that if Chainlink holds below the $12.85 level, it could slip into prolonged sideways movement. This uncertain behavior will likely hinge on Bitcoin’s overall market direction, which continues to heavily influence altcoin performance. With no clear trade setup currently in play, the analyst concluded that it&#8217;s best to remain patient for a cleaner structure to emerge before making any decisive moves. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Gets The Greenlight To Be Counted As Assets For Mortgage Applications, But What About XRP?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-for-mortgage-applications/",
      "summary": "A major breakthrough has just arrived for Bitcoin and the crypto industry from one of the most influential financial regulatory bodies in the United States. The Federal Housing Finance Agency (FHFA), which oversees the country’s largest mortgage liquidity providers, has issued a directive that could change how digital assets are viewed. Under this directive, mortgage liquidity providers have been officially ordered to begin preparations for considering cryptocurrencies as part of a borrower’s asset portfolio during mortgage evaluations. Crypto As Mortgage-Eligible Asset In a recent post on the social media platform X, FHFA Director Bill Pulte issued a directive instructing Fannie Mae and Freddie Mac to prepare proposals that allow homebuyers to count cryptocurrency holdings held on US-regulated exchanges as part of their asset reserves for mortgage applications without converting them into dollars. Related Reading: These Companies Are Following Saylor’s Strategy Into The Bitcoin Battleground With Over $2 Billion Slated To Buy BTC Crypto assets have always been excluded from mortgage risk assessments unless converted to U.S. dollars before closing. However, this recent move breaks that barrier. This policy shift aligns with former President Donald Trump’s campaigns to establish the United States as the crypto capital of the world. Pulte, who was recently sworn in as the 5th Director of U.S. Federal Housing FHFA in March 2025, is now part of those taking steps to make this vision a reality. According to the order, both Fannie Mae and Freddie Mac must also factor in market volatility and enforce strong risk-based adjustments before implementing the new assessment method. Fannie and Freddie are government-sponsored enterprises that do not issue mortgages themselves but play an important role in the housing market by purchasing home loans on the secondary market and setting the criteria for the loans they are willing to acquire. Bitcoin To Benefit The Most, But Where Does XRP Stand? Bitcoin is going to benefit the most from this policy update. Being the largest and most widely held cryptocurrency, Bitcoin has long been considered the digital gold standard, which makes it a natural candidate for institutional recognition. Related Reading: Crypto Pundit Reveals Why This Bitcoin Bull Market Feels Different As Crypto Enters ‘New Era’ Its established presence on U.S.-regulated exchanges and deep liquidity profile through Spot Bitcoin ETFs tick nearly every box laid out in the FHFA’s directive. However, the decision raises an important question for XRP holders as to whether the same regulation will be extended to XRP. Unlike Bitcoin, XRP has had a complicated history with regulatory agencies in the US, most notably the SEC. Although recent legal clarity around XRP has allowed the crypto to resume trading on major US-based exchanges, it isn&#8217;t really certain whether Fannie Mae and Freddie Mac will be quick to include it under this new directive. Nonetheless, the FHFA’s directive doesn’t specify eligible tokens. It simply refers to cryptocurrencies held on US-regulated exchanges. As such, the directive could be quick to include US-based cryptocurrencies like XRP and Ethereum alongside Bitcoin. Other countries are already far ahead with XRP in real estate. In Japan, for instance, Open House Group allows XRP payments for property purchases in cities such as Tokyo and Osaka. Dubai is also using the XRP Ledger to tokenize real estate. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Staking Hits Record High: 29.02% Of Supply Locked Signals Long-Term Conviction",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-staking-hits-record-high-29-02-of-supply-locked-signals-long-term-conviction/",
      "summary": "Ethereum is trading at a critical level after reclaiming the $2,400 mark, showing resilience in the face of market-wide volatility. Bulls have managed to defend key support levels following a recent fakeout below $2,200, but momentum remains fragile as ETH struggles to establish a clear trend. Despite attempts to push higher, price action is consolidating near the mid-range, suggesting indecision among traders. However, fundamental strength continues to build beneath the surface. Related Reading: Ethereum Fakes Out Bears – Altcoin Rally Depends On Key Level Breakout Top analyst Ted Pillows highlighted a major on-chain development: the percentage of Ethereum supply being staked has reached a new all-time high. This milestone signals rising confidence among long-term holders and validators, who are increasingly locking up ETH to secure the network and earn yield. Elevated staking levels historically coincide with lower active supply and reduced sell pressure—an encouraging sign for bulls anticipating a breakout. As macroeconomic uncertainty and geopolitical risks persist, Ethereum’s price behavior at this level could determine whether the broader altcoin market finally ignites. For now, ETH sits at a technical and psychological crossroads, with both bulls and bears preparing for the next major move. All eyes are on staking data and price structure to guide what comes next. Ethereum Builds Bullish Momentum As Staking Hits All-Time High Ethereum has climbed 75% from its April lows, showing strong recovery and resilience in a volatile market. Despite this impressive rebound, ETH remains nearly 98% below its all-time high, leaving significant upside potential. Many analysts believe Ethereum could be gearing up for a rally that may trigger the long-awaited altseason. However, caution still lingers in the market due to ongoing global risks and macroeconomic uncertainty, including rising interest rates and geopolitical tensions. The growing optimism is supported by improving on-chain fundamentals. Ted Pillows highlighted a key metric showing that the percentage of Ethereum supply staked has reached a new all-time high of 29.02%. This steady increase in staked ETH reflects strong long-term conviction from holders, who are choosing to lock up their assets to support the network and earn yield rather than sell during market turbulence. Historically, high levels of staking reduce active circulating supply, which can ease sell pressure and fuel bullish price movements. Combined with technical strength and growing confidence among long-term investors, Ethereum appears well-positioned for a breakout, provided bulls can hold current levels and reclaim resistance zones. Related Reading: Ethereum Reclaims $2,444 Level – Bullish Continuation In Focus ETH Reclaims Key Level But Faces Resistance Ethereum (ETH) is showing renewed strength after bouncing from its April 2025 lows and reclaiming the $2,400 level. On the weekly chart, ETH is up over 10% this week, closing firmly above the 200-week simple moving average (SMA) at $2,437.52 — a key threshold that previously acted as both resistance and support in past cycles. Reclaiming this level is a bullish sign and shows that buyers are stepping back in after months of selling pressure. However, Ethereum now faces significant resistance around the $2,625–2,660 zone, where the 100-week and 50-week SMAs converge. This zone has historically served as a pivot for major price action, and a clear break above it would likely trigger a broader rally targeting the $2,800–$3,000 range. Volume has also picked up, signaling renewed interest, though it remains below early 2024 levels. This indicates cautious optimism among traders, especially as global macro uncertainty and geopolitical tensions continue to weigh on markets. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Takes a Lot of Pressure Off The Dollar, Says Donald Trump",
      "link": "https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Takes-a-Lot-of-Pressure-Off-The-Dollar-Says-Donald-Trump.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump\" rel=\"nofollow\"> </a></p> <p>President Donald Trump is backing Bitcoin, calling it a vital American asset that the US must continue to dominate.</p> <p>"
    },
    {
      "title": "How The IMF Prevents Global Bitcoin Adoption (And Why They Do It)",
      "link": "https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/IMF-Blocking-Bitcoin-Adoption.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it\" rel=\"nofollow\"> </a></p> <p>IMF loans halt nation-state Bitcoin plans—only debt-free countries like Bhutan push forward. Grassroots use still thrives.</p> <p>"
    },
    {
      "title": "Lnfi Network Integrates RGB Protocol to Enhance Lightning Network",
      "link": "https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_A_futuristic_digital_dashboard_glowing_wit_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network\" rel=\"nofollow\"> </a></p> <p>Lnfi Network adopts RGB for Bitcoin’s Lightning, enabling secure asset trading. Nostr’s encryption stops manipulation.</p> <p>"
    },
    {
      "title": "If Institutions Are Buying Why Isn’t The Bitcoin Price Going Up?",
      "link": "https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/If-Institutions-Are-Buying-Why-Isnt-The-Bitcoin-Price-Going-Up.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up\" rel=\"nofollow\"> </a></p> <p>Bitcoin price not soaring despite institutional billions? Uncover why profit-taking and derivatives hold it back, with a breakout looming!</p> <p>"
    },
    {
      "title": "Tahini’s Bitcoin Treasury: How a Family Chain Outsmarted Inflation",
      "link": "https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/tahini-bitcoin-2020-treasury-playbook.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation\" rel=\"nofollow\"> </a></p> <p>Tahini’s, a Canadian fast-casual chain, embraced Bitcoin in 2020, leveraging it to compete with giants like McDonald’s. Here’s their treasury playbook.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Trump Blames Biden for Banks Blocking Crypto: 'There Is a Lot of Debanking'",
      "link": "https://decrypt.co/327531/trump-blames-biden-banks-blocking-crypto-debanking",
      "summary": "President Trump unloaded on the issue of crypto debanking Friday, but stopped short of committing to issuing an executive order on the subject."
    },
    {
      "title": "'Rogue' Police Are Destroying Bitcoin ATMs: Bitcoin Depot Legal Chief",
      "link": "https://decrypt.co/327503/rogue-police-are-destroying-bitcoin-atms-bitcoin-depot-legal-chief",
      "summary": "Chris Ryan said that police may be breaking the law in some instances and that the provider of the machines is entitled to the funds."
    },
    {
      "title": "Ripple to Drop Appeal in SEC Case Over XRP Sales, Ending Case 'Once and for All'",
      "link": "https://decrypt.co/327524/ripple-drop-appeal-sec-case-xrp-sales-ending-case",
      "summary": "Ripple says it'll drop its appeal in the long-running SEC case over XRP sales, finally putting the legal battle to bed."
    },
    {
      "title": "Public Keys: Copycat Lawsuits for Bitcoin Giant Strategy, Coinbase Hits All-Time High",
      "link": "https://decrypt.co/327495/public-keys-strategy-bitcoin-lawsuits-coinbase-all-time-high",
      "summary": "Why Bitcoin treasury giant Strategy is facing down multiple identical lawsuits, plus Coinbase hits a record closing price as perps near."
    },
    {
      "title": "White House Weighs Federal Land and Fast-Tracked Permits to Drive AI Boom: Reuters",
      "link": "https://decrypt.co/327489/white-house-weighs-federal-land-fast-tracked-permits-ai-boom",
      "summary": "President Trump is reportedly mulling executive orders to boost AI infrastructure in the U.S. amid soaring energy demands."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Ripple drops cross-appeal as SEC set to follow, closing XRP case",
      "link": "https://cryptobriefing.com/ripple-sec-agreement-ends/",
      "summary": "<p>Ripple and SEC end their prolonged legal dispute as both sides drop appeals, marking a pivotal ripple sec agreement in crypto regulation.</p> <p>"
    },
    {
      "title": "Robinhood rolls out micro XRP, Solana futures following token relisting",
      "link": "https://cryptobriefing.com/micro-futures-contracts-xrp-solana/",
      "summary": "<p>Robinhood's expansion into micro crypto futures could democratize access to digital asset trading, potentially increasing market participation.</p> <p>"
    },
    {
      "title": "Trump backs Bitcoin adoption amid claims it could ease pressure on the dollar",
      "link": "https://cryptobriefing.com/trump-bitcoin-adoption-dollar/",
      "summary": "<p>Trump's endorsement of Bitcoin could accelerate its mainstream adoption, potentially reshaping global financial dynamics and US economic policy.</p> <p>"
    },
    {
      "title": "The power of crypto journaling: how tracking your trades can transform your success",
      "link": "https://cryptobriefing.com/crypto-trading-journal-success/",
      "summary": "<p>A crypto trading journal helps track trades, refine strategies, manage emotions, and boost discipline for better results.</p> <p>"
    },
    {
      "title": "Bitcoin retreats after Fed’s preferred inflation gauge shows mild uptick",
      "link": "https://cryptobriefing.com/bitcoin-pce-inflation-gauge-impact/",
      "summary": "<p>Bitcoin's volatility highlights economic uncertainty, with inflation concerns and potential Fed rate decisions impacting market stability.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "$7.5M pulled from TRUMP coin liquidity pool – Is the hype crumbling?",
      "link": "https://ambcrypto.com/7-5m-pulled-from-trump-coin-liquidity-pool-is-the-hype-crumbling/",
      "summary": "<img alt=\"$7.5M pulled from TRUMP coin liquidity pool - Is the hype crumbling?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/4C1AF4BA-400C-43A5-AC82-E106A3B1BF98.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Even as the TRUMP team sells, investors hold firm."
    },
    {
      "title": "ETF giants hold 6% of Bitcoin – But BTC at $73K could break their patience",
      "link": "https://ambcrypto.com/etf-giants-hold-6-of-bitcoin-but-btc-at-73k-could-break-their-patience/",
      "summary": "<img alt=\"ETF giants hold 6% of Bitcoin - But $73K could break their patience\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-11.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Over 1.2M BTC locked in ETFs, will 50% profits tempt institutions to break ranks?"
    },
    {
      "title": "TRON’s comeback meets 2 major challenges! What is TRX’s road ahead?",
      "link": "https://ambcrypto.com/trons-comeback-meets-2-major-challenges-what-is-trxs-road-ahead/",
      "summary": "<img alt=\"TRON&#039;s comeback meets 2 major challenges! What is TRX&#039;s road ahead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-27T122213.365-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Daily TRON transactions nearly doubled, driven by revived user activity and increased fee utility."
    },
    {
      "title": "$22 mln TRUMP lands in hot wallet – The memecoin could crash to $8 unless…",
      "link": "https://ambcrypto.com/22-mln-trump-lands-in-hot-wallet-the-memecoin-could-crash-to-8-unless/",
      "summary": "<img alt=\"$22 mln TRUMP lands in hot wallet - The memecoin could crash to $8 unless...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-2-7.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Here’s why the memecoin's price could still go either way."
    },
    {
      "title": "Is Solana’s 8% staking yield ‘kind of a meme?’ What this VC believes",
      "link": "https://ambcrypto.com/is-solanas-8-staking-yield-kind-of-a-meme-what-this-vc-believes/",
      "summary": "<img alt=\"Is Solana&#039;s 8% staking yield &#039;Kind of a meme?&#039; What this VC believes\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Benjamin-2025-06-27T155203.529.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Crypto VC downplays inflation as a model for 'network security.'"
    }
  ]
}