{
  "CoinDesk": [
    {
      "title": "Aptos' APT Gains 4% on Significant Volume, Has More Potential Upside",
      "link": "https://www.coindesk.com/markets/2025/06/09/aptos-apt-gains-4-on-significant-volume-has-more-potential-upside",
      "summary": ""
    },
    {
      "title": "Trump Media and Semler Scientific Could Be Cheapest Bitcoin Treasury Companies by This Metric",
      "link": "https://www.coindesk.com/markets/2025/06/09/trump-media-and-semler-scientific-could-be-cheapest-bitcoin-treasury-companies-by-this-metric",
      "summary": ""
    },
    {
      "title": "U.S. SEC Chair Says Working on 'Innovation Exemption' for DeFi Platforms",
      "link": "https://www.coindesk.com/policy/2025/06/09/u-s-sec-chair-says-working-on-innovation-exemption-for-defi-platforms",
      "summary": ""
    },
    {
      "title": "Plasma’s XPL Token Sale Attracts $500M as Investors Chase Stablecoin Plays",
      "link": "https://www.coindesk.com/markets/2025/06/09/plasmas-xpl-token-sale-attracts-500m-as-investors-chase-stablecoin-plays",
      "summary": ""
    },
    {
      "title": "Paraguay President's X Account Hacked, Shares Bitcoin Scam",
      "link": "https://www.coindesk.com/policy/2025/06/09/paraguay-presidents-x-account-hacked-shares-bitcoin-scam",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Turnkey raises $30M for crypto open infrastructure layer",
      "link": "https://cointelegraph.com/news/turnkey-raises-30m-crypto-open-infrastructure-layer?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU2OGUtMGU5Mi03YzRjLTg4MzgtYTQwZmNkZGI4Yjdh.jpg\" /></p><p>Digital asset infrastructure companies have seen more attention in recent years, with some fundraises in the hundreds of millions of dollars.</p>"
    },
    {
      "title": "Telegram founder Durov on arrest, detention in France: ‘I’m confused’",
      "link": "https://cointelegraph.com/news/telegram-founder-durov-arrest-detention-france-im-confused?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU2NTMtNDFkZS03YmE0LTgzNjMtMTk4YjkxMmNlMWZk.jpg\" /></p><p>In an interview with Tucker Carlson, Pavel Durov’s first since being indicted on six charges in 2024, said his company did nothing wrong.</p>"
    },
    {
      "title": "US lawmakers propose amendment to crypto market structure bill before markup",
      "link": "https://cointelegraph.com/news/amendment-blockchain-developers-crypto-market-structure-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmZkNDgtMDVjNS03NzUzLTkzZjgtMDVjMjcwZDQwMjkw.jpg\" /></p><p>Two bills in the US Congress considering stablecoins and a digital asset regulatory framework will reach crucial stages this week after long debates and controversies.</p>"
    },
    {
      "title": "BlackRock ETH accumulation, key price metrics forecast Ethereum rally to $3K",
      "link": "https://cointelegraph.com/news/blackrock-eth-accumulation-key-price-metrics-forecast-ethereum-rally-to-3k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzIxMTAtMWJjOS03MzlkLWE4N2QtYjYzODY1ODUxMzAx.jpg\" /></p><p>Rising futures open interest, robust spot ETH ETF flows, and a bullish technical analysis indicator forecast an Ethereum price rally to $3,000.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "ProShares, Bitwise race to launch CRCL ETFs, targeting August debut amid stock price surge",
      "link": "https://cryptoslate.com/proshares-bitwise-race-to-launch-crcl-etfs-targeting-august-debut-amid-stock-price-surge/",
      "summary": "<p>ProShares Trust and Bitwise each filed preliminary prospectuses with the Securities and Exchange Commission (SEC) on June 6 for exchange-traded funds (ETF) designed to track Circle’s CRCL shares. The ProShares Ultra CRCL ETF is a 2x leveraged product that seeks to deliver twice the daily move in CRCL by utilizing swaps and other derivatives, as [&#8230;]</p> <p>"
    },
    {
      "title": "BiT Global drops Coinbase lawsuit over wrapped Bitcoin delisting",
      "link": "https://cryptoslate.com/bit-global-drops-coinbase-lawsuit-over-wrapped-bitcoin-delisting/",
      "summary": "<p>BiT Global, a crypto custody firm tied to entrepreneur Justin Sun, has voluntarily dismissed its lawsuit against Coinbase over the delisting of Wrapped Bitcoin (WBTC). The move ends a months-long legal dispute that spotlighted growing tensions between centralized exchanges and token custodians as control over key infrastructure becomes increasingly contested. Filed on June 6 in [&#8230;]</p> <p>"
    },
    {
      "title": "BlackRock’s IBIT rockets to $70B in 341 days, 5x faster than previous record",
      "link": "https://cryptoslate.com/blackrocks-ibit-rockets-to-70b-in-341-days-5x-faster-than-previous-record/",
      "summary": "<p>BlackRock&#8217;s iShares Bitcoin Trust (IBIT) exchange-traded fund (ETF) crossed $70 billion in assets under management (AUM) on June 6, being the fastest to reach this mark in just 341 trading days. Bloomberg ETF analyst Eric Balchunas reported the milestone on X, noting that the fund beat the previous speed record of 1,691 days set by [&#8230;]</p> <p>"
    },
    {
      "title": "Visa, Chainlink successfully complete CBDC, stablecoin swap between Hong Kong, Australia",
      "link": "https://cryptoslate.com/visa-chainlink-successfully-complete-cbdc-stablecoin-swap-between-hong-kong-australia/",
      "summary": "<p>Visa and Chainlink have completed a key milestone in the Hong Kong Monetary Authority’s (HKMA) e-HKD+ Pilot Programme, successfully testing a cross-border blockchain transaction using central bank digital currency (CBDC) and stablecoins. The trial, conducted in partnership with ANZ, ChinaAMC, and Fidelity International, is one of the first real-world simulations of programmable money being used [&#8230;]</p> <p>"
    },
    {
      "title": "SEC Chair Paul Atkins backs DeFi, rejects forced intermediaries during latest roundtable speech",
      "link": "https://cryptoslate.com/sec-chair-paul-atkins-backs-defi-rejects-forced-intermediaries-during-latest-roundtable-speech/",
      "summary": "<p>US Securities and Exchange Commission (SEC) Chairman Paul Atkins told the agency’s fifth cryptocurrency roundtable on June 9 that the ability to hold crypto without an intermediary belongs at the core of US law. Atkins opened the “DeFi and the American Spirit” session by linking decentralized (DeFi) finance with the country’s traditions of private property [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Is Altcoin Season Still Coming? Why Bitcoin Is To Blame Despite Making ATHs",
      "link": "https://www.newsbtc.com/altcoin/is-altcoin-season-still-coming/",
      "summary": "Despite Bitcoin’s historic rise above the $100,000 mark in early 2025, a growing number of crypto investors are left wondering when the long-anticipated altcoin season will begin. At the time of writing, the altcoin season index from BlockchainCenter has now dipped to a reading of 20, far below the 75 threshold typically required to confirm the start of an altcoin season. In a detailed post on social media platform X, van de Poppe addressed what is one of the most frequently asked questions in the crypto industry today: “When altseason?” Altcoin Season Missing Despite Bull Market Conditions According to analyst Michaël van de Poppe, this cycle has deviated significantly from historical patterns. His response to the growing question of an altcoin season relays the fact that while Bitcoin has made gains, the altcoin market continues to lag significantly behind, raising doubts about whether a true altseason will even arrive this cycle. Related Reading: Certified Analyst Says Bitcoin Dominance Could Reverse At 64% – Is It Time For Altcoin Season? In past cycles, altcoins followed Bitcoin’s rally within weeks or months. However, 2024 and the early part of 2025 have proven to be different. This, in turn, has been many investors expecting this cycle to play out the same getting hammered and losing their patience. Although some new meme coins had their brief moments of explosive growth in late 2024, the broader altcoin market has been largely suppressed since late 2021. Van de Poppe explains that most older altcoins failed to match Bitcoin’s performance in 2021, and that trend has only worsened in the current cycle. This has somewhat changed the expectation of a typical four-year cycle rhythm. The tables have turned and other variables need to be taken into account for investors looking to get a significant return in those markets. Bitcoin Dominance And Sentiment Imbalance Holding Altcoins Back One of the clearest reasons for the delay in altseason is Bitcoin’s overwhelming dominance. As the Altcoin Season Index indicates, the metric remains significantly below the 25 threshold line and firmly entrenched in Bitcoin Season territory. Van de Poppe attributes this not just to price action, but also to macro-level shifts, such as interest rate regimes and monetary policy from central banks. For now, there’s still much upside potential for Bitcoin, especially if the Fed interest rates were to go down from their current 4% levels. Related Reading: Is Altcoin Season Over Or It Never Started? Here’s What Historical Data Says In his view, the current market is divided into two camps: those expecting a bear market and those who believe the bull run is just beginning. Both could be wrong, he warns, because the game has changed. If there are so many factors going into negative sentiment, that’s actually a sign to allocate funds into altcoins. Keeping this in mind, the best time to invest in altcoins would be now, when the altcoin season isn&#8217;t showing any signs. Van de Poppe concludes that altseason isn’t just a timeframe but a phase where patient investors accumulate undervalued cryptocurrencies before the rest of the market catches on. When the altcoin season eventually rolls in, it will come unannounced. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Calm Won’t Last—This Week Holds Breakout Risk",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-calm-wont-last-this-week/",
      "summary": "Singapore-based trading firm QCP Capital opened its Monday note with a blunt assessment: “Implied vols continue to come under pressure, with BTC stuck in a tight range as summer approaches.” In the options house’s telling, the market is drifting into the northern-hemisphere holiday season much as it did a year ago, when one-month at-the-money (ATM) volatility collapsed from 80 vols in March to barely 40 vols by July and spot repeatedly “failed to decisively breach the $70k level.” The difference this year is the new, higher plateau: BTC has sat between $100,000 and $110,000 for most of the past three weeks. The calm is visible beyond Deribit’s options screens. Deribit’s DVOL index, which tracks 30-day implied volatility, is hovering just above 40—one of its lowest prints in more than two years. Realised volatility is even quieter, so even one-year lows on implieds still look “optically rich,” QCP argues. That valuation gap has encouraged traders to sell gamma: perpetual open interest has slipped and the favourite hedge-fund basis trade—long spot via the new ETFs, short futures—has unwound, taking what QCP calls “the natural bid for vol” out of the market. Related Reading: Bitcoin At A Crossroads: $97,000 Cost Basis Holds Key To Next Breakout Flows in the listed options market confirm the malaise. Dealers report that July upside strikes around $130,000 and $140,000 are being rolled out to September “in meaningful size,” effectively pushing bullish timelines further down the curve. Meanwhile, Deribit’s put-skew has flattened as short-dated hedges expire worthless—a dynamic that often precedes a directional move once macro catalysts arrive. This Week Could Break Bitcoin’s Lull Those catalysts line up uncomfortably close. On Wednesday the Bureau of Labor Statistics will publish May consumer-price data. April’s headline CPI rose a modest 0.2% month-on-month and 2.3% year-on-year, while core prices advanced 0.2% on the month and 2.8% on the year. Economists look for headline CPI to quicken to 0.3% on the month and 2.5% year-on-year, with core CPI seen edging up to 0.3% and 2.9% respectively. Producer prices follow on Thursday: April’s PPI fell 0.5% on the month yet still printed 2.4% year-on-year. The consensus expects May PPI to rebound 0.2%, leaving the annual rate near 2.4%. Inflation is not the only macro variable in play. Friday’s stronger-than-expected US non-farm payrolls report—139,000 jobs versus a 130,000 consensus—rekindled dollar strength and knocked gold more than one percent lower, but BTC “remained conspicuously unmoved,” QCP noted. The same divergence is visible this morning: US equity futures are slightly softer, spot gold is bid on safe-haven demand, and bitcoin is trading virtually unchanged. Geopolitics may supply the spark that inflation data has so far failed to ignite. Senior US and Chinese officials meet in London today (Monday) in what both sides are calling a push for a limited trade deal that would dial back export-control threats and myriad retaliatory tariffs. The talks matter for crypto because tariffs have been feeding directly into the CPI basket and—via global risk sentiment—into bitcoin demand. “A clean break below $100k or above $110k would likely reawaken broader market interest,” QCP wrote, “but we currently see no obvious near-term catalyst to drive such a move.” Trade headlines could change that calculus in a single newsflash. Related Reading: Crypto Analyst Says This Bitcoin Top Signal Hasn’t Gone Off Yet — What To Know Institutional positioning likewise hints at fatigue. US regulatory filings show that large hedge funds trimmed spot-ETF holdings in the first quarter as the lucrative cash-and-carry spread compressed. Net inflows across the 11 US bitcoin ETFs have slowed to a trickle since late May, leaving cumulative additions at roughly $44 billion—unchanged for almost a fortnight, according to Farside data. For now, the market’s centre of gravity is exactly where QCP says it is: inside the $100,000–$110,000 corridor. Volatility sellers continue to collect premium, and the risk-reward for momentum traders remains poor. Yet with CPI, PPI and high-stakes trade negotiations all landing inside a 72-hour window, the premium that option writers are harvesting could quickly look meagre. If the inflation data surprise to the upside, a repricing of Fed-cut expectations could turn last week’s equity rally into a risk-off wobble, yanking bitcoin below six figures for the first time since April. Conversely, a benign print combined with even a symbolic easing of tariff rhetoric could flip the narrative to “soft landing, structural bid via ETFs,” reigniting topside optionality into the June quarter-end. In that scenario the rolled-out September $140,000 calls might come alive far sooner than their buyers now expect. Either way, the clock on bitcoin’s summer doldrums is ticking loudly. “Without a compelling narrative to spark the next leg higher, signs of fatigue are emerging,” QCP warns. The narrative candidates arrive this week; whether they supply ignition or simply more noise will decide whether 2025’s range trade breaks—or cements itself as the dominant theme of another crypto summer. At press time, BTC traded at $107,919. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Consolidates As Momentum Builds – Analyst Has $3K In Sight For June",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-consolidates-as-momentum-builds-analyst-has-3k-in-sight-for-june/",
      "summary": "Ethereum has remained firm above key support levels despite the broader market pullback in recent weeks. While many altcoins have shown weakness, ETH continues to trade above the $2,400–$2,500 zone, signaling strength and positioning itself for a potential recovery. After a volatile start to the year that saw steep declines, analysts are increasingly calling for a breakout, with some suggesting Ethereum could soon reclaim lost ground if current conditions hold. Related Reading: Bitcoin And Ethereum Defend Key Moving Averages – Bullish Signal Or Temporary Relief? However, not everyone agrees on the bullish outlook. Some traders warn that Ethereum’s recent consolidation may precede another leg down, especially if resistance near $2,800 remains unbroken. The debate highlights the uncertainty hanging over the market as macro risks and shifting liquidity continue to influence short-term direction. Top analyst Ted Pillows recently shared his view, noting that Ethereum is still consolidating after a strong May. While this pause may seem neutral, he pointed to rising ETF inflows and growing network activity as leading indicators of renewed demand. According to Pillows, these signals often precede price expansion, suggesting that ETH may just be gearing up for its next move. Ethereum Holds Firm As Market Volatility Builds Toward A Decisive Move Ethereum is navigating a critical moment as the broader crypto market faces heightened volatility and mounting uncertainty. Still trading 48% below its all-time high, ETH has shown impressive resilience, holding firm above key support levels even as sentiment wavers. The market remains on edge following renewed tensions between Elon Musk and US President Donald Trump — a dynamic that has triggered risk-off behavior and short-term instability across assets. Despite the noise, Ethereum continues to show underlying strength. Bitcoin remains stable near its highs, and many altcoins appear to be coiling for potential breakout moves. In this context, the coming weeks could prove decisive for ETH, which has so far managed to consolidate after a bullish May without breaking key structure. Ted Pillows noted in a recent update that Ethereum is still consolidating, and that’s not necessarily bearish. According to his view, rising ETF inflows and accelerating network activity suggest that renewed demand is quietly building behind the scenes. Historically, these have been leading indicators of a breakout, and ETH looks well-positioned to take advantage. Momentum is shifting, and bulls are eyeing the $2,800 level as the next key threshold. Reclaiming that level could trigger a move toward $3,000 in June. Beyond that, if macro conditions remain stable, Ethereum could realistically push to $4,000 by Q3 2025. For now, ETH remains in consolidation mode — but with strength in the fundamentals, technical structure, and on-chain trends, the case for a breakout is growing stronger. The next move will be crucial, not just for Ethereum, but for the broader altcoin market heading into summer. Related Reading: Ethereum Consolidates Below $2,800 – Bulls Need This Level To Trigger Next Leg Up ETH Holds Mid-Range Structure Amid Continued Consolidation Ethereum continues to trade within a tight range, holding at $2,513 after briefly dipping to $2,479 earlier in the session. As seen on the daily chart, ETH remains in consolidation beneath the key resistance at $2,659, marked by the 200-day simple moving average (SMA), which has capped several upside attempts throughout June. Despite failing to break out, the structure remains constructive. The 34-day EMA ($2,435.80) and 50-day SMA ($2,284.93) continue to act as dynamic support. ETH recently bounced off the 34 EMA after testing that level for three consecutive days, signaling buyers are still present and defending key zones. Meanwhile, volume remains muted, reflecting indecision and lack of conviction from both bulls and bears. For now, the $2,430–$2,660 range defines the battleground. A daily close above the 200 SMA would indicate bullish continuation toward the $2,800 level. Conversely, a breakdown below $2,430 could trigger a larger retrace toward $2,200. Related Reading: Solana Key Indicator Flashes Buy Signal On Daily Chart – Rally Ahead? Ethereum&#8217;s current behavior reflects a market waiting for a catalyst. With rising ETF inflows and steady on-chain activity, momentum could return quickly, but until then, ETH remains trapped in a sideways grind. The next confirmed move out of this range will likely dictate the trend heading into late June. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Pundit Says Do Not Ignore Ethereum Amid New All-Time Highs In Major Metric",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-ath-in-major-metric/",
      "summary": "Ethereum is back in sharp focus across the crypto market following a recent rally to $2,800 that has added fresh layers of bullish momentum to its long-term narrative. At the time of writing, Ethereum is trying to register a footing above $2,500, but this subdued price action masks what an analyst is calling one of the most critical technical and on-chain moments in Ethereum’s recent history. Ethereum Weekly Engagement Hits Record High According to Crypto Patel, a crypto analyst on the social media platform X, Ethereum&#8217;s weekly engagement has reached an all-time high, surpassing all previous peaks seen since 2022. The accompanying chart below shows a steep rise in the number of unique addresses interacting with Ethereum’s ecosystem. Related Reading: Is Ethereum Back In Business? Morningstar Candlestick Pattern Tells A Story According to the most recent data, the number of weekly active addresses stands at 17.4 million, representing an increase of almost 17% in just seven days. Notably, May 2025 saw the most significant growth in engagement, with each of the past three weeks witnessing at least 15 million active addresses. Meanwhile, the Layer 2 multiplier, which reflects adoption across Ethereum’s scaling solutions, has climbed to 7.55x, marking an 18.63% jump over the same period. Crypto Patel described the development as impossible to ignore, adding that the momentum is building fast, and warned followers to stay ready as Ethereum prepares for what could be a dramatic next leg up. “It’s impossible to ignore $ETH right now,” he remarked. Despite a minor 4.31% decline in cross-chain activity in the past seven days, the overall engagement trend confirms that more users are entering the Ethereum ecosystem. Analyst Predicts $9,000 To $10,000 ETH Price Target Complementing this on-chain momentum is a broader technical perspective offered by another crypto analyst known as XForceGlobal on the social media platform X. In a detailed Elliott Wave analysis also shared on X, the analyst noted that Ethereum has successfully completed a complex corrective structure and is now poised to enter a powerful new impulsive phase. According to the chart, the bearish scenario has been invalidated by recent price behavior, and a new bullish cycle is now underway as Ethereum is currently playing out a bullish B wave. Related Reading: Ethereum Price At $8,000: Pundit Predicts Parabolic Run For ETH If this bullish B wave plays out as expected, XForceGlobal projects a major price surge with a target range between $9,000 and $10,000 for Ethereum. Specifically, the analyst identified a $9,410 price target for sometime in the next year. However, the analyst outlines a hypothetical fallback to the $576 zone if the C corrective wave unfolds. Nonetheless, the current wave structure shows an increased likelihood of Ethereum surging higher rather than breaking down. The analyst concluded by stating, “We can now confidently scrap the bearish case. The impulse opened the door for potential new highs.” At the time of writing, Ethereum is trading at $2,493 with a recent intraday high of $2,537. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "$106K Bitcoin A ‘Safer’ Buy Than $25K—XRP Lawyer Drops Bombshell",
      "link": "https://www.newsbtc.com/news/bitcoin/106k-bitcoin-a-safer-buy-than-25k-xrp-lawyer-drops-bombshell/",
      "summary": "A well-known cryptocurrency attorney and XRP advocate, John Deaton, is urging investors to stay bullish on Bitcoin even as it hovers near $106,000. He’s put about 80% of his net worth into BTC at an average price below $25,000. Rather than fret over today’s high sticker, he says the odds favor more gains ahead than losses. Related Reading: Blank Pi Network Wallets Spark Outcry—What’s The Network Hiding? Deaton’s Big Bet According to Deaton, buying at six figures isn’t too late. He calls today’s price range “more asymmetrical,” meaning the upside is greater than the downside. He’s put 80% of his wealth into Bitcoin. His average entry cost was less than $25,000. Still, he sees room to run even from around $106,000. Macro Concerns Drive Interest Based on reports, Deaton worries about soaring national debt in the US and fresh tariffs from US President Donald Trump’s time in office. He flags endless money printing by central banks as a red flag. I’m not in favor of telling people living paycheck to paycheck (me until 15 years ago) to take out a mortgage on their primary home to buy Bitcoin (I’m not suggesting that that’s what David is recommending either), but I am in the process of selling real estate, and although my… https://t.co/JMB1zgeazW — John E Deaton (@JohnEDeaton1) June 8, 2025 He says all these moves are chipping away at trust in fiat cash. With only 21 million BTC ever to be mined, Bitcoin can’t be inflated away. That fixed supply, he argues, makes it a solid hedge against a shaky dollar. Corporate And State Adoption Institutional demand is also on the rise. MicroStrategy—now called Strategy—holds more than 200,000 BTC, worth tens of billions of dollars. And in the last seven days, 16 companies have added Bitcoin to their balance sheets. On the government side, Rep. Tim Burchett introduced a bill to turn a Trump executive order into law, creating a US Strategic Bitcoin Reserve. Countries like Pakistan, Ukraine, and Ireland are weighing similar steps. They want to see if holding Bitcoin could protect their foreign exchange plans. Skeptics Voice Worries Not everyone agrees with Deaton’s rosy outlook. Economist Peter Schiff, a gold advocate, says Bitcoin has no real value and is too wild to be a safe haven. He tweeted that today’s rally is just hype. Deaton doesn’t shy away from such criticism. He admits he has “confirmation and wealth-preservation bias.” He still insists Bitcoin is the best store of value during today’s economic storms. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Deaton warns against buying with money you can’t afford to lose. He tells people living paycheck-to-paycheck not to risk their homes or take out loans just to buy crypto. His basic message is simple: look past daily price swings and ask where the world’s money is headed. If you share his concerns about the dollar and believe institutions will keep piling in, his bet on Bitcoin could pay off. But anyone on the sidelines should be ready for big swings and should only invest what they can handle. Featured image from Pexels, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "KULR Technology Group Announces $300 Million ATM Offering To Invest in Their Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>KULR entered a $300 million ATM offering to fund its Bitcoin treasury reserve, with Cantor Fitzgerald &#038; Co. and Craig-Hallum Capital Group LLC.</p> <p>"
    },
    {
      "title": "BlackRock’s iShares Bitcoin Trust Shatters ETF Growth Record, Surpassing $70 Billion in Just 341 Days",
      "link": "https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BlackRock.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days\" rel=\"nofollow\"> </a></p> <p>BlackRock’s iShares Bitcoin Trust (IBIT) has officially made history. The Bitcoin ETF surged past $70 billion in assets under management (AUM), reaching the milestone in just 341 trading days. This achievement makes IBIT the fastest ETF to ever hit that threshold.&#160; To put that into perspective, the previous record-holder—SPDR Gold Shares (GLD)—took 1,691 days to [&#8230;]</p> <p>"
    },
    {
      "title": "New York City Won’t Be Issuing BitBonds Anytime Soon",
      "link": "https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/New-York-City-Mayor-Eric-Adams-Bitcoin-BitBonds.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon\" rel=\"nofollow\"> </a></p> <p>At Bitcoin 2025, NYC mayor, Eric Adams, proclaimed that he’s going to push to issue a BitBond, but judging by his past inaction on Bitcoin as well as a statement from NYC’s comptroller, odds are New Yorkers won’t see a BitBond in the near future.</p> <p>"
    },
    {
      "title": "Japan’s ANAP Holdings Launches Full Bitcoin Business Strategy with Goal of Over 1,000 BTC by August 2025",
      "link": "https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ANAP.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025\" rel=\"nofollow\"> </a></p> <p>ANAP Holdings, Inc. (3189: Tokyo Standard Market) has officially announced the launch of its “Bitcoin Business” in a formal corporate filing, detailing an entry into Bitcoin focused operations across treasury, finance, fashion, and mining. In a statement signed by President and CEO Yuta Sawaki, the company confirmed that its consolidated subsidiary ANAP Lightning Channel will [&#8230;]</p> <p>"
    },
    {
      "title": "Investment Holding Company Belgravia Hartford Capital Makes First Bitcoin Purchase as Part of Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/investment-holding-company-belgravia-hartford-capital-makes-first-bitcoin-purchase-as-part-of-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Investment-Holding-Company-Belgravia-Hartford-Capital-Makes-First-Bitcoin-Purchase-as-Part-of-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/investment-holding-company-belgravia-hartford-capital-makes-first-bitcoin-purchase-as-part-of-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Belgravia Hartford Capital purchased 4.86 BTC for $500,000.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Sui DeFi Exchange Cetus Back in Action After $233 Million Exploit",
      "link": "https://decrypt.co/324313/sui-defi-exchange-cetus-back-in-action-after-233-million-exploit",
      "summary": "Following a damaging protocol vulnerability in May, Sui decentralized exchange Cetus is back online with a compensation plan."
    },
    {
      "title": "Plasma Attracts $500 Million for ICO—And One Trader Spent $100K on Ethereum Gas Fees",
      "link": "https://decrypt.co/324237/plasma-500-million-ico-trader-spent-100k-ethereum-gas",
      "summary": "Are ICOs back? Stablecoin network Plasma just attracted $500 million worth of deposits for its sale, with one trader paying $100K for an edge."
    },
    {
      "title": "Paraguay Says Presidential X Post Promising Bitcoin Reserve a Hack",
      "link": "https://decrypt.co/324244/paraguay-says-presidential-tweet-promising-bitcoin-reserve-hack",
      "summary": "The South American country is also not starting a strategic BTC reserve. Hackers asked readers to send the asset to a Bitcoin address."
    },
    {
      "title": "Why Bitcoin Implied Volatility Has Collapsed Amid Trump Trade Talks",
      "link": "https://decrypt.co/324304/bitcoin-implied-volatility-collapsed-trump",
      "summary": "Bitcoin volatility hits 1-year low as U.S.-China trade talks resume, with BTC holding above $100K but trapped in range amid geopolitical uncertainty."
    },
    {
      "title": "'Bitcoin First' KULR Technology Seeks $300 Million to Boost BTC Holdings",
      "link": "https://decrypt.co/324242/bitcoin-first-kulr-technology-seeks-300-million-to-boost-btc-holdings",
      "summary": "The publicly traded company holds 920 Bitcoin, worth just under $1 billion on Monday."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "How UK crypto taxes work and what you need to know",
      "link": "https://cryptobriefing.com/how-uk-crypto-taxes-work/",
      "summary": "<p>The increasing scrutiny on crypto tax compliance in the UK highlights the need for investors to maintain accurate records and understand tax obligations.</p> <p>"
    },
    {
      "title": "Did Paraguay just make Bitcoin legal tender? Suspected hack of president’s X account sparks confusion",
      "link": "https://cryptobriefing.com/paraguay-bitcoin-legal-tender-hack/",
      "summary": "<p>The incident highlights the vulnerability of digital platforms in disseminating misinformation, potentially impacting national and global markets.</p> <p>"
    },
    {
      "title": "ProShares, Bitwise seek SEC approval for ETFs tracking Circle stock",
      "link": "https://cryptobriefing.com/circle-stock-etfs-proshares-bitwise/",
      "summary": "<p>The approval of these ETFs could enhance investor access to crypto-related equities, potentially boosting market liquidity and innovation.</p> <p>"
    },
    {
      "title": "Tether to open-source Bitcoin Mining Operating System to empower small, mid-sized miners, says Paolo Ardoino",
      "link": "https://cryptobriefing.com/tether-bitcoin-mining-open-source/",
      "summary": "<p>Tether's open-source MOS could democratize Bitcoin mining, enhancing decentralization and security while enabling smaller players to compete.</p> <p>"
    },
    {
      "title": "Bitcoin rises as key US-China trade talks commence in London",
      "link": "https://cryptobriefing.com/bitcoin-market-reaction-us-china-trade/",
      "summary": "<p>Bitcoin's rebound highlights its sensitivity to geopolitical events, underscoring its potential as a barometer for global economic tensions.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "DEXE – Down by 17%, but traders are still buying! Here’s why…",
      "link": "https://ambcrypto.com/dexe-down-by-17-but-traders-are-still-buying-heres-why/",
      "summary": "<img alt=\"DEXE - Down by 17%, but traders are still buying! Here&#039;s why...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/CAA530AC-94D4-49E5-AE8F-11DB808E31A7.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />DEXE might have declined massively, but that may not be the end."
    },
    {
      "title": "Bitcoin’s future sparks war among developers: Will node policy change break the network?",
      "link": "https://ambcrypto.com/bitcoins-future-sparks-war-among-developers-will-node-policy-change-break-the-network/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-4.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Are we headed for a Bitcoin breakup?"
    },
    {
      "title": "Dogecoin’s price could rally by 32%, but here’s the catch…!",
      "link": "https://ambcrypto.com/dogecoins-price-could-rally-by-32-but-heres-the-catch/",
      "summary": "<img alt=\"Dogecoin&#039;s price could rally by 32%, but here&#039;s the catch...!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-09T173332.809_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Everyone's favourite memecoin may be set to head in a different direction soon."
    },
    {
      "title": "Bitcoin network goes silent: Lowest activity in months raises questions about utility",
      "link": "https://ambcrypto.com/bitcoin-network-goes-silent-lowest-activity-in-months-raises-questions-about-utility/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-5-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin’s price surges, but on-chain activity declines, sparking debate over its real-world utility"
    },
    {
      "title": "KAIA defies low liquidity to rally 14% – Can it target $0.135 next?",
      "link": "https://ambcrypto.com/kaia-defies-low-liquidity-to-rally-14-can-it-target-0-135-next/",
      "summary": "<img alt=\"KAIA\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/B08C0A92-5BD4-4333-AA5A-C818C4C9D417.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />KAIA has led the market race and shows no signs of slowing down."
    }
  ]
}