{
  "CoinDesk": [
    {
      "title": "Anthony Pompliano Set to Head $750M Bitcoin Investment Vehicle: FT",
      "link": "https://www.coindesk.com/markets/2025/06/13/anthony-pompliano-set-to-head-750m-bitcoin-investment-vehicle-ft",
      "summary": ""
    },
    {
      "title": "Ripple, SEC File Joint Motion to Release $125M Held in Escrow",
      "link": "https://www.coindesk.com/markets/2025/06/13/ripple-sec-file-joint-motion-to-release-125m-held-in-escrow",
      "summary": ""
    },
    {
      "title": "XRP, SOL Poised to Take Off Amid Rocketing Institutional Demand, Analyst Says",
      "link": "https://www.coindesk.com/markets/2025/06/13/xrp-sol-poised-to-take-off-amid-rocketing-institutional-demand-analyst-says",
      "summary": ""
    },
    {
      "title": "Single Bitcoin Trader Loses $200M as Crypto Bulls See $1B Liquidations",
      "link": "https://www.coindesk.com/markets/2025/06/13/single-bitcoin-trader-loses-200m-as-crypto-bulls-see-1b-liquidations",
      "summary": ""
    },
    {
      "title": "Cynthia Lummis Proposes Artificial Intelligence Bill, Requiring AI Firms to Disclose Technicals",
      "link": "https://www.coindesk.com/policy/2025/06/13/cynthia-lummis-proposes-artificial-intelligence-bill-requiring-ai-firms-to-disclose-technicals",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Shopify launches early access to USDC stablecoin payments on Base",
      "link": "https://cointelegraph.com/news/shopify-early-access-usdc-stablecoin-payments-base?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzYxMzItNjYyYy03ODI0LTk5MGQtMzBkYzZjNDlkYzNm.jpg\" /></p><p>Shopify is rolling out USDC payments via Coinbase’s Base network, offering cashback perks and expanding crypto checkout options through Shopify Payments.</p>"
    },
    {
      "title": "KuCoin expands into Thailand with SEC-approved exchange",
      "link": "https://cointelegraph.com/news/kucoin-launches-regulated-thailand-exchange-after-erx-acquisition?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY4NDUtZWMzZi03ZDFkLTkyZjEtOGEzNDVmMDg4MzNj.jpg\" /></p><p>KuCoin enters the Thai market with a fully licensed exchange after acquiring ERX, Thailand’s first SEC-supervised digital token platform.</p>"
    },
    {
      "title": "My Big Coin execs to pay nearly $26M in fines to CTFC",
      "link": "https://cointelegraph.com/news/my-big-coin-to-pay-26m-fines-to-ctfc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY3M2ItNzQzMi03YzAwLWFlMGMtYzZmMDU4MWQyY2Ri.jpg\" /></p><p>The CFTC said that My Big Coin investors might not get their money back as the alleged operators “may not have sufficient funds or assets.”</p>"
    },
    {
      "title": "Huione darknet humming at ‘full capacity’ despite shutdown",
      "link": "https://cointelegraph.com/news/huione-still-thriving-despite-shutdown-chainalysis?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY3YTMtODAyYy03YzI4LWE4M2ItMmM1ZDgyZDQzZDIx.jpg\" /></p><p>Despite repeated attempts to stamp out the crypto-crime-linked Huione, Chainalysis says there’s been no meaningful decline in transactions.</p>"
    },
    {
      "title": "Bitcoin slides to $103K as Israel launches airstrikes on Iran",
      "link": "https://cointelegraph.com/news/bitcoin-price-declines-israel-airstrikes-iran?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2RmMzUtOTlkYi03ZTk5LWIzZWQtNDM0ZTFhYzQyZjM0.jpg\" /></p><p>Jan3 founder Samson Mow tells GameStop CEO, “This is where you buy” as Bitcoin’s price tumbled after Israel launched a series of airstrikes on Iran.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "How Nemo Money Is Redefining Global Investing With Smart Tools and Zero Commission Trading",
      "link": "https://cryptoslate.com/how-nemo-money-is-redefining-global-investing-with-smart-tools-and-zero-commission-trading/",
      "summary": "<p>Introduction In an increasingly complex investment world, Nemo Money is breaking through the noise. As a next-generation investing app developed by Exinity, Nemo is designed for both new and experienced investors looking for smarter, more accessible ways to manage their money — without paying excessive fees. Built for Investors Who Want More With over 6,000 [&#8230;]</p> <p>"
    },
    {
      "title": "Over $1.1B liquidated amid Middle East conflict with Bitcoin, Ethereum hit hardest",
      "link": "https://cryptoslate.com/insights/over-1-1b-liquidated-amid-middle-east-conflict-with-bitcoin-ethereum-hit-hardest/",
      "summary": "<p>In the past 24 hours, over $1.14 billion in crypto market positions were liquidated, with long positions accounting for roughly 91 percent of the total, according to data from Coinglass. The sharp unwinding came as Bitcoin dropped more than 5 percent from a local high of $108,000 Thursday to as low as $103,000, following Israeli [&#8230;]</p> <p>"
    },
    {
      "title": "Israel strike on Iran nuclear sites causes Bitcoin 5% slide, fails to act as a financial flight to safety",
      "link": "https://cryptoslate.com/israel-strikes-iran-nuclear-sites-causes-bitcoin-5-slide-fails-to-act-as-a-financial-flight-to-safety/",
      "summary": "<p>Bitcoin dropped sharply early Friday following Israel’s overnight strikes on Iran, weakening its recent position as a perceived safe-haven asset. The leading digital asset fell over 5 percent, from a local high of $108,000 on Thursday to approximately $103,000, as market participants reacted to escalating conflict in the Middle East. Oil markets surged in response [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin liquidity moves to non-KYC exchanges as US reserves thin",
      "link": "https://cryptoslate.com/bitcoin-liquidity-moves-to-non-kyc-exchanges-as-us-reserves-thin/",
      "summary": "<p>During Bitcoin&#8217;s climb to a new ATH above $111,000 in late May, a silent but measurable reshuffling has occurred in the market: more BTC is now held on offshore exchanges than on regulated platforms in the US, and volumes are steadily leaking from KYC-compliant venues. Data from CryptoQuant shows that the market embraced institutional inflows [&#8230;]</p> <p>"
    },
    {
      "title": "$USD1 Stablecoin Begins Minting on TRON",
      "link": "https://cryptoslate.com/usd1-stablecoin-begins-minting-on-tron/",
      "summary": "<p>Geneva, Switzerland, June 12, 2025 – TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet through blockchain technology and decentralized applications (dApps), has announced the first minting of the USD1 stablecoin on the TRON blockchain. Released by World Liberty Financial., the developer of a pioneering DeFi protocol and governance platform inspired [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "ONDO To Repeat 2024’s ‘Parabolic’ Run? Analyst Anticipates 130% Rally Soon",
      "link": "https://www.newsbtc.com/news/ondo-to-repeat-2024s-parabolic-run-analyst-anticipates-130-rally-soon/",
      "summary": "Despite failing to break out of its downtrend, ONDO could be preparing for a surge above the $2 barrier. Some analysts suggest it could repeat its 2024 playbook if it continues to hold its current levels. Related Reading: Ethereum Prepares For Massive Run After $2,800 Reclaim – ‘Up Only’ Ahead? ONDO Breakout Eyes $2 ONDO, the native token of the tokenized real-world asset (RWA) platform Ondo Finance, is attempting to reclaim a key area amid the market pullback. Notably, the cryptocurrency has struggled to hold the $1 mark since losing the area as support over three months ago. In December, the RWA token hit its all-time high (ATH) of $2.14 after US President Donald Trump’s crypto venture, World Liberty Financial (WLFI), purchased 134,216 ONDO tokens for 250,000 USDC. This propelled ONDO’s price above the $2 barrier for the first time, but the late 2024 and Q1 2025 corrections halted its bullish momentum, sending its price to the $0.60-$0.70 range. Following the late April market recovery, ONDO’s price reclaimed the $0.85 area and broke out of its multi-month downtrend. The cryptocurrency then hovered between the $0.85-$1.10 levels throughout May, hitting a three-month high of $1.13 nearly a month ago. Since then, the token has been in a one-month downtrend, dipping below its local range after the recent market pullback. However, the cryptocurrency has been attempting to reclaim this range for the past week, hitting a one-week high of $0.92 on Wednesday. Crypto analyst World of Charts highlighted the token’s performance, affirming, “after a long correction, Finally Looking Good For Midterm.” As ONDO attempts to reclaim the $0.90 area, the analyst anticipates that the cryptocurrency will soon break out of its current range and the downtrend line, forecasting a 130% rally toward the $2 barrier. 2024 ATH Repeat Coming? On Thursday, analyst Sjuul from AltCryptoGems noted ONDO’s performance over the past year, asserting, “Not sure there are many other charts looking as good on high time frames like ONDO.” He explained that “The King of RWA” is “basically holding a bullish structure since its launch,” making a series of higher lows for over a year while maintaining its ascending support trendline. Meanwhile, analyst Alex Clay suggested that ONDO could see a parabolic run based on its performance in 2024. The market watcher noted that the token is currently accumulating at the bottom of a 15-month ascending channel, which previously served as a crucial bounce point for its rally toward its ATH. As Clay explained, after reaching the channel’s upper boundary last year, ONDO saw a multi-month downtrend toward the lower boundary, before printing a higher low. This was followed by a massive rally toward the channel’s top. Related Reading: Bitcoin Eyes New Highs As Price Retests $109,000, But Analyst Warns Of Potential Pullback This year, ONDO is “following the Bullish Fractal from the previous year” after falling to the channel’s lower boundary, breaking out of the downtrend line, and registering a higher low. “These 2 reasons are more than enough to pump straight up to the channel&#8217;s top,” the analyst concluded. If history repeats, the cryptocurrency could surge toward the $2.8-$3 area. At the time of writing, ONDO trades at $0.84, a 5.2% decline in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price’s Brutal Sell-Off Has One More Stop, Says Analyst — Here’s Where",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-prices-brutal-sell-off-has-one-more-stop-says-analyst-heres-where/",
      "summary": "The Bitcoin price continues to decelerate as the crypto market shows signs of weakness due to macroeconomic factors. The top crypto by market capitalization has been testing critical support levels and is at risk of falling deeper into its monthly lows. Related Reading: Bitcoin Could Jump 20% For Every 1% Liquidity Boost: Expert At the time of writing, the Bitcoin price trades around $104,000 recording a 2.5% drop over the past 24 hours. Other cryptocurrencies show greater weaknesses on similar timeframes with Ethereum and XRP displaying a 8% and 4% drop, respectively. Bitcoin price hints at further losses on the daily chart. Source: BTCUSD on Tradingview Bitcoin Price Alert, Key Levels To Watch According to top crypto analyst Daan Crypto, the Bitcoin price has been trading within a narrow window after losing the range high located at $108,385. While the cryptocurrency has been able to withstand the sell-off, the analyst drew important levels to watch. As seen on the chart below, and according to the analyst, the Bitcoin price is likely to stay on its bearish course and potentially touch the mid area of its current range. This price action would put BTC at around $99,600 in the coming days. If buyers can’t hold the sell pressure around this level, then BTC is more than likely to keep bleeding into its range low of $90,000. This bearish price action, the analyst clarified, would become the norm for the rest of June. Key Levels to watch as the Bitcoin price shows weakness on low timeframes. Source: Daan Crypto via X Daan Crypto stated the following regarding the Bitcoin price action: Quick move after that which was obviously &#8220;helped&#8221; by the headlines although the news was looming already with the past 48 hours of headlines which is also why price started selling of prior. I&#8217;ve said it a couple of times before but I&#8217;ll say it again. Bulls had no business going back down below $108K and I&#8217;m treating this as another deviation and move back into the larger range. This is reason enough for me to be cautious and not add on exposure that was derisked (…). In this context, the analyst advised his followers to wait for clear confirmation that the bull trend is returning if Bitcoin can retake its range high around the previously mentioned level. Otherwise, the best course of action is to remain cautious. Optimism Fades as Bitcoin Aims for Lower On a separate note, trading desk QCP Group noted that the biggest risk for Bitcoin and the crypto market comes from the rising tensions between the US and China, and the growing tensions in the Middle East. Related Reading: Bitcoin Is Just 0.2% Of Global Wealth — And That’s Why It’s Not Too Late: Analyst However, the trading desk pointed at several items to show that there are still good news hinting at a potential recovery in the digital asset market. These included the spike in Ethereum ETFs inflows, the potential launch of a Solana ETF, and GameStop’s plan to offer $1.7 billion in convertible notes to allocate money into Bitcoin as the company looks for “balance sheet diversification.” Cover image ChatGPT, BTC/USD chart from Tradingview"
    },
    {
      "title": "$390M In Ethereum Leaves Exchanges—Biggest Daily Exit In Over A Month",
      "link": "https://www.newsbtc.com/news/ethereum/393m-ethereum-leaves-exchanges-biggest-daily-exit/",
      "summary": "On-chain data shows Ethereum has just witnessed its largest daily withdrawal in over a month, a sign that may turn out to be bullish for the asset&#8217;s price. Ethereum Has Recently Seen Notable Exchange Outflows As explained by the institutional DeFi solutions provider Sentora (formerly IntoTheBlock) in a new post on X, a large amount of Ethereum has left exchanges. The on-chain indicator of interest here is the &#8220;Exchange Netflow,&#8221; which measures the net amount of ETH entering into or exiting out of the wallets associated with centralized exchanges. When the value of this metric is positive, it means the exchanges are receiving a net number of deposits. As one of the main reasons why investors deposit their tokens to these platforms is for selling-related purposes, this kind of trend can have a bearish implication for the ETH price. Related Reading: Tron Has Plenty Of Room For A 2025 Bull Run, Risk Metric Signals On the other hand, the indicator being below zero suggests the exchange outflows outweigh the inflows. Such a trend can imply the holders are accumulating, which can naturally have a bullish effect on the asset. Now, here is the chart shared by Sentora that shows the trend in the Ethereum Exchange Netflow over the past month: As displayed in the above graph, the Ethereum Exchange Netflow has seen a sharp negative spike during the past day, which suggests the investors have withdrawn a significant amount of the cryptocurrency. In total, the exchanges have handled net outflows of more than 140,000 ETH (worth about $390 million) with this withdrawal spree. This is the largest single-day exit that these platforms have faced in over a month. These outflows have come as Ethereum has been attempting a breakout from its month-long range. As such, it&#8217;s possible that a portion of the large holders of the market have some level of confidence in this rally. In some other news, the cash-margined Ethereum Futures Open Interest has set a new all-time high, as the on-chain analytics firm Glassnode has revealed in an X post. The Futures Open Interest is an indicator that measures the total amount of positions related to Ethereum that are currently open on all derivatives platforms. Here, the &#8216;cash-margined&#8217; Open Interest is of relevance, which includes all the contracts that have fiat/stablecoins as collateral. Related Reading: Bitcoin Options Traders Expect Quiet—But On-Chain Data Suggests Chaos From the chart, it&#8217;s apparent that this metric has recently seen some rapid growth and has achieved a new record of about $20 billion. &#8220;Despite a slight pullback from the $2.8K levels, leverage continues to build as traders load up using stablecoins,&#8221; notes Glassnode. ETH Price Ethereum crossed beyond the $2,800 level earlier, but it appears it has seen a setback as its price is back at $2,750. Featured image from Dall-E, Glassnode.com, IntoTheBlock.com, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Is Just 0.2% Of Global Wealth — And That’s Why It’s Not Too Late: Analyst",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-is-just-0-2-of-global-wealth-and-thats-why-its-not-too-late-analyst/",
      "summary": "According to Walker, host of The Bitcoin Podcast, Bitcoin’s share of the world’s wealth is still tiny. It sits at about $2 trillion in market value. That’s just 0.2% of roughly $1 quadrillion held across all assets. For many investors, that number brings a sense of how early this market really is. Yet, it also raises questions about what comes next for this highly talked-about coin. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Global Wealth Distribution Real estate holds the biggest slice of that $1 quadrillion pie. At around $370 trillion, it represents 37% of total global wealth. Bonds follow close behind with $318 trillion. Those are seen as a safe choice for retirees and conservative funds. Stocks, meanwhile, sit at $135 trillion. Cash and bank deposits add another almost $130 trillion to the mix. These numbers show where most of the world’s money lives today. There is $1000 TRILLION of global wealth. Bitcoin is only $2T… Bitcoin is only 0.2% of global wealth, and there will only ever be 21M bitcoins. We are insanely early yet many still feel like they’ve missed the boat… If you’re reading this, buy bitcoin. Chart: @Croesus_BTC pic.twitter.com/gjju41MMGm — Walker⚡️ (@WalkerAmerica) June 11, 2025 Bitcoin’s Market Share Bitcoin’s $2 trillion value looks small next to these giants. It comes in below art, cars and collectibles, which together amount to $27 trillion. Gold, long a trusted store of value, sits at $22 trillion. So, while Bitcoin is rare by design, it still trails behind assets with centuries of history and deep pockets on the buying side. Scarcity Fuels Price Talk With only 21 million coins ever to be mined, Bitcoin’s supply cap is fixed. That has led to forecasts of big price jumps if demand keeps growing. Based on reports, some say Bitcoin could match gold’s $22 trillion market cap one day. That would push a single coin past $1.15 million. Other backers warn that missing out now could mean buying in later at much higher levels, driven by FOMO—fear of missing out. Related Reading: TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin Institutions Eye The Market Michael Saylor, who heads one of the biggest Bitcoin treasury firms, thinks big players might wait until prices soar. He suggests that companies like JPMorgan could finally jump in when Bitcoin hits $1 million. He even floated the idea of $10 million per coin before it becomes common in mainstream portfolios. These views point to a potential wave of new cash rushing in if certain price thresholds are crossed. Featured image from Bitbo, chart from TradingView"
    },
    {
      "title": "Bitcoin Could Jump 20% For Every 1% Liquidity Boost: Expert",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-could-jump-20-for-every-1-liquidity-boost-expert/",
      "summary": "Bitcoin’s blistering second-quarter advance is tracking the strongest expansion in global liquidity on record, according to Real Vision chief crypto analyst Jamie Coutts, who argues that every additional percentage point of liquidity injected into the financial system “should” translate into a 20% gain for the cryptocurrency. 1% Liquidity = 20% Bitcoin? Writing on X, Coutts observed that his proprietary Global Liquidity Index broke to a fresh all-time high on 10 April after three years of drift and that, in the nine weeks since, Bitcoin has rallied about 40 percent. &#8220;Bitcoin has rallied 40% since April 10 which was when my global liquidity aggregate (GLI) after 3 years broke out to new all time highs on the back of a plummeting US dollar. Since then the aggregate is up 2%. Bitcoin&#8217;s Q2 rally is entirely consistent with liquidity regimes of this nature.&#8221; He added that &#8220;while Bitcoin’s sensitivity to GLI moderates over time, for every extra 1 percent of liquidity added to the system we should expect to see a &#62; 20 percent move in the price of Bitcoin,” he said, further claiming that the steady inflow of capital “doesn’t account for the inevitable ‘oh shit’ moment of panic buying that is going to happen… eventually. It will be best of times, it will be the worst of times.” Related Reading: Bitcoin Options Traders Expect Quiet—But On-Chain Data Suggests Chaos The chart he shared, reproduced above, overlays his GLI (white) with daily Bitcoin prices (orange) from 2018 through June 2025. It shows the index pressing to roughly $138 trillion while Bitcoin changes hands near $108,000, underscoring the tight directional relationship between the two series across several liquidity cycles. Coutts builds the indicator by combining G4 central-bank balance sheets, broad money aggregates such as M2, and key US liquidity accounts including the Treasury General Account and the Federal Reserve’s reverse-repo facility. Since the April breakout the GLI has added only about two percentage points, yet Bitcoin’s market value has already risen by twice the elasticity implied by his model—an outcome he considers “entirely consistent” with prior liquidity regimes, which tend to produce the sharpest price response early in the cycle. Related Reading: Bitcoin Is Wildly Undervalued, Says Bitwise: ‘Fair Price’ Today Is $230,000 For now, he sees little evidence that the GLI’s momentum is cresting; with the Federal Reserve still draining its reverse-repo facility, the People’s Bank of China quietly expanding its balance sheet, and the European Central Bank hinting at renewed long-term refinancing operations, the backdrop remains structurally bullish even if it won’t be a straight line. Looking further out, mainstream liquidity research suggests modest but persistent growth: most macro desks expect the global aggregate to rise roughly one to six percent over the next twelve months, three to eight percent cumulatively by mid-2027, and on the order of ten to fifteen percent by the turn of the decade as governments roll over record debt loads and central banks normalise balance-sheet policies. If Coutts’ rule of thumb holds, even the low end of those projections would leave ample headroom for triple-digit percentage gains in Bitcoin before 2030. At press time, BTC traded at $107,676. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Will Replace Gold And Go To $1,000,000, Says Galaxy Digital CEO Mike Novogratz",
      "link": "https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Will-Replace-Gold-And-Go-To-1000000-Says-Galaxy-Digital-CEO-Mike-Novogratz.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-will-replace-gold-and-go-to-1000000-says-galaxy-digital-ceo-mike-novogratz\" rel=\"nofollow\"> </a></p> <p>Mike Novogratz, in an interview with CNBC, said “there have been more Bitcoins lost than will be mined for the rest of eternity.\"</p> <p>"
    },
    {
      "title": "Coinbase Announces Bitcoin Rewards Credit Card, Offering up to 4% BTC Back on Everything",
      "link": "https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase-BTC-Credit-Card.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-announces-bitcoin-rewards-credit-card-offering-up-to-4-btc-back-on-everything\" rel=\"nofollow\"> </a></p> <p>Coinbase is launching its first-ever branded credit card in partnership with American Express, set to roll out this fall. Called the Coinbase One Card, it will be available only to U.S. members of Coinbase One, the platform’s monthly subscription service. The card will offer 2% to 4% back in Bitcoin on everyday purchases, along with [&#8230;]</p> <p>"
    },
    {
      "title": "France’s The Blockchain Group Secures €9.7 Million More For Its Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Frances-The-Blockchain-Group-Secures-E9.7-Million-More-For-Its-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/frances-the-blockchain-group-secures-e9-7-million-more-for-its-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Adam Back, TOBAM and Ludovic Chechin-Laurans back ALTBG with €9.7 million in equity and convertible bonds.</p> <p>"
    },
    {
      "title": "Bitcoin: How To Solve the Student Loan Crisis",
      "link": "https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/studentdebt.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/bitcoin-how-to-solve-the-student-loan-crisis\" rel=\"nofollow\"> </a></p> <p>Students are already taking out mortgage-sized loans for college. The financial jiu-jitsu of pairing bitcoin with student loans can fix the student debt crisis.</p> <p>"
    },
    {
      "title": "Passport Prime: A New Security Device For a New Generation",
      "link": "https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Passport-Prime-A-New-Security-Device-For-a-New-Generation.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/passport-prime-a-new-security-device-for-a-new-generation\" rel=\"nofollow\"> </a></p> <p>Passport Prime from Foundation Devices gears up for a Q3 2025 release, offering NFC, 2FA, and a sleek design to boost Bitcoin security.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Thai Police Arrest Chinese Suspect in $6.1 Million Bitcoin Fraud Case",
      "link": "https://decrypt.co/325028/thai-police-arrest-chinese-suspect-bitcoin-fraud-case",
      "summary": "Two Chinese victims lost their Bitcoin after a business meeting in Mae Sai district, transferring funds in two separate transactions."
    },
    {
      "title": "Coinbase Launches Bitcoin Rewards Card to Drive Subscriber Growth",
      "link": "https://decrypt.co/325025/coinbase-bitcoin-rewards-card-drive-subscriber-growth",
      "summary": "Coinbase has launched a Bitcoin rewards credit card, with possible plans to support multiple tokens over time, was told."
    },
    {
      "title": "Barbie, Hot Wheels Toy Maker to Use OpenAI Tech to Boost Productivity",
      "link": "https://decrypt.co/325022/barbie-hot-wheels-toy-maker-openai-tech-productivity",
      "summary": "Mattel will retain full control of its brands while using AI to develop new products, with the first launch expected later this year."
    },
    {
      "title": "Ripple, SEC Ask Court to Dissolve XRP Injunction, Release $125M in Escrow",
      "link": "https://decrypt.co/325015/ripple-sec-ask-court-to-dissolve-xrp-injunction-release-125m-in-escrow",
      "summary": "The joint filing proposes a $50 million payment to the SEC and marks a key step toward settling the years-long legal battle over XRP sales."
    },
    {
      "title": "Former NBA Star Shaquille O'Neal Agrees to Pay $1.8M to Settle FTX Suit",
      "link": "https://decrypt.co/325012/former-nba-star-shaquille-oneal-settle-ftx-suit",
      "summary": "The agreement marks one of the first major financial settlements against celebrities who promoted FTX before its spectacular collapse."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin slides, gold spikes after Israel strikes Iran, Israeli PM warns campaign will last as many days as needed",
      "link": "https://cryptobriefing.com/crypto-market-volatility-israel-iran/",
      "summary": "<p>Geopolitical tensions may drive investors to traditional safe-haven assets, impacting cryptocurrency markets and regional economic stability.</p> <p>"
    },
    {
      "title": "$USD1 stablecoin begins minting on TRON",
      "link": "https://cryptobriefing.com/usd1-stablecoin-minting-on-tron/",
      "summary": "<p>The minting of USD1 on TRON could enhance institutional trust and adoption, bolstering TRON's position in the global blockchain market.</p> <p>"
    },
    {
      "title": "Trump says Fed can raise rates if inflation returns, but warns Powell will be “too late for that too”",
      "link": "https://cryptobriefing.com/trump-fed-interest-rates-inflation/",
      "summary": "<p>Trump's remarks highlight ongoing tensions with the Fed, potentially impacting future monetary policy decisions and economic stability.</p> <p>"
    },
    {
      "title": "Circle brings USDC to Ripple’s network as XRP Ledger gears up for EVM-compatible sidechain this quarter",
      "link": "https://cryptobriefing.com/usdc-on-xrp-ledger-evm-sidechain/",
      "summary": "<p>The integration of USDC on XRPL and the upcoming EVM sidechain could significantly enhance XRPL's utility and attract diverse blockchain projects.</p> <p>"
    },
    {
      "title": "BlackRock targets to become world’s largest crypto asset manager by 2030",
      "link": "https://cryptobriefing.com/blackrock-crypto-asset-management/",
      "summary": "<p>BlackRock's crypto ambitions could reshape global financial markets, influencing regulatory landscapes and accelerating digital asset adoption.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "GameStop stock tanks amid news of $1.75B Bitcoin bet: ‘Insane!’",
      "link": "https://ambcrypto.com/gamestop-stock-tank-amid-news-of-1-75b-bitcoin-bet-insane/",
      "summary": "<img alt=\"GameStop shares tank 11.7% amid news of $1.75B Bitcoin bet: &#039;Insane!&#039;\" class=\"attachment-full size-full wp-post-image\" height=\"723\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/GameStop-Announces-Proposed-Private-Offering.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1286\" />Is GameStop’s crypto pivot backfiring?"
    },
    {
      "title": "Top 9 presales to look out for in June 2025",
      "link": "https://ambcrypto.com/top-9-presales-to-look-out-for-in-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1469\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/john-mcarthur-ROQzKIAdY78-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A presale refers to an early sale of tokens before they are listed on public [&#8230;]"
    },
    {
      "title": "Bitcoin set for explosive growth as inflation cools – $200k in sight?",
      "link": "https://ambcrypto.com/bitcoin-set-for-explosive-growth-as-inflation-cools-200k-in-sight/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Inflation remains lower than expected, but Bitcoin continues to trend higher through the chaos."
    },
    {
      "title": "TRON: Despite recent volatility, TRX’s bullish trend remains",
      "link": "https://ambcrypto.com/tron-despite-recent-volatility-trxs-bullish-trend-remains/",
      "summary": "<img alt=\"TRON: Despite recent volatility, TRX&#039;s bullish trend remains\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/TRON-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A bullish phase was underway, but the swift retracement over the past couple of days could reset market sentiment."
    },
    {
      "title": "Stablecoins can grow 8X, cross $2T by 2028: U.S. Treasury Sec. Scott Bessent",
      "link": "https://ambcrypto.com/stablecoins-can-grow-8x-cross-2t-by-2028-u-s-treasury-sec-scott-bessent/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/stablecoins-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />About 81% of Tether's USDT reserves are in U.S. Treasury bills."
    }
  ]
}