{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: BTC Slips Below $110K as 'Signs of Fatigue' Emerging",
      "link": "https://www.coindesk.com/markets/2025/06/09/asia-morning-briefing-btc-slips-below-110k-as-signs-of-fatigue-emerging",
      "summary": ""
    },
    {
      "title": "Bitcoin Climbs Above $110K, 'At Crossroads' for Next Major Move",
      "link": "https://www.coindesk.com/markets/2025/06/09/bitcoin-climbs-above-110k-at-crossroads-for-next-major-move",
      "summary": ""
    },
    {
      "title": "Aptos' APT Gains 4% on Significant Volume, Has More Potential Upside",
      "link": "https://www.coindesk.com/markets/2025/06/09/aptos-apt-gains-4-on-significant-volume-has-more-potential-upside",
      "summary": ""
    },
    {
      "title": "Trump Media and Semler Scientific Could Be Cheapest Bitcoin Treasury Companies by This Metric",
      "link": "https://www.coindesk.com/markets/2025/06/09/trump-media-and-semler-scientific-could-be-cheapest-bitcoin-treasury-companies-by-this-metric",
      "summary": ""
    },
    {
      "title": "U.S. SEC Chair Says Working on 'Innovation Exemption' for DeFi Platforms",
      "link": "https://www.coindesk.com/policy/2025/06/09/u-s-sec-chair-says-working-on-innovation-exemption-for-defi-platforms",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Ripple commits $5M more toward crypto research in APAC",
      "link": "https://cointelegraph.com/news/ripple-commits-5-million-crypto-research-apac?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU3ZjQtNGYwOS03ODM3LWFmNDctMjUyNTVkYzExOWQ4.jpg\" /></p><p>The funds are on top of the $25 million that Ripple committed last month to education nonprofit organizations in the US.</p>"
    },
    {
      "title": "Société Générale launches US dollar stablecoin on Ethereum and Solana",
      "link": "https://cointelegraph.com/news/societe-generale-forge-to-launch-a-usd-denominated-stablecoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU4N2YtY2M3Yi03MjhhLThhNjMtNDM2MjNjNjM0YzJj.jpg\" /></p><p>Société Générale-Forge launches USDCV stablecoin on Ethereum and Solana, with BNY as custodian and global rollout aimed at trading and settlement.</p>"
    },
    {
      "title": "Crypto social media sees rising interest in AI taking jobs: Santiment",
      "link": "https://cointelegraph.com/news/crypto-social-media-sees-rising-interest-in-ai-taking-jobs-santiment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2NkYjgtNmI2Zi03YjcxLTg1ZjEtMmU0NWMyNWFjMTVi.jpg\" /></p><p>Other narratives of interest on social media included the accumulation of crypto by whales like millionaire crypto trader James Wynn, Solana, Loud Token and various memecoins.</p>"
    },
    {
      "title": "South Korea moves to legalize stablecoins with new crypto bill",
      "link": "https://cointelegraph.com/news/south-korea-plan-allow-stablecoins-introduces-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU0NmQtZDJkOC03M2Y4LWE2NTYtZjU4NzdiMjMyZjM4.jpg\" /></p><p>South Korea’s ruling party under new president Lee Jae-myung is pushing legislation to allow local stablecoin issuance and boost crypto market growth.</p>"
    },
    {
      "title": "Bitcoin lacks strong catalyst to beat its $112K ATH: Analyst",
      "link": "https://cointelegraph.com/news/bitcoin-price-lacks-fuel-surpass-all-time-high?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWQyOWEtMmViYS03Mjk1LTlhY2MtOTUwMmU0ZGFmNGE0.jpg\" /></p><p>Bitfinex analysts say that Bitcoin holders who bought in Q1 are now being tested as “the price churns sideways near ATH levels.”</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "RLUSD surpasses $300M supply as Ripple secures UAE backing",
      "link": "https://cryptoslate.com/rlusd-surpasses-300m-supply-as-ripple-secures-uae-backing/",
      "summary": "<p>Ripple’s stablecoin RLUSD expanded its circulating supply by 29% in the week ended June 8, adding $72.5 million and closing at $320.6 million. The movement marks the first time the token’s float crossed the $300 million threshold. Additionally, it represents a sixfold increase since the launch of RLUSD on Dec. 17, 2024. Data from Artemis [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin climbs back to $110k amid sustained corporate, institutional interest",
      "link": "https://cryptoslate.com/bitcoin-climbs-back-to-110k-amid-sustained-corporate-institutional-interest/",
      "summary": "<p>Bitcoin (BTC) rebounded above $110,000 on June 9, regaining ground lost in last week’s selloff as investors rotated back into digital assets on the back of strong ETF inflows, easing macroeconomic tensions, and renewed optimism across risk markets. The world’s largest crypto reached an intraday high of $110,653 from a daily low of $105,426 earlier [&#8230;]</p> <p>"
    },
    {
      "title": "ProShares, Bitwise race to launch CRCL ETFs, targeting August debut amid stock price surge",
      "link": "https://cryptoslate.com/proshares-bitwise-race-to-launch-crcl-etfs-targeting-august-debut-amid-stock-price-surge/",
      "summary": "<p>ProShares Trust and Bitwise each filed preliminary prospectuses with the Securities and Exchange Commission (SEC) on June 6 for exchange-traded funds (ETF) designed to track Circle’s CRCL shares. The ProShares Ultra CRCL ETF is a 2x leveraged product that seeks to deliver twice the daily move in CRCL by utilizing swaps and other derivatives, as [&#8230;]</p> <p>"
    },
    {
      "title": "BiT Global drops Coinbase lawsuit over wrapped Bitcoin delisting",
      "link": "https://cryptoslate.com/bit-global-drops-coinbase-lawsuit-over-wrapped-bitcoin-delisting/",
      "summary": "<p>BiT Global, a crypto custody firm tied to entrepreneur Justin Sun, has voluntarily dismissed its lawsuit against Coinbase over the delisting of Wrapped Bitcoin (WBTC). The move ends a months-long legal dispute that spotlighted growing tensions between centralized exchanges and token custodians as control over key infrastructure becomes increasingly contested. Filed on June 6 in [&#8230;]</p> <p>"
    },
    {
      "title": "BlackRock’s IBIT rockets to $70B in 341 days, 5x faster than previous record",
      "link": "https://cryptoslate.com/blackrocks-ibit-rockets-to-70b-in-341-days-5x-faster-than-previous-record/",
      "summary": "<p>BlackRock&#8217;s iShares Bitcoin Trust (IBIT) exchange-traded fund (ETF) crossed $70 billion in assets under management (AUM) on June 6, being the fastest to reach this mark in just 341 trading days. Bloomberg ETF analyst Eric Balchunas reported the milestone on X, noting that the fund beat the previous speed record of 1,691 days set by [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum’s Realized Price Hints at a Market Reset, What Traders Should Know",
      "link": "https://www.newsbtc.com/bitcoin-news/ethereums-realized-price-hints-at-a-market-reset-what-traders-should-know/",
      "summary": "Ethereum has shown signs of regaining momentum after a recent period of decline. The asset is currently trading at approximately $2,540, reflecting a modest 1% daily increase. This upward move follows a notable dip to the $2,400 range last week, marking what appears to be a short-term rebound from recent bearish pressure. While price fluctuations continue, on-chain analysts closely monitor Ethereum’s market structure through various metrics that provide historical context and potential forecasting value. Recent insights from a CryptoQuant analyst have focused on how ETH’s long-term behavior aligns with certain key indicators, which may help define price floors and signal overheated market conditions. Related Reading: Bitcoin And Ethereum Defend Key Moving Averages – Bullish Signal Or Temporary Relief? Assessing Ethereum Price Floors Using On-Chain Data One of CryptoQuant’s analysts, writing under the name CryptoOnchain, shared a breakdown of Ethereum’s potential “price floors” using a composite of on-chain and market metrics. These floors represent statistical thresholds that have historically acted as support zones during market corrections. Among them is the realized price, which measures the average value at which all circulating ETH last moved on-chain. This metric is often used as a sentiment gauge to track when market participants are in profit or loss. Another benchmark, the mean_price_classic, reflects the average daily closing price of ETH since inception and serves as a cumulative market average. It is used in conjunction with the delta_price_classic, a figure derived from the difference between Ethereum’s realized capitalization and its historical average cap, adjusted for supply. According to the analyst, this delta price is frequently cited in Bitcoin analytics to highlight undervalued zones, and its adaptation for Ethereum provides a comparable lens for identifying periods when the market may be at or near a floor. Tracking Market Tops and Potential Resistance Zones In a separate analysis report, CryptoOnchain highlighted tools for identifying potential market tops. The indicators outlined include the realized_price_x2 and realized_price_x3, which are calculated by multiplying Ethereum’s realized price by two and three, respectively. Historically, these levels have coincided with overheated phases of the market, where prices reached temporary peaks before correcting. Related Reading: Ethereum Consolidates Below $2,800 – Bulls Need This Level To Trigger Next Leg Up Another tool, the price_top_stddev, incorporates volatility into the analysis by adding two times the historical standard deviation of ETH’s closing price to the realized price. This combination serves as a marker of statistically elevated prices, often aligning with periods of heightened euphoria and speculative activity. CryptoOnchain suggests that monitoring these zones can assist traders in managing risk during extended rallies, as these resistance levels have previously preceded major cycle reversals. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin On-Chain Warning: Short-Term Holder Selling Accelerates Amid Price Correction",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-on-chain-warning-short-term-holder-selling-accelerates-amid-price-correction/",
      "summary": "As Bitcoin (BTC) came close to slumping below the psychologically important $100,000 mark last week, the short-term holders (STH) cohort started to show signs of weakening conviction in the leading cryptocurrency, raising fears of a deeper price correction. Bitcoin STH Fear Resurfaces According to a recent CryptoQuant Quicktake post by contributor Darkfost, Bitcoin STH’s net position has turned sharply negative over the past month. This has happened despite BTC holding above the $100,000 level. For the uninitiated, Bitcoin STH are investors who have held their BTC for less than 155 days. They are generally more reactive to price volatility and market sentiment, often selling during corrections or uncertainty. Specifically, a cumulative net position change of -833,000 BTC has been recorded among short-term holders during the ongoing pullback. By comparison, the April crash saw a net position change of around -977,000 BTC. Related Reading: Bitcoin Signals Strength As Long-Term Holder Realized Cap Surges Past $20 Billion – Details Darkfost noted that current STH behavior closely resembles the activity observed during BTC’s brief drop below $80,000 in April 2025, when the digital asset bottomed out at $74,508. The analyst wrote: Since then, STH appear to have become much more sensitive to market movements, and the recent dip around the $100,000 mark was enough to trigger renewed fear among this group of investors. BTC Showing Signs of Reversal Although BTC lost momentum after reaching its latest all-time high (ATH) of $111,814, the leading cryptocurrency regained strength over the weekend &#8211; indicating a possible reversal may be underway. Related Reading: Bitcoin Derivatives Reset: Neutral Funding And Whale Withdrawals Hint At Bullish Shift For example, seasoned crypto analyst Ali Martinez noted that BTC has broken through the key resistance level at $106,600. In a recent X post, Martinez predicted that Bitcoin could rally to $108,300 or even $110,000 if current momentum continues. In a separate X post, fellow crypto analyst Rekt Capital shared the following Bitcoin daily chart, noting that the cryptocurrency not only broke out of its two-week downtrend &#8211; highlighted in light blue &#8211; but may now be turning that former resistance into a new support level. Meanwhile, several technical indicators also point to continued bullish momentum. Notably, Bitcoin’s Hash Ribbons have recently flashed a prime buying signal. Additionally, on-chain data suggests that BTC could experience a sharp upward move in the short term, potentially driven by a negative funding rate on Binance. A prolonged period of negative funding rates often sets the stage for a short squeeze. Despite the bullish outlook, some red flags remain. Recent data shows that long-term holders are gradually exiting the market, while an influx of retail investors could add volatility to the current rally. At press time, BTC trades at $107,627, up 1.9% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant, X, and TradingView.com"
    },
    {
      "title": "On-Chain Data Flashes Bullish: Is Bitcoin Ready for a $110K Comeback?",
      "link": "https://www.newsbtc.com/bitcoin-news/on-chain-data-flashes-bullish-is-bitcoin-ready-for-a-110k-comeback/",
      "summary": "Bitcoin has resumed its upward trajectory, registering a modest 1.6% gain over the last 24 hours to trade at $107,428. The recovery comes after last week’s dip toward $100,000 levels, which had been triggered by market-wide volatility and profit-taking. While BTC remains approximately 4.2% below its all-time high of $111,000 reached last month, the weekly trend still reflects a 3.3% increase, suggesting buyers are gradually regaining confidence. This market behavior is mirrored in a set of on-chain indicators recently analyzed by CryptoQuant contributor Amr Taha. Related Reading: Bitcoin And Ethereum Defend Key Moving Averages – Bullish Signal Or Temporary Relief? Bitcoin On-Chain Metrics Reflect Accumulation Behavior In Taha&#8217;s analysis titled “On-Chain Data Hints at Bitcoin’s Next Leg Higher,” Taha examined several metrics that point to a potential continuation of the rally. These include the Binance Taker Buy/Sell Ratio, UTXO age bands, and the Long-Term Holder (LTH) realized cap. All three suggest that market participants are actively accumulating and that underlying sentiment is shifting toward renewed bullishness. One of the primary indicators Taha focused on is Binance’s Taker Buy/Sell Ratio, which has recently climbed to 1.1. This metric evaluates the volume of aggressive market buys versus market sells on the Binance exchange. A ratio above 1 typically implies that more participants are willing to pay the market price to buy than to sell, indicating stronger buyer conviction. According to Taha, such shifts historically precede continued price increases when supported by volume. Another key metric showing strength is the Buy/Sell Pressure Delta over the last 90 days. This indicator tracks the net difference between buying and selling pressure and is now halfway to its historical peak at 0.02. Taha explains that this suggests a market not yet overheated, with room for further accumulation. Combined with recent breakout behavior above the 1D–1W UTXO band, representing recently transacted coins, this hints that many new holders are currently in profit and choosing to hold rather than sell. LTH Conviction and Stablecoin Inflows Reinforce Bullish Case Taha also noted the Long-Term Holder (LTH) Realized Cap has now surpassed $56 billion, reflecting strong hands holding a larger share of Bitcoin supply. These coins have not moved in over 155 days and are considered to represent investors with higher conviction. The increase in this metric implies that fewer coins are being sold into the market, a signal that many investors are expecting higher valuations in the coming weeks or months. Related Reading: Bitcoin Leveraged Traders Are Back Betting On A Price Decline — What This Means In addition, more than $550 million in stablecoins have reportedly flowed into Binance in recent hours. Historically, such inflows to spot exchanges, as opposed to derivatives platforms, often suggest readiness to deploy capital for direct asset purchases. Notably, all of these indicators can be seen as a leading signal of potential volatility or buying pressure. If this pattern holds, Bitcoin’s short-term price activity may benefit from continued accumulation and institutional positioning. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "XRP Price Regains Traction, Can The Bulls Pump It This Time?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-regains-traction-2-25/",
      "summary": "XRP price started a fresh increase above the $2.25 zone. The price is now consolidating and might aim for an upward move above the $2.320 resistance. XRP price started a decent upward move above the $2.220 zone. The price is now trading above $2.250 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.270 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start another increase if it clears the $2.320 resistance zone. XRP Price Aims Fresh Increase XRP price formed a base and started a fresh increase from the $2.050 zone, like Bitcoin and Ethereum. There was a move above the $2.120 and $2.20 resistance levels. The bulls even pushed the price above the $2.25 level. Finally, the price tested the $2.320 resistance. A high was formed at $2.3294 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2.2250 swing low to the $2.3294 high. The price is now trading above $2.220 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $2.270 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.320 level. The first major resistance is near the $2.350 level. The next resistance is $2.40. A clear move above the $2.40 resistance might send the price toward the $2.420 resistance. Any more gains might send the price toward the $2.480 resistance or even $2.50 in the near term. The next major hurdle for the bulls might be $2.550. Are Dips Supported? If XRP fails to clear the $2.320 resistance zone, it could start another decline. Initial support on the downside is near the $2.2750 level. The next major support is near the $2.250 level and the 76.4% Fib retracement level of the upward move from the $2.2250 swing low to the $2.3294 high. If there is a downside break and a close below the $2.250 level, the price might continue to decline toward the $2.220 support. The next major support sits near the $2.20 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.2750 and $2.250. Major Resistance Levels – $2.320 and $2.350."
    },
    {
      "title": "Ethereum Price Pops Above $2,700: Are Bulls Back in Control?",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-pops-above-2700-2/",
      "summary": "Ethereum price started a fresh increase above the $2,550 zone. ETH is now consolidating and eyes more gains above the $2,740 resistance. Ethereum started a fresh increase above the $2,700 level. The price is trading above $2,600 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,540 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh surge if it clears the $2,740 zone in the near term. Ethereum Price Regains Pace Ethereum price started a fresh increase after it found support near the $2,400 level, like Bitcoin. ETH price was able to clear the $2,500 and $2,550 resistance levels. The bulls pushed the price above $2,650. ETH even spiked above $2,700. A high was formed at $2,731 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2,482 swing low to the $2,731 high. Ethereum price is now trading above $2,600 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $2,540 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,720 level. The next key resistance is near the $2,740 level. The first major resistance is near the $2,750 level. A clear move above the $2,750 resistance might send the price toward the $2,840 resistance. An upside break above the $2,840 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,880 resistance zone or even $2,920 in the near term. Are Dips Supported In ETH? If Ethereum fails to clear the $2,740 resistance, it could start a fresh decline. Initial support on the downside is near the $2,640 level. The first major support sits near the $2,580 zone and the 61.8% Fib retracement level of the upward move from the $2,482 swing low to the $2,731 high. A clear move below the $2,580 support might push the price toward the $2,540 support. Any more losses might send the price toward the $2,450 support level in the near term. The next key support sits at $2,350. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,640 Major Resistance Level – $2,740"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Robert Mitchnick Discusses BlackRock’s Bitcoin ETF IBIT Success On Bloomberg",
      "link": "https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Robert-Mitchnick-Discusses-BlackRocks-Bitcoin-ETF-IBIT-Success-On-Bloomberg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg\" rel=\"nofollow\"> </a></p> <p>BlackRock’s Head of Digital Assets, Robert Mitchnick, explains the key factors driving the surge in Bitcoin ETFs.</p> <p>"
    },
    {
      "title": "KULR Technology Group Announces $300 Million ATM Offering To Invest in Their Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>KULR entered a $300 million ATM offering to fund its Bitcoin treasury reserve, with Cantor Fitzgerald &#038; Co. and Craig-Hallum Capital Group LLC.</p> <p>"
    },
    {
      "title": "BlackRock’s iShares Bitcoin Trust Shatters ETF Growth Record, Surpassing $70 Billion in Just 341 Days",
      "link": "https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BlackRock.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days\" rel=\"nofollow\"> </a></p> <p>BlackRock’s iShares Bitcoin Trust (IBIT) has officially made history. The Bitcoin ETF surged past $70 billion in assets under management (AUM), reaching the milestone in just 341 trading days. This achievement makes IBIT the fastest ETF to ever hit that threshold.&#160; To put that into perspective, the previous record-holder—SPDR Gold Shares (GLD)—took 1,691 days to [&#8230;]</p> <p>"
    },
    {
      "title": "New York City Won’t Be Issuing BitBonds Anytime Soon",
      "link": "https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/New-York-City-Mayor-Eric-Adams-Bitcoin-BitBonds.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon\" rel=\"nofollow\"> </a></p> <p>At Bitcoin 2025, NYC mayor, Eric Adams, proclaimed that he’s going to push to issue a BitBond, but judging by his past inaction on Bitcoin as well as a statement from NYC’s comptroller, odds are New Yorkers won’t see a BitBond in the near future.</p> <p>"
    },
    {
      "title": "Japan’s ANAP Holdings Launches Full Bitcoin Business Strategy with Goal of Over 1,000 BTC by August 2025",
      "link": "https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ANAP.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025\" rel=\"nofollow\"> </a></p> <p>ANAP Holdings, Inc. (3189: Tokyo Standard Market) has officially announced the launch of its “Bitcoin Business” in a formal corporate filing, detailing an entry into Bitcoin focused operations across treasury, finance, fashion, and mining. In a statement signed by President and CEO Yuta Sawaki, the company confirmed that its consolidated subsidiary ANAP Lightning Channel will [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Self-Driving Waymo Cars Torched During ICE Protest in Los Angeles",
      "link": "https://decrypt.co/324336/robotic-waymo-cars-torched-ice-protest-los-angeles",
      "summary": "Several Waymo self-driving taxis were destroyed amid growing tensions over ICE activity in Los Angeles."
    },
    {
      "title": "Apple Tones Down AI Hype While Showcasing Next iPhone, Mac Features",
      "link": "https://decrypt.co/324330/apple-tones-down-ai-hype-wwdc-2025",
      "summary": "At WWDC 2025, Apple introduced AI-powered updates and UX design overhaul—but the AI hype was taken down a notch."
    },
    {
      "title": "Bitcoin Soars Above $110K, Nearing Record as Ethereum and Dogecoin Rise",
      "link": "https://decrypt.co/324317/bitcoin-soars-above-110k-ethereum-dogecoin",
      "summary": "Bitcoin's price jumped past $110,000 for the first time in about two weeks to lead a broader upturn in digital assets."
    },
    {
      "title": "Sui DeFi Exchange Cetus Back in Action After $233 Million Exploit",
      "link": "https://decrypt.co/324313/sui-defi-exchange-cetus-back-in-action-after-233-million-exploit",
      "summary": "Following a damaging protocol vulnerability in May, Sui decentralized exchange Cetus is back online with a compensation plan."
    },
    {
      "title": "Plasma Attracts $500 Million for ICO—And One Trader Spent $100K on Ethereum Gas Fees",
      "link": "https://decrypt.co/324237/plasma-500-million-ico-trader-spent-100k-ethereum-gas",
      "summary": "Are ICOs back? Stablecoin network Plasma just attracted $500 million worth of deposits for its sale, with one trader paying $100K for an edge."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "How UK crypto taxes work and what you need to know",
      "link": "https://cryptobriefing.com/how-uk-crypto-taxes-work/",
      "summary": "<p>The increasing scrutiny on crypto tax compliance in the UK highlights the need for investors to maintain accurate records and understand tax obligations.</p> <p>"
    },
    {
      "title": "Did Paraguay just make Bitcoin legal tender? Suspected hack of president’s X account sparks confusion",
      "link": "https://cryptobriefing.com/paraguay-bitcoin-legal-tender-hack/",
      "summary": "<p>The incident highlights the vulnerability of digital platforms in disseminating misinformation, potentially impacting national and global markets.</p> <p>"
    },
    {
      "title": "ProShares, Bitwise seek SEC approval for ETFs tracking Circle stock",
      "link": "https://cryptobriefing.com/circle-stock-etfs-proshares-bitwise/",
      "summary": "<p>The approval of these ETFs could enhance investor access to crypto-related equities, potentially boosting market liquidity and innovation.</p> <p>"
    },
    {
      "title": "Tether to open-source Bitcoin Mining Operating System to empower small, mid-sized miners, says Paolo Ardoino",
      "link": "https://cryptobriefing.com/tether-bitcoin-mining-open-source/",
      "summary": "<p>Tether's open-source MOS could democratize Bitcoin mining, enhancing decentralization and security while enabling smaller players to compete.</p> <p>"
    },
    {
      "title": "Bitcoin rises as key US-China trade talks commence in London",
      "link": "https://cryptobriefing.com/bitcoin-market-reaction-us-china-trade/",
      "summary": "<p>Bitcoin's rebound highlights its sensitivity to geopolitical events, underscoring its potential as a barometer for global economic tensions.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Michael Saylor downplays quantum computing’s threat to Bitcoin – ‘Not worried’",
      "link": "https://ambcrypto.com/michael-saylor-downplays-quantum-computings-threat-to-bitcoin-not-worried/",
      "summary": "<img alt=\"Michael Saylor downplays quantum computing&#039;s threat to Bitcoin - ‘Not worried’\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Michael-Saylor-quantum.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Saylor dismissed quantum computing risk as an immediate concern."
    },
    {
      "title": "Ethereum holds steady at $2.5K as institutional giants quietly load up on ETH",
      "link": "https://ambcrypto.com/ethereum-holds-steady-at-2-5k-as-institutional-giants-quietly-load-up-on-eth/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ethereum-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Slowdown in Ethereum’s spot ETF netflows may be temporary."
    },
    {
      "title": "XRP sees signs of accumulation, but will it be enough to breach $2.3?",
      "link": "https://ambcrypto.com/xrp-sees-signs-of-accumulation-but-will-it-be-enough-to-breach-2-3/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/XRP-Featured-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Spot buyers had the upper hand, but this might not be enough to prevent a short-term XRP price dip."
    },
    {
      "title": "How BNB is defying the market and closing in on its ATH again",
      "link": "https://ambcrypto.com/how-bnb-is-defying-the-market-and-closing-in-on-its-ath-again/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-9.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is BNB quietly setting up for another breakout run while the rest of the market plays catch-up?"
    },
    {
      "title": "Will Chainlink push past $14 and trigger a market squeeze? – Assessing…",
      "link": "https://ambcrypto.com/is-chainlink-link-ready-for-a-breakout-heres-why-14-is-the-key/",
      "summary": "<img alt=\"LINK\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-09T161205.751-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bullish structure forms as LINK eyes key resistance amid rising derivatives activity."
    }
  ]
}