{
  "CoinDesk": [
    {
      "title": "Tron Inc. Deal Gives Justin Sun’s Father Control of Public Firm Via $100M Token Deal",
      "link": "https://www.coindesk.com/markets/2025/06/17/tron-inc-deal-gives-justin-suns-father-control-of-public-firm-via-100m-token-deal",
      "summary": ""
    },
    {
      "title": "U.S. Senate Passes GENIUS Act to Regulate Stablecoins, Marking Crypto Industry Win",
      "link": "https://www.coindesk.com/policy/2025/06/17/u-s-senate-passes-genius-act-to-regulate-stablecoins-marking-crypto-industry-win",
      "summary": ""
    },
    {
      "title": "JPMorgan Introduces USD Deposit Token on Coinbase’s Base Blockchain",
      "link": "https://www.coindesk.com/business/2025/06/17/jpmorgan-introduces-usd-deposit-token-on-coinbase-s-base-blockchain",
      "summary": ""
    },
    {
      "title": "Coinbase Seeks SEC Approval to Offer Tokenized Stock Trading",
      "link": "https://www.coindesk.com/business/2025/06/17/coinbase-seeks-sec-approval-to-offer-tokenized-stock-trading",
      "summary": ""
    },
    {
      "title": "Can Tether's Dominance Survive the U.S. Stablecoin Bill?",
      "link": "https://www.coindesk.com/news-analysis/2025/06/17/can-tether-s-dominance-survive-the-u-s-stablecoin-bill",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "How to legally stake crypto in 2025: What is now allowed after the SEC’s latest move",
      "link": "https://cointelegraph.com/news/how-to-legally-stake-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzY5ZjQtODVhYi03MmU0LThlZDEtN2M4MTU3YWMzNzRj.jpg\" /></p><p>The SEC’s 2025 guideline clarifies the regulatory stance regarding crypto staking. It states what is and isn’t allowed and how you can stake lawfully.</p>"
    },
    {
      "title": "JPMorgan, SEC meet to discuss capital markets moving onchain",
      "link": "https://cointelegraph.com/news/jpmorgan-sec-discuss-traditional-capital-markets-moving-onchain?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdmZDktNDdlMC03MDRjLWE4MGQtZjQ2NDRkNTU5MTU1.jpg\" /></p><p>Three JPMorgan executives met with the SEC’s Crypto Task Force to discuss which capital markets instruments could move onchain and how to best navigate the change.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "25% Bitcoin price rally set to follow today’s correction if history repeats",
      "link": "https://cointelegraph.com/news/25-bitcoin-price-rally-set-to-follow-today-s-correction-if-history-repeats?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdlZDctMjMxNi03MDRiLTlmNmMtNzBhOWQ1YzdkOWI5.jpg\" /></p><p>A Bitcoin price drop below $102,000 could be followed by a swift 25% rally to new all-time highs.</p>"
    },
    {
      "title": "US Senate passes GENIUS stablecoin bill in 68-30 vote",
      "link": "https://cointelegraph.com/news/us-senate-passes-genius-act-stablecoins?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdlYTQtMjI0NC03NzU1LThmNWUtMTY5NWUzZGMwM2Rj.jpg\" /></p><p>The bill passed without amendments to address Donald Trump’s connections to World Liberty Financial’s stablecoin, which many Democrats had been calling for.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "US DOJ, Europol seize world’s largest dark web drug market operating via Monero",
      "link": "https://cryptoslate.com/us-doj-europol-seize-worlds-largest-dark-web-drug-market-operating-via-monero/",
      "summary": "<p>An international law enforcement effort has dismantled one of the world’s largest and longest-running criminal marketplaces on the darknet, arresting its suspected German operator in Spain and seizing millions in illicit assets, according to a June 16 press release. The takedown, coordinated by the Frankfurt Public Prosecutor’s Office, Germany’s Federal Criminal Police Office (BKA), the [&#8230;]</p> <p>"
    },
    {
      "title": "LatAm energy giant executes landmark $75M oil and gas deal via blockchain tokenization",
      "link": "https://cryptoslate.com/latam-energy-giant-executes-landmark-75m-oil-and-gas-deal-via-blockchain-tokenization/",
      "summary": "<p>Feniix Energy, an energy firm based in Latin America, has completed a $75 million acquisition of a live oil and gas operation using blockchain tokenization, according to a statement shared with on June 17. Global Settlement, a blockchain firm specializing in real-world assets (RWAs), executed the deal through its GSX Protocol. The protocol enabled [&#8230;]</p> <p>"
    },
    {
      "title": "DAMA 2: Deutsche Bank unveils institutional tokenization stack to fast-track regulated funds",
      "link": "https://cryptoslate.com/dama-2-deutsche-bank-unveils-institutional-tokenization-stack-to-fast-track-regulated-funds/",
      "summary": "<p>Deutsche Bank, Memento Blockchain, and Interop Labs published a litepaper on June 17 outlining plans for Digital Asset Management Access 2 (DAMA 2), a tokenization platform intended to operate on public blockchains and facilitate the issuance of regulated funds. According to the paper, DAMA 2 would link three layers: Ethereum (ETH) would act as the [&#8230;]</p> <p>"
    },
    {
      "title": "VanEck’s Solana ETF moves closer to market entry with DTCC listing",
      "link": "https://cryptoslate.com/vanecks-solana-etf-moves-closer-to-market-entry-with-dtcc-listing/",
      "summary": "<p>VanEck’s planned Solana (SOL) exchange-traded fund has been listed with the Depository Trust &#38; Clearing Corporation (DTCC) under the ticker symbol VSOL, signaling another step in mainstreaming Solana exposure for traditional investors. According to DTCC records, the fund is labeled “VANECK SOLANA TR COM SHS BEN INT” and falls under the ‘D’ settlement category, an [&#8230;]</p> <p>"
    },
    {
      "title": "US Senate approves landmark GENIUS Act for stablecoin regulation",
      "link": "https://cryptoslate.com/us-senate-approves-landmark-genius-act-for-stablecoin-regulation/",
      "summary": "<p>The Senate approved the Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act in a 51-23 vote on June 17, sending the measure to the House for consideration. The vote followed a 68-30 cloture decision on June 11 that cut off debate and started the mandatory 30-hour countdown to the final roll call. Senator [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Bullish Signal: Shark & Whale Wallets Set New All-Time High",
      "link": "https://www.newsbtc.com/xrp-news/xrp-bullish-shark-whale-set-new-all-time-high/",
      "summary": "On-chain data shows XRP shark and whale population has climbed to a new record alongside a spike in activity on the blockchain. XRP Wallets With 1 Million+ Tokens Have Set A New Record In a new post on X, the on-chain analytics firm Santiment has discussed the latest trend in a couple of indicators related to the XRP network. The first metric of relevance is the &#8220;Supply Distribution,&#8221; which tells us, among other things, the number of wallets that belong to a particular coin range. Related Reading: Stablecoin Exchange Inflows Plummet $61 Billion—Warning Sign For Bitcoin? In the context of the current topic, the range of interest is above 1 million coins (with the upper bound being infinity). This cutoff for the range converts to about $2.2 million at the current exchange rate, which is quite significant. Naturally, the only investors who would qualify for this threshold would be the big-money ones. Such holders are popularly known as the sharks and whales. Generally, the influence of any entity on the network goes up the more coins that they hold, so this cohort, with its large holdings, can carry some degree of power. As such, the behavior of the sharks and whales can be worth keeping an eye on. If nothing else, it can at least inform us about what the sentiment may be like among these humongous investors. Now, here is the chart shared by Santiment that shows the trend in the Supply Distribution of these 1 million+ holders over the past year: As displayed in the above graph, the XRP Supply Distribution has recently registered an uptick for sharks and whales, implying more wallets carrying above a million coins have popped up on the network. This could be an indication that some new big-money investors have potentially joined the chain. Following the increase, the network now has 2,708 wallets of this size, which is a new record. In the same chart, the analytics firm has also attached the data of the second relevant metric: Daily Active Addresses. This indicator measures the unique total number of wallets that are becoming involved in some kind of transaction activity on the network every day, whether as a sender or receiver. Since the smaller entities like retail massively outweigh the large investors in terms of number, this metric essentially represents the amount of activity that the entities on the smaller end of the network are participating in. From the graph, it&#8217;s visible that the XRP Daily Active Addresses have recently observed a large spike. Over the past week, the metric has averaged a value of 295,000 addresses daily, which is a drastic jump over the 35,000 to 40,000 figure witnessed during the last three months. Related Reading: Dogecoin Must Hold This Level—Or Risk A 30% Price Crash &#8220;The XRP ledger is showing serious signs of growth, from both a usage and key stakeholder perspective,&#8221; notes Santiment. It now remains to be seen what effect, if any, these changes in network metrics would have on the cryptocurrency&#8217;s price. XRP Price XRP shot up beyond the $2.33 mark yesterday, but it seems bullish momentum has already faded as the coin has dropped back to $2.20. Featured image from Dall-E, Santiment.net, chart from TradingView.com"
    },
    {
      "title": "Ethereum Golden Cross Approaching – Will History Repeat?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-golden-cross-approaching-will-history-repeat/",
      "summary": "Ethereum has faced intense volatility in recent days as escalating tensions between Israel and Iran continue to rattle global markets. Despite the uncertainty, ETH remains resilient above the $2,500 level, signaling ongoing strength among bulls. However, Ethereum now trades just below a critical resistance level at $2,675 — a zone that has acted as a barrier several times over the past few weeks. A breakout above this mark could trigger renewed upside momentum and set the stage for a rally toward $3,000. Related Reading: Ethereum Consolidation Continues – Altseason May Follow A Clean Break Above Resistance Market participants remain divided on Ethereum’s short-term direction, but the technical landscape offers a potentially bullish clue. According to top analyst Ted Pillows, Ethereum is on the verge of completing a golden cross — a chart pattern where the 50-day moving average crosses above the 200-day moving average. Historically, this signal has preceded strong upward trends in ETH, with the last golden cross resulting in a 35% surge over the following weeks. As Ethereum hovers in a tight range, traders are closely watching this setup. If bulls manage to reclaim $2,675 and the golden cross confirms, Ethereum could enter a powerful breakout phase, potentially sparking broader optimism across the altcoin market. Ethereum Prepares For A Breakout As Bulls Hold Support Ethereum is facing a decisive moment as it continues to trade within a range that has persisted for more than six weeks. The current price structure reflects growing indecision among market participants, largely driven by geopolitical uncertainty stemming from the escalating conflict between Israel and Iran. This macro backdrop has injected volatility across financial markets, and Ethereum has not been immune. While price action remains contained, ETH bulls are showing resilience by defending the $2,500 level — a crucial zone that has repeatedly served as support during the past month. However, to regain momentum, Ethereum must break above the $2,750–$2,800 resistance area, which has proven to be a major barrier since early May. This range remains the threshold separating consolidation from a full bullish breakout. A reclaim of this level would likely trigger a wave of buying, as it would mark the end of the current sideways phase and possibly initiate a fresh trend toward the $3,000 mark. Adding to the bullish thesis, Ted Pillows highlights that a golden cross is approaching on Ethereum’s moving averages. This occurs when the 50-day moving average crosses above the 200-day moving average — a technical signal often associated with trend reversals and sustained upward moves. The last time this setup formed, Ethereum surged over 35% in just a few weeks. With ETH hovering just beneath key resistance and macro conditions remaining uncertain, the coming days may determine whether the golden cross will serve as a launchpad for a major rally. If bulls hold $2,500 and reclaim $2,800, Ethereum could be preparing for a significant breakout, potentially igniting momentum across the altcoin sector. Related Reading: Ethereum Consolidation Continues – Altseason May Follow A Clean Break Above Resistance Ethereum Holds Support But Struggles With Resistance Ethereum (ETH) is showing resilience as it continues to trade above the $2,500 mark, but price action on the 4-hour chart reveals persistent difficulty in breaking through the $2,675–$2,700 resistance zone. This area, highlighted on the chart, has acted as a rejection zone multiple times since early June, capping bullish attempts to break out of the current range. Price recently tapped this resistance area again but failed to sustain momentum, resulting in a pullback toward the 200 EMA and 200 SMA, currently acting as near-term support around $2,575. ETH now hovers slightly above that level, and bulls must defend this zone to avoid slipping into lower support near $2,500. The pattern shows continued consolidation between a clearly defined support and resistance band, with the 50 and 100 moving averages flattening — a sign of market indecision. Volume has also declined slightly, reinforcing the idea that the market is waiting for a catalyst. Related Reading: Ethereum Weekly Candle Hints At Pre-Tower Top Formation – Details If ETH can reclaim $2,675 with conviction and follow through above $2,700, a rally toward the $2,850–$3,000 zone could develop. Until then, this tight range may continue. Holding the current support is crucial to avoid testing lower levels near $2,400, which could shift sentiment bearish. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "XRP To End 7-Month Consolidation After 700% Surge – Is A Major Move Coming?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-7-month-consolidation/",
      "summary": "After months of sideways movement, XRP may finally be gearing up for a significant breakout. According to analysts, the popular altcoin saw a dramatic 700% surge earlier last year. Now, its price is positioned to exit a seven-month consolidation phase, which could set it up for its next bullish move. XRP Gets Ready For Major Bullish Move A recently published technical chart by market expert ‘Crypto Michael’ on X (formerly Twitter) reveals that XRP has been consolidating for seven months following a staggering 700% price rally, which was triggered by a breakout from a multi-year Symmetrical Triangle pattern. The chart, based on a 3-month candlestick, shows that XRP had been in a major price compression within the triangle pattern for seven years. Related Reading: XRP Price Still On Track For $1.5T Market Cap And 27% Crypto Market Dominance True to form, XRP finally broke above the upper trendline of the pennant in late 2024, igniting one of its most powerful quarterly rallies to date. This breakout led to a price surge of about 700%, pushing the cryptocurrency from around $0.6 to over $2. Since the dramatic breakout, XRP has entered a stabilization phase, trading sideways in what appears to be a healthy consolidation range. The chart highlights this consolidation area with a white circle, indicating a well-defined post-breakout phase. Notably, XRP’s $2.15 price at the time of the analysis is above prior resistance levels, suggesting that the cryptocurrency is maintaining strength while waiting for its next bullish catalyst. Crypto Michael points out that XRP’s consolidation is ending just as Bitcoin, the world’s largest cryptocurrency, approaches a critical juncture: the “8-year line.” This correlation suggests that a broader shift in market sentiment may be underway. Historically, leading altcoins like XRP have followed Bitcoin’s lead during broader market rallies. If BTC successfully breaks through this long-standing line, Crypto Michael believes it could serve as a macro trigger that ignites a fresh bullish move for XRP. Analyst Says The Altcoin Is Set To Explode Against BTC A fresh analysis by Egrag Crypto, a crypto analyst on X, suggests that the XRP/BTC pair could be on the edge of a major breakout. The pair has followed a consistent cycle for over a decade, with lows in 2015, 2017, 2020, and 2024—each succeeded by strong rallies. These lows align with a rising trendline, signaling possible long-term strength. Related Reading: XRP Bullish Structure Remains Bullish: Analyst Releases 3 New Targets Now, XRP/BTC is approaching a key resistance level that has blocked past rallies since 2015. This time, however, Egrag Crypto suggests that the setup looks different and slightly more favorable for a breakout. If the pair breaks above this multi-year ceiling, it could mark a major turning point, effectively leading XRP into an explosive bullish phase. The analyst’s chart outlines two potential paths: a green breakout zone if XRP pushes higher and a red rejection zone if it fails to break this key resistance again. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Holds Strong Despite Israel-Iran Tensions – Weekly Resistance Begins To Crack",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-holds-strong-despite-israel-iran-tensions-weekly-resistance-begins-to-crack/",
      "summary": "Bitcoin has weathered a wave of volatility in recent days, triggered by the escalating conflict between Israel and Iran. As geopolitical tensions rise and global markets grapple with uncertainty, risk assets like BTC have faced increased pressure. Yet despite this turbulent backdrop, Bitcoin has managed to maintain its footing above key support levels, demonstrating notable resilience. Related Reading: Ethereum Consolidation Continues – Altseason May Follow A Clean Break Above Resistance Currently trading just under its all-time high, Bitcoin is in a consolidation phase that many analysts view as the calm before a potential breakout. Top analyst Rekt Capital shared insights indicating that the final major Weekly resistance, which has previously capped price rallies, may now be weakening as a point of rejection. If confirmed, this shift could signal a critical turning point in the market structure and open the door to price discovery. Investors are watching closely as BTC holds strong while macro headwinds—including rising US Treasury yields and fears of energy disruptions—continue to swirl. With the broader market bracing for further developments in the Middle East, Bitcoin’s ability to maintain higher lows and approach resistance with momentum suggests that the bulls may soon reclaim full control. The coming days could prove pivotal for the next phase of BTC’s market cycle. Bitcoin Awaits Clarity As Middle East Tensions Shape Market Sentiment The conflict between Israel and Iran continues to dominate headlines and exert influence over global markets. As tensions escalate, investors remain cautious, closely monitoring geopolitical developments and their macroeconomic ripple effects. In this uncertain environment, Bitcoin has entered a consolidation phase, with neither bulls nor bears fully in control. The lack of a clear direction stems from diverging investor expectations. Optimistic market participants anticipate that a diplomatic resolution may be reached in the coming days or weeks. A peace deal could reduce market anxiety, drive oil prices lower, and reignite momentum across risk assets—Bitcoin included. On the other hand, more cautious investors fear that the situation could worsen. Prolonged conflict may spark volatility in the energy sector, push inflation higher, and strain economic stability, particularly in regions dependent on oil imports. This week may prove decisive for Bitcoin’s next major move. Price action remains tightly bound, but all eyes are on the long-standing Weekly resistance. According to Rekt Capital, the final major Weekly resistance—once a strong rejection point—now appears to be weakening. This shift in structure suggests that Bitcoin may be preparing for a breakout into price discovery territory, should macro conditions stabilize. Related Reading: Ethereum Holds Key Range Support – Bulls Set Sights on Higher Levels BTC Price Holds Above Key Support Amid Consolidation The 12-hour chart for Bitcoin shows that BTC continues to trade within a tight range, holding above the critical $103,600 support while struggling to break cleanly through the $109,300 resistance. This zone has repeatedly acted as a ceiling for price action since early May, with sellers stepping in around $109K and buyers defending dips near $104K. The recent bounce from just above the $103,600 level reflects ongoing buyer interest at that range, reinforced by the 100-day SMA (green), which is providing dynamic support. Meanwhile, the 50-day SMA (blue) is curling slightly upward, showing early signs of positive momentum, although the price has yet to clearly reclaim and hold above it. Volume remains moderate, indicating a lack of strong conviction on either side. For bulls to regain full control, BTC must push through the $109,300 resistance with sustained volume and hold that breakout level. A failure to do so may result in another rejection and a potential retest of the lower boundary near $103,600. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Dogecoin Sets The Stage For A Liftoff With Key Reversal Pattern",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-key-reversal-pattern/",
      "summary": "Crypto Sat recently took to X to share a technical insight on Dogecoin, revealing that the asset is showing signs of accumulation following a sharp correction. According to the analyst, the 2-hour chart is beginning to shape a potential double bottom pattern. Should this structure be confirmed, it might signal a renewed upward push for DOGE, catching the interest of short-term traders and long-term holders. Make-or-Break Moment For Dogecoin: The Neckline Battle Ahead Dogecoin is currently displaying the characteristics of a double bottom formation, a classic reversal setup that could signal a shift in momentum, as noted by Crypto Sat. The first bottom was established around the $0.170 mark, following a significant price drop, where buyers initially stepped in to defend the zone. Related Reading: Dogecoin Must Hold This Level—Or Risk A 30% Price Crash Shortly after, DOGE made a move back down for a second test of the same support area, with a higher low structure forming, suggesting weakening bearish pressure and the emergence of early accumulation. The key area to watch is the neckline resistance, which sits in the $0.198 to $0.200 range. Crypto Sat emphasizes that a breakout above the neckline would serve as strong technical confirmation of a shift in market sentiment. If bulls manage to push through, it might open the door for a sustained upward rally, as traders gain confidence in the reversal setup taking hold. Here Are Key Signals To Watch In the analysis, Crypto Sat has outlined several key signals to watch as Dogecoin&#8217;s price action tightens. One early bullish sign, he notes, is the rising volume on the second bottom, a subtle but important clue that buyers may be stepping in with growing conviction. Volume often leads price, and this uptick could mark the start of renewed upward momentum. Related Reading: Dogecoin Breaks Out Of Bull Pennant—What’s The Target? The crucial level to monitor is the resistance zone around $0.200. A strong breakout above this zone could trigger a technical shift, paving the way for a potential rally toward the $0.220 and $0.230 range. Such a move would confirm the double bottom formation and likely attract more bullish participation as confidence builds. However, if price fails to break through the neckline, support around $0.165 becomes the next critical level. A bounce from that zone would keep the pattern alive, but a clean drop below it could invalidate the setup and suggest further downside risk. Sharing his personal outlook, Crypto Sat believes DOGE may be positioning for a breakout, but cautions traders to be patient. &#8220;Let the neckline decide the next big move,&#8221; he advises, underscoring the importance of watching for confirmation before making aggressive plays. Featured image from Pixabay, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "U.S. Senate Passes Stablecoin Bill The GENIUS Act",
      "link": "https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/USA-GENIUS-BILLpg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-senate-passes-stablecoin-bill-the-genius-act\" rel=\"nofollow\"> </a></p> <p>The U.S. Senate has passed the Guiding and Establishing National Innovation for U.S. Stablecoins (GENIUS) Act (S. 394) by a vote of 68-30, establishing the first comprehensive federal framework for fiat-backed stablecoins. The bipartisan legislation was introduced by Senator Bill Hagerty and co-sponsored by Senators Tim Scott, Kirsten Gillibrand, and Cynthia Lummis. It passed under [&#8230;]</p> <p>"
    },
    {
      "title": "BBVA Tells Wealthy Clients to Invest Up to 7% in Bitcoin",
      "link": "https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BBVA.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bbva-tells-wealthy-clients-to-invest-up-to-7-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>Spanish bank BBVA is now advising its wealthy clients to invest up to 7% of their portfolios in crypto and Bitcoin, showing how traditional banks are starting to see the potential of Bitcoin.&#160; &#8220;With private customers, since September last year, we started advising on Bitcoin,&#8221; said Philippe Meyer, head of digital &#38; blockchain solutions at [&#8230;]</p> <p>"
    },
    {
      "title": "Ukraine Introduces Bill to Allow Bitcoin in National Reserves",
      "link": "https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Ukraine-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ukraine-introduces-bill-to-allow-bitcoin-in-national-reserves\" rel=\"nofollow\"> </a></p> <p>Ukraine has introduced a bill that would give its central bank the legal right to hold Bitcoin and other assets as part of its national reserves. The draft law, submitted to the Verkhovna Rada on June 10, 2025, proposes updates to existing legislation to include “virtual assets” in the foreign exchange and gold reserves of [&#8230;]</p> <p>"
    },
    {
      "title": "Fold Holdings Secures $250 Million Equity Deal to Expand Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Fold-Holdings-Secures-250M-Equity-Deal-to-Expand-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fold-holdings-secures-250-million-equity-deal-to-expand-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>Fold aims to increase its bitcoin treasury through a $250M equity facility, giving the company flexibility to raise funds as needed.</p> <p>"
    },
    {
      "title": "Thailand Approves Five Year Bitcoin And Crypto Tax Break",
      "link": "https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Thailand-Approves-Tax-Exemption-on-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/thailand-approves-five-year-bitcoin-and-crypto-tax-break\" rel=\"nofollow\"> </a></p> <p>Thailand has approved a five year tax exemption on capital gains from cryptocurrency trading made through licensed digital asset platforms. The exemption will be in effect from January 1, 2025, through December 31, 2029. Deputy Finance Minister Julapun Amornvivat announced the measure, calling it a move to increase investment, stimulate economic activity, and drive long [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "OpenAI Lands Pentagon Deal—Musk’s xAI Left Watching From Sidelines",
      "link": "https://decrypt.co/325716/openai-lands-pentagon-deal",
      "summary": "A new $200 million contract with the Department of Defense puts OpenAI ahead in the race to bring AI to government."
    },
    {
      "title": "How to Get Your Chatbot to Talk Dirty",
      "link": "https://decrypt.co/325680/how-get-your-chatbot-talk-dirty",
      "summary": "Users seeking steamy romance from their AI companions are getting yoga guides instead. Here’s how to stop your chatbot from pivoting from passion to wellness."
    },
    {
      "title": "Is Semler Scientific Flashing a Warning Sign for Bitcoin Treasury Firms?",
      "link": "https://decrypt.co/325674/is-semler-scientific-flashing-a-warning-sign-for-bitcoin-treasury-firms",
      "summary": "The company was valued at a razor-thin premium compared to its Bitcoin holdings, as of Tuesday."
    },
    {
      "title": "Bitcoin Miners Face More Trouble as Transaction Fee Share Hits 3-Year Low",
      "link": "https://decrypt.co/325671/bitcoin-miners-face-trouble-transaction-fees-3-year-low",
      "summary": "Bitcoin transaction fee rewards have dropped to their lowest level since 2022, making the already tough BTC mining industry even tougher."
    },
    {
      "title": "Elon Musk’s xAI Seeks $4.3 Billion in Fresh Funding: Bloomberg",
      "link": "https://decrypt.co/325678/elon-musks-xai-seeks-4-3-billion-in-fresh-funding",
      "summary": "xAI, Elon Musk's rising startup, is aiming to secure billions more in funding to fuel its AI ambitions, per a report."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "US Senate passes GENIUS stablecoin bill, advancing it to the House for final approval",
      "link": "https://cryptobriefing.com/genius-stablecoin-bill-house/",
      "summary": "<p>US Senate passes the GENIUS stablecoin bill, advancing it to the House for a vote in 3 weeks with rules on backing, audits, and oversight.</p> <p>"
    },
    {
      "title": "JPMorgan Chase to pilot stablecoin-like JPMD for institutional clients on Base",
      "link": "https://cryptobriefing.com/jpmorgan-jpmd-deposit-token/",
      "summary": "<p>JPMorgan's pilot of JPMD tokens could accelerate institutional adoption of blockchain technology, influencing future financial systems.</p> <p>"
    },
    {
      "title": "How is technology redefining money and currency?",
      "link": "https://cryptobriefing.com/technology-redefining-money-currency/",
      "summary": "<p>Technology is redefining money with digital assets, smart contracts, and blockchain, shifting value exchange beyond traditional currency.</p> <p>"
    },
    {
      "title": "Kraken-backed layer 2 Ink to launch $INK token",
      "link": "https://cryptobriefing.com/kraken-ink-token-launch/",
      "summary": "<p>The launch of $INK could significantly enhance DeFi ecosystems by fostering user-driven governance and expanding on-chain capital markets.</p> <p>"
    },
    {
      "title": "Coinbase plans to offer tokenized equities to rival Robinhood, Charles Schwab",
      "link": "https://cryptobriefing.com/coinbase-tokenized-equities-sec-approval/",
      "summary": "<p>Coinbase's move into tokenized equities could reshape financial markets by increasing competition, innovation, and accessibility in trading.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Sonic DEX volume rises 17% – But THIS signals likely trend reversal",
      "link": "https://ambcrypto.com/sonic-dex-volume-rises-17-but-this-signals-likely-trend-reversal/",
      "summary": "<img alt=\"Sonic DEX volume rises 17% - But THIS signals likely trend reversal\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-17T132752.528-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whales accumulate as Sonic holds $0.316 support and TVL consolidates above $2B."
    },
    {
      "title": "Is BNB ready for a bullish breakout? 2 reasons why price shows strength",
      "link": "https://ambcrypto.com/is-bnb-ready-for-a-bullish-breakout-2-reasons-why-price-shows-strength/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-17T145155.651-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB Chain’s usage is soaring, but price action remains confined beneath key resistance."
    },
    {
      "title": "Bitcoin fluctuates below $108K: What’s next amid Israel-Iran tensions?",
      "link": "https://ambcrypto.com/bitcoin-fluctuates-below-108k-whats-next-amid-israel-iran-tensions/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BitcoinFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Per analyst Willy Woo, short-term BTC price action was being driven by liquidity hunt."
    },
    {
      "title": "Ethereum’s $1.4B stablecoin surge sparks bullish hopes, BUT…",
      "link": "https://ambcrypto.com/ethereums-1-4b-stablecoin-surge-sparks-bullish-hopes-but/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250617_095351_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ETH shows bullish potential, but questions remain."
    },
    {
      "title": "SPX6900 drops 16% in 24 hours, but is this the start of a new rally?",
      "link": "https://ambcrypto.com/spx6900-drops-16-in-24-hours-but-is-this-the-start-of-a-new-rally/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250617_131343_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SPX memecoin suffers massive drop—why it may not be over yet."
    }
  ]
}