{
  "CoinDesk": [
    {
      "title": "Dogecoin Drops 8% but Shows V-Shaped Recovery in Boost for Bulls",
      "link": "https://www.coindesk.com/markets/2025/06/22/dogecoin-drops-8-but-shows-v-shaped-recovery-in-boost-for-bulls",
      "summary": ""
    },
    {
      "title": "XRP Rebounds From Intraday Lows, Forms Bullish Pattern Above Key Support",
      "link": "https://www.coindesk.com/markets/2025/06/22/xrp-rebounds-from-intraday-lows-forms-bullish-pattern-above-key-support",
      "summary": ""
    },
    {
      "title": "Bitcoin Rallies Above $102K After Panic Sellers Dump Into War Fears",
      "link": "https://www.coindesk.com/markets/2025/06/22/bitcoin-rallies-above-usd102k-after-panic-sellers-dump-into-war-fears",
      "summary": ""
    },
    {
      "title": "Bullish Crypto Bets Liquidated for $595M as U.S. Bombs Iran Nuclear Sites",
      "link": "https://www.coindesk.com/markets/2025/06/22/bullish-crypto-bets-liquidated-for-595m-as-us-bombs-iran-nuclear-sites",
      "summary": ""
    },
    {
      "title": "ETH Drops 8% in Flash Crash, Recovers After Buyers Step In",
      "link": "https://www.coindesk.com/markets/2025/06/22/eth-drops-8-in-flash-crash-recovers-after-buyers-step-in",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Signal trading ‘school’ and fake exchange rob investor of $860K: Lawsuit",
      "link": "https://cointelegraph.com/news/florida-investor-sues-denver-crypto-school-fake-exchange-scam?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWQ3NjYtNjBmNC03Yzc0LTgyYjAtMTE4OWU1YTQ0MDNi.jpg\" /></p><p>A Florida man says a Denver-based crypto trading school and a fake exchange tricked him into handing over $860,000 through phony trade signals.</p>"
    },
    {
      "title": "Michael Saylor’s Strategy premium is not ‘unreasonable’: Adam Back",
      "link": "https://cointelegraph.com/news/michael-saylor-s-strategy-premium-is-not-unreasonable-adam-back?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjAwYzUtMmZmYi03MzRkLTljYWEtN2UzNmYyYWNiYjE5.jpg\" /></p><p>Adam Back says that since Strategy typically takes 16 to 18 months to double its Bitcoin per share, the premium on its stock is not \"unreasonable.”</p>"
    },
    {
      "title": "Samson Mow wants Bitcoin in ‘all of Europe,’ receives invite to France",
      "link": "https://cointelegraph.com/news/jan3-samson-mow-bitcoin-adoption-europe-france?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0ZmEtZGI2Zi03MjFjLWEyNTYtNzIzMjI2MDI0YmI1.jpg\" /></p><p>French lawmaker Sarah Knafo has invited Samson Mow to visit France, and Mow says he is keen to kick off a wave of nation-state Bitcoin adoption across Europe.</p>"
    },
    {
      "title": "Cathie Wood&#039;s ARK dumps $146M in Circle amid share surge",
      "link": "https://cointelegraph.com/news/cathie-wood-ark-dump-146-million-circle-shares-crlc-rise-240?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkzZmUtMGI4OC03MDZmLTgwZTMtMTYxM2YxODE0NzQx.jpg\" /></p><p>Despite the massive sale, ARK remains the eighth largest Circle holder.</p>"
    },
    {
      "title": "Strategy’s Michael Saylor raises Bitcoin forecast to $21M by 2046",
      "link": "https://cointelegraph.com/news/michael-saylor-strategy-bitcoin-forecast-21-million-21-years?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzkzOWItYWZiNS03MjE1LTg2ZDItMjRlYjhkYjc3ZTZl.jpg\" /></p><p>Michael Saylor has doubled down on his Bitcoin price prediction, citing massive geopolitical and regulatory changes.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Coinbase CEO highlights 3 key reasons why the world needs crypto",
      "link": "https://cryptoslate.com/coinbase-ceo-highlights-3-key-reasons-why-the-world-needs-crypto/",
      "summary": "<p>As the world faces increasing economic woes from soaring debt and stubborn inflation to dwindling trust in financial institutions, Coinbase CEO says, “The world needs crypto, now more than ever.” He adds: “Debt is growing exponentially, inflation is crippling entire nations, economic freedom is declining.” Armstrong points to the astronomical level of U.S. federal debt, [&#8230;]</p> <p>"
    },
    {
      "title": "Pumpfun reportedly delays token auction to July amid legal troubles",
      "link": "https://cryptoslate.com/pumpfun-reportedly-delays-token-auction-to-july-amid-legal-troubles/",
      "summary": "<p>Pump.fun has delayed its public token sale once again, extending months of uncertainty for users and investors as the popular Solana-based launchpad wrestles with a flurry of lawsuits, Colin Wu reported on June 20. Pump.fun had aimed to raise $1 billion at a $4 billion valuation through its token auction originally set for June 25. The [&#8230;]</p> <p>"
    },
    {
      "title": "Alex Mashinsky forfeits rights to Celsius assets amid ongoing bankruptcy process",
      "link": "https://cryptoslate.com/alex-mashinsky-forfeits-rights-to-celsius-assets-amid-ongoing-bankruptcy-process/",
      "summary": "<p>Alex Mashinsky, the former CEO of Celsius, has agreed to surrender all rights to assets tied to the collapsed crypto lender. According to newly filed court documents, Mashinsky and entities associated with him, including AM Ventures Holdings Inc., Koala1 LLC, and Koala3 LLC, will be excluded from any future distributions under the Celsius bankruptcy plan. The [&#8230;]</p> <p>"
    },
    {
      "title": "Bloomberg analysts revise altcoin ETF approval odds to ‘90% or higher’ as SEC requests amended filings",
      "link": "https://cryptoslate.com/bloomberg-analysts-revise-etf-approval-odds-to-90-or-higher-as-sec-requests-amended-filings/",
      "summary": "<p>Bloomberg analysts have sharply increased the likelihood of U.S. regulators approving a new wave of cryptocurrency exchange-traded funds, pointing to a friendlier stance from the Securities and Exchange Commission (SEC). Bloomberg senior ETF analysts Eric Balchunas and James Seyffart said on June 20 that they now see a &#8220;90% or higher&#8221; chance that a broad [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase secures MiCA approval, shifts headquarters to Luxembourg",
      "link": "https://cryptoslate.com/coinbase-secures-mica-approval-shifts-headquarters-to-luxembourg/",
      "summary": "<p>Coinbase, the largest US-based exchange, has taken a major step in its global expansion by securing approval under the European Union’s Markets in Crypto-Assets (MiCA) regulation, according to a June 20 statement. The exchange confirmed that Luxembourg’s financial watchdog, the Commission de Surveillance du Secteur Financier (CSSF), granted it the necessary license to operate across the [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana Cracks Below Key Structure – Head And Shoulders Breakdown Points To $106",
      "link": "https://www.newsbtc.com/news/solana/solana-cracks-below-key-structure-head-and-shoulders-breakdown-points-to-106/",
      "summary": "Solana has broken down decisively, losing a critical support level following news that the United States launched an attack on Iranian nuclear facilities. The unexpected geopolitical development triggered widespread panic across financial markets, with altcoins taking the hardest hit. Solana, in particular, has seen significant selling pressure, dropping 20% from its May high of approximately $185 and now trading near $148. Related Reading: Ethereum Charts Signal Potential Bottom – All Eyes On Next Move This breakdown confirms investor concerns that SOL&#8217;s uptrend has weakened. Top analyst Carl Runefelt noted that Solana has completed a Head and Shoulders pattern—a bearish technical structure often signaling deeper downside. The price has broken below the neckline of this pattern, confirming the potential for continued declines in the short term. Adding to the bearish outlook is Solana&#8217;s inability to reclaim its prior support levels during brief bounces. With momentum indicators turning negative and broader market sentiment rattled, the likelihood of a swift recovery appears slim unless macro conditions stabilize. Solana Faces Deeper Correction As Bearish Pattern Unfolds Solana’s bullish momentum from late 2024 has all but faded, replaced by stagnation and sharp corrections as market conditions worsen. Now trading more than 50% below its all-time high, SOL continues to struggle under the weight of global macroeconomic uncertainty and rising geopolitical tensions. The US military strike on Iranian nuclear facilities has only added to the volatility, sending shockwaves through both traditional and crypto markets. While Solana was one of the strongest performers during the previous cycle, its price action has turned decisively bearish in recent weeks. Bulls have failed to maintain critical support levels, and the asset has now broken below its short-term trend structures. According to Runefelt, Solana has completed a Head and Shoulders pattern, a classic technical signal that often precedes a prolonged downtrend. The pattern’s neckline has been breached, and the projected bearish target now stands around $106.30—a level not seen since February. The breakdown also reflects broader weakness in the altcoin market. Despite earlier hopes for an altseason, capital has rotated out of risk assets, favoring Bitcoin and stablecoins amid uncertainty. Solana&#8217;s inability to reclaim prior highs or establish higher lows points to a market in retreat. Momentum indicators continue to flash red, and unless bulls reclaim lost ground quickly, SOL could be facing an extended period of consolidation or further losses. Related Reading: Tron Energy Usage Surges 108% – Smart Contract Activity Accelerates SOL Price Analysis: Breaking Below Key Support Solana is under pressure as it breaks below the critical 200-day simple moving average (SMA) around $149.54, a level that had previously acted as dynamic support. This breakdown signals growing bearish sentiment as price action confirms a loss of momentum following weeks of consolidation below the $155–$160 resistance zone. As of now, SOL is trading at approximately $135.99, down nearly 3% on the day and over 20% from its May highs. The chart shows a rejection near the 100-day SMA (green line), and the sustained move below both the 200-day and 50-day SMAs (blue line) points to a shifting structure, leaning heavily toward the downside. Volume remains elevated on red candles, confirming that the breakdown is supported by increasing sell pressure rather than a low-liquidity move. Related Reading: Ethereum Prepares For A Decisive Move: ETH/BTC Setup Could Trigger Altseason If the current trend continues, Solana could revisit the $120–$125 range, which previously served as strong support in early Q1 2025. The broader context of macroeconomic volatility and geopolitical tension, particularly the recent U.S. attack on Iran, adds to investor unease across risk assets, including altcoins like Solana. A daily close back above $149 would be needed to neutralize the short-term bearish structure and shift sentiment. Until then, downside risks dominate. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Ethereum Weekly Chart Nears Tower Top Formation As US Launches Attack On Iran – Details",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-weekly-chart-nears-tower-top-formation-as-us-launches-attack-on-iran-details/",
      "summary": "Ethereum has officially broken below the long-standing range it had maintained since early May, losing the critical $2,320 support level. This breakdown was triggered by escalating geopolitical tensions, as news broke that the United States had launched attacks on Iranian nuclear facilities. The announcement sent shockwaves through global markets, sparking widespread risk-off behavior and panic selling across crypto. Ethereum, already trading near the bottom of its six-week consolidation range, quickly reacted with a sharp drop, dragging the broader altcoin market with it. Related Reading: Solana Analyst Sees $123 And $116 As Mid-Zone Support Levels – Here’s Why The move marks a critical shift in sentiment, as Ethereum now trades outside the range that had served as a battleground between bulls and bears for over a month. With volatility spiking and confidence shaken, traders are re-evaluating risk in light of escalating conflict in the Middle East and broader macroeconomic headwinds. According to top analyst Big Cheds, Ethereum&#8217;s weekly chart is now flirting with a potential tower top pattern completion — a bearish reversal structure that may signal further downside unless buyers reclaim key levels in the coming days. As the situation evolves, all eyes will remain on ETH’s ability to hold new support levels or risk further decline in a fragile market environment. Ethereum Slides 22% From June Highs – All Eyes On Weekly Structure Ethereum has lost over 22% of its value since peaking in early June, as global instability and heightened selling pressure weigh heavily on market sentiment. The asset has now broken below its six-week range, triggering concern among investors and adding to uncertainty across the broader crypto space. With rising tensions in the Middle East—particularly following US attacks on Iranian nuclear facilities—the market has entered a risk-off environment, dragging altcoins like Ethereum into deeper retracements. Despite the volatility, Ethereum remains at the center of investor focus, as many still expect it to lead the next altseason. However, with bulls losing control of key support zones, confidence in a near-term rally continues to waver. Analysts are now split: while some predict a deeper retracement toward the $2,000 region, others argue that Ethereum is nearing exhaustion on the downside and may soon recover. Big Cheds points to Ethereum’s weekly chart, where the price is currently flirting with a potential tower top pattern—a bearish reversal structure. If this pattern confirms, ETH may face another wave of downside before finding demand at lower supply levels. If buyers step in during this pivotal moment, a recovery from this structure could quickly follow. The coming sessions will be critical in determining whether this breakdown extends or turns into a fakeout with bullish continuation. For now, traders should remain cautious, as Ethereum&#8217;s next move could define the tone of the altcoin market heading into July. Related Reading: Tron Energy Usage Surges 108% – Smart Contract Activity Accelerates Ethereum Breaks Down Below Support As Volatility Spikes Ethereum has officially broken below the $2,320 support level, signaling a shift in short-term market structure as shown in the 4-hour chart. After weeks of ranging between $2,320 and $2,650, ETH failed to reclaim its moving averages and lost bullish momentum. The price is now trading around $2,260, down sharply from its June highs near $2,900. This recent leg down follows a clean breakdown through the 50, 100, and 200-period SMAs, confirming a strong bearish momentum. Volume spikes accompanied the drop, suggesting panic selling likely triggered by geopolitical turmoil in the Middle East. The price broke down aggressively with little resistance, meaning previous demand zones have now become weak. If buyers fail to step in quickly, Ethereum may revisit earlier May support levels around $2,100 or even $2,000. Related Reading: Ethereum Charts Signal Potential Bottom – All Eyes On Next Move From a technical standpoint, the breakdown invalidates the previous consolidation range, opening the door for a possible extended correction. Until ETH reclaims $2,320 and stabilizes above its moving averages, the risk of continued downside remains high. Market participants should watch closely for volume shifts or bullish divergences, but for now, Ethereum remains under pressure as uncertainty continues to dominate the macro environment. The next few sessions will be crucial for price discovery. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Pump.fun’s Big Launch Put On Ice Over Legal Drama",
      "link": "https://www.newsbtc.com/news/solana/pump-funs-big-launch-put-on-ice-over-legal-drama/",
      "summary": "Pump.fun’s latest delay has rattled its backers. The Solana‐based memecoin launchpad was set to raise $1 billion at a $4 billion valuation on June 25. Now, the team says the sale will slip into mid‑July. Related Reading: Dogecoin Breaks Free—Could Soar 60%, Analyst Says There’s no clear reason for the hold‑up, and users are on edge. Investors who queued up months ago are left wondering if they’ll ever see a token in their wallets. Token Sale Pushed Into Mid‑July According to reports on June 20, Pump.fun first hinted at raising $1 billion at a $4 billion valuation. The sale was supposed to start on June 25. Instead, the launchpad now aims for mid‑July. That’s at least a 10‑day shift, and possibly longer. Users who planned around the June date have to sit tight again. Frustration is growing in online chat groups, where some members point fingers at the core team for poor communication. Exclusive: The Pumpfun token auction and listing, originally scheduled for June 25, has been postponed again and is now expected to take place in mid-July. Sources familiar with the matter disclosed that since Pumpfun began planning to issue and auction tokens late last year,… pic.twitter.com/UD0xIb45FA — Wu Blockchain (@WuBlockchain) June 20, 2025 Lawsuit Accuses Platform Of Securities Violations On January 15, Burwick Law filed a class action lawsuit against Pump.fun. The complaint alleges the platform acted as an unregistered securities exchange. It also claims that Pump.fun pumped token prices to lure in retail investors. According to the complaint, many users saw their holdings plunge in value after the hype died down. Max Burwick, the firm’s founder, called the platform “a modern pyramid scheme dressed as a viral meme economy.” Trademark Claims Lead To Cease‑And‑Desist Based on reports from February, Burwick Law teamed up with Wolf Popper LLP to issue a cease‑and‑desist order. They argue that several user‑generated memecoins on Pump.fun infringe on trademark rights. That move opened another front of legal risk. Projects tied to big brands or franchises suddenly faced takedown notices. Pump.fun says it’s beefed up its legal team, but it hasn’t shared details on how it plans to settle trademark disputes. IT&#8217;S NOT JUST PUMP FUN! 🚨 Major CT suspensions (Ongoing Tracker) Here&#8217;s what we’ve got so far 👇🏼 GMGN-Linked Accounts@gmgnai @haze0x — Founder@arthur_gmgn — Co-founder@Ga__ke — Affiliate (?)@brc20niubi — Affiliate@Wolfy_XBT — Affiliate@0xcryptowizard — Affiliate… pic.twitter.com/u5WbYP3rJD — Øtto⚡️ (@0xottoman) June 16, 2025 X Account Suspensions Raise Eyebrows On June 16, Pump.fun’s official X accounts were locked without warning. An X user known as Otto logged more than 30 profiles that went dark, including handles linked to GMGN and Bloom trading groups. The accounts came back online after a few days, but no one got an explanation. Related Reading: Bitcoin Nears Climax, But A Twist Awaits—Analyst Reveals Key Insight Some users suspect a regulator asked for the takedown. Others think it was trademark owners flexing their muscles. Either way, the episode fed more chatter about external pressure on the platform. Featured image from Pexels, chart from TradingView"
    },
    {
      "title": "XRP On-Chain Activity Down 80% In 5 Months, Experts Argue Bullish/Bearish Implications",
      "link": "https://www.newsbtc.com/altcoin/xrp-on-chain-activity-down-80-in-5-months-experts-argue-bullish-bearish-implications/",
      "summary": "XRP’s on-chain metrics are reportedly painting a foreboding picture for its price outlook, as data shows a steep 80% decline in new wallet creation over the past five months. This drop in network activity has sparked divided opinions between two expert analysts, with one casting doubts on XRP’s ability to reclaim the $3 mark, and the other rejecting such bearish predictions. XRP Price Surge To $3 Stalled In a recent X (formerly Twitter) post, crypto analyst the ‘Coin Bureau’ highlights that XRP’s momentum appears to be fading fast as new on-chain data from Glassnode reveals a staggering 80% drop in wallet creation since January 2025. This sharp decline in network activity and growth has led the analyst to claim that the XRP price is unlikely to revisit the $3 level anytime soon. Related Reading: Bitcoin Nears Climax, But A Twist Awaits—Analyst Reveals Key Insight At the height of XRP’s 2024 rally, both its price and user activity surged in tandem. During that time, new wallet addresses soared to nearly 30,000 per day in November, coinciding with a sharp rally that sent the token’s price surging close to $3. However, the explosive rally proved short-lived, as momentum faded and prices have since reversed. As of mid-June 2025, Glassnode chart shows that new wallet creation has fallen drastically to around 2,000-5,000 per day, while daily active addresses plunged from 577,000 to just 34,000. XRP’s price, meanwhile, has settled just above $2 and has remained largely range-bound, failing to show signs of a sustained breakout. According to Coin Bureau, this significant drop in on-chain engagement indicates that interest in XRP may have dried up, removing one of the key drivers behind its previous rally. Without new users entering the ecosystem or existing ones increasing XRP’s on-chain activity, the analyst warns that the conditions necessary for an immediate $3 price reclaim aren’t present. Analyst Debunks Bearish Forecast While Coin Bureau’s data paints a picture of declining interest and slow price growth, one crypto expert, known as Moon Lambo on X, has pushed back against the bearish narrative. He argues that XRP’s network activity actually reflects growing strength and long-term confidence. The chart presented by the analyst, covering wallet creation data from June 2024 to June 2025, shows an undeniable spike in network activity between November and early January—a surge that peaked during a period of heightened market enthusiasm following the US elections. As"
    },
    {
      "title": "Bitcoin CBD Heatmap Marks $95,500–$97,000 As Make-Or-Break Zone – Details",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-cbd-heatmap-marks-95500-97000-as-make-or-break-zone-details/",
      "summary": "Since hitting a new all-time high almost a month ago, Bitcoin has done little to assure investors of intent to explore new price territories. Amid announcement of new US trade tariffs and rising geopolitical tensions between Israel and Iran, the premier cryptocurrency has come under bearish influences to trade as low as 101,000. At press time, Bitcoin is hovering near $104,000 following a 2.03% % decline in the past day. However, popular analytics company Glassnode has highlighted a crucial price range worth monitoring especially in the advent of a further price decline. Related Reading: Bitcoin Sees Modest Gains, But Demand Weakness Limits Breakout Potential $95,500–$97,000: Bitcoin’s Line In The Sand In a recent X post, Glassnode shares an insight into the Bitcoin market based on data from Cost Basis Distribution (CBD) heatmap. The CBD is a common on-chain metric that tracks the price levels at which tokens were last purchased or sold. When a substantial amount of coins are traded within a specific price range, it forms a supply cluster capable of acting as a support or resistance level. According to Glassnode’s report, the Bitcoin’s CBD heatmap shows the first dense supply cluster below the current market price lies at $95,500 &#8211; $97,000 price zone. Interestingly, this range rests just below the short-term holders (STH) cost basis suggesting a confluence of technical and on-chain metric to present a high-stake battleground. Therefore, Glassnode analysts explain that holding the market price above this threshold reinforces bullish momentum and boosts Bitcoin chances of re-entering a price discovery mode. However, a breakdown below the $95,500 price level could trigger panic selling supporting bearish projections for the mid-term to short-term. Interestingly, prominent market analysts including anonymous X expert with username Mr. Wall Street has backed the latter scenario stating Bitcoin is due for a further price drops. Mr. Wall Street strictly warns Bitcoin would not hold above the $100,000 psychological support zone forecasting a price fall to around the $93,000 &#8211; $95,000 which Glassnode predicts should induce widescale market liquidations. Related Reading: BNB Price Breakout Could Trigger ATH Rally Repeat – Is $730 The Next Stop? Bitcoin Market Overview At the time of writing, Bitcoin is trading at $103,753 with a cumulative 1.27% decline in the past week. During this period, the flagship cryptocurrency remained largely under $106,000 barring a weak price breakout between June 16 and June 17. On a monthly scale, Bitcoin has now recorded a 6.10% loss, signaling a gradual shift in momentum with bearish forces regaining control of the market. Meanwhile, with a market cap of $2.05 trillion, the &#8220;digital gold&#8221; continues to rank as the largest cryptocurrency with a reported market dominance of 64.3%. Featured image from Pexels, chart from Tradingview"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Norway Plans to Temporarily Ban New Bitcoin & Crypto Mining Centers to Conserve Energy",
      "link": "https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/NBX-Acquires-Bitcoin-Becomes-First-Public-Bitcoin-Treasury-Company-in-Norway.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy\" rel=\"nofollow\">Norway Plans to Temporarily Ban New Bitcoin &amp; Crypto Mining Centers to Conserve Energy</a></p> <p>Norway’s government will temporarily block the development of new Bitcoin and cryptocurrency mining facilities starting this year, prioritizing energy for other industries.</p> <p>"
    },
    {
      "title": "A Seed Phrase Isn’t Self Custody, It’s A Liability.",
      "link": "https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/seedlessheader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability\" rel=\"nofollow\"> </a></p> <p>Seed phrases were an improvement a decade ago. They’re long overdue for an upgrade.</p> <p>"
    },
    {
      "title": "Is the 4-Year Bitcoin Cycle Over? Rational Root Explains Why This Time Might Not Be Different",
      "link": "https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Is-the-4-Year-Bitcoin-Cycle-Over-Rational-Root-Explains.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root\" rel=\"nofollow\"> </a></p> <p>Rational Root joins Pro to debate whether the 4-year Bitcoin cycle is breaking down in the age of ETFs, passive flows, and institutions.</p> <p>"
    },
    {
      "title": "What Happens to Bitcoin When Quantum Computers Arrive?",
      "link": "https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ChaincodeReportHeader-fotor-20250620123039.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive\" rel=\"nofollow\"> </a></p> <p>A high level overview of the recent report by Chaincode Labs on the threat quantum computing poses to Bitcoin. </p> <p>"
    },
    {
      "title": "Coinbase Secures MiCA License to Serve 450 Million Europeans",
      "link": "https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans\" rel=\"nofollow\"> </a></p> <p>Coinbase has obtained its Markets in Crypto Assets (MiCA) license from Luxembourg&#8217;s Commission de Surveillance du Secteur Financier (CSSF), marking a significant regulatory milestone that enables them to offer its complete range of services across all 27 European Union member states. The license allows Coinbase to serve approximately 450 million Europeans under a unified regulatory [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "'Public Good': Wyoming Plots August Debut for WYST Stablecoin",
      "link": "https://decrypt.co/326331/wyoming-plots-august-debut-wyst-state-stablecoin",
      "summary": "The Wyoming Stable Token Commission is targeting an August launch for its state stablecoin following years of preparation."
    },
    {
      "title": "How 'MapleStory N' Is Fighting Back Against Thousands of Hackers",
      "link": "https://decrypt.co/326266/how-maplestory-n-fighting-back-against-hackers",
      "summary": "MapleStory N is banning thousands of hackers a day, as abusers try to make a quick buck off the Avalanche blockchain game."
    },
    {
      "title": "From Free NFT Mint to Drinks at 7-Eleven: Rekt Is Reaching the Masses",
      "link": "https://decrypt.co/326337/from-nft-drinks-7-eleven-rekt-reaching-masses",
      "summary": "Rekt began life as free Ethereum NFT drop and now is a rising drink brand, with cans hitting 7-Eleven stores this week."
    },
    {
      "title": "Elliptic, Internet Watch Foundation Team Up to Combat Crypto Financing of Child Abuse Material",
      "link": "https://decrypt.co/326305/elliptic-iwf-combat-crypto-financing-child-abuse-material",
      "summary": "The Internet Watch Foundation found that cryptocurrencies are the most commonly offered method of payment on child abuse websites."
    },
    {
      "title": "Solana, XRP and Dogecoin ETF Approvals in 2025 Are a Near Lock, Analysts Say",
      "link": "https://decrypt.co/326353/solana-xrp-dogecoin-etf-approvals-2025-near-lock",
      "summary": "Wall Street analysts say that SEC approvals for ETFs based on altcoins including Dogecoin, XRP, and Solana are nearly a sure thing this year."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump announces US airstrikes on Iran’s nuclear sites, Bitcoin dumps, then pumps",
      "link": "https://cryptobriefing.com/us-iran-airstrikes-nuclear-sites/",
      "summary": "<p>The airstrikes heighten geopolitical tensions, potentially destabilizing the region and impacting global markets and cryptocurrency volatility.</p> <p>"
    },
    {
      "title": "Texas governor signs Bitcoin reserve bill into law",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-law/",
      "summary": "<p>Texas' Bitcoin reserve law could bolster financial resilience and set a precedent for other states to integrate crypto into fiscal strategies.</p> <p>"
    },
    {
      "title": "CoinMarketCap’s front-end compromised, investigation underway",
      "link": "https://cryptobriefing.com/coinmarketcap-security-breach-investigation/",
      "summary": "<p>This incident highlights the urgent need for enhanced cybersecurity measures in the crypto industry to protect user assets and data integrity.</p> <p>"
    },
    {
      "title": "Texas governor signs bill to protect state Bitcoin reserve as a permanent fund if established",
      "link": "https://cryptobriefing.com/texas-bitcoin-reserve-protection-bill/",
      "summary": "<p>Texas' move to protect a potential Bitcoin reserve could set a precedent for state-level crypto asset management, influencing future fiscal policies.</p> <p>"
    },
    {
      "title": "XRP joins Solana and Litecoin in top ETF approval tier",
      "link": "https://cryptobriefing.com/spot-crypto-etf-approval-tier/",
      "summary": "<p>The increased likelihood of crypto ETF approvals could significantly boost market legitimacy and attract institutional investment.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Mapping XRP’s road to $2.35 – Bulls, watch THESE levels next",
      "link": "https://ambcrypto.com/mapping-xrps-road-to-2-35-bulls-watch-these-levels-next/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-21T153947.783-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP’s optimism grows, but weak on-chain activity threatens breakout hopes below $2.35 resistance."
    },
    {
      "title": "VIRTUAL falls 12% amid $7.8M sell-off – Will more losses follow?",
      "link": "https://ambcrypto.com/virtual-falls-12-amid-7-8m-sell-off-more-losses-ahead-if/",
      "summary": "<img alt=\"VIRTUAL\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/1000001545.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bybit shorts. Aerodome exits. Active Addresses fall off. What is happening?"
    },
    {
      "title": "Fartcoin whale makes $2M move just before $6M liquidation – Warning sign?",
      "link": "https://ambcrypto.com/fartcoin-whale-makes-2m-move-just-before-6m-liquidation-warning-sign/",
      "summary": "<img alt=\"FARTCOIN\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-21T152710.704-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />FARTCOIN faces intense bearish pressure as longs get wiped out and price stalls below key resistance."
    },
    {
      "title": "$50M Telegram scam exposed! – 4 altcoins targeted: Details here",
      "link": "https://ambcrypto.com/50m-telegram-scam-exposed-4-altcoins-targeted-details-here/",
      "summary": "<img alt=\"OTC Crypto Scams\" class=\"attachment-full size-full wp-post-image\" height=\"810\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/OTC-Crypto-Scams.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1440\" />Even with clear public warnings, millions kept flowing , what made investors ignore the red flags?"
    },
    {
      "title": "Hacken: How a 251M token mint shook HAI to its core!",
      "link": "https://ambcrypto.com/hacken-how-a-251m-token-mint-shook-hai-to-its-core/",
      "summary": "<img alt=\"HAI\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika2-1-5.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The 251 million HAI mint erupted like a volcano - Liquidity surged, and panic swept the market."
    }
  ]
}