{
  "CoinDesk": [
    {
      "title": "Riot Sells $1.58M of Bitfarms Shares as Part of Investment Review",
      "link": "https://www.coindesk.com/business/2025/06/10/riot-sells-usd1-58m-of-bitfarms-shares-as-part-of-investment-review",
      "summary": ""
    },
    {
      "title": "SocGen’s Crypto Arm Unveils Dollar Stablecoin on Ethereum and Solana",
      "link": "https://www.coindesk.com/business/2025/06/10/socgen-s-crypto-arm-unveils-dollar-stablecoin-on-ethereum-and-solana",
      "summary": ""
    },
    {
      "title": "Asia Morning Briefing: BTC Slips Below $110K as 'Signs of Fatigue' Emerging",
      "link": "https://www.coindesk.com/markets/2025/06/09/asia-morning-briefing-btc-slips-below-110k-as-signs-of-fatigue-emerging",
      "summary": ""
    },
    {
      "title": "Bitcoin Climbs Above $110K, 'At Crossroads' for Next Major Move",
      "link": "https://www.coindesk.com/markets/2025/06/09/bitcoin-climbs-above-110k-at-crossroads-for-next-major-move",
      "summary": ""
    },
    {
      "title": "Aptos' APT Gains 4% on Significant Volume, Has More Potential Upside",
      "link": "https://www.coindesk.com/markets/2025/06/09/aptos-apt-gains-4-on-significant-volume-has-more-potential-upside",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Why is the crypto market up today?",
      "link": "https://cointelegraph.com/news/why-is-the-crypto-market-up-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvYTYzMzIzMGQtM2Y5YS00NzQ5LThiYWItMDE3YzRiOTQzNWEw.jpg\" /></p><p>The crypto market is up today, reflecting investors' optimism for a possible continued rally amid increasing institutional demand for cryptocurrency investment products.</p>"
    },
    {
      "title": "Trump’s CFTC pick calls blockchain a society-shaping technology",
      "link": "https://cointelegraph.com/news/trump-cftc-pick-quintenz-blockchain-impact-society?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzMyOWMtOWM2Ni03YzgyLWJjNmYtZDNmODI3ZGUxMjQz.jpg\" /></p><p>Trump’s CFTC nominee Brian Quintenz says blockchain will reshape industries beyond finance and calls for clear crypto rules to protect US leadership.</p>"
    },
    {
      "title": "Bitcoin Coinbase Premium hits 4-month high as 550K BTC leaves exchanges",
      "link": "https://cointelegraph.com/news/bitcoin-coinbase-premium-hits-4-month-high-550k-btc-leaves-exchanges?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDczOGUtNWZmZS03ZWIyLWE4MTYtOWI1MGVhYjhkMmQy.jpg\" /></p><p>Bitcoin demand in the US is rising, while spot exchanges see their reserves decline by one third in less than a year, per new data from CryptoQuant.</p>"
    },
    {
      "title": "Why is Bitcoin price up today?",
      "link": "https://cointelegraph.com/news/why-is-bitcoin-price-up-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvMjk3NTY5OWMtYWJkZC00ZjdiLWJkMzUtNzQyNjdhNTcwMTE3.jpg\" /></p><p>Bitcoin price recovers above $109,000 as multiple BTC market metrics show an improvement in investor sentiment.</p>"
    },
    {
      "title": "Ripple commits $5M more toward crypto research in APAC",
      "link": "https://cointelegraph.com/news/ripple-commits-5-million-crypto-research-apac?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU3ZjQtNGYwOS03ODM3LWFmNDctMjUyNTVkYzExOWQ4.jpg\" /></p><p>The funds are on top of the $25 million that Ripple committed last month to education nonprofit organizations in the US.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Average US house prices fall 99% in a decade when priced in Bitcoin",
      "link": "https://cryptoslate.com/average-us-house-prices-fall-99-in-a-decade-when-priced-in-bitcoin/",
      "summary": "<p>Two new Coinbase ads recently hit U.S. screens, reviving crypto’s populist pitch at a time when inflation is stubborn, Bitcoin is soaring, and Americans are once again talking about “building.” One spot reframes Bitcoin as “money from the future,” while another shows how a U.S. home’s price has dropped from 30,000 BTC to just 5 [&#8230;]</p> <p>"
    },
    {
      "title": "Ripple partners with APAC universities in AI and decentralized systems with $5 million funding",
      "link": "https://cryptoslate.com/ripple-partners-with-apac-universities-in-ai-and-decentralized-systems-with-5-million-funding/",
      "summary": "<p>Ripple is scaling up its global blockchain education efforts with a fresh commitment of more than $5 million in funding to universities across the Asia-Pacific (APAC) region, according to a June 10 statement. The crypto payment company stated that the investment will be channeled through Ripple&#8217;s University Blockchain Research Initiative (UBRI), targeting institutions in South [&#8230;]</p> <p>"
    },
    {
      "title": "SocGen doubles down on stablecoins with USD launch and BNY custody",
      "link": "https://cryptoslate.com/socgen-doubles-down-on-stablecoins-with-usd-launch-and-bny-custody/",
      "summary": "<p>Societe Generale-FORGE (SG-FORGE), the crypto-asset arm of French banking giant Societe Generale, has announced the launch of a new U.S. dollar-pegged stablecoin, the USD CoinVertible (USDCV), set to operate natively on both the Ethereum and Solana public blockchains. The launch marks SG-FORGE&#8217;s second stablecoin initiative, following the EUR CoinVertible (EURCV) release in April 2023. Like [&#8230;]</p> <p>"
    },
    {
      "title": "RLUSD surpasses $300M supply as Ripple secures UAE backing",
      "link": "https://cryptoslate.com/rlusd-surpasses-300m-supply-as-ripple-secures-uae-backing/",
      "summary": "<p>Ripple’s stablecoin RLUSD expanded its circulating supply by 29% in the week ended June 8, adding $72.5 million and closing at $320.6 million. The movement marks the first time the token’s float crossed the $300 million threshold. Additionally, it represents a sixfold increase since the launch of RLUSD on Dec. 17, 2024. Data from Artemis [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin climbs back to $110k amid sustained corporate, institutional interest",
      "link": "https://cryptoslate.com/bitcoin-climbs-back-to-110k-amid-sustained-corporate-institutional-interest/",
      "summary": "<p>Bitcoin (BTC) rebounded above $110,000 on June 9, regaining ground lost in last week’s selloff as investors rotated back into digital assets on the back of strong ETF inflows, easing macroeconomic tensions, and renewed optimism across risk markets. The world’s largest crypto reached an intraday high of $110,653 from a daily low of $105,426 earlier [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana Triangle Formation Breakout Targets Rally To $164 – Is A Recovery Around The Corner?",
      "link": "https://www.newsbtc.com/news/solana-triangle-formation-breakout-targets-rally-to-164-is-a-recovery-around-the-corner/",
      "summary": "Solana (SOL) has recovered from the recent market pullback after bouncing from its local bottom. Amid its recent breakout from a bullish formation, some market watchers suggest that the cryptocurrency could recover its start-of-year glory. Related Reading: Bitcoin Weekly Chart Flexes Strength—Is The Moonshot Just Getting Started? Solana Breakout Eyes $164 Solana is recording a 2.45% surge in the weekly timeframe after recovering from its recent drop to the $140 area. The altcoin has seen a significant recovery from its multi-month downtrend, which led the token to hit a 14-month low of $95 during the early April retraces. However, SOL lost the $160 area amid the recent market corrections, dipping 11% in one week. Over the weekend, its price bounced nearly 10%, reclaiming the $150 level as support and forming an ascending triangle pattern. Crypto analyst Ali Martinez highlighted the 3-day formation in Solana’s chart, suggesting a potential 6% jump to its recently lost support level. According to"
    },
    {
      "title": "Bitcoin Skyrockets Past $108,000 Amid US-China Tariff Discussions",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-skyrockets-past-108000-amid-us-china-tariff-discussions/",
      "summary": "The market’s leading cryptocurrency, Bitcoin (BTC), experienced a notable spike on Monday, surging past the $108,000 mark after a period of consolidation between $100,000 and $106,000 for the past week. This surge comes as key officials from the United States and China prepare for critical trade negotiations in London, aimed at addressing ongoing tensions and salvaging “a fragile trade agreement.” US-China Trade Talks Spark Investor Optimism The cryptocurrency gained 2% on Monday, briefly touching a peak of $108,900 before settling back slightly. This uptick reflects growing investor optimism regarding the potential resolution of trade disputes between the US and China, one of its largest trading partners. Treasury Secretary Scott Bessent and China’s Vice Premier for Economic Policy, He Lifeng, are set to lead their respective delegations in discussions that began Monday and are expected to continue into Tuesday, as reported by Fortune. Related Reading: Pundit Says Do Not Ignore Ethereum Amid New All-Time Highs In Major Metric These negotiations are part of President Donald Trump’s broader strategy to compel US trading partners to meet various demands, often through the threat of imposing significant tariffs on imports. Following the announcement of a sweeping tariff policy in April, which impacted nearly all American trading partners, Trump authorized a 90-day pause for negotiations. However, this pause did not apply to tariffs on China, which were escalated to 145%. Trade Talks Resuming As Bitcoin Prices Rise The heightened tensions between the two nations had previously led to a significant drop in Bitcoin’s value, reaching a yearly low of $75,000 as fears of a trade war drove investors away from American markets. However, optimism returned following a summit in Geneva last month, where Trump announced a temporary agreement that would lower tariffs and facilitate further discussions. In the wake of this news, Bitcoin surged to an all-time high of $111,800 on May 22. Yet, the truce was short-lived. Trump claimed that China had violated the agreement over a dispute regarding exports of rare earth magnets. On May 30, he expressed his frustrations on Truth Social, stating, “China, perhaps not surprisingly to some, HAS TOTALLY VIOLATED ITS AGREEMENT WITH US. So much for being Mr. NICE GUY!” In an urgent attempt to salvage the deteriorating trade deal, Trump and Chinese President Xi Jinping held a phone call last week, their first in months. Following this 90-minute conversation, it was announced that senior officials from both countries would meet in London this week to resume negotiations. In addition to trade-related factors, Bitcoin&#8217;s recent price surge may also be influenced by increased activity in the cryptocurrency initial public offering (IPO) market. Wave Of Crypto IPO Activity Last week, the stablecoin giant Circle made its public debut on the New York Stock Exchange (NYSE), with its shares soaring by over 168%, jumping from an initial price of $31 to $69 on the first day of trading. Additionally, Gemini, the cryptocurrency exchange founded by the Winklevoss twins, filed for an initial public offering, further demonstrating the crypto industry&#8217;s growing connection to traditional finance. Related Reading: Dogecoin Is Going To $1 With The ‘Next Impulse’, Analyst Predicts “While the IPO excitement may be short-lived, the long-term positioning of institutional investors suggests a bullish outlook for Bitcoin’s performance through 2025,” remarked David Siemer, CEO of Wave Digital Assets, in an interview with Fortune. When writing, BTC trades at $108,670, recording gains of 6% in the monthly time frame, little over 2.7% from its record high of $111,8000 reached in May. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Solana Listed on Nasdaq as Solaxy, the First SOL Layer-2, Raises $46M",
      "link": "https://www.newsbtc.com/news/solana-listed-on-nasdaq-as-solaxy-the-first-sol-layer-2-raises-46m/",
      "summary": "The NASDAQ has been bringing crypto and traditional investing together since 2025. With the June 7 filing of a standard K-8 fund, the Nasdaq noted that its standard Nasdaq Crypto US Settlement Price Index (NCIUS) would add four new cryptos – Cardano, Solana, Stellar Lumens, and XRP Ledger – to its current roster of Bitcoin and Ethereum. The move sets up the potential for the first-ever multi-asset crypto ETF, and signals crypto’s continued ascension to the upper ranks of the financial world. The news comes on the back of reports that BlackRock’s Bitcoin ETF just became the fastest-ever ETF to reach $70B in total assets. Add it all together, and it’s clear that the finance world has expanded beyond recognizing just $BTC and $ETH. Solana’s $83.7B market cap could be set to swell even further on the back of a potential Nasdaq listing and possible ETF inclusion. And any growth could skyrocket when critical upgrades like Solaxy, Solana’s first-ever Layer-2, provide a much-needed boost to Solana scalability and reliability. ETFs: Kind Of A Big Deal Exchange-Traded Funds (ETFs) are pools of assets listed on exchanges, letting ordinary investors gain exposure to the underlying assets without purchasing them directly. That makes them great for retail investors who may not want the struggle of setting up a crypto wallet – even a simple wallet like Best Wallet app. However, ETFs are also appealing to institutional investors, who use ETFs to diversify their portfolios. $BTC and $ETH ETFs both caused a spike in the price of their respective cryptos when they launched last year, and have been widely credited with fueling a steady increase in demand. Currently, $BTC ETFs account for 6% of the total Bitcoin market cap; $ETH ETFs hold 3.13%. In both cases, that’s a significant percentage of the total market cap and adds buying pressure. A potential multi-asset ETF, from Nasdaq, no less, would do the same for any included cryptos, including Solana. Solana’s Ecosystem Set to Expand Solana has historically relied on a single Rust-based validator client. That was Agave, maintained by Anza, with over 90% of stake weight running on Jito-Solana, a fork built around MEV infrastructure. The Jito-Solana consolidation boosted performance and staking returns, but raised concerns that a failure at a single point could severely disrupt the network. In a positive sign, several competing clients are emerging: Jito‑Solana: the original MEV solution, which jump-started the trend of validator innovation Firedancer: developed by Jump Crypto, aimed at blazing-fast, modular performance Sig: Syndica’s rewrite in Zig, optimized for read-heavy workloads common in dApps Paladin: a lightweight MEV-focused fork of Jito featuring a protected ‘P3’ transaction lane to mitigate sandwich attacks and enhance fairness TinyDancer: an open-source light client designed for mobile environments, with SPV verification, data sampling, and fraud proofing Taken together, these clients represent a maturing Solana ecosystem: each addresses specific limitations and contributes to greater resilience, specialization, and decentralization. They lay the groundwork for further development on a Solana network that has seen some of the best meme coins and new crypto presales launched in recent years. And now there’s another improvement on the way, just in time for any potential ETF: the first-ever Solana Layer-2 solution, Solaxy. Solaxy ($SOLX): First-Ever Solana Layer-2 for Zero Down-Time Why have investors poured $46M into the Solaxy ($SOLX) presale so far? Because the potential for a Layer 2 solution that solves some of Solana’s nagging problems – like failed transactions and network congestion – is simply too great to miss. The Solaxy project brings together aspects of Ethereum’s scalability and reliability, blending them with Solana’s faster network speeds and lower transaction costs. The $SOLX token will be multi-chain, launching on Ethereum and bridging to the Solaxy Layer-2 when fully deployed. In the meantime, the project is already well underway. The Solaxy Block Explorer and Bridge are live on the testnet. And the token launch is imminent; there are only six days left in the presale. Any investors eager to get in early on what could be the next generation of Solana development can check out our guide on how to buy Solaxy. Tokens currently cost $0.00175, but our price prediction shows the potential for the token to hit $0.025 by the end of 2025, a 1300% increase. Visit the Solaxy presale page today. Nasdaq Listing Positions Solana – and Solaxy – As Financial Cornerstones With Nasdaq listing Solana in its crypto index and a potential ETF on the horizon, institutional demand could surge. Paired with the emergence of Solaxy, Solana is no longer just fast – it’s becoming foundational, and a core part of crypto finance. Do your own research before investing; this is not financial advice. But be aware – time’s running out to get in on the ground floor, with under a week left in the Solaxy presale."
    },
    {
      "title": "Bitcoin Defies Bears: Price Nears $108,000 Despite $250M Exchange Inflows",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-bears-price-108000-despite-250m-inflows/",
      "summary": "On-chain data shows the exchanges recently received a large amount of Bitcoin inflows, but so far, the asset&#8217;s price has only been going up. Bitcoin Has Seen A Spike In Exchange Inflows Recently In a new post on X, the institutional DeFi solutions provider Sentora (formerly IntoTheBlock) has talked about the latest trend in the Exchange Netflow for Bitcoin. The Exchange Netflow is an on-chain indicator that keeps track of the net amount of the asset that&#8217;s moving into or out of the wallets associated with all centralized exchanges. When the value of this metric is positive, it means the exchange inflows outweigh the exchange outflows. As one of the main reasons why investors would deposit their coins to these platforms is for selling-related purposes, this kind of trend can have a bearish impact on the asset&#8217;s price. Related Reading: Bitcoin &#38; Ethereum Diverge—ETF Flows Just Flipped The Narrative On the other hand, the indicator being under the zero mark suggests the holders are taking out a net number of tokens from exchanges. Such a trend can be a sign that the investors are accumulating, which can naturally prove to be bullish for the cryptocurrency. Now, here is a chart that shows the trend in the Bitcoin Exchange Netflow since the start of the month: As displayed in the above graph, the Bitcoin Exchange Netflow has recently mostly been contained in the negative territory, but the latest value (yesterday&#8217;s) has been positive. In total, the investors have deposited a net $262.75 million of the asset to the exchange-connected wallets with this inflow spike. According to the analytics firm, this marks the first day of significant deposits since May 27th. As mentioned before, exchange inflows are something that can turn out to be bearish for the coin&#8217;s value. So far, however, the opposite has happened for Bitcoin, as its price has soared instead. This could indicate that even if there are some large holders looking to sell with these deposits, enough demand has surfaced at the same time that BTC has not only been able to ride out this wave of potential selling pressure, but actually add to its recovery. Related Reading: Crypto Suffers $1 Billion Flush As Musk-Trump Feud Shakes Bitcoin According to the analytics firm Glassnode, short liquidations have registered a notable uptick alongside this surge in the cryptocurrency. &#8220;Over just 4 hours, total short liquidations spiked from $105K to $359K (24H SMA),&#8221; notes Glassnode. Generally, large liquidations end up providing fuel to the price move that caused them, so in this case, it&#8217;s possible the short squeeze may have provided support to the Bitcoin rally. BTC Price At the time of writing, Bitcoin is floating around $107,900, up over 3% in the last seven days. Featured image from Dall-E, Glassnode.com, IntoTheBlock.com, chart from TradingView.com"
    },
    {
      "title": "Ethereum’s Realized Price Hints at a Market Reset, What Traders Should Know",
      "link": "https://www.newsbtc.com/bitcoin-news/ethereums-realized-price-hints-at-a-market-reset-what-traders-should-know/",
      "summary": "Ethereum has shown signs of regaining momentum after a recent period of decline. The asset is currently trading at approximately $2,540, reflecting a modest 1% daily increase. This upward move follows a notable dip to the $2,400 range last week, marking what appears to be a short-term rebound from recent bearish pressure. While price fluctuations continue, on-chain analysts closely monitor Ethereum’s market structure through various metrics that provide historical context and potential forecasting value. Recent insights from a CryptoQuant analyst have focused on how ETH’s long-term behavior aligns with certain key indicators, which may help define price floors and signal overheated market conditions. Related Reading: Bitcoin And Ethereum Defend Key Moving Averages – Bullish Signal Or Temporary Relief? Assessing Ethereum Price Floors Using On-Chain Data One of CryptoQuant’s analysts, writing under the name CryptoOnchain, shared a breakdown of Ethereum’s potential “price floors” using a composite of on-chain and market metrics. These floors represent statistical thresholds that have historically acted as support zones during market corrections. Among them is the realized price, which measures the average value at which all circulating ETH last moved on-chain. This metric is often used as a sentiment gauge to track when market participants are in profit or loss. Another benchmark, the mean_price_classic, reflects the average daily closing price of ETH since inception and serves as a cumulative market average. It is used in conjunction with the delta_price_classic, a figure derived from the difference between Ethereum’s realized capitalization and its historical average cap, adjusted for supply. According to the analyst, this delta price is frequently cited in Bitcoin analytics to highlight undervalued zones, and its adaptation for Ethereum provides a comparable lens for identifying periods when the market may be at or near a floor. Tracking Market Tops and Potential Resistance Zones In a separate analysis report, CryptoOnchain highlighted tools for identifying potential market tops. The indicators outlined include the realized_price_x2 and realized_price_x3, which are calculated by multiplying Ethereum’s realized price by two and three, respectively. Historically, these levels have coincided with overheated phases of the market, where prices reached temporary peaks before correcting. Related Reading: Ethereum Consolidates Below $2,800 – Bulls Need This Level To Trigger Next Leg Up Another tool, the price_top_stddev, incorporates volatility into the analysis by adding two times the historical standard deviation of ETH’s closing price to the realized price. This combination serves as a marker of statistically elevated prices, often aligning with periods of heightened euphoria and speculative activity. CryptoOnchain suggests that monitoring these zones can assist traders in managing risk during extended rallies, as these resistance levels have previously preceded major cycle reversals. Featured image created with DALL-E, Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Robert Mitchnick Discusses BlackRock’s Bitcoin ETF IBIT Success On Bloomberg",
      "link": "https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Robert-Mitchnick-Discusses-BlackRocks-Bitcoin-ETF-IBIT-Success-On-Bloomberg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg\" rel=\"nofollow\"> </a></p> <p>BlackRock’s Head of Digital Assets, Robert Mitchnick, explains the key factors driving the surge in Bitcoin ETFs.</p> <p>"
    },
    {
      "title": "KULR Technology Group Announces $300 Million ATM Offering To Invest in Their Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>KULR entered a $300 million ATM offering to fund its Bitcoin treasury reserve, with Cantor Fitzgerald &#038; Co. and Craig-Hallum Capital Group LLC.</p> <p>"
    },
    {
      "title": "BlackRock’s iShares Bitcoin Trust Shatters ETF Growth Record, Surpassing $70 Billion in Just 341 Days",
      "link": "https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BlackRock.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days\" rel=\"nofollow\"> </a></p> <p>BlackRock’s iShares Bitcoin Trust (IBIT) has officially made history. The Bitcoin ETF surged past $70 billion in assets under management (AUM), reaching the milestone in just 341 trading days. This achievement makes IBIT the fastest ETF to ever hit that threshold.&#160; To put that into perspective, the previous record-holder—SPDR Gold Shares (GLD)—took 1,691 days to [&#8230;]</p> <p>"
    },
    {
      "title": "New York City Won’t Be Issuing BitBonds Anytime Soon",
      "link": "https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/New-York-City-Mayor-Eric-Adams-Bitcoin-BitBonds.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon\" rel=\"nofollow\"> </a></p> <p>At Bitcoin 2025, NYC mayor, Eric Adams, proclaimed that he’s going to push to issue a BitBond, but judging by his past inaction on Bitcoin as well as a statement from NYC’s comptroller, odds are New Yorkers won’t see a BitBond in the near future.</p> <p>"
    },
    {
      "title": "Japan’s ANAP Holdings Launches Full Bitcoin Business Strategy with Goal of Over 1,000 BTC by August 2025",
      "link": "https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ANAP.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025\" rel=\"nofollow\"> </a></p> <p>ANAP Holdings, Inc. (3189: Tokyo Standard Market) has officially announced the launch of its “Bitcoin Business” in a formal corporate filing, detailing an entry into Bitcoin focused operations across treasury, finance, fashion, and mining. In a statement signed by President and CEO Yuta Sawaki, the company confirmed that its consolidated subsidiary ANAP Lightning Channel will [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Self-Driving Waymo Cars Torched During ICE Protest in Los Angeles",
      "link": "https://decrypt.co/324336/robotic-waymo-cars-torched-ice-protest-los-angeles",
      "summary": "Several Waymo self-driving taxis were destroyed amid growing tensions over ICE activity in Los Angeles."
    },
    {
      "title": "Apple Tones Down AI Hype While Showcasing Next iPhone, Mac Features",
      "link": "https://decrypt.co/324330/apple-tones-down-ai-hype-wwdc-2025",
      "summary": "At WWDC 2025, Apple introduced AI-powered updates and UX design overhaul—but the AI hype was taken down a notch."
    },
    {
      "title": "Bitcoin Soars Above $110K, Nearing Record as Ethereum and Dogecoin Rise",
      "link": "https://decrypt.co/324317/bitcoin-soars-above-110k-ethereum-dogecoin",
      "summary": "Bitcoin's price jumped past $110,000 for the first time in about two weeks to lead a broader upturn in digital assets."
    },
    {
      "title": "Sui DeFi Exchange Cetus Back in Action After $233 Million Exploit",
      "link": "https://decrypt.co/324313/sui-defi-exchange-cetus-back-in-action-after-233-million-exploit",
      "summary": "Following a damaging protocol vulnerability in May, Sui decentralized exchange Cetus is back online with a compensation plan."
    },
    {
      "title": "Plasma Attracts $500 Million for ICO—And One Trader Spent $100K on Ethereum Gas Fees",
      "link": "https://decrypt.co/324237/plasma-500-million-ico-trader-spent-100k-ethereum-gas",
      "summary": "Are ICOs back? Stablecoin network Plasma just attracted $500 million worth of deposits for its sale, with one trader paying $100K for an edge."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "French banking giant Société Générale confirms launch of new stablecoin on Ethereum and Solana",
      "link": "https://cryptobriefing.com/usd-coinvertible-launch-sg-forge/",
      "summary": "<p>Socit Gnrale's stablecoin launch signifies a pivotal shift in traditional banking towards embracing blockchain technology and digital finance.</p> <p>"
    },
    {
      "title": "How UK crypto taxes work and what you need to know",
      "link": "https://cryptobriefing.com/how-uk-crypto-taxes-work/",
      "summary": "<p>The increasing scrutiny on crypto tax compliance in the UK highlights the need for investors to maintain accurate records and understand tax obligations.</p> <p>"
    },
    {
      "title": "Did Paraguay just make Bitcoin legal tender? Suspected hack of president’s X account sparks confusion",
      "link": "https://cryptobriefing.com/paraguay-bitcoin-legal-tender-hack/",
      "summary": "<p>The incident highlights the vulnerability of digital platforms in disseminating misinformation, potentially impacting national and global markets.</p> <p>"
    },
    {
      "title": "ProShares, Bitwise seek SEC approval for ETFs tracking Circle stock",
      "link": "https://cryptobriefing.com/circle-stock-etfs-proshares-bitwise/",
      "summary": "<p>The approval of these ETFs could enhance investor access to crypto-related equities, potentially boosting market liquidity and innovation.</p> <p>"
    },
    {
      "title": "Tether to open-source Bitcoin Mining Operating System to empower small, mid-sized miners, says Paolo Ardoino",
      "link": "https://cryptobriefing.com/tether-bitcoin-mining-open-source/",
      "summary": "<p>Tether's open-source MOS could democratize Bitcoin mining, enhancing decentralization and security while enabling smaller players to compete.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Is Solana’s $10B liquidity drain a sign of trouble for SOL?",
      "link": "https://ambcrypto.com/is-solanas-10b-liquidity-drain-a-sign-of-trouble-for-sol/",
      "summary": "<img alt=\"Solana\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-10.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SOL moves fast, but in a desert of liquidity, every step risks collapse."
    },
    {
      "title": "SUI surges 6% after key breakout – $4 on the cards",
      "link": "https://ambcrypto.com/sui-surges-6-after-key-breakout-4-on-the-cards/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_40_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SUI breaks bullish flag resistance as buyers dominate, aiming for $4 despite cooling spot volume."
    },
    {
      "title": "Traditional Southeast Asian enterprises adopt web3 technologies for strategic transformation",
      "link": "https://ambcrypto.com/traditional-southeast-asian-enterprises-adopt-web3-technologies-for-strategic-transformation/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"434\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-10-144747.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"755\" />Vietnam’s SSI Digital (SSID), the technology arm of SSI Securities Corporation, has announced the launch [&#8230;]"
    },
    {
      "title": "Decoding XRP’s rise: LTHs hold tight, all eyes on THIS price level!",
      "link": "https://ambcrypto.com/decoding-xrps-climb-lths-hold-tight-all-eyes-on-this-price-level/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-7-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />LTHs are accumulating, and Funding Rates have been consistently positive recently."
    },
    {
      "title": "All about Solana’s 8.5% rally after $143 retest- Time for a major recovery?",
      "link": "https://ambcrypto.com/all-about-solanas-8-5-rally-after-143-retest-time-for-a-major-recovery/",
      "summary": "<img alt=\"Solana Sees 8.5% Rally After $143 Retest- Is It Time for a Larger Recovery?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Solana-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana’s short-term rally might face obstacles as weak volume hinted at uncertainty."
    }
  ]
}