{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Leverage Meets Patience as Bitcoin Builds Toward a Breakout",
      "link": "https://www.coindesk.com/markets/2025/07/01/asia-morning-briefing-leverage-meets-patience-as-bitcoin-builds-toward-a-breakout",
      "summary": ""
    },
    {
      "title": "EU Central Bank Commits to Distributed Ledger Technology Settlement Work",
      "link": "https://www.coindesk.com/policy/2025/07/01/eu-central-bank-commits-to-distributed-ledger-technology-settlement-work",
      "summary": ""
    },
    {
      "title": "Why Is Ether Struggling Near $2,400 Even as More Firms Add ETH to Their Treasuries?",
      "link": "https://www.coindesk.com/markets/2025/07/01/why-is-ether-struggling-near-usd2-400-even-as-more-firms-add-eth-to-their-treasuries",
      "summary": ""
    },
    {
      "title": "Solana Drops Below $146 Despite Imminent Launch of First U.S.-Based SOL Staking ETF",
      "link": "https://www.coindesk.com/markets/2025/07/01/solana-drops-below-usd146-despite-imminent-launch-of-first-u-s-based-sol-staking-etf",
      "summary": ""
    },
    {
      "title": "Polkadot's DOT Slips 4% From Highs, Now Testing Support at $3.32 Level",
      "link": "https://www.coindesk.com/markets/2025/07/01/polkadots-dot-slips-4-from-highs-now-testing-support-at-332-level",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "US sanctions crypto wallet tied to ransomware, infostealer host",
      "link": "https://cointelegraph.com/news/us-treasury-sanctions-aeza-group-wallet-leaders?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M4NDMtMTI3MS03ZGU4LWI5YWQtNjQzYzk4NDYxNTg5.jpg\" /></p><p>The US Treasury has sanctioned a crypto wallet containing $350,000 tied to the alleged cybercrime hosting service Aeza Group.</p>"
    },
    {
      "title": "SOL ETF news gain evaporates, while chart warns of another 20% drop",
      "link": "https://cointelegraph.com/news/sol-etf-news-gain-evaporates-while-chart-warns-of-another-20percent-drop?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGY2NjEtMzY3NS03ODQwLWEwYWQtYWM2YTM4NmEzMjgz.jpg\" /></p><p>SOL retraced its ETF rally, and with over 14% of supply concentrated at $144, holding this key support is critical to avoid a deeper correction.</p>"
    },
    {
      "title": "SEC approves conversion of Grayscale&#039;s large-cap crypto fund into ETF",
      "link": "https://cointelegraph.com/news/sec-conversion-grayscale-large-cap-crypto-fund-etf?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWE3ODQtNmJmNC03MTc1LWEyZGUtMDQwMTZhYjdmNTkz.jpg\" /></p><p>Grayscale has slowly narrowed the arbitrage opportunities on its crypto trusts by converting them into exchange-traded funds.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "US regulator considers simplified path to market for crypto ETFs",
      "link": "https://cointelegraph.com/news/us-considers-simplified-path-to-market-crypto-etfs?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWE3ODQtNmJmNC03MTc1LWEyZGUtMDQwMTZhYjdmNTkz.jpg\" /></p><p>The United States Securities and Exchange Commission is reportedly considering simplifying the listing process for certain crypto ETFs.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin holder unlocks $10 million from rare Casascius bar bought for $500",
      "link": "https://cryptoslate.com/bitcoin-holder-unlocks-10-million-from-rare-casascius-bar-bought-for-500/",
      "summary": "<p>A long-time Bitcoin holder has finally cracked open one of the rarest physical Bitcoin collectibles in existence—a Casascius bar loaded with 100 BTC. The collector, who goes by the name John Galt on the Bitcoin Talk forum, originally bought the bar in 2012 for just $500. 13 years later, he redeemed it when the top [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum dev Zack Cole launches initiative to fund ‘tokenless’ projects, promote ETH burning mechanisms",
      "link": "https://cryptoslate.com/ethereum-dev-zack-cole-launches-initiative-to-fund-tokenless-projects-promote-eth-burning-mechanisms/",
      "summary": "<p>Ethereum developer Zak Cole is spearheading a new initiative called the Ethereum Community Foundation (ECF), which will primarily work to enhance the digital asset&#8217;s economic value. The initiative was announced during the Ethereum Community Conference in Cannes, France. Founded by Cole and a group of ecosystem supporters, the ECF has reportedly already raised &#8220;millions&#8221; and [&#8230;]</p> <p>"
    },
    {
      "title": "Figma discloses $70M Bitcoin exposure via Bitwise ETF in IPO filing, plans another $30M buy",
      "link": "https://cryptoslate.com/figma-discloses-70m-bitcoin-exposure-via-bitwise-etf-in-ipo-filing-plans-another-30m-buy/",
      "summary": "<p>Figma’s initial public offering (IPO) prospectus reveals that the design software company holds approximately $69.5 million of the Bitwise Bitcoin ETF (BITB). According to a July 1 filing, a table lists the ETF under level-1 marketable securities at $69.533 million. The document also stated that the board authorized a $55 million purchase on March 3, [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin holders exhibit ‘diamond hands’ as unrealized profits swell past $1 trillion",
      "link": "https://cryptoslate.com/bitcoin-holders-exhibit-diamond-hands-as-unrealized-profits-swell-past-1-trillion/",
      "summary": "<p>Bitcoin (BTC) investors have kept their coins off exchanges in recent weeks, even as market-wide profitability climbed to levels that typically trigger distribution, according to a July 1 report from Glassnode. Bitcoin fell from $106,000 to $99,000 during last week’s Israel-Iran flare-up, but buyers defended the short-term holder cost basis at $98,300 and pushed the [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin dips to $105k on Q3 open despite record monthly close",
      "link": "https://cryptoslate.com/bitcoin-dips-to-105k-on-q3-open-despite-record-monthly-close/",
      "summary": "<p>The crypto market saw significant declines on July 1 despite Bitcoin&#8217;s record monthly close the day prior amid continued institutional and corporate accumulation. Bitcoin (BTC) managed to maintain its footing above the $105,000, but altcoins experienced drastic declines, with some posting double-digit percentage losses for the day. Bitcoin fell nearly 2% to a low of [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Price Drops After Bullish Attempt — Support Area Under Pressure",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-drops-2350/",
      "summary": "Ethereum price started a fresh decline from the $2,520 zone. ETH is now back below $2,450 and struggling to stay above the $2,350 support. Ethereum started a fresh decline from the $2,520 level. The price is trading below $2,450 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support at $2,450 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it remains stable above the $2,350 zone in the near term. Ethereum Price Trims Gains Ethereum price started a fresh decline from the $2,520 resistance, like Bitcoin. ETH price declined below the $2,500 and $2,450 levels to enter a short-term bearish zone. Besides, there was a break below a key bullish trend line with support at $2,450 on the hourly chart of ETH/USD. The pair even spiked below the $2,400 level. A low was formed at $2,373 and the price is now attempting to recover some losses. It climbed above the 23.6% Fib retracement level of the downward move from the $2,523 swing high to the $2,373 low. Ethereum price is now trading below $2,450 and the 100-hourly Simple Moving Average. On the upside, the price could face resistance near the $2,420 level. The next key resistance is near the $2,450 level. It is close to the 50% Fib retracement level of the downward move from the $2,523 swing high to the $2,373 low. The first major resistance is near the $2,465 level. A clear move above the $2,465 resistance might send the price toward the $2,520 resistance. An upside break above the $2,520 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,550 resistance zone or even $2,650 in the near term. Another Decline In ETH? If Ethereum fails to clear the $2,450 resistance, it could start a fresh decline. Initial support on the downside is near the $2,375 level. The first major support sits near the $2,350 zone. A clear move below the $2,350 support might push the price toward the $2,280 support. Any more losses might send the price toward the $2,220 support level in the near term. The next key support sits at $2,150. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,350 Major Resistance Level – $2,450"
    },
    {
      "title": "Ethereum In Demand: ETF Inflow Streak Extends To 7 Weeks",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-demand-etf-inflow-streak-7-weeks/",
      "summary": "Institutional demand for Ethereum appears strong as spot exchange-traded funds (ETFs) have recorded seventh-straight week of inflows. US Ethereum Spot ETFs Have Recently Seen Continuous Inflows In a new post on X, the analytics firm Glassnode has shared an update on how the netflow related to the US Ethereum spot ETFs is looking. Spot ETFs are investment vehicles that allow investors to gain exposure to a given cryptocurrency without having to directly own tokens of it. Related Reading: Ethereum At Risk? If $2,200 Cracks, $1,160 May Be Coming These ETFs trade on traditional platforms, so traders taking this route don&#8217;t have to bother with digital asset exchanges and wallets. For investors only familiar with the traditional mode, this fact can make the ETFs the preferrable mode of investment. The US Securities and Exchange Commission (SEC) approved spot ETFs for Ethereum in mid 2024, half a year after Bitcoin&#8217;s approval went through near the start of the year. Below is the chart shared by Glassnode that shows how the aggregate netflow has been like for the US ETH spot ETFs during the past few months. As is visible in the graph, the Ethereum spot ETFs saw outflows earlier in the year, but the trend has been different since the final third of April. Save for a week in May, a net amount of capital has been pouring into these investment vehicles. &#8220;As ETH rebounded from $2.2K to $2.5K, institutional appetite followed,&#8221; notes Glassnode. &#8220;Spot ETH ETFs recorded 106K ETH in net inflows last week &#8211; marking the 7th consecutive week of positive flows.&#8221; Ethereum isn&#8217;t the only cryptocurrency that has recently been enjoying ETF inflows. As the analytics firm has pointed out in another X post, the number one digital asset, Bitcoin, is also seeing demand pick up. As displayed in the above chart, Bitcoin has also been seeing a green netflow for the US spot ETFs, but due to a week of outflows in early June, the streak only stands at three weeks for the asset. During the latest week, around 15,000 BTC flowed into the ETFs. In USD terms, that&#8217;s equivalent to $1.6 billion. For comparison, inflows amounted to $258.6 million for Ethereum. Clearly, while both have seen demand, there is a clear difference of scale involved between the two. Related Reading: Dogecoin Under Pressure: Only Top 10 Coin Where Loss-Taking Exceeds Profit From the graph, it&#8217;s apparent that the US Bitcoin spot ETFs saw an acceleration of demand over the course of June. It only remains to be seen, though, whether the trend would keep up in this month of July. ETH Price Ethereum crossed the $2,500 level earlier, but it seems the coin has since faced a pullback as its price is back at $2,400. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Price Trims Gains — Bulls Lose Steam Near Resistance",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-trims-gains-105k/",
      "summary": "Bitcoin price started a fresh decline from the $108,800 zone. BTC is now consolidating and might aim for a move above the $106,500 resistance. Bitcoin started a downside correction from the $108,800 zone. The price is trading below $107,000 and the 100 hourly Simple moving average. There is a bearish trend line forming with resistance at $106,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $105,000 zone. Bitcoin Price Dips Further Bitcoin price failed to surpass the $108,800 resistance and started a fresh decline. BTC declined below the $107,000 level. The bears even pushed the price below the $106,000 level. A low was formed at $105,116 and the price is now trading in a range below the 23.6% Fib retracement level of the downward move from the $108,792 swing high to the $105,116 low. Bitcoin is now trading below $107,000 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $106,000 level. There is also a bearish trend line forming with resistance at $106,000 on the hourly chart of the BTC/USD pair. The first key resistance is near the $106,500 level. A close above the $106,500 resistance might send the price further higher. In the stated case, the price could rise and test the $107,000 resistance level. It is close to the 50% Fib level of the downward move from the $108,792 swing high to the $105,116 low. Any more gains might send the price toward the $108,000 level. More Losses In BTC? If Bitcoin fails to rise above the $106,500 resistance zone, it could start another decline. Immediate support is near the $105,500 level. The first major support is near the $105,000 level. The next support is now near the $104,200 zone. Any more losses might send the price toward the $103,500 support in the near term. The main support sits at $102,000, below which BTC might continue to move down. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $105,500, followed by $105,000. Major Resistance Levels – $106,500 and $107,000."
    },
    {
      "title": "Ethereum Network Awakens—Massive On-Chain Moves Signal What’s Coming",
      "link": "https://www.newsbtc.com/altcoin/ethereum-network-awakens-massive-on-chain-moves-signal-whats-coming/",
      "summary": "Ethereum has stayed under the radar as Bitcoin grabs headlines. But new data shows long‑term holders have quietly built up a huge stash of ETH. This might set the stage for a big move when markets heat up. Related Reading: Insane Or Insightful? VC Firm Says XRP Could Reach Nearly $9,000 In Just 5 Years According to on‑chain trackers, close to 30 million ETH is now sitting in wallets that have never spent a single coin. These so‑called accumulation addresses only take in Ethereum and don’t send any out. That’s an all‑time high for this group of holders. They’ve piled in even though Ether is trading far below its peak. Many of these investors seem to believe a rally is coming. $ETH on-chain activity is spiking. The sleeping giant is about to wake up! pic.twitter.com/1Pq6L0g5hH — Crypto Rover (@rovercrc) June 28, 2025 Rising Hoards Signal Confidence The pace of ETH going into cold wallets has shot up sharply over the past few months. It’s a bigger build‑up than in past cycles. If history is any guide, that sort of move usually precedes a price surge. Long‑term holders often buy early and hold tight before a big run. This kind of confidence from big players can spark wider interest. Network Traffic Hits Peak Based on reports, daily transactions on Ethereum just topped 1,500,000. That’s the most since early 2023. A rise in on‑chain transfers often points to more users, more apps and more trading. When people send coins or use smart contracts, they fuel network fees and show real demand. High activity can pull in more traders looking to catch the next wave. Technical Barriers Remain ETH is trading near $2,460 and it hasn’t cleared two key hurdles yet. The 50‑day moving average sits just above price, as does the 200‑day line. Those are tough barriers for any asset. Momentum tools aren’t screaming “buy” yet, either. The RSI sits around 49 and the MACD has flattened out after a stretch of weak readings. On‑balance volume is low, which means big buyers are still cautious. Related Reading: Crypto Bombshell: Developer Claims XRP Could Hit $20,000 What Comes Next For ETH? Even with strong on‑chain signs, price needs to break past $2,600 before bulls can charge ahead. If Ethereum can push through that level, the road to $3,000 would look clear. Traders will watch for volume spikes and a steady move above those moving averages. If it fails, the big holders could be stuck on the sidelines, holding bags that lose value. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Bitcoin Whales Just Realized $2.6B In Profit, Is the Market About to Crack or Soar?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-whales-just-realized-2-6b-in-profit-is-the-market-about-to-crack-or-soar/",
      "summary": "Bitcoin remains within a relatively tight range, struggling to gain sufficient momentum to break the $110,000 mark. At the time of writing, the leading crypto by market cap trades at $106,437, down 1.1% over the past 24 hours and nearly 4.8% below its May all-time high. The current consolidation range between $105,000 and $107,000 has prompted close monitoring of market behavior, especially from whales and long-term holders (LTHs), as the market attempts to find its next direction. Related Reading: Bitcoin Dominance Shows Bearish Divergence – Altseason Could Be Near Bitcoin Whales Lead Market Activity as Profit Realization Surges Recent data from CryptoQuant suggests that a significant shift in realized profits on Binance may be influencing short-term price trends. CryptoQuant analyst Crazzyblockk highlighted a major event on June 16, when over $2.6 billion in profits were realized on Binance alone, the second-largest spike of its kind on the platform. This activity was followed by immediate selling pressure and market reaction, suggesting that profit-taking from large investors remains a core factor in the current price movement. According to Crazzyblockk, the June 16 event saw a total of $4.5 billion in realized profits across centralized exchanges, with Binance accounting for nearly 58% of that volume. “This milestone is more than just a data point — it’s a reminder of Binance&#8217;s unmatched influence on global crypto markets,” the analyst wrote. He emphasized Binance’s role in price discovery and how whale behavior on the platform often serves as a proxy for broader market sentiment. As institutional participants and high-net-worth investors execute large moves on Binance, their actions can foreshadow phases of trend reversals or sustained accumulation. The data also shows the importance of tracking realized profit and loss (PnL) metrics, especially on high-volume exchanges. The event reflects what Crazzyblockk described as “strategic profit-taking by sophisticated participants,” many of whom rely on Binance&#8217;s infrastructure for executing high-liquidity trades. Long-Term Holder Selling Seen as Constructive Rotation In a separate QuickTake post, CryptoQuant analyst Yonsei Dent offered a different perspective by analyzing long-term holder activity. Dent observed that although Bitcoin has been trading sideways between $100,000 and $110,000 since May, on-chain indicators such as Spent Output Age Bands (SOAB) and Binary CDD show persistent selling from long-term holders. These are entities that have held their coins for more than six months, indicating a redistribution of supply. However, Dent argues that this selling may not imply weakness. “Despite this steady LTH selling, the price hasn&#8217;t broken down. This means the market is absorbing the sell pressure—implying new demand is coming in,” he explained. According to Dent, this dynamic, a rotation from older holders to new buyers, is common during mid-to-late stages of a bull market. Related Reading: Warning Signs? Long-Term Bitcoin Holders Take Profits as Leverage Spikes He also noted increased activity from coins held for one to three years, possibly reflecting profit-taking from previous cycle participants. Ultimately, Dent suggested the market may be undergoing a quiet redistribution, a phase that could lay the groundwork for future upside if buy-side demand remains strong. Featured image created with DALL-E, Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Wallet of Satoshi Partners With Spark To Offer Self-Custodial Bitcoin Lightning Experience",
      "link": "https://bitcoinmagazine.com/news/wallet-of-satoshi-partners-with-spark-to-offer-self-custodial-bitcoin-lightning-experience",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Wallet-of-Satoshi-Partners-With-Spark-To-Offer-Self-Custodial-Bitcoin-Lightning-Experience.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/wallet-of-satoshi-partners-with-spark-to-offer-self-custodial-bitcoin-lightning-experience\" rel=\"nofollow\"> </a></p> <p>Wallet of Satoshi will be in a beta version, bringing self-custody lightning wallets to Spark platform.</p> <p>"
    },
    {
      "title": "Figma Reveals $70M Bitcoin ETF Holdings, Plans to Buy $30M More",
      "link": "https://bitcoinmagazine.com/news/figma-reveals-70m-bitcoin-etf-holdings-plans-to-buy-30m-more",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Figma-Reveals-70M-Bitcoin-ETF-Holdings-Plans-to-Buy-30M-More.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/figma-reveals-70m-bitcoin-etf-holdings-plans-to-buy-30m-more\" rel=\"nofollow\"> </a></p> <p>The design software company invested $55M in a Bitwise Bitcoin ETF and got board approval to convert $30M USDC into Bitcoin.</p> <p>"
    },
    {
      "title": "DDC Enterprise Finalizes $528 Million Financing to Accelerate Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/DDC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DDC Enterprise Limited (NYSE: DDC) has officially closed its $528 million financing deal to expand its corporate Bitcoin strategy. The funding, led by Anson Funds with participation from Animoca Brands, Kenetic Capital, and others, is one of the largest Bitcoin-focused capital raises by a NYSE-listed company.&#160; “This maximum aggregate $528 million capital commitment marks a [&#8230;]</p> <p>"
    },
    {
      "title": "Eric Trump’s American Bitcoin Raises $220 Million in Private Stock Sale To Buy More BTC",
      "link": "https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Gryphon-to-Merge-with-Eric-Trumps-American-Bitcoin-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc\" rel=\"nofollow\"> </a></p> <p>The Hut 8 sold over 11 million shares to investors, securing $215 million in net proceeds to expand its Bitcoin holdings and mining operations.</p> <p>"
    },
    {
      "title": "The One Big Beautiful Act Passes in the U.S. Senate — Without Bitcoin Tax Amendment",
      "link": "https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/One-Big-Beautiful-Act-Bitcoin-Magazine.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment\" rel=\"nofollow\"> </a></p> <p>Despite a push from Senator Cynthia Lummis (R-WY), an amendment regarding de minimus capital gains exemption on crypto spending was not included in the version of the One Big Beautiful Act that passed in the Senate.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Figma Eyes Further Bitcoin Exposure in Run-Up to Hopeful NYSE Debut",
      "link": "https://decrypt.co/328130/figma-bitcoin-exposure-nyse-debut",
      "summary": "Figma’s $69.5 million Bitcoin ETF holding now accounts for 4.5% of its cash and securities portfolio, the company revealed Tuesday."
    },
    {
      "title": "Paging Dr. Algorithm: Microsoft’s AI Diagnoses Like House, Bills Like Costco",
      "link": "https://decrypt.co/328095/microsofts-ai-diagnoses-like-house-bills-like-costco",
      "summary": "In head-to-head tests, Microsoft’s virtual medical council diagnosed correctly four times more often than human doctors, and at a lower cost."
    },
    {
      "title": "Hotels Are Staffing Robots—and Guests Are Freaking Out",
      "link": "https://decrypt.co/328073/hotels-staffing-robots-guests-freaking-out",
      "summary": "Hotels are turning to humanoid robots, with guests either loving or hating the creepy, human-like experience."
    },
    {
      "title": "Cloudflare Hits the Kill Switch on AI Crawlers—And an Entire Industry Cheers",
      "link": "https://decrypt.co/328057/cloudflare-hits-kill-switch-ai-crawlers-entire-industry-cheers",
      "summary": "The world’s largest internet security provider just defaulted to blocking AI crawlers—and lets publishers set a price for scraping."
    },
    {
      "title": "High on DOGE? Cannabis Company Makes Dogecoin Treasury Play",
      "link": "https://decrypt.co/328071/high-doge-cannabis-company-dogecoin-treasury-play",
      "summary": "Publicly traded cannabis company Dogecoin Cash Inc. is embracing the real DOGE after previously stockpiling a derivative meme coin."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Kraken elected as Super Representative on the TRON network",
      "link": "https://cryptobriefing.com/tron-super-representative-kraken-election/",
      "summary": "<p>Kraken's role as a Super Representative on TRON enhances network security and efficiency, boosting institutional trust and blockchain adoption.</p> <p>"
    },
    {
      "title": "Figma IPO filing shows $70M in BTC ETFs, gets board nod for $30M more",
      "link": "https://cryptobriefing.com/bitcoin-corporate-treasury-figma/",
      "summary": "<p>Figma's S-1 reveals $70M in Bitcoin ETFs and board approval for $30M BTC via USDC, highlighting its Bitcoin corporate treasury strategy.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus inks $100M funding deal with Ripple Strategy Holdings to support XRP reserve strategy, stock jumps 130% intraday",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy-funding/",
      "summary": "<p>Webus' strategic funding deal could enhance its market position in crypto mobility, potentially influencing blockchain adoption in related sectors.</p> <p>"
    },
    {
      "title": "SEC approves Grayscale’s proposal to convert BTC, ETH, XRP, ADA large-cap fund into a spot ETF",
      "link": "https://cryptobriefing.com/crypto-spot-etf-sec-approval/",
      "summary": "<p>The SEC's approval signals growing acceptance of crypto assets in traditional finance, potentially boosting market legitimacy and investor access.</p> <p>"
    },
    {
      "title": "SEC considers allowing crypto ETFs to launch without 19b-4 filing",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec/",
      "summary": "<p>Streamlining crypto ETF approvals could accelerate market growth, enhance investor access, and influence global regulatory approaches.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Cynthia Lummis’ crypto tax: Will Bitcoin miners see much-needed relief?",
      "link": "https://ambcrypto.com/cynthia-lummis-crypto-tax-will-bitcoin-miners-see-much-needed-relief/",
      "summary": "<img alt=\"Cynthia Lummis&#039; crypto tax: Will Bitcoin miners see much-needed relief?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Cynthia-Lummis-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Senator Lummis wants crypto taxed only on sale."
    },
    {
      "title": "45 mln MOVE pulled from Binance – Will bulls stay in control?",
      "link": "https://ambcrypto.com/45-mln-move-pulled-from-binance-will-bulls-stay-in-control/",
      "summary": "<img alt=\"45 mln MOVE pulled from Binance - Will bulls stay in control?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Buybacks by Movement Labs could be a hint of a potential trend to the upside."
    },
    {
      "title": "Is this the future of Wall Street? Robinhood brings U.S. stocks on-chain in Europe",
      "link": "https://ambcrypto.com/is-this-the-future-of-wall-street-robinhood-brings-u-s-stocks-on-chain-in-europe/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-8.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A 131% surge in HOOD stock followed the news, but adoption and regulation remain key."
    },
    {
      "title": "SYRUP pulls back to $0.5, but there’s an opportunity ahead",
      "link": "https://ambcrypto.com/syrup-pulls-back-to-0-5-but-theres-an-opportunity-ahead/",
      "summary": "<img alt=\"SYRUP pulls back to $0.5, but there&#039;s an opportunity ahead\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/SYRUP-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The daily price chart showed that SYRUP bulls remained dominant, and traders can look to buy."
    },
    {
      "title": "XRP price prediction – Bulls can reclaim $2.6 unless THIS happens first",
      "link": "https://ambcrypto.com/xrp-price-prediction-bulls-can-reclaim-2-6-unless-this-happens-first/",
      "summary": "<img alt=\"XRP price prediction - Bulls can reclaim $2.6 unless THIS happens first\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/XRP-price-prediction.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Over 1 billion XRP tokens have been bought and moved off exchanges in H1 2025."
    }
  ]
}