{
  "CoinDesk": [
    {
      "title": "Trump's CFTC Pick Says U.S. Can Boost Crypto Innovation and Shield Consumers",
      "link": "https://www.coindesk.com/policy/2025/06/10/trump-s-cftc-pick-says-u-s-can-boost-crypto-innovation-and-shield-consumers",
      "summary": ""
    },
    {
      "title": "Bitcoin Rises to $110K as Altcoins Rally; Traders Skeptical of Breakout",
      "link": "https://www.coindesk.com/markets/2025/06/10/bitcoin-rises-to-110k-as-altcoins-rally-traders-skeptical-of-breakout",
      "summary": ""
    },
    {
      "title": "Aptos' APT Rallies 4% Following Bullish Breakout on High Volume",
      "link": "https://www.coindesk.com/markets/2025/06/10/aptos-apt-rallies-4-following-bullish-breakout-on-high-volume",
      "summary": ""
    },
    {
      "title": "Solana's SOL Jumps 5% on Report of Spot ETF Development",
      "link": "https://www.coindesk.com/markets/2025/06/10/solanas-sol-jumps-5-on-report-of-spot-etf-development",
      "summary": ""
    },
    {
      "title": "Ether Roars Past $2,700; Popular Trader Declares ‘Beast Mode’",
      "link": "https://www.coindesk.com/markets/2025/06/10/ether-roars-past-usd2-700-popular-trader-declares-beast-mode",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin update to raise data limit on divisive OP_RETURN function",
      "link": "https://cointelegraph.com/news/bitcoin-op-return-data-limit-raise-next-update?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzViYjktYTkxMi03MTdkLWFjMDgtNDVlNzhhNDc2NGU1.jpg\" /></p><p>Bitcoin Core dev Gloria Zhao says the data limit for OP_RETURN will be raised in October, infuriating several Bitcoin users who prefer images, text and audio to stay off the blockchain.</p>"
    },
    {
      "title": "Ether price hits 15-week high: Will $1.8B in short liquidations send ETH above $3K?",
      "link": "https://cointelegraph.com/news/ether-price-hits-15-week-high-will-1-8b-in-short-liquidations-send-eth-above-3k?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGVhMDEtZGQ2OS03OGZjLTgyYTMtYzdhYjkwMmVhYjc4.jpg\" /></p><p>ETH open interest reached a record $40 billion as Ether price rallied above $2,800 for the first time in 15 weeks.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "ETH price tops $2.8K as options traders open bearish positions: Are bears wrong?",
      "link": "https://cointelegraph.com/news/eth-price-tops-2-8k-as-options-traders-open-bearish-positions-are-bears-wrong?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzViZDktNjQ3MC03N2MwLTkyM2UtOTVkNGU3ZGQyZWJk.jpg\" /></p><p>Ether price continues to show strength at $2,800 even as some traders embrace bearish options strategies. What gives?</p>"
    },
    {
      "title": "Ethereum Foundation highlights UX, social layer as security ‘challenges’",
      "link": "https://cointelegraph.com/news/ethereum-foundation-security-report-ux-social-layer-risks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzViYTUtZjBiZS03MGVlLWJhY2UtMTVlMjc2ZDgzNzdh.jpg\" /></p><p>According to the Ethereum Foundation, “a significant burden of security” still falls on users of digital assets.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin holding $100k psychological floor amid recent dip signals robust investor sentiment",
      "link": "https://cryptoslate.com/bitcoin-holding-100k-psychological-floor-amid-recent-dip-signals-robust-investor-sentiment/",
      "summary": "<p>On-chain data shows that Bitcoin&#8217;s (BTC) brief slide to $100,000 strengthened rather than weakened market structure, Glassnode said in a June 10 report. Bitcoin is currently trading at $109,500, after an over 4% climb on June 9 to hit a weekly high of $110,600. The report noted that the 9% drawdown following the June 7 [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation releases first 1TS outlining roadmap to tackle security challenges",
      "link": "https://cryptoslate.com/ethereum-foundation-releases-first-1ts-outlining-roadmap-to-tackle-security-challenges/",
      "summary": "<p>The Ethereum Foundation has released the first report in its most comprehensive security initiative to date, which maps the critical risks Ethereum (ETH) must address to support trillions in global on-chain value. The first Trillion Dollar Security (1TS) report outlines what individuals, institutions, and governments require to entrust significantly larger sums to the network. The [&#8230;]</p> <p>"
    },
    {
      "title": "SEC reportedly fast-tracks Solana ETFs: potential approval arrives within 5 weeks",
      "link": "https://cryptoslate.com/sec-reportedly-fast-tracks-solana-etfs-potential-approval-arrives-within-5-weeks/",
      "summary": "<p>The US Securities and Exchange Commission (SEC) asked would-be Solana exchange-traded fund (ETF) sponsors to file amended S-1 Forms within a week, Blockworks reported on June 10, citing three people familiar with the discussions. The sources said that the SEC has informed the issuers that it intends to respond within 30 days of the filings. [&#8230;]</p> <p>"
    },
    {
      "title": "Fortune 500 blockchain adoption hits 60% as institutions inject $50B into crypto funds in Q1",
      "link": "https://cryptoslate.com/fortune-500-blockchain-adoption-hits-60-as-institutions-inject-50b-into-crypto-funds-in-q1/",
      "summary": "<p>Fortune 500 companies and global asset managers continued to expand blockchain activity and allocations during the first half of 2025, according to Coinbase’s latest State of Crypto report. Six in ten Fortune 500 executives say their firms run on-chain initiatives, and the average number of projects per company jumped to 9.7 from 5.8 year on [&#8230;]</p> <p>"
    },
    {
      "title": "Blockchain Group wins approval for $11B raise to execute aggressive Bitcoin acquisitions",
      "link": "https://cryptoslate.com/blockchain-group-wins-approval-for-11b-raise-to-execute-aggressive-bitcoin-acquisitions/",
      "summary": "<p>The Blockchain Group on June 10 won shareholder approval to raise more than €10 billion ($11 billion) for additional Bitcoin (BTC) purchases effective immediately, formalizing a proposal first aired one day earlier. During an ordinary and extraordinary general meeting, investors holding 39% of voting rights backed every resolution with support exceeding 95%, according to a [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Owning 10,000 XRP? You’re Among Crypto’s Elite, Expert Claims",
      "link": "https://www.newsbtc.com/altcoin/owning-10000-xrp-youre-among-cryptos-elite-expert-claims/",
      "summary": "According to crypto entrepreneur Edoardo Farina, most individual XRP holders could find themselves shut out as inflation and tight budgets squeeze their options. He argues that owning more than 10,000 XRP – which costs about $23,100 at a price of $2.31 per token – has become a barrier for anyone living paycheck to paycheck. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Rich List Data Reveals Concentration Based on reports, there are about 6.55 million XRP wallet addresses in existence. Less than 4% of those wallets contain at least 10,000 XRP. A clear majority, over 5 million addresses, hold 500 XRP or fewer. That gap shows how stacked the system is. More than 166,250 wallets sit in the 10,000–25,000 XRP range. Another 159,566 wallets carry between 5,000 and 10,000 XRP. These figures point to a small group with deep pockets, while the rest trail far behind. Owning more than 10,000 $XRP nowadays is already a luxury few people can afford. — EDO FARINA 🅧 XRP (@edward_farina) June 9, 2025 Inflation Pressures Hit Small Holders Farina warns that rising inflation is forcing ordinary holders to sell just to cover daily needs. He notes, “We’re already seeing people around the world selling their XRP just to buy groceries.” When basic goods cost more each month, people feel they have no choice but to cash out their crypto. It’s a harsh reality. Owning large amounts of XRP has morphed from a luxury into a struggle for survival. Threshold Debate Heats Up He first said 95% of XRP holders risk being priced out. Now he’s raised that warning to 99%. That jump has sparked debate. Some worry it feeds a fear of missing out on a “10,000-XRP club,” while others see it as a wake-up call. Farina questions whether Bitcoin’s rally to about $112,000 really reflects growth, or simply the dollar losing its value. He frames the issue as a tug-of-war between crypto gains and fiat losses. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Calls For New Income Streams Instead of selling crypto, Farina urges holders to find extra income. He suggests side hustles or online work as ways to avoid cutting into holdings. “If you truly believe XRP has long-term value, selling it now for groceries is exactly what they want you to do,” he said. His advice pushes people to rethink how they earn and where they live. Crypto markets can move on legal news and product launches, not only inflation. Ripple’s ongoing court case and ETF filings could change XRP’s path. Still, Farina’s message taps into a broader concern: the gap between small and large holders may widen as prices climb. Retail investors can still join in. They just need to pace their buys and stay aware of both crypto trends and everyday costs. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Ethereum Approaches Decisive Level –  Trading Around 200 DMA Resistance",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-approaches-decisive-level-trading-around-200-dma-resistance/",
      "summary": "Ethereum is showing renewed strength after climbing above the $2,600 mark with ease, holding firmly above key support levels as bulls attempt to reclaim momentum. The move comes after weeks of range-bound price action, and while the breakout attempt has gained attention, traders are now watching closely for confirmation through a decisive push above the next resistance zone. Related Reading: Ethereum Weekly Structure Tightens – Tower Top Pattern In Play? So far, ETH has held up well despite broader market volatility. With buyers back in control, the focus has shifted to whether Ethereum can break through the upper boundary of its current range and begin a sustained move higher. Without follow-through, price risks slipping back into consolidation, frustrating bullish positioning. Top analyst Big Cheds recently shared a technical analysis highlighting that Ethereum is now pushing into weekly range highs, specifically a zone defined by a cluster of upper shadows and the underside of the 200-day moving average (DMA). This region has repeatedly acted as resistance, rejecting previous rally attempts. Ethereum Bulls Eye Breakout Confirmation Ethereum is at a critical juncture as bulls push price toward the $2,800 resistance — a level that must be decisively cleared to confirm a breakout and transition into a full bullish phase. After a sharp rebound from April’s low, where ETH traded near $1,400, the asset has surged more than 90%, reclaiming key moving averages and breaking through previous short-term resistance levels. Momentum is clearly building, but Ethereum now faces its most important test. The $2,800 zone marks the top of the current range and coincides with multiple technical barriers. Cheds highlighted that ETH is now trading into weekly range highs, where a cluster of upper shadows has repeatedly rejected price. This region also aligns with the underside of the 200-day moving average (DMA), reinforcing it as a major zone of resistance. According to Cheds, the bear thesis fails if ETH can flip $2,750 into support — a level that would likely signal trend reversal and sustained upside. However, macro risks remain. US Treasury yields continue to climb, reflecting concerns over inflation and tighter financial conditions. Rising yields often put pressure on risk assets, including cryptocurrencies, by pulling liquidity out of speculative markets. Despite these headwinds, Ethereum’s structure remains strong. As long as bulls maintain pressure and defend higher lows, the path toward reclaiming $3,000 becomes more probable. A confirmed breakout above $2,800 would likely trigger increased participation, both from technical traders and investors sidelined by recent volatility. Until then, ETH remains rangebound — but the momentum is clearly shifting in favor of the bulls. Related Reading: Ethereum Consolidates As Momentum Builds – Analyst Has $3K In Sight For June ETH Reaches Key Resistance Zone After Breakout Ethereum is currently trading at $2,688 on the 4-hour chart, after a strong breakout from a multi-day ascending triangle structure. The move was backed by rising volume and a clean reclaim of all major moving averages — the 50 SMA ($2,558), 100 SMA ($2,571), and 200 SMA ($2,535) — which now act as support beneath price. ETH has pushed directly into a key resistance zone between $2,690 and $2,735, highlighted by several previous rejection wicks. This area has acted as a supply zone since mid-May, capping every breakout attempt and leading to swift pullbacks. The current test marks Ethereum’s fifth attempt to break above this level in recent weeks, which increases the odds of a potential breakout, especially if bulls maintain momentum and volume remains elevated. Related Reading: Bitcoin And Ethereum Defend Key Moving Averages – Bullish Signal Or Temporary Relief? However, if ETH fails to clear this zone, a pullback toward the 200 SMA or the $2,600 level is likely, especially if volume tapers off. The structure remains bullish in the short term, with higher lows forming and buying pressure increasing. A confirmed 4H close above $2,735 would signal breakout confirmation and likely trigger a push toward $2,900–$3,000. Until then, ETH remains rangebound — but bulls are clearly pressing on the door. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Positioning For Altcoin Season: Analyst Reveals When To Buy As Bitcoin Dominance Rises",
      "link": "https://www.newsbtc.com/altcoin/impending-altcoin-season/",
      "summary": "As Bitcoin Dominance (BTC.D) rises in the crypto market, analysts are closely watching for signs of the long-awaited altcoin season. In a recent analysis, a crypto market expert shared key insights on the best time to buy altcoins, offering strategic guidance for traders looking to position themselves ahead of the next potential market rally. When To Position For The Altcoin Season As the Bitcoin price continues its upward trajectory, the speculation about an impending altcoin season remains a recurring theme across crypto communities. However, a Bitcoin Dominance chart shared by ‘Stockmoney Lizards,’ a pseudonymous crypto analyst on X (formerly Twitter), challenges the narrative that an altcoin season is imminent. Related Reading: The Return Of Altcoin Season: Why Bitcoin Dominance Must Fall To 62% Drawing on personal experience and market cycles, Stockmoney Lizards explains that the repeated cries of “altcoin season is here” are often premature and misleading. The analyst revealed that the true altcoin season, the period where even the lowest-quality coins tend to skyrocket, is often the final phase of the crypto bull run. It begins when Bitcoin Dominance breaks below the 60% support level, signaling a market-wide shift into altcoins. Notably, the analyst has shed light on how and when to position ahead of the altcoin season. Instead of buying altcoins based on hype or assumptions of immediate gains, Stockmoney Lizards suggests a more disciplined strategy: accumulate only at extreme oversold levels. This is typically when the Relative Strength Index (RSI) on the 4-hour or daily time frame drops below 25-30, reflecting capitulation. According to the market expert, these moments offer the best entry points for short-term rebounds, where altcoins deliver explosive moves of about 50% to 200%. The analyst further highlights that the primary objective is to take profits and rotate them back into Bitcoin. This approach not only maximizes gains but also minimizes exposure to prolonged drawdowns that usually follow the euphoric phase of the market cycle. Bitcoin Dominance Influence On AltSeason According to Stockmoney Lizards, the current behaviour of BTC.D, trading firmly between a well-defined channel, indicates that the market is still in the early to mid-phase of a bull run. Typically, this phase is dominated by Bitcoin, not altcoins, and history shows that institutional capital prefers to build positions in the flagship cryptocurrency before moving to riskier lower-cap assets. Related Reading: Bitcoin Price At $200,000 And Ethereum At $10,000? Analyst Says Altcoin Season Is Coming Notably, Bitcoin’s rising dominance in the market is not seen by the analyst as a bearish signal for altcoins in the long term. Instead, it is perceived as a healthy sign of a maturing bull market. He disclosed that the real altcoin season doesn’t begin until BTC.D decisively breaks down from its channel and drops to historical lows. Until then, Bitcoin’s strength reflects institutional accumulation and market confidence. Stockmoney Lizards reveals that retail investors often misinterpret this as a signal to chase altcoins, only to be caught holding bags as BTC continues to outperform. The analyst concludes that the altcoin season breakout will eventually come, but only those who position smartly by letting Bitcoin lead and waiting for alts to reach oversold extremes will be best prepared to capitalize on the market rally. Featured image from iStock, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Still Rangebound Below $2,735 Level – No Clear Breakout Yet",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-still-rangebound-below-2735-level-no-clear-breakout-yet/",
      "summary": "Ethereum is making waves in the crypto market, pushing into key resistance levels following an impressive 14% surge over the past few days. This upward momentum has put bulls firmly in control, igniting optimism among investors as the second-largest cryptocurrency by market cap tests critical thresholds. The recent rally has brought Ethereum close to a pivotal juncture, where breaking through higher levels could confirm sustained bullish momentum and potentially signal the start of a broader uptrend. Related Reading: Ethereum Weekly Structure Tightens – Tower Top Pattern In Play? Top analyst Daan recently shared an insightful analysis, highlighting that Ethereum remains rangebound between approximately $2,475 and $2,735. This consolidation zone has proven to be a battleground, with the price repeatedly testing its boundaries. Notably, Ethereum has now retested the range high of $2,735 for the fourth time, a level that has acted as both support and resistance in recent weeks. The price has also swept both the highs and lows within this range, suggesting a period of indecision that could precede a significant move. For bulls to maintain their dominance, clearing this resistance will be crucial. Failure to do so might invite renewed selling pressure, keeping the market on edge as traders watch for the next catalyst. Ethereum Clears Range Highs But Needs Confirmation Ethereum stands at a decisive level following a robust push into resistance, marking a critical moment for the cryptocurrency’s trajectory. After a notable surge, the price has tested key thresholds, drawing sharp attention from market participants. Sentiment remains deeply divided, with some analysts anticipating a breakout to higher prices, fueled by the recent momentum, while others predict an imminent correction as overextension risks loom. This uncertainty is compounded by global tensions and macroeconomic instability, which continue to drive volatility across financial markets, keeping traders on edge. Daan’s recent analysis provides a detailed perspective, noting that Ethereum remains rangebound between approximately $2,475 and $2,735. Within this zone, the price has swept both the highs and lows, reflecting a period of consolidation. Significantly, Ethereum has now retested the range high of $2,735 for the fourth time, a level that has repeatedly served as a psychological and technical barrier. According to Daan, this prolonged range play suggests that a breakout—either upward or downward—is on the horizon, likely triggering a substantial move. However, he cautions that until such a breakout occurs, it’s prudent to avoid overcommitting to either bullish or bearish positions. The analyst points out that over the past few weeks, traders have repeatedly bet on breakouts in both directions, only to face choppy conditions that often result in losses. This pattern of indecision has left many investors “chopped up,” as premature bets fail to materialize. With global economic uncertainties adding pressure, Ethereum’s next move hinges on whether bulls can decisively clear the $2,735 resistance or if bears will capitalize on a potential reversal. Until clarity emerges, the market remains a battleground of competing forces. Related Reading: Ethereum Consolidates As Momentum Builds – Analyst Has $3K In Sight For June Price Action Details: Key Levels To Clear Ethereum is trading at $2,690.46 on the 1-day chart, following a period of consolidation after a sharp decline. After finding support near $1,750 in April, ETH formed a tentative ascending triangle pattern, with recent price action testing key moving averages. The 50-day SMA ($2,310.51) and 100-day SMA ($2,077.91) have been breached upward, while the 200-day SMA ($2,657.01) remains a critical resistance, aligning with the current price zone. This move suggests short-term resilience, setting the stage for a potential test of the $2,750 resistance, a level retested four times since early 2025. A decisive daily close above $2,750, supported by rising volume, could pave the way for a push toward $3,000. The chart reveals rising lows since April, indicating accumulation and renewed buyer interest, particularly around the $2,500-$2,600 range. Increasing volume during recent upticks adds credibility to the breakout attempt, reducing the likelihood of a false move. Related Reading: Bitcoin And Ethereum Defend Key Moving Averages – Bullish Signal Or Temporary Relief? If ETH holds above $2,500, the trend leans bullish. However, a rejection at $2,750 might drive the price back to the $2,250-$2,400 support zone. The market remains rangebound between $2,475 and $2,735, per analyst Daan’s insights, with a breakout likely to trigger a significant move. All eyes are on whether ETH can clear $2,750 to confirm upward momentum. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Solana Bounces Back: Bullish Wave Builds Above $155 After Sharp Dip",
      "link": "https://www.newsbtc.com/news/solana/solana-bullish-wave-builds/",
      "summary": "In a recent post on X, crypto analyst Grayhoood observed that Solana (SOL) is currently showing signs of a bullish trend. Over the past 24 hours, the price has climbed by 2.8%, with candlestick charts revealing a noticeable upward trajectory. Solana Stochastics And CCI Signal Short-Term Strength Earlier in the day, SOL briefly dipped to around $151 but managed to recover steadily, reaching a current price of $155.35. Grayhoood pointed out that this short-term strength is consistent with Solana’s 7-day performance, which shows a modest 1.4% increase. However, the longer-term outlook remains volatile, with SOL still down by 3.9% over the past year. Related Reading: Solana Picture Bigger Than $420: Analyst Predicts 140% Surge To New ATHs Grayhoood revealed that technical indicators are suggesting a cautiously optimistic outlook for SOL. As price action continues to show signs of recovery, the Relative Strength Index (RSI) is likely positioned in a neutral zone, indicating the recent uptick. This positioning allows space for further gains, but also signals a potential shift into overbought territory if SOL’s price surges too rapidly. The Stochastic Oscillator and Commodity Channel Index (CCI) also point to short-term bullish momentum, especially with SOL breaking through the $154 resistance level. These indicators suggest that buyers are regaining control. However, Grayhoood cautioned that while momentum appears to be building, the recent price dip observed earlier in the day reveals that sellers are not entirely out of the picture. Recovery Gains Traction, But Yearly Losses Still Weigh In To further reinforce his claim, the analyst pointed to Solana’s moving averages, which currently present a mixed but insightful technical outlook. In the short term, the 7-day and 14-day moving averages hint at a hold or mild buying pressure. This aligns with SOL’s recent bounce from $151 to $155.35, signaling that momentum may be shifting in favor of the bulls. Related Reading: Solana’s Old Hands Are Moving—Is Trouble Brewing? However, when viewed from a broader lens, long-term averages continue to reflect lingering weakness. The 30-day and yearly trends, which show declines of 9.3% and 3.9% respectively, suggest that the larger market remains cautious. These figures reveal that while the recent gains are encouraging, they have not fully reversed the bearish structure seen over the past months. Overall, the analyst believes that despite the volatility seen over the past few weeks, market sentiment is beginning to lean bullish in the short term. Solana’s recent performance, supported by its ability to reclaim key levels and maintain upward momentum, offers a more favorable outlook heading into the near future. If current trends persist and key resistances are successfully challenged, the path may open for a broader shift in sentiment. Featured image from Adobe Stock, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Michael Saylor: The Bear Market Is Not Coming Back And Bitcoin Is Going To $1 Million",
      "link": "https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Michael-Saylor-The-Bear-Market-Is-Not-Coming-Back-And-Bitcoin-Is-Going-To-1-Million.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million\" rel=\"nofollow\"> </a></p> <p>In a Bloomberg interview, Strategy CEO Michael Saylor announces that Bitcoin is not going to zero, it is going to $1 million.</p> <p>"
    },
    {
      "title": "Bitwise Debuts First Ever GameStop Covered Call ETF",
      "link": "https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitwise.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf\" rel=\"nofollow\"> </a></p> <p>Today, Bitwise Asset Management announced the launch of the Bitwise GME Option Income Strategy ETF (IGME), the first-ever covered call ETF centered around GameStop (GME). The fund arrives at a moment where GameStop recently made headlines for its $500 million Bitcoin treasury strategy. Led by Bitwise’s Head of Alpha Strategies Jeff Park, IGME is the [&#8230;]</p> <p>"
    },
    {
      "title": "Economic Bitcoin Nodes: Why You Need To Use Your Node For It To Matter",
      "link": "https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BitcoinEconomicNOdes.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter\" rel=\"nofollow\"> </a></p> <p>Bitcoin nodes are what makes up the Bitcoin network, but without using them to verify your economic activity, they don't impact consensus. </p> <p>"
    },
    {
      "title": "Bitcoin Officially Traded Above $100,000 For 30 Consecutive Days For The First Time",
      "link": "https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Officially-Traded-Above-100000-For-30-Consecutive-Days-For-The-First-Time.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time\" rel=\"nofollow\"> </a></p> <p>Bitcoin holds above $100K for 30 days as states, banks, and companies accelerate adoption.</p> <p>"
    },
    {
      "title": "The Trump’s American Bitcoin Merges with Gryphon, Reports 215 BTC on Balance Sheet Since Launch",
      "link": "https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ABTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch\" rel=\"nofollow\"> </a></p> <p>American Bitcoin Corp (ABTC), a newly formed private Bitcoin mining company backed by Eric Trump and Donald Trump Jr., announced in a June 10 SEC filing that it has acquired 215 Bitcoin (BTC) since launching operations on April 1, 2025. The reserve is currently valued at approximately $23 million, showing their drive and commitment to [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "OpenAI CEO Says We've Already Passed the “Superintelligence Event Horizon”",
      "link": "https://decrypt.co/324532/openai-ceo-says-weve-already-passed-the-superintelligence-event-horizon",
      "summary": "Sam Altman believes AI has crossed a key threshold into a new digital era of superintelligence."
    },
    {
      "title": "Bitcoin Steadies Near $110K as Traders Await Inflation Data, Fed Signals",
      "link": "https://decrypt.co/324534/bitcoin-steadies-near-110k-as-traders-await-inflation-data-fed-signals",
      "summary": "Bitcoin is trading close to two-week highs near $110,000 as investors await U.S. inflation data that may shape the Fed’s rate outlook."
    },
    {
      "title": "South Korea Stablecoin Bill to Allow Companies to Issue the Tokens: Report",
      "link": "https://decrypt.co/324507/south-korea-stablecoin-bill-allow-companies-issue-tokens-report",
      "summary": "Newly elected president Lee Jae-myung has been supportive of the industry in a country where crypto is popular."
    },
    {
      "title": "Blockchain Use Surging at Fortune 500, Smaller Firms: Coinbase",
      "link": "https://decrypt.co/324508/blockchain-use-soaring-fortune-500-smaller-firms-coinbase",
      "summary": "The exchange's latest State of Crypto report found that 60% of Fortune 500 companies were working on blockchain initiatives."
    },
    {
      "title": "Trump Sons-Backed American Bitcoin Has Amassed $23.7 Million in BTC",
      "link": "https://decrypt.co/324511/trump-sons-american-bitcoin-amassed-23-7-million-bitcoin",
      "summary": "The Bitcoin mining firm, which aims to go public as soon as this year, has 215 Bitcoin on its balance sheet, according to a recent SEC filing."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Pro-Bitcoin Scott Bessent emerges as candidate for next Fed chair",
      "link": "https://cryptobriefing.com/fed-chair-successor-bessent-powell/",
      "summary": "<p>Bessent's potential Fed chair candidacy highlights a shift towards integrating cryptocurrency perspectives in U.S. monetary policy.</p> <p>"
    },
    {
      "title": "Solana ETFs could be approved in 3-5 weeks, SEC signals openness to staking",
      "link": "https://cryptobriefing.com/solana-etf-approval-potential-signals/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional investment in crypto, enhancing market legitimacy and innovation.</p> <p>"
    },
    {
      "title": "Wall Street’s Guggenheim Treasury brings its flagship tokenized debt instrument to XRP Ledger",
      "link": "https://cryptobriefing.com/guggenheim-treasury-launches-tokenized-commercial-paper-xrp-ledger/",
      "summary": "<p>The integration of tokenized debt on the XRP Ledger could accelerate blockchain adoption in traditional finance, enhancing liquidity and efficiency.</p> <p>"
    },
    {
      "title": "Eric Trump-backed American Bitcoin discloses 215 BTC holdings",
      "link": "https://cryptobriefing.com/american-bitcoin-btc-disclosure/",
      "summary": "<p>The strategic focus on Bitcoin accumulation by American Bitcoin could influence market dynamics and drive broader adoption and infrastructure development.</p> <p>"
    },
    {
      "title": "French banking giant Société Générale confirms launch of new stablecoin on Ethereum and Solana",
      "link": "https://cryptobriefing.com/usd-coinvertible-launch-sg-forge/",
      "summary": "<p>Socit Gnrale's stablecoin launch signifies a pivotal shift in traditional banking towards embracing blockchain technology and digital finance.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Crypto stock winners and losers – MARA, RIOT gain but HOOD loses out",
      "link": "https://ambcrypto.com/crypto-stock-winners-and-losers-mara-riot-gain-but-hood-loses-out/",
      "summary": "<img alt=\"Crypto stock winners and losers - MARA, RIOT gain but HOOD loses out\" class=\"attachment-full size-full wp-post-image\" height=\"853\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Crypto-stocks-rise.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1516\" />Beyond Bitcoin's rise, what pivotal market events are truly reshaping crypto investments?"
    },
    {
      "title": "Why is crypto up today? Bitcoin in a short squeeze as U.S-China talks fuel rally",
      "link": "https://ambcrypto.com/why-is-crypto-up-today-bitcoin-in-a-short-squeeze-as-u-s-china-talks-fuel-rally/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Why-is-crypto-up-today-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Experts remain cautious despite the early week Bitcoin pump."
    },
    {
      "title": "PENGU hits key support after 11% jump—Is a breakout imminent?",
      "link": "https://ambcrypto.com/pengu-hits-key-support-after-11-jump-is-a-breakout-imminent/",
      "summary": "<img alt=\"PENGU\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lennox-5.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />After the 11% surge in a day, will PENGU maintain the upward momentum?"
    },
    {
      "title": "Ethereum staking hits new highs – Is ETH set for a big move now?",
      "link": "https://ambcrypto.com/ethereum-staking-hits-new-highs-is-eth-set-for-a-big-move-now/",
      "summary": "<img alt=\"ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-10-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />34.8M ETH is now locked as ETF buzz fuels optimism."
    },
    {
      "title": "BONK eyes ‘golden cross’ after 14 days of slump – What’s next for the price?",
      "link": "https://ambcrypto.com/bonk-eyes-golden-cross-after-14-days-of-slump-whats-next-for-the-price/",
      "summary": "<img alt=\"BONK\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/9EE202F2-8B83-4FB3-A716-720DF337C7BD.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BONK could reverse its downward trend. But how?"
    }
  ]
}