{
  "CoinDesk": [
    {
      "title": "Stablecoin Clearing Startup Ubyx Raises $10M Round Backed by Galaxy, Coinbase, Others",
      "link": "https://www.coindesk.com/markets/2025/06/17/stablecoin-clearing-startup-ubyx-raises-10m-round-backed-by-galaxy-coinbase-others",
      "summary": ""
    },
    {
      "title": "Bitcoin Cash-Bitcoin Ratio Smashes Triangle Pattern; HYPE Rally May Be Over",
      "link": "https://www.coindesk.com/markets/2025/06/17/bitcoin-cash-bitcoin-ratio-smashes-triangle-pattern-hype-rally-may-be-over",
      "summary": ""
    },
    {
      "title": "Polyhedra Blames Liquidity Attacks for Sudden 80% Price Drop in ZKJ, Promises Buyback",
      "link": "https://www.coindesk.com/tech/2025/06/17/polyhedra-blames-liquidity-attacks-for-sudden-80-price-drop-in-zkj-promises-buyback",
      "summary": ""
    },
    {
      "title": "Crypto Daybook Americas: Institutions Pile In as Bitcoin’s Favorable Asymmetry Persists",
      "link": "https://www.coindesk.com/daybook-us/2025/06/17/crypto-daybook-americas-institutions-pile-in-as-bitcoins-favorable-asymmetry-persists",
      "summary": ""
    },
    {
      "title": "XRP Jumps as Bulls Push Through Key Resistance Levels",
      "link": "https://www.coindesk.com/markets/2025/06/17/xrp-jumps-as-bulls-push-through-key-resistance-levels",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Watch these Bitcoin price levels ahead of Fed Chair Powell&#039;s speech",
      "link": "https://cointelegraph.com/news/watch-bitcoin-price-levels-ahead-of-fed-chair-powell-speech?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzY4MDItNmJkOC03Zjk1LTk2OTUtOGMxMDU3N2Q1NmRh.jpg\" /></p><p>Bitcoin price remains stuck below $110,000 ahead of the FOMC, with big overhead resistance at $112,000 in place and several key support levels below.</p>"
    },
    {
      "title": "RWA backing: How do issuers ensure 1:1 peg with tokenized assets?",
      "link": "https://cointelegraph.com/news/raw-backing-how-issuers-ensure-1-1-peg-tokenized-assets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGNiYjgtNTc5ZS03Nzk5LWJkMzktZDNmOThlMGZkOGY5.jpg\" /></p><p>The question of RWA backing is not primarily a technology question but is instead a subject to other considerations, industry executives say.</p>"
    },
    {
      "title": "Thailand approves five-year crypto tax exemption",
      "link": "https://cointelegraph.com/news/thailand-tax-exemption-crypto-income-five-years?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzJjODItZDUxZi03ZTA3LTgxZjItYjlhMjdhZjkyY2Ji.jpg\" /></p><p>Thailand’s crypto income tax waiver applies to crypto sales made through licensed crypto asset service providers from 2025 to late 2029.</p>"
    },
    {
      "title": "Gemini accuses CFTC enforcers of ‘trophy-hunting lawfare’ in 2022",
      "link": "https://cointelegraph.com/news/gemini-accuses-cftc-enforcers-lawfare-civil-case?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdjMDMtNmY4YS03Y2NlLWIzOTYtMmRjZWI4NDYyNTEy.jpg\" /></p><p>Gemini has accused the CFTC’s enforcement division of using a false whistleblower report to form its 2022 lawsuit against the crypto exchange.</p>"
    },
    {
      "title": "From OpenAI to blockchain: Joey Bertschler builds crypto wage access platform",
      "link": "https://cointelegraph.com/news/former-openai-employee-launches-crypto-wage-startup?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzdjZTktYzMzZi03MTM1LWI5MmUtN2VlNDIzY2RmNGM3.jpg\" /></p><p>Joey Bertschler, a former OpenAI employee, is building a crypto wage distribution system, Volante Chain, motivated in part by disillusionment with OpenAI’s culture.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "A16z backs EigenLayer’s EigenCloud rollout with $70 million EIGEN investment",
      "link": "https://cryptoslate.com/a16z-backs-eigenlayers-eigencloud-rollout-with-70-million-eigen-investment/",
      "summary": "<p>EigenLayer has introduced a new platform called EigenCloud, designed to bring verifiability and transparency to both blockchain-native and traditional applications. The launch, announced on June 17 in a statement shared with , introduces a unified system that leverages the power of EigenLayer&#8217;s ecosystem, including its native EIGEN token. Eigen Labs CEO Sreeram Kannan stated that [&#8230;]</p> <p>"
    },
    {
      "title": "Ark Invest dumps $51M in Circle shares amid 400% rally and valuation concerns",
      "link": "https://cryptoslate.com/ark-invest-dumps-51m-in-circle-shares-amid-400-rally-and-valuation-concerns/",
      "summary": "<p>Ark Invest, the investment management firm led by Cathie Wood, has sold off over $50 million of its holdings in Circle Internet Group (CRCL), the issuer of the USDC stablecoin. On June 16, Ark dumped 342,658 CRCL shares valued at approximately $51.7 million, based on the day&#8217;s closing price of $151.06, according to Yahoo Finance [&#8230;]</p> <p>"
    },
    {
      "title": "Lawmakers think stablecoins are GENIUS: Inside the new US stablecoin bill",
      "link": "https://cryptoslate.com/market-reports/lawmakers-think-stablecoins-are-genius-inside-the-new-us-stablecoin-bill/",
      "summary": "<p>"
    },
    {
      "title": "Coinbase CEO Brian Armstrong seen at 10 Downing Street amid push for UK crypto overhaul",
      "link": "https://cryptoslate.com/coinbase-ceo-brian-armstrong-seen-at-10-downing-street-amid-push-for-uk-crypto-overhaul/",
      "summary": "<p>Coinbase CEO Brian Armstrong recently met with senior policymakers in the United Kingdom to support the country&#8217;s ongoing efforts to shape clear crypto regulations. In a June 16 post on X, Armstrong revealed he had been in London, pictured outside Downing Street, for discussions focused on positioning the UK as a leading crypto hub. While [&#8230;]</p> <p>"
    },
    {
      "title": "Elizabeth Warren criticizes GENIUS Act over stablecoin concerns ahead of final vote",
      "link": "https://cryptoslate.com/elizabeth-warren-criticizes-genius-act-over-stablecoin-concerns-ahead-of-final-vote/",
      "summary": "<p>Senator Elizabeth Warren has voiced fresh concerns about the GENIUS Act, a bill designed to regulate stablecoins in the US financial system, ahead of its final vote scheduled for later today. In a June 16 statement on X, Warren claimed the bill could allow billionaires to launch stablecoins that monitor user activity and gain an [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana ETF Nears Approval – Don’t Miss Your Chance to Buy Solaxy, the First $SOL Layer-2",
      "link": "https://www.newsbtc.com/news/solana-etf-is-next-last-chance-to-buy-solaxy/",
      "summary": "Here’s a list of the people who think a Solana ETF is incoming: everyone. And here’s a list of the people who think a $SOL ETF could send Solana – and Solaxy, a much-needed Solana Layer 2 – sky-high: also everyone. That’s right, Solana is gaining serious momentum. Cantor Fitzgerald&#8217;s analysts report that Solana-focused firms DeFi Development, Upexi, and SOL Strategies will raise each raise $250M this year for various crypto-related efforts, including $SOL treasuries. Both the pending $SOL ETFs and current treasury efforts underscore SOL&#8217;s strengths: a unified, low‑cost, and high‑throughput blockchain that enables native staking yields and positions it as an attractive treasury asset. And how does this impact side projects like Solaxy, Solana&#8217;s first-ever Layer-2 chain? Let&#8217;s discuss below. Solana’s TVL Climbs as ETFs Loom Solana’s Total Value Locked (TVL) now exceeds $8B, and it maintains a vibrant developer base. Today&#8217;s treasury strategies are shifting accordingly, favoring scalable, productive blockchains alongside traditional reserve assets like Bitcoin. Simultaneously, CoinShares joined other financial heavyweights in filing for a spot Solana ETF, featuring staking components and third-party custody via Coinbase and BitGo. The filing aims to address SEC concerns about redemption and staking. While there’s no timeline on the SEC’s response and potential approval, analysts anticipate potential approvals in late summer or early fall 2025. It’s worth noting that CoinShares’s filing was one of 8 on the same day for new $SOL ETFs. Why the rush? In part because Solana is enjoying steadily growing adoption, despite relatively lackluster $SOL price performance. Strategy’s Treasury Strategy Expands to Solana As the drumbeat of Michael Saylor’s Bitcoin strategy goes on, companies beyond (Micro)Strategy are joining the bandwagon. After all, who doesn’t want their very own pile of crypto? And in this case, companies are applying it to $SOL as well. DeFi Development Corp notified the SEC back in April that it intended to sell $1B in securities to purchase $SOL. SOL Strategies, based in Canada, did the same in late May. What does this mean for investors? At least three possibilities: ⬆️ SOL could be moving into the mainstream, attracting attention as a yield-generating asset thanks to its staking model and institutional embrace. ✅ Approval of spot $SOL ETFs would dramatically lower barriers to $SOL exposure through traditional brokerage venues. 📊Continued technological adoption and treasury-level interest could propel SOL further, though regulatory black swans and market volatility remain risks. Solana stands at a pivotal junction, even as $SOL treasuries take off and Solana meme coins continue to get attention. And the core Solana technical advantages – low fees, fast transactions – will get supercharged as Solaxy wraps up a dynamite presale. Solaxy ($SOLX) – $54M Raised as Time Runs Out for Groundbreak Layer-2 Presale $53.9M raised in its official presale – but with interest still sky-high, Solaxy ($SOLX) has opened a six-day window for investors to join the action. Solana loyalists and meme coin enthusiasts, drawn by Solaxy’s potential as the first-ever Solana Layer 2, have added another $2M after the presale ended on Monday. That potential is taking shape with the Testnet Block Explorer and Bridge already live. The full launch schedule kicks in with the Token Claim on June 23, then builds out with a Mainnet Launch and bridge connecting Solana, Ethereum, and Solaxy. Multichain functionality is built into Solaxy from launch, with full Layer 2 deployment as the crowning achievement of a red-hot crypto presale. With Solana interest peaking at just the right time, how far could Solaxy go? Our own price prediction shows the token could reach $0.032, up 1,700% from its current $0.001766. What is Solaxy? It’s the future of an already dynamic blockchain, combining Solana’s speed and low costs with Ethereum’s rock-solid framework and incredible ability to scale. Learn how to buy Solaxy, but don’t delay – this truly is the last chance to buy. Visit the Solaxy Presale Page. Solana Climbs Adoption Ladder – Will Solaxy Price Follow? Curiously, Solana’s price seems to lag its adoption. Even as institutions flock to $SOL treasuries and ETFs, the token price lags far behind $BTC’s impressive performance. Will Solaxy’s Layer 2 send both $SOLX and $SOL surging? Do your own research. This isn’t financial advice – crypto markets are always volatile."
    },
    {
      "title": "Wild XRP Prediction: Crypto Founder Sees $10K Price Tag—Here’s When",
      "link": "https://www.newsbtc.com/news/wild-xrp-prediction-crypto-founder-sees-10k-price-tag-heres-when/",
      "summary": "According to Digital Ascension Group’s Managing Director Jake Claver, XRP could reach a price level that brings a dramatic shift in how value moves on its network. He argues that higher token prices make the system more efficient. Claver even lays out a bold target of $10,000 per XRP, and he says that can happen within 24 months. The idea has reignited talk of crypto’s next big rally. Related Reading: Record‑High Ethereum Open Interest Signals Institutional Confidence Price And Liquidity Efficiency According to Claver, moving large sums on the XRP ledger depends on token price. At $1 per XRP, you need 1,000,000 tokens to shift $1 million. If the price rose to $10, only 100,000 tokens would do the job. And in a world where one XRP costs $1 million, a single token could cover that same $1 million transfer. This math shows why Claver believes price and network efficiency go hand in hand. Does XRP need to be a certain price to move large amounts of money? pic.twitter.com/tbqBbvST4y — Jake Claver, QFOP (@beyond_broke) May 27, 2025 Market Cap Implications XRP trades near $2.24 today, with a market cap of about $131.7 billion. At $10,000 per token, that cap would swell to over $585 trillion. Claver treats that huge number as a sign of strength rather than a warning. He says market cap rules don’t apply the same way to XRP. But critics point out you can’t assume that every token sits ready to trade. Actual liquidity comes from orders on exchanges and funds in liquidity pools, not just a headline market cap. Timeline And Skepticism Claver doesn’t shy away from timing. He told his followers that the $10,000 mark could arrive within 24 months. Some hear that as a call to buy now. Others see it as wildly optimistic. To reach that level, XRP would need to climb more than 500,000% from today’s price. Even Bitcoin, with far more adoption, took about four years to go from $1,200 to $68,000 in the last cycle. Cranking out a similar or bigger gain in half the time would require huge new demand. Community Reaction And Risks Based on reports, Claver’s claim has attracted both cheers and jeers. Some XRP fans embrace the vision. Others worry it sets unrealistic hopes. Alex Caraco, former CEO of an Australian stock market firm, summed up a common view: “It’s sad to see buyers sold the story of $10,000 XRP happening tomorrow.” Critics say such talk distracts from real issues like regulatory hurdles, exchange listings and developer growth. Related Reading: Amid Bitcoin Hype, Seasoned Trader Predicts Sudden Drop To This Level XRP Price Forecast XRP is expected to dip slightly—by around 0.70%—with projections placing its value at $2.23 by July 17, 2025. Current indicators paint a neutral market mood, with the Fear &#38; Greed Index leaning heavily toward Neutral at a score of 57. Over the past month, XRP has closed in the green on 16 out of 30 days, experiencing a modest 3.70% in price swings. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Bear Signal Lingers On Dogecoin—Here’s Why That’s Bullish",
      "link": "https://www.newsbtc.com/news/dogecoin/bear-signal-dogecoin-why-thats-bullish/",
      "summary": "Dogecoin’s Market-Value-to-Realised-Value (MVRV) Z-Score is printing just 0.28 – a level normally associated with capitulation, not euphoria. Yet the price of the ninth-largest cryptocurrency keeps carving a succession of higher highs and higher lows on the weekly chart, trading near $0.17 with a market capitalisation of roughly $26 billion in Monday’s late-New-York session. The juxtaposition between lethargic on-chain sentiment and resilient spot bids was laid bare in a chart posted to X by Kevin, the pseudonymous analyst behind @Kev_Capital_TA. “Dogecoin MVRV Score is still at bear-market levels while price continues to make higher highs and higher lows on higher time frames,” he wrote. Kevin also pointed out that previous cycle tops saw the Z-Score blow off at ≈11 in 2017 and ≈16 in 2021, whereas the current advance has so far peaked at 3.5. “#DOGE … has not seen a real bull run yet. This delay in durable Altcoins out-performance is very much due to restrictive monetary policy… It will change at some point and Alts will have their day in the sun.” The Macro Backdrop For Dogecoin The “restrictive monetary policy” Kevin cites remains the single most important head-wind for the entire alt-coin complex. In the US, the Federal Reserve has held the fed-funds target at 4.25 %–4.50% since January, having already delivered three cuts in 2024. Related Reading: Dogecoin Must Hold This Level—Or Risk A 30% Price Crash Futures markets this week imply the first additional reduction “around September or later,”after soft May inflation but a still-solid economy At the same time the Fed is only slowing — not stopping — quantitative tightening: beginning 1 April the monthly Treasury run-off cap fell to $5 billion from $25 billion, but Chair Jerome Powell made clear “there is no sign yet the Fed is ready to end QT.” In Europe, the ECB has started to nudge borrowing costs lower, slicing the deposit rate to 2% on 5 June. President Christine Lagarde nevertheless insisted the Governing Council was “in a good position” to move gradually and would keep quantitative easing “in the toolbox,” rather than redeploying it. Vice-President Luis de Guindos was more explicit yesterday, telling Reuters that the ECB had “learned much more about side effects” of money printing and that the bar for new QE is now “higher.” The net result is a world in which policy rates are still comfortably above neutral, liquidity is being drained by the Fed, and European officials are determined not to repeat the 2015-21 experiment of perpetual bond-buying. In Kevin’s words, this “delay” in easy money explains why alt-coins have under-performed Bitcoin so far in the 2024-25 cycle. Reading The MVRV Tea Leaves MVRV compares the aggregate market value of all coins with the value at which they last moved on-chain (their realised value). A Z-Score normalises that ratio against its own multi-year mean and standard deviation. Historically for Dogecoin, values above +9 have coincided with secular tops (January 2018; May 2021), values between –1 and +1 have appeared during long lateral “crypto winters,” and values below –1 have signalled deep capitulation and, in hindsight, exceptional long-term entry points. Related Reading: $8 Dogecoin? Analyst Says You’ll Regret Sleeping On This Chart Today’s 0.28 sits squarely inside the winter band even though spot DOGE is up roughly 5x from its 2022 lows. The same disparity is visible within the chart: the blue line (market cap) has been rising since late 2023, while the red Z-Score remains pinned near zero because the orange line (realised cap) is climbing almost in lock-step as dormant supply changes hands at higher cost basis. In plain English, the average on-chain holder is not yet sitting on the kind of paper profits that breed euphoria. When Could Policy Turn From Restrictive To Supportive? Futures markets now look for two quarter-point Fed cuts by December, taking policy to roughly 3.75%. Market-implied odds of a September move fluctuate with each inflation print; should shelter and services dis-inflation stall, traders will push expectations into 2026. However, neither the Fed nor the ECB is openly contemplating new asset purchases. Powell told reporters in March that the slower pace of QT is designed to “extend how far the central bank can run QT before needing to stop,” not to hint at a reversal. In Frankfurt, de Guindos stressed that “sometimes it’s much easier to start using [QE] than to withdraw it,” signalling that any relaunch would require either a financial-stability shock or a deep recession. With QT still active and rate-cut trajectories shallow, a powerful systemic tail-wind for DOGE may not materialise until after the first Fed or ECB pause in balance-sheet contraction. If consensus is correct that QT ends late-2025 or early-2026, any prospective QE would be a story for the next downturn, not this upswing. Kevin’s interpretation hinges on potential energy. Because the Z-Score has not yet detached from its mean, Dogecoin can, in theory, absorb a fresh wave of retail and leverage-driven inflows without immediately flashing the kind of overheated signal that coaxed sellers in 2017 and 2021. Put differently, DOGE’s spring has not been compressed. Macro, however, remains the gating factor. “Buy them low and sell them high. Never get attached to your Alts,” the analyst reminds followers. For now, low MVRV suggests structural downside is limited, but cyclicality implies explosive upside will likely coincide with a convincing turn in global liquidity – a turn that the Fed and the ECB, by their own admission, are not yet ready to deliver. At press time, DOGE traded at $0.17387. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "On-Chain Analyst Warns: Bitcoin Peak Expected, Altcoins Facing -95% Plunge",
      "link": "https://www.newsbtc.com/bitcoin-news/on-chain-analyst-warns-bitcoin-peak-expected-altcoins-facing-95-plunge/",
      "summary": "As Bitcoin (BTC) and the broader cryptocurrency market show tentative signs of recovery following the most recent correction, a crypto analyst has made a bold statement suggesting that the market may have already reached its peak. BladeDeFi, in a recent post on X (formerly Twitter), warned followers that a significant downturn could be on the horizon, predicting a challenging summer ahead for the crypto space. Crypto Pump Or Trap? In his post, BladeDeFi emphasized that “crypto has already PEAKED” and forecasted a potential slump where alternative cryptocurrencies could see declines of up to 95%. He indicated that most indicators are flashing red, suggesting that the market is on the brink of a significant downturn. According to him, Bitcoin has already hit its all-time high early in the current cycle and is now trapped in a “slow-motion downtrend,” with each subsequent bounce becoming weaker than the last. Related Reading: Bitcoin Gold Rush 2.0? Treasuries Swell With 60 New Players The analyst pointed out a concerning trend: retail investors are becoming exhausted, while larger institutional players have begun to exit the market. Major firms like BlackRock, Fidelity, and MicroStrategy are reportedly rotating their investments and hedging their positions, often without making their actions overtly public. The analyst suggests that this shift leaves retail investors vulnerable, potentially left holding depreciating assets as liquidity in the market continues to dwindle. BladeDeFi also criticized the current market dynamics, warning that sudden price increases or “green candles” are often deceptive, serving only to entice late buyers into traps that lead to further losses. He noted that without new capital inflows—such as fresh stimulus or significant investment—the recent price pumps lack sustainability. The absence of liquidity means that any upward movements are likely to be fleeting, and the overall trend remains downward. Bitcoin Poised For Year-End Peak? Adding to the bearish sentiment, another analyst, Peppeso, echoed similar concerns, suggesting that the top of the 2025 bull market has already been established. Peppeso observed historical patterns in previous market cycles, noting that while bull markets have become longer, bear markets have shortened and softened in their impact. Despite this, Bitcoin has consistently reached all-time highs in the final months of each cycle, reinforcing Peppeso’s expectation of a peak around November or December 2025. Related Reading: Ethereum Consolidation Continues – Altseason May Follow A Clean Break Above Resistance The current market environment is further complicated by macroeconomic factors, including rising interest rates and increasing geopolitical risks. With uncertainty clouding the outlook, many investors are adopting a risk-off approach, leading to a sustained downtrend in the crypto market. Even popular memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) have experienced significant declines of 9% and 7% in the past week alone respectively, indicating that the hype surrounding these assets is fading. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Slows Down In June: Historical Data Says More Losses To Come",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-slowns-down-june/",
      "summary": "Ethereum is already seeing a slowdown for the month of June, suggesting that it is sticking to established historical trends for the month. With half of the month already gone, the altcoin is likely to finish out the month in the same trend, and the previous cycle data warns of further price crashes. But how far down will the Ethereum price go before it recovers? Ethereum Fighting The Bears In June According to data from the CryptoRank website, the month of June is the second-worst month for the Ethereum price historically. This comes down to its average and median returns, which sit at -6.56% and -5.65%, respectively, showing that returns for the month are likely to be red. It falls behind only the month of September, which has -10.7% average returns and -13.6% median returns. Related Reading: Shiba Inu Burn Explodes 3,194%: Can It Change The SHIB Price Trajectory? In the decade that the Ethereum cryptocurrency has existed, only a total of three years have the month of June ended in green. In contrast, six years have closed in the red, including back in 2024 when the Ethereum price tumbled 8.64% in June. So far, the month of June 2025 has seen very little gains, with CryptoRank data only showing a 0.20% increase at the time of writing. This suggests a continuation of the established bearish trend, especially with the bear still pushing down the price of Bitcoin, and the rest of the crypto market keeps going down with it. If the altcoin does stick to its historical performance, then it is possible that the price could break below $2,500 before the month is over. However, there is still the possibility of a recovery if the Bitcoin price does continue to rise. Bullish Sentiment Still Strong Despite the bearish trend of June, crypto analysts are still calling for higher prices for Ethereum. One analyst, Crypto Patel, predicts a possible short-term crash if the Ethereum price drops below $2,500. Patel believes $2,000 is next if this happens. However, long-term remains bullish as the crypto analyst believes Ethereum is headed for $10,000. Related Reading: Dormant Ethereum Wallet Awakens After 10 Years With Millions Worth Of ETH Another crypto analyst, Ash Crypto, pointed out that ETH is forming a possible golden cross, just one month after Bitcoin did. But unlike Bitcoin, which usually takes months to play out a golden cross trend, the crypto analyst says Ethereum will begin immediately, and the target from here is $3,500. Crypto analyst Lord of Alts also explained that Ethereum is actually playing out as expected, with three trends. The first is consolidation, then accumulation, before ending in a price expansion. Lord of Alts says ETH is entering this trend again and puts the price as high as $6,000 by 2026. Featured image from Dall.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Flash Releases Free Bitcoin Invoicing Tool with No Fees, KYC, or Custody",
      "link": "https://bitcoinmagazine.com/news/flash-releases-free-bitcoin-invoicing-tool-with-no-fees-kyc-or-custody",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Flash-Releases-Free-Bitcoin-Invoicing-Tool-with-No-Fees-KYC-or-Custody-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/flash-releases-free-bitcoin-invoicing-tool-with-no-fees-kyc-or-custody\" rel=\"nofollow\"> </a></p> <p>The new tool lets freelancers issue professional Bitcoin invoices without platform fees, identity checks, or third party control.</p> <p>"
    },
    {
      "title": "H100 Group Receives 144.8 BTC in Convertible Loan Deal",
      "link": "https://bitcoinmagazine.com/news/h100-group-receives-144-8-btc-in-convertible-loan-deal",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/H100-Group-Receives-144.8-BTC-in-Convertible-Loan-Deal-Now-Holds-169.2-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/h100-group-receives-144-8-btc-in-convertible-loan-deal\" rel=\"nofollow\"> </a></p> <p>H100 Group, Swedish health-tech firm, has received 144.8 BTC as part of a settlement tied to its convertible loan agreement, according to a company press release issued Monday. With this latest transaction, the Stockholm-based firm now holds a total of 169.2 BTC on its balance sheet. The 144.8 BTC was transferred as a part of [&#8230;]</p> <p>"
    },
    {
      "title": "Trump Media Files to Launch Bitcoin and Ethereum ETF",
      "link": "https://bitcoinmagazine.com/news/trump-media-files-to-launch-bitcoin-and-ethereum-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Trump-Media-Files-to-Launch-Bitcoin-and-Ethereum-ETF.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/trump-media-files-to-launch-bitcoin-and-ethereum-etf\" rel=\"nofollow\"> </a></p> <p>Trump Media &#38; Technology Group has filed a registration statement with the U.S. Securities and Exchange Commission to launch the Truth Social Bitcoin and Ethereum ETF, B.T. The ETF will directly hold Bitcoin and Ether, with an initial allocation of 75% Bitcoin and 25% Ether. Shares of the fund will be offered to investors to [&#8230;]</p> <p>"
    },
    {
      "title": "Michael Saylor and Pakistan’s Crypto Minister Bilal Talk Bitcoin and Global Investment",
      "link": "https://bitcoinmagazine.com/news/michael-saylor-and-pakistans-crypto-minister-bilal-talk-bitcoin-and-global-investment",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Michael-Saylor-and-Pakistans-Crypto-Minister-Bilal-Talk-Bitcoin-and-Global-Investment.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/michael-saylor-and-pakistans-crypto-minister-bilal-talk-bitcoin-and-global-investment\" rel=\"nofollow\"> </a></p> <p>Michael Saylor discussed how trust and leadership could attract global Bitcoin investments to Pakistan.</p> <p>"
    },
    {
      "title": "Senator Hagerty’s Vision Beyond The GENIUS Act: Make Tennessee A Hub For Bitcoin Mining",
      "link": "https://bitcoinmagazine.com/politics/senator-hagertys-vision-beyond-the-genius-act-make-tennessee-a-hub-for-bitcoin-mining",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Senator-Bill-Hagerty-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/senator-hagertys-vision-beyond-the-genius-act-make-tennessee-a-hub-for-bitcoin-mining\" rel=\"nofollow\"> </a></p> <p>While currently focused on stablecoin legislation, the Tennessee senator also has plans for Bitcoin mining and AI data centers in his home state.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "EigenLayer Gets $70M From a16z to Launch Off-Chain Verifiability Platform",
      "link": "https://decrypt.co/325503/eigenlayer-70m-a16z-verifiability-platform",
      "summary": "EigenLayer has secured $70 million for a platform that enables blockchain-grade verification for off-chain apps in AI, finance, and beyond."
    },
    {
      "title": "Ethereum and Solana Meme Coins PEPE, FLOKI, WIF Lead Losses as Market Dips",
      "link": "https://decrypt.co/325539/ethereum-solana-meme-coins-pepe-floki-wif-losses",
      "summary": "Meme coins Pepe, Floki Inu and Dogwifhat have led losses as the crypto market experiences a 3.5% pullback Tuesday morning."
    },
    {
      "title": "Bitcoin Price Holds Steady Amid Iran Conflict Fears",
      "link": "https://decrypt.co/325536/bitcoin-price-holds-steady-amid-iran-conflict-fears",
      "summary": "Analysts told they expect Bitcoin to remain stable until there is more clarity about the U.S. response to Middle East tensions."
    },
    {
      "title": "CRYPTO REBOUNDS AFTER MIDDLE EAST CONFLICT, HYPE KEEPS GOING HIGHER!",
      "link": "https://decrypt.co/videos/interviews/PIycV1Ic/crypto-rebounds-after-middle-east-conflict-hype-keeps-going-higher",
      "summary": "- FOMO HOUR LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. SOL lead rebound in majors after Iran-Israel news. HYPE hits another ATH. DRW Investments invests $100m in Trump Media. Metaplanet to issue $210m debt to buy BTC. Whales leading accumulation of ETH vs retail. Fidelity files S-1 for SOL ETF. Bybit launches on-chain liquidity network on SOL. Bybit adds gold, stocks & FX trading. Crypto near tipping point toward systemic risk: FSB. Coinbase, Gemini to receive MiCA licenses. Gotbit founder jailed on wash trading. Vietnam officially recognises crypto for regulations. Saylor set to advise Pakistan on BTC. 00:00:00 Kick Streaming Launches with Tyler Mando 00:04:32 Highlights From Recent Football Matches 00:09:06 Potential Escalation in the Strait of Hormuz 00:14:17 SPX and Bitcoin Market Update 00:19:06 Crypto Market Trends: Golden Bull Run and Alt Season Evolution 00:23:51 Tron's IPO and Controversial Investments 00:28:31 Giveaway and Raffle Entry Instructions 00:33:36 Potential Geopolitical Escalations: Iran and Global Markets 00:38:21 Meme Tokens Surge and Market Highlights LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    },
    {
      "title": "EU Risks Becoming Crypto ‘Flyover Zone’ Between US, Asia: Franklin Templeton",
      "link": "https://decrypt.co/325528/eu-crypto-flyover-zone-franklin-templeton",
      "summary": "The United States’ crypto-friendly approach has given the EU a shot in the arm as it mulls an update to 2023’s MiCA regulations."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Thailand exempts Bitcoin, crypto gains from tax to support entrepreneurs and innovation",
      "link": "https://cryptobriefing.com/thailand-crypto-tax-relief-innovation/",
      "summary": "<p>Thailand's tax exemption on crypto gains could boost its digital economy, attract global investors, and enhance entrepreneurial growth.</p> <p>"
    },
    {
      "title": "SEC, Ripple ask court to delay appeal proceedings pending August 15 update",
      "link": "https://cryptobriefing.com/sec-ripple-settlement-delay-request/",
      "summary": "<p>The delay in appeal proceedings could signal a potential shift towards more collaborative resolutions in regulatory disputes within the crypto industry.</p> <p>"
    },
    {
      "title": "X accounts tied to Pump.fun, ElizaOS, and GMGN suspended",
      "link": "https://cryptobriefing.com/x-account-suspensions-pump-fun-elizaos/",
      "summary": "<p>The suspension of these accounts could disrupt upcoming projects and impact investor confidence in decentralized platforms.</p> <p>"
    },
    {
      "title": "JPMorgan files ‘JPMD’ trademark, hinting at possible stablecoin offering",
      "link": "https://cryptobriefing.com/jpmorgan-stablecoin-trademark-application/",
      "summary": "<p>JPMorgan's trademark move could accelerate mainstream adoption of digital currencies, influencing financial markets and regulatory landscapes.</p> <p>"
    },
    {
      "title": "Eric Trump says he loves Justin Sun but denies involvement in Tron’s public debut plan",
      "link": "https://cryptobriefing.com/eric-trump-tron-statement/",
      "summary": "<p>Eric Trump's denial of involvement in Tron's debut highlights potential complexities in crypto market entries and the influence of high-profile endorsements.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Top 13 Telegram games of June 2025",
      "link": "https://ambcrypto.com/top-13-telegram-games-of-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1445\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/riho-kroll-m4sGYaHYN5o-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Telegram has become much more than just a messaging platform, and its importance in the [&#8230;]"
    },
    {
      "title": "ONDO whale dumps 2.69 mln tokens as bearish concerns persist: What now?",
      "link": "https://ambcrypto.com/ondo-whale-dumps-2-69-mln-tokens-as-bearish-concerns-persist-what-now/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-25.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />ONDO whale sells 2.69 million tokens worth $2.13 million amid concerns over more losses."
    },
    {
      "title": "Top 12 casinos to watch out for in June 2025",
      "link": "https://ambcrypto.com/top-12-casinos-to-watch-out-for-in-june-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/amit-lahav-HffApi3okak-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Crypto casinos are online gambling platforms similar to traditional casinos, offering players live dealer games, [&#8230;]"
    },
    {
      "title": "Analyzing Ethereum’s $1.29M whale action – A short squeeze in sight, IF..",
      "link": "https://ambcrypto.com/analyzing-ethereums-1-29m-whale-action-can-eth-bulls-force-a-squeeze/",
      "summary": "<img alt=\"ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_47_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum whale sells $1.29 millions as short liquidations surge and exchange inflows shrink hinting at a potential rally."
    },
    {
      "title": "Ripple sees 7x activity surge- Can it drive XRP to an all-time high?",
      "link": "https://ambcrypto.com/ripple-sees-7x-activity-surge-can-it-drive-xrp-to-an-all-time-high/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika2-1-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is XRP gearing up for a breakout Q3? All eyes on institutional flows."
    }
  ]
}