{
  "CoinDesk": [
    {
      "title": "Amber International Raises $25.5M to Expand $100M Crypto Reserve Strategy",
      "link": "https://www.coindesk.com/business/2025/07/03/amber-international-raises-255m-to-expand-100m-crypto-reserve-strategy",
      "summary": ""
    },
    {
      "title": "Ondo, Pantera Capital to Invest $250M in Real-World Asset Projects",
      "link": "https://www.coindesk.com/business/2025/07/03/ondo-pantera-capital-to-invest-250m-in-real-world-asset-projects",
      "summary": ""
    },
    {
      "title": "ETH Holds Firm as Strong U.S. Jobs Data Lifts S&P 500 and Nasdaq Composite to Record Highs",
      "link": "https://www.coindesk.com/markets/2025/07/03/eth-holds-firm-as-strong-u-s-jobs-data-lifts-s-and-p-500-and-nasdaq-composite-to-record-highs",
      "summary": ""
    },
    {
      "title": "SEC's Pause of Grayscale Fund Is Likely Temporary",
      "link": "https://www.coindesk.com/news-analysis/2025/07/03/sec-s-pause-of-grayscale-fund-is-likely-temporary",
      "summary": ""
    },
    {
      "title": "Sui Reclaims $3 After Week-Long Rally Sparked by Lion Group’s Treasury Plans",
      "link": "https://www.coindesk.com/markets/2025/07/03/sui-reclaims-usd3-after-week-long-rally-sparked-by-lion-group-s-treasury-plans",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "$20M crypto scam victim who sued Citibank says 2 more banks liable",
      "link": "https://cointelegraph.com/news/crypto-scam-victim-claims-2-more-banks-liable-20m-scheme?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmMyNjEtYzdlOS03OWE5LTk1MWQtOTdmNmM1MDVjY2Fh.jpg\" /></p><p>The victim of a $20 million crypto scam who sued Citibank last week for allegedly ignoring “red flags” has filed a similar complaint against two more banks.</p>"
    },
    {
      "title": "Solana treasury firm extends stock rally after buying $2.7M of SOL",
      "link": "https://cointelegraph.com/news/solana-treasury-firm-extends-rally-after-buying-sol?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjU5ZmQtYjY4MC03Y2E3LWExZDAtZDFmMTg5MzZhZDNj.jpg\" /></p><p>The company’s Solana stack is now worth almost $98 million. The firm’s stock price is up 2,733% year-to-date.</p>"
    },
    {
      "title": "Bitcoin solo miner banks $350K with 2.3 petahash in ‘incredible odds’",
      "link": "https://cointelegraph.com/news/bitcoin-solo-miner-wins-350-000-with-measly-2-3-petahash?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjFmNWYtNTdlOC03NGQ2LWFiNTctZjRkOGI3YjM4ZDU3.jpg\" /></p><p>A solo miner with just 2.3 petahashes successfully mined a Bitcoin block on Thursday, netting them $349,028 in rewards.</p>"
    },
    {
      "title": "Bitcoin bull run could peter out in 2-3 months, says analyst",
      "link": "https://cointelegraph.com/news/bitcoin-price-bull-run-coming-to-end-crypto-analyst-forecast?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2QzNzktMDA3Ny03ZmRkLWExYmMtMWViZTFjNGFiM2Jk.jpg\" /></p><p>Crypto analyst Rekt Capital says that while there’s a lot of talk about the Bitcoin cycle extending into 2026, traders should not “throw away time-tested principles.”</p>"
    },
    {
      "title": "US Republicans declare ‘Crypto Week’ to mull 3 crypto bills",
      "link": "https://cointelegraph.com/news/us-republicans-declare-crypto-week-to-mull-3-crypto-bills?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2E4NjAtNzVkOC03Mjg4LWJlYWQtYmY5NWM0YzdiMDE2.jpg\" /></p><p>US Republican leaders say the House will look to pass bills on stablecoins, crypto market structure and CBDCs in mid-July in what they’ve dubbed “Crypto Week.”</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "DeFi TVL breaks above $116B as lending roars back",
      "link": "https://cryptoslate.com/defi-tvl-breaks-above-116b-as-lending-roars-back/",
      "summary": "<p>The DeFi market has rebounded at the beginning of July, with total value locked (TVL) rising to $116.416 billion, a level last seen in April. The 24-hour increase of 4.95% reflects rising crypto asset prices and renewed deposit flows into lending protocols, restaking services, and yield-bearing primitives. As Ethereum and Solana continue to absorb most [&#8230;]</p> <p>"
    },
    {
      "title": "TRON DAO Joins EthCC as WAGMI Sponsor, Co-Hosts Events with MetaMask and Arkham",
      "link": "https://cryptoslate.com/tron-dao-joins-ethcc-as-wagmi-sponsor-co-hosts-events-with-metamask-and-arkham/",
      "summary": "<p>Geneva, Switzerland, July 3 2025 — TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and decentralized applications (dApps), proudly participated as a WAGMI Sponsor at the Ethereum Community Conference (EthCC), held from June 30 to July 3 in Cannes, France. As Europe’s largest annual Ethereum-focused event, EthCC [&#8230;]</p> <p>"
    },
    {
      "title": "Pantera, Ondo launch $250M fund to drive RWA tokenization",
      "link": "https://cryptoslate.com/pantera-ondo-launch-250m-fund-to-drive-rwa-tokenization/",
      "summary": "<p>Ondo Finance and Pantera Capital have launched a $250 million fund to accelerate investments in tokenized real-world assets (RWAs), Axios reported on July 3. According to the report, the fund, named Ondo Catalyst, will invest in equity stakes and tokens of projects developing tokenized versions of traditional financial assets. Ian De Bode, chief strategy officer [&#8230;]</p> <p>"
    },
    {
      "title": "Post-maintenance mishap on Solana’s Backpack triggers incorrect futures orders, balance reports",
      "link": "https://cryptoslate.com/post-maintenance-mishap-on-solanas-backpack-triggers-incorrect-futures-orders-balance-reports/",
      "summary": "<p>Backpack halted trading for scheduled maintenance at 10 a.m. UTC on July 3 and reopened two hours later, but the restart triggered account errors that forced CEO Armani Ferrante to promise reviews and compensation. Backpack had warned users on X that the platform would go offline at 10 a.m., enter post-only mode at noon, and [&#8230;]</p> <p>"
    },
    {
      "title": "Russian insurance firms unveil investment life policies tied to Bitcoin",
      "link": "https://cryptoslate.com/russian-insurance-firms-unveil-investment-life-policies-tied-to-bitcoin/",
      "summary": "<p>Two major Russian insurance firms, Renaissance Life and BCS Life Insurance, have launched investment life insurance policies (ILIPs) linked to Bitcoin, according to a July 2 local media report. According to the report, the innovative policies allow investors to gain exposure to BlackRock’s iShares Bitcoin Trust (IBIT), the largest Bitcoin ETF by assets under management. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Brushes $110K as Whales Pull Funds from Binance, What Are They Planning?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-brushes-110k-as-whales-pull-funds-from-binance-what-are-they-planning/",
      "summary": "Bitcoin’s upward momentum has returned, with the asset briefly crossing the $110,000 threshold before pulling back slightly. After hitting a 24-hour high of $110,117, Bitcoin now trades at $109,386, reflecting a 1.8% increase in the past day. This recent push places the asset about $2,000 surge away from its all-time high of $111,814, recorded in May 2025, prompting renewed attention from traders and analysts. While price movements often attract headlines, on-chain data has started signaling deeper market activity. Related Reading: Bitcoin Realized Dominance Signals Weak Hands Capitulating, Strong Hands Rising Binance Sees 3,400 Bitcoin in Outflows as Spot Volume Surges According to CryptoQuant analyst Amr Taha, a substantial volume of BTC has recently been moved off Binance, one of the world’s largest crypto exchanges. The shift aligns with anticipation around a series of US macroeconomic indicators, which historically tend to influence risk-on assets like Bitcoin. Taha highlighted that Binance recorded a net outflow of over 3,400 BTC in a single day. This occurred shortly after Bitcoin’s price breached the $109,000 mark. Large-scale withdrawals from exchanges such as Binance are often interpreted as a sign that holders may be preparing to hold their assets longer-term, or shielding their positions from potential short-term volatility. Simultaneously, Binance’s share of the global Bitcoin spot volume surged significantly, from 41% to 56% in just one session. Taha noted that this spike indicates increased reliance on Binance’s liquidity by traders seeking exposure to Bitcoin ahead of anticipated market-moving economic data. The outflow trend, paired with rising spot volume, suggests that traders are actively responding to broader market signals, especially from traditional finance. US Jobs Report Drives Market Positioning The current surge in Bitcoin activity coincides with heightened market focus on US labor market data, including the Non-Farm Employment Change, Unemployment Rate, and Average Hourly Earnings figures. These indicators are closely watched by investors as they influence inflation expectations and the Federal Reserve’s approach to interest rate adjustments. Shifts in rate expectations often have direct consequences for risk assets like Bitcoin, as changes in the cost of capital affect liquidity and investor appetite. Related Reading: Bitcoin Seasonality: Why Summer 2025 Will Catch Everyone Off Guard Taha suggests that the recent Binance outflows may reflect investor positioning ahead of potential macro-driven market volatility. “Bitcoin outflows from Binance alongside the sharp rise in spot trading activity… appear to show that investors are positioning for potential upside volatility,” he wrote. A favorable labor report could amplify bullish sentiment across both equity and crypto markets if it strengthens expectations of a rate cut or an extended pause in rate hikes. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Solana (SOL) Cools After Recovery — Resistance Proving Difficult to Crack",
      "link": "https://www.newsbtc.com/analysis/solana-sol-cools-155/",
      "summary": "Solana started a recovery wave above the $150 zone. SOL price is now correcting gains and might struggle to rise above the $155 resistance. SOL price started a fresh decline after it failed to clear $155 against the US Dollar. The price is now trading near $152 and the 100-hourly simple moving average. There is a key bullish trend line forming with support at $151 on the hourly chart of the SOL/USD pair (data source from Kraken). The pair could start a fresh increase if it clears the $156 resistance zone. Solana Price Trims Gains Solana price started a decent increase after it cleared the $150 resistance, like Bitcoin and Ethereum. SOL climbed above the $152 level to enter a short-term positive zone. There was a move above the 50% Fib retracement level of the downward move from the $160 swing high to the $144 low. However, the bears were active near the $156 resistance. They protected a move above the 76.4% Fib retracement level of the downward move from the $160 swing high to the $144 low. The price is now moving lower and trading below the $154 level. Solana is now trading near $152 and the 100-hourly simple moving average. There is also a key bullish trend line forming with support at $151 on the hourly chart of the SOL/USD pair. On the upside, the price is facing resistance near the $155 level. The next major resistance is near the $156 level. The main resistance could be $160. A successful close above the $160 resistance zone could set the pace for another steady increase. The next key resistance is $162. Any more gains might send the price toward the $165 level. Another Decline in SOL? If SOL fails to rise above the $155 resistance, it could start another decline. Initial support on the downside is near the $150 zone. The first major support is near the $146 level. A break below the $146 level might send the price toward the $142 zone. If there is a close below the $142 support, the price could decline toward the $136 support in the near term. Technical Indicators Hourly MACD – The MACD for SOL/USD is losing pace in the bullish zone. Hourly Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $150 and $146. Major Resistance Levels – $155 and $160."
    },
    {
      "title": "XRP Could Hit $50 If Ripple Gets Bank License, Claims Crypto Pundit",
      "link": "https://www.newsbtc.com/xrp-news/xrp-could-hit-50-if-ripple-gets-bank-license-claims-crypto-pundit/",
      "summary": "Vincent Van Code, a software engineer and long-time XRP advocate, ignited fresh debate across the crypto community by outlining what he believes to be the transformative implications of Ripple’s bid for a US banking charter and a Federal Reserve master account. The developments, which Ripple confirmed 2 July, would position the company at the epicenter of both crypto innovation and traditional financial infrastructure. According to Van Code, the impact of such regulatory approvals would go far beyond Ripple’s current operations. “With Ripple announcing they are seeking a banking charter as well as a Fed master account, this means they will be the very first crypto bank,” he posted via X. He detailed that the move could allow Ripple to hold reserves directly with the Federal Reserve, bypassing commercial banks, and operate as a full-service financial institution offering both fiat and crypto products. This would include the ability to provide FDIC-insured deposit accounts—potentially even for certain crypto assets—up to the $250,000 limit, and lend against crypto collateral such as XRP. “That’s going to be nuts. And XRP is flying it all together,” he wrote, calling the possible integration of insured crypto banking and core cross-border remittances a paradigm shift. “2025 to 2026 will be marked in history as the era which the 100 year banking cartel began to crumble.” Related Reading: Analyst: XRP Is Coiled For A Short Squeeze Rally A master account would allow Ripple to interact directly with the Fed&#8217;s payment rails, including Fedwire and FedNow, giving it full access to the US financial system as a settlement counterparty. Combined with its push into stablecoins through RLUSD and its remittance infrastructure RippleNet, such a regulatory leap could fully embed Ripple into both domestic and international payment flows. Impact On XRP Price In a follow-up post, Van Code did something he says he rarely does: offer a specific XRP price prediction. “I usually don’t predict XRP price but often get asked, so here it is FINALLY,” he wrote. “My opinion is $30–$50. And this is no shill, I don’t expect anyone to agree with me. I am not prophet or time traveller. But my investment in XRP is based on this opinion.” While he didn’t commit to a timeframe, he emphasized that such targets are not arbitrary, but grounded in a set of unfolding macro and market catalysts. Related Reading: Wave 3 Ignites As XRP Breaks Structure—Analyst Says ‘Fireworks Ahead’ Among those catalysts, Van Code cited potential XRP spot ETF approval and an estimated $20–$50 billion in institutional capital inflows. He also pointed to a potential master account approval coupled with RippleNet capturing 20–30% of the $1 trillion cross-border payments market, and global adoption of XRP as a bridge asset for central bank digital currency (CBDC) corridors in over 50 countries. Van Code further noted the rising use case for Ripple’s stablecoin RLUSD, arguing that demand for a Fed-backed digital dollar would reinforce XRP’s utility as a bridge currency. He also floated the idea that XRP could be used in Saudi oil settlements, citing Ripple’s confirmed 2024 collaboration with the Saudi central bank as a possible foundation for that evolution. His posts have struck a chord in the XRP community. “People weighed in on XRP price&#8230; Lots of interesting opinions. But common across all is everyone expecting price to at least 5x. This is a great sign,” he said. The idea that XRP could rise to $30–$50 implies a market cap in the trillions, something skeptics will call out as unrealistic. But for XRP holders, especially those who see Ripple’s regulatory path as a backdoor to institutional legitimacy, the confluence of a Fed master account, bank charter, ETF inflows, and global adoption isn’t merely theoretical. It’s a roadmap. At press time, XRP traded at $2.27. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "XRP Price Prepares for Possible Bounce — Support Levels In Focus",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-prepares-bounce-2-20/",
      "summary": "XRP price started a decent upward move from the $2.20 zone. The price is now correcting some gains and might find bids near the $2.220 zone. XRP price started a fresh increase above the $2.220 zone. The price is now trading above $2.220 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.2250 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another decline if it fails to stay above the $2.220 zone. XRP Price Faces Resistance XRP price started a fresh increase after it settled above the $2.20 level, like Bitcoin and Ethereum. The price was able to climb above the $2.220 resistance level. The bulls were able to push the price above the $2.250 level. However, the bears were active near the $2.320 level. A high was formed at $2.310 and the price is now correcting some gains. There was a move below the 23.6% Fib retracement level of the upward move from the $2.148 swing low to the $2.310 high. The price is now trading above $2.220 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.2250 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.2720 level. The first major resistance is near the $2.30 level. The next resistance is $2.320. A clear move above the $2.320 resistance might send the price toward the $2.350 resistance. Any more gains might send the price toward the $2.40 resistance or even $2.420 in the near term. The next major hurdle for the bulls might be $2.50. More Losses? If XRP fails to clear the $2.30 resistance zone, it could start another decline. Initial support on the downside is near the $2.2250 level and the trend line. The next major support is near the $2.20 level or the 61.8% Fib retracement level of the upward move from the $2.148 swing low to the $2.310 high. If there is a downside break and a close below the $2.20 level, the price might continue to decline toward the $2.150 support. The next major support sits near the $2.120 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.2250 and $2.20. Major Resistance Levels – $2.30 and $2.320."
    },
    {
      "title": "Under Stress: Tron Revenue Drops As Nearly $190M Flows Out",
      "link": "https://www.newsbtc.com/news/tron-under-stress-trx-revenue-drops-as-nearly-190m-flows-out/",
      "summary": "TRON’s token TRX has barely budged despite a flurry of on‑chain action. Traders saw a 5% gain over the past week and a measly 0.50% uptick in the last 24 hours. But behind those mild price moves, there’s a storm of activity that could shape how TRX fares in the days ahead. Related Reading: The Silent Bitcoin Accumulation: Public Companies’ Surprising H1 2025 Lead Surge In On‑Chain Activity According to data from Artemis, daily transaction counts shot up to over 9 million, up from 7.5 million the day before. That jump in numbers sent active addresses soaring. On‑chain participants climbed to 2.7 million, marking the highest level since June 6. Based on reports, much of this traffic appears tied to stablecoin transfers rather than new users or fresh investment. The spike in transaction volume doesn’t match TRX’s price action. That gap hints at wallets moving funds out of exchanges, routing payments, or chasing yield elsewhere. Users aren’t rushing to hold TRX for its own sake. They’re using the network as a highway and then driving off into other chains. TRX market cap currently at $26.8 billion. Chart: TradingView Stablecoin Outflows Hit Record High According to Artemis, TRON’s stablecoin supply hit $80 billion in June, setting a new milestone for the network. Since then, about $185 million worth of stablecoins have fled the chain. That outflow marks a sharp reversal in user habits. People who once parked their USDT and other tokens on TRON look to be shifting them to new destinations. The pullback follows a broader rotation in crypto markets where investors chase better rates or lower fees. TRON once drew crowds for its low transaction costs. Now, competing chains and Layer 2 platforms are undercutting its edge. That has cut into TRX’s role as the network’s workhorse token. Revenue And TVL Take A Hit Artemis figures show that TRX’s total revenue plunged to just $114,000 in a single day. That number sits at a four‑year low. Network fees in TRON come from “bandwidth” and “energy,” so when users batch transfers or switch to zero‑fee bridges, fee income collapses fast. Based on data from DeFiLlama, total value locked on TRON protocols fell by 0.50% in 24 hours, a drop from $4.80 billion to $4.85 billion. That’s about $26 million walking out the door. While a half‑percent move might look small, it underlines a trend. Every million dollars that leaves makes it tougher for lending pools and yield farms to keep their rates up. Related Reading: Long-Term Bitcoin Holders Near Pain Point Last Seen In October 2024 Despite the outflows, TRX hasn’t broken key support levels yet. It still trades above areas that buyers defended in late spring. But if TVL keeps sliding and stablecoins continue to exit, we could see more pressure on the token’s price. Featured image from P2P.org, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Senator Lummis’ New Bill Enables Tax-Exempt Bitcoin Spending — But Thresholds Are Too Low",
      "link": "https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Senator-Lummis-at-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start\" rel=\"nofollow\"> </a></p> <p>Long-time Bitcoin advocate Senator Cynthia Lummis (R-WY) has drafted a bill that allows Bitcoin enthusiasts to spend small amounts of bitcoin without incurring capital gains taxes (which is very cool), but many — including myself — feel that the spending limits in the bill are too low.</p> <p>"
    },
    {
      "title": "Senator Lummis Introduces Digital Asset Tax Legislation",
      "link": "https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/US-Senator-Cynthia-Lummis-Discusses-Bitcoin-Reserve-Stablecoin-Legislation-and-Market-Structure-Bill-at-Bitcoin-2025-Conference.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation\" rel=\"nofollow\"> </a></p> <p>The bill proposes a $300 exemption for small Bitcoin and crypto transactions, defers taxes on mining and staking until assets are sold.</p> <p>"
    },
    {
      "title": "Bitcoin Miner Riot Produces 450 Bitcoin In June",
      "link": "https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Miner-Riot-Produces-450-Bitcoin-In-June.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june\" rel=\"nofollow\"> </a></p> <p>The company saw a 76% year-over-year increase in production, earned $5.6 million in power credits, and ended the month holding 19,273 Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin at UATX: A New Era of Intellectual Sovereignty",
      "link": "https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_A_majestic_depiction_of_the_Texas_State_Ca_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty\" rel=\"nofollow\"> </a></p> <p>UATX’s Bitcoin Endowment and hands-on curriculum defy academia’s past. Students mine with Antminer S9s — could this shape Bitcoin’s academic future? </p> <p>"
    },
    {
      "title": "Blue Star Capital Secures £1.25M For Bitcoin and Crypto Treasury Expansion",
      "link": "https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Blue-Star-Capital-Secures-1.25M-For-Bitcoin-and-Crypto-Treasury-Expansion.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion\" rel=\"nofollow\"> </a></p> <p>The funding will be used to expand SatoshiPay’s Bitcoin and crypto treasury and enhance its crypto operations. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Detroit Sues Crypto Real Estate Platform Over Safety, Health Violations",
      "link": "https://decrypt.co/328586/detroit-sues-crypto-real-estate-platform-safety-health-violations",
      "summary": "The city alleges the asset tokenization platform left hundreds of properties in disrepair, even as it promised significant returns."
    },
    {
      "title": "UK and Singapore Forge New AI and Tokenization Pact in London Talks",
      "link": "https://decrypt.co/328583/uk-singapore-ai-tokenization-pact-london-talks",
      "summary": "Officials are exploring cooperation in digital finance, ranging from asset tokenization to artificial intelligence."
    },
    {
      "title": "Japan's Minna Bank Explores Stablecoins on Solana in Fireblocks-Led Study",
      "link": "https://decrypt.co/328372/japans-minna-bank-stablecoins-solana-fireblocks-study",
      "summary": "The study will examine whether stablecoins are suitable for modernizing payments and cross-border finance in Japan."
    },
    {
      "title": "House GOP Declares ‘Crypto Week’ to Advance Landmark Digital Asset Bills",
      "link": "https://decrypt.co/328567/house-gop-crypto-week-advance-landmark-digital-asset-bills",
      "summary": "House Republicans are coordinating a legislative blitz to reshape U.S. crypto regulation and block future state-issued digital currencies."
    },
    {
      "title": "Telegram's Crypto Ecosystem Notches Billion-Dollar Unicorn in The Open Platform",
      "link": "https://decrypt.co/328548/telegram-crypto-ecosystem-billion-dollar-unicorn-open-platform",
      "summary": "A key player in the Telegram-linked The Open Network (TON) crypto ecosystem just hit a $1 billion valuation with its latest funding round."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump’s ‘Big Beautiful Bill’ clears Congress after narrow House vote, what could this mean for Bitcoin?",
      "link": "https://cryptobriefing.com/trump-tax-bill-congress-vote/",
      "summary": "<p>The bill's passage may lead to a liquidity squeeze, impacting Bitcoin's price volatility and potentially increasing national debt concerns.</p> <p>"
    },
    {
      "title": "Senator Lummis proposes to exempt small crypto transactions from taxes, ending double taxation for miners and stakers",
      "link": "https://cryptobriefing.com/crypto-tax-reform-innovation-users/",
      "summary": "<p>The proposed tax reform could boost crypto adoption, enhance U.S. competitiveness in digital finance, and simplify tax compliance for users.</p> <p>"
    },
    {
      "title": "TON builder The Open Platform raises $28.5 million, reaches $1 billion valuation in extended Series A",
      "link": "https://cryptobriefing.com/ton-blockchain-funding-unicorn-status/",
      "summary": "<p>The funding and valuation boost for The Open Platform could accelerate global blockchain adoption, leveraging Telegram's extensive user base.</p> <p>"
    },
    {
      "title": "IMF denies Pakistan’s proposal to offer cheap power to Bitcoin, crypto miners",
      "link": "https://cryptobriefing.com/crypto-mining-electricity-pakistan-imf/",
      "summary": "<p>The IMF's rejection highlights challenges in balancing economic growth with sustainable energy policies in developing nations.</p> <p>"
    },
    {
      "title": "Bitcoin could retest $90K as Trump’s Big Beautiful Bill sets stage for liquidity crunch: Arthur Hayes",
      "link": "https://cryptobriefing.com/bitcoin-liquidity-risk-tga-refill/",
      "summary": "<p>A potential liquidity drain from US fiscal policies could temporarily pressure Bitcoin, but long-term bullish trends remain intact.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Yuan vs. U.S Dollar – The race to dominate the $2 trillion stablecoin market",
      "link": "https://ambcrypto.com/yuan-vs-u-s-dollar-the-race-to-dominate-the-2-trillion-stablecoin-market/",
      "summary": "<img alt=\"Yuan vs. U.S Dollar - The race to dominate the $2 trillion stablecoin market\" class=\"attachment-full size-full wp-post-image\" height=\"713\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chinas-stablecoin-push.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1267\" />Could this be China’s comeback in the crypto space after its ban a few years ago?"
    },
    {
      "title": "PLUME crypto gathers steam for recovery with 28% gains since Monday – Details",
      "link": "https://ambcrypto.com/plume-crypto-gathers-steam-for-recovery-with-28-gains-since-monday-details/",
      "summary": "<img alt=\"Plume crypto gathers steam for recovery with 28% gains since Monday\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/PLume-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The WLFI partnership announcement bolstered bullish market sentiment for PLUME."
    },
    {
      "title": "Cardano vs Ethereum – Is ADA ready for a rotation rebound?",
      "link": "https://ambcrypto.com/cardano-vs-ethereum-is-ada-ready-for-a-rotation-rebound/",
      "summary": "<img alt=\"Cardano vs Ethereum - Is ADA ready for a rotation rebound?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika-5.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is Ethereum’s spotlight fading just as Cardano’s starts to glow brighter?"
    },
    {
      "title": "Celestia defies bears with 16% rally – But will profit-taking kill TIA?",
      "link": "https://ambcrypto.com/celestia-defies-bears-with-16-rally-but-will-profit-taking-kill-tia/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/F8A3934C-7882-4869-916C-0127A73E642D.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TIA has delivered gains for investors but still faces several hurdles."
    },
    {
      "title": "Dogecoin activity on the rise: Will it help DOGE hold $0.19 resistance?",
      "link": "https://ambcrypto.com/dogecoin-activity-on-the-rise-will-it-help-doge-hold-0-19-resistance/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-03T163209.626-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />DOGE rallies off support as whales accumulate and derivatives surge, but usage metrics remain weak."
    }
  ]
}