{
  "CoinDesk": [
    {
      "title": "Arizona Moves Closer to Creating Bitcoin Reserve as Bill Passes Final Senate Vote",
      "link": "https://www.coindesk.com/policy/2025/06/20/arizona-moves-closer-to-creating-bitcoin-reserve-as-bill-passes-final-senate-vote",
      "summary": ""
    },
    {
      "title": "North Korean Hackers Are Targeting Top Crypto Firms With Malware Hidden in Job Applications",
      "link": "https://www.coindesk.com/tech/2025/06/20/north-korean-hackers-are-targeting-top-crypto-firms-with-malware-hidden-in-job-applications",
      "summary": ""
    },
    {
      "title": "XRP Early Buyers Accelerate Profit-Taking as Regulatory Wins Bolster XRP Ecosystem",
      "link": "https://www.coindesk.com/markets/2025/06/20/xrp-early-buyers-accelerate-profit-taking-as-regulatory-wins-bolster-xrp-ecosystem",
      "summary": ""
    },
    {
      "title": "Bitcoin Cash Stages Surprise Run to Near $500 as Volumes Spike 500%",
      "link": "https://www.coindesk.com/markets/2025/06/20/bitcoin-cash-stages-surprise-run-to-near-500-as-volumes-spike-500",
      "summary": ""
    },
    {
      "title": "Bitcoin Steady Above $104K as Traders Eye Historically Bullish Second Half",
      "link": "https://www.coindesk.com/markets/2025/06/20/bitcoin-steady-above-104k-as-traders-eye-historically-bullish-second-half",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "BlackRock ETF scoops up 3.25% of Bitcoin supply as ‘new money’ dries up",
      "link": "https://cointelegraph.com/news/blackrock-etf-3-25-bitcoin-supply-new-money-dries-up?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzI0YmEtMDM0Ny03MTAzLWFjY2EtYjY2M2M1NWQ3ZjM3.jpg\" /></p><p>BlackRock’s ETF is nearing the $70 billion mark as Bitcoin transactions continue to be dominated by large investors.</p>"
    },
    {
      "title": "Death, divorce and lost keys: The question of succession in tokenized property",
      "link": "https://cointelegraph.com/news/succession-in-tokenized-property?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NGI2Y2YtNGFlMC03M2E2LWFkYjktNWI4MDJmNzg4YWVl.jpg\" /></p><p>Blockchain’s promise of democratized property ownership faces a potential roadblock. Integrating automated, blockchain-native succession protocols is essential to protect digital assets and enable true democratization of RWA ownership.</p>"
    },
    {
      "title": "Blockdaemon launches non-custodial staking and DeFi stack for institutions",
      "link": "https://cointelegraph.com/news/blockdaemon-launches-non-custodial-staking-defi-stack-institutions?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTRiZmQtNDE1ZS03ZmM4LWIxOGUtZmQxMTE0NjU3ODRi.jpg\" /></p><p>Blockdaemon has launched Earn Stack, a non-custodial institutional service that delivers DeFi yield farming and PoS staking across more than 50 protocols.</p>"
    },
    {
      "title": "Bitcoin grabs $106K liquidity as whale longs BTC with $255M",
      "link": "https://cointelegraph.com/news/bitcoin-grabs-106k-liquidity-as-whale-longs-btc-with-255m?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NTNkZDMtY2JlOS03ZWI3LTkwN2MtZGVmOThmMjdkMDZi.jpg\" /></p><p>Bitcoin sees a giant leveraged long liquidate late shorts, but is it enough to spark the BTC price range exit that traders have wanted?</p>"
    },
    {
      "title": "TikTok denies TRUMP memecoin buys in reply to congressman’s accusations",
      "link": "https://cointelegraph.com/news/tiktok-denies-trump-memecoin-buy-brad-sherman?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhjNDQtM2M1MC03NzgyLTgzZDAtZGJhNjRmMTU0NGM0.jpg\" /></p><p>Bitcoin hater Brad Sherman accused US President Donald Trump of accepting a $300 million bribe from TikTok, but TikTok denied it has anything to do with it.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "You’re Hired! North Korea’s new crypto scam starts with a job offer",
      "link": "https://cryptoslate.com/north-korea-leverages-fake-job-offers-and-deep%e2%80%91fakes-to-infiltrate-crypto-developer-networks/",
      "summary": "<p>A new wave of cyberattacks shows the DPRK is exploiting the crypto industry&#8217;s recruitment funnel, using fake LinkedIn job offers, deep‑fake Zoom calls, and backdoored interview files to access Web3 developers’ wallets and repositories. With seasoned developer talent already thinning and open‑source protocols increasingly reliant on individual contributors, the stakes have never been higher. North [&#8230;]</p> <p>"
    },
    {
      "title": "Semler’s $11B Bitcoin bet. Can the tiny med-tech firm become the next Strategy?",
      "link": "https://cryptoslate.com/semlers-11b-bitcoin-bet-can-the-tiny-med-tech-firm-become-the-next-strategy/",
      "summary": "<p>Semler Scientific, the previously obscure medical device maker, has unveiled plans to acquire a staggering 105,000 BTC by the end of 2027. Its ambition would make Semler the second-largest corporate Bitcoin holder in the world, behind only Strategy (formerly MicroStrategy). The announcement, made on June 20, sent Semler’s shares soaring nearly 12% in pre-market trading, [&#8230;]</p> <p>"
    },
    {
      "title": "Arizona revives bid for seized crypto reserve fund through House Bill 2324",
      "link": "https://cryptoslate.com/arizona-revives-bid-for-seized-crypto-reserve-fund-through-house-bill-2324/",
      "summary": "<p>Arizona lawmakers are revisiting a previously rejected bill that would allow the state to manage a reserve fund built from seized cryptocurrencies. House Bill 2324 failed in an earlier House vote but is back in motion following a narrow 16–14 Senate decision on June 19. This decision returns the bill to the Arizona House for [&#8230;]</p> <p>"
    },
    {
      "title": "Jupiter halts governance voting to tackle burnout and refocus on innovation",
      "link": "https://cryptoslate.com/jupiter-halts-governance-voting-to-tackle-burnout-and-refocus-on-innovation/",
      "summary": "<p>Solana’s largest decentralized exchange aggregator, Jupiter, has decided to halt all community voting through next year and keep its governance Treasury sealed until 2027, citing community burnout and a need to prioritize building new products. The move temporarily disables one of the main utilities for Jupiter’s native token, JUP, which powers governance proposals and decisions [&#8230;]</p> <p>"
    },
    {
      "title": "Circle approaches $50B valuation amid evolving regulatory landscape in the US",
      "link": "https://cryptoslate.com/insights/circles-stock-rally-propels-valuation-to-nearly-50-billion/",
      "summary": "<p>Circle, the issuer of the USD Coin (USDC) stablecoin, is edging closer to a $50 billion valuation after a major rally in its stock price. Since debuting at $31, Circle&#8217;s shares (CRCL) have climbed over 540%, now trading around $200, according to Yahoo Finance. This surge has helped push Circle&#8217;s valuation to approximately $48.4 billion [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin’s Back on the Table: 3 Best New Crypto as Arizona Revives Bill on Seized $BTC",
      "link": "https://www.newsbtc.com/news/arizona-hb2324-bitcoin-reserve-fund/",
      "summary": "Arizona’s Senate has moved to revive a bill that will create the state’s crypto reserve fund. This growing attention to the world’s most valuable cryptocurrency further adds interest to related new cryptos, such as BTC Bull Token ($BTCBULL) and secure crypto wallets like Best Wallet. Arizona’s House Bill 2324 is now under reconsideration after the Senate voted 16-14 to revive it. The House of Representatives initially voted down the bill in May. What Arizona’s HB2324 is About HB2324 expands Arizona’s ability to seize and forfeit property that has been used or obtained through criminal activity to include crypto and other digital assets. The state will then sell the forfeited digital asset. The bill also clarifies the role of Arizona’s ‘Bitcoin and Digital Assets Reserve Fund,’ wherein the state will deposit 25% of any seized digital assets worth over $300K. In May, Arizona created the reserve fund to store unclaimed digital assets, making it one of the first US states to do so. Why HB2324 Matters The revival of HB2324 signals the US’s push to add $BTC and other crypto to its finances. Aside from Arizona, other states have created similar crypto reserves, including New Hampshire and Texas. This growing momentum highlights a broader trend: US states no longer wait for federal guidance to make crypto moves. Instead, they’re taking matters into their own hands, with Bitcoin increasingly viewed as a strategic asset rather than a speculative gamble. By actively building reserves in digital assets, states like Arizona and New Hampshire are positioning themselves at the forefront of a financial shift, diversifying treasuries, hedging against inflation, and embracing innovation as a competitive advantage. The 3 Best New Crypto to Buy as Bitcoin Adoption Grows With government institutions and Wall Street starting to embrace $BTC and other digital assets more openly, here are three new crypto that could benefit from this development: 1. Best Wallet Token ($BEST) – A Secure Way to Store Your Bitcoin and Other Crypto With crypto becoming more mainstream, there’s a growing demand for a secure crypto wallet where people can store their valuable digital assets. That’s the demand that Best Wallet wants to meet. This crypto wallet lets you store, buy, and stake crypto and a lot more. It even has a Token Launchpad where you can access the best presales while they’re still cheap. As a non-custodial crypto wallet, Best Wallet gives you sole control over your private keys. This makes it more secure compared to wallets where private keys are in the hands of the wallet provider. It’s also a no-KYC crypto wallet, meaning it doesn’t require you to undergo the know-your-customer (KYC) verification, which helps maintain your privacy. Behind the wallet is its native Best Wallet Token ($BEST). It’s currently on presale, which you can get for only $0.025205 each. Our Best Wallet Token buying guide has all the details you need to grab $BEST tokens. Owning the token has various advantages. These include getting low transaction fees within the Best Wallet ecosystem, higher staking rewards, early access to presales in the Token Launchpad, and governance rights that give you control over the project’s direction. 2. BTC Bull Token ($BEST) – Buy BTC Bull Tokens, Get the Chance to Receive Free Bitcoins As the world’s biggest cryptocurrency, Bitcoin’s value is on its way to new highs. That’s the BTC Bull Token ($BTCBULL) team’s rallying cry as it urges believers to push $BTC to $250K and beyond. At its heart are the free $BTC and $BTCBULL airdrops when Bitcoin hits price milestones. This means when you hold $BTCBULL, you’ll get the chance to receive Bitcoins when it hits $150K and $200K. Then, when it finally reaches $250K, you’ll get free BTC Bull tokens. The team will also have regular token burns happening at $125K, $175K, and $225K. These will help reduce the number of $BTCBULL in circulation, making them scarcer and more valuable. The token is currently available for $0.00257 each at the BTC Bull Token presale page. To buy tokens, connect your crypto wallet like Best Wallet to the presale widget, enter the number of coins you want to buy, and pay with your credit/debit card or crypto. If you prefer, you can stake tokens after you buy them and enjoy staking rewards that are currently set at 56% p.a. HODLing could also be an ideal strategy, as it could be worth as much as $0.0096 each. 3. Bitcoin Pepe ($BPEP) – Merging the World of Bitcoin and Meme Coins Bitcoin was never meant for the world of meme coins, that is, until Bitcoin Pepe ($BPEP) arrived. By creating a Layer 2 blockchain, the Bitcoin Pepe team aims to merge Bitcoin with meme coins. When completed, this will deliver the best that Solana has to offer—speed, low transaction fees, and user-friendly UX—and bank on the biggest crypto&#8217;s massive value and mainstream appeal. $BPEP is available for $0.0416 on the Bitcoin Pepe presale page. But with just 10 days before the presale closes, it’s your last chance to get the tokens at a discount. Crypto Has Gone Mainstream and There’s No Looking Back With the revival of HB2324 in Arizona, Bitcoin and other crypto are back in the spotlight. While this is still big news at the moment, it will be a matter of time before it completely becomes a part of the mainstream. Because of this, it’s always best to be a step ahead of the crowd, such as by getting a secure crypto wallet powered by Best Wallet Token ($BEST) or betting on Bitcoin’s bull run with BTC Bull Token ($BTCBULL). But before you invest in crypto, make sure you do your research. This will allow you to be aware of the opportunities as well as the risks of trading these digital assets. Also, use the information in this article for educational purposes and not as investment advice."
    },
    {
      "title": "Analyst Warns Of Bitcoin Breakdown—’If This Continues, It Snaps’",
      "link": "https://www.newsbtc.com/bitcoin-news/itcoin-breakdown-if-this-continues-it-snaps/",
      "summary": "Bearish sentiment on X continues to grow, fueling a rising number of crash forecasts. Among them is Dom (@traderview2), a widely followed crypto market analyst, who issued a stark warning on Wednesday: Bitcoin is approaching a structural tipping point that could trigger a severe breakdown if bulls fail to act swiftly. “If this continues, it snaps,” Dom cautioned, referring to a wave of relentless selling pressure and thinning liquidity across major exchanges. Time Is Ticking For Bitcoin In a detailed post, Dom described current market conditions as “vital,” noting that Bitcoin and the broader crypto space are at a moment where “it needs to save itself or we&#8217;re going south.” The recent weekly chart, he said, reflects a bearish “liquidity grab”—a move where BTC pushed above the previous weekly high only to sharply reverse, a pattern often marking local tops. That reversal has been accompanied by a three-touch declining strength formation, signaling fading bullish momentum. “I think time is ticking for bulls to save this chart, as it needs to happen soon IMO,” Dom added, underscoring the urgency of a bullish reclaim to invalidate the setup. Related Reading: Bitcoin Is The Purest AI Trade, Says Wall Street Veteran Beneath price action, the structural foundation appears increasingly fragile. Dom pointed to alarmingly thin order books across key spot markets—Binance, Bybit, Coinbase, OKX, and Kraken. Over the past three weeks, roughly 38,000 BTC has been sold into the market, absorbed by passive bids. While buyers have held so far, the analyst warned that visible liquidity beneath current price levels is virtually nonexistent. “There is virtually no support down to 80ks (at least as of now), not even advertisement of support,” he said. The same bearish pattern is playing out in perpetual futures markets. Platforms like Binance, Bybit, OKX, and Hyperliquid have seen consistent taker-side selling, forming what Dom described as a “relentless downtrend of market selling.” With perp books also thin, the pressure may be unsustainable unless conditions change quickly. Drawing a parallel to Bitcoin’s February breakdown from the 90k level, Dom noted, “We saw the same dynamic pre-90k breakdown.” The implication is clear: without a shift in market behavior, BTC may be headed toward a similar fate. Related Reading: Buy Bitcoin Now? Not Yet—Analyst Says Time Holds The Key Seasonal trends are adding weight to the bearish outlook. Dom highlighted that summer months historically bring weaker market participation and lower liquidity—an environment that exacerbates downside moves and limits the impact of bullish efforts to regain control. Despite the grim analysis, Dom remains clear on what would invalidate his bearish stance: a recovery of the 108.5k level. “If that level regains, great. I think we can void these signals,” he said. “But for now, bearish outlook for me is the better R/R on a risk-first basis.” In a separate reply, Dom acknowledged that a dip to the $96,000–$98,000 region, even with a wick into the $80,000’s, would not necessarily break structure. “It surely would not be abnormal and I think structure would still be ok,” he wrote, adding that he would reassess the setup if such a move occurs. With order books thinning, taker flow intensifying, and no solid support beneath, Dom’s message is blunt: time is running out. At press time, BTC traded at $104,694. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Analyst Predicts 20% Ethereum Price Crash Below $2,000, Here’s Why",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-price-crash-2000/",
      "summary": "While the Bitcoin price stays close to its all-time highs, the Ethereum price has done pretty much the opposite. This failure to perform has put intense bearish pressure on the altcoin market as a whole, and the resulting price action has triggered what is seemingly a bear market for altcoins. Even now, the Ethereum price has not shown any signs of a bullish recovery, with expectations remaining bleak at this level, and analysts predicting further crashes. Why The Ethereum Price Is Headed Below $2,000 Crypto analyst Maddox Metrics has given the short and long-term outlook for the Ethereum price, and it seems the current market decline is nowhere near its end. In the short term, Maddox expects the Ethereum price to continue to decline and, in fact, fall below some major support levels. Related Reading: XRP Addresses Holding 1M Coins Reach 12-Year High As Experts Predict Move Above $4 As the crypto analyst explains, investors are already expecting the ETH price to actually fall lower toward the $1,900 target. And as shown in the analyst’s chart, this would actually be the second wave of the 5-wave count as Ethereum moves into its long-term potential. While there has been a lot of buying, especially among institutional investors and ETF issuers, the Ethereum price continues to trend low. The analyst attributes this to the rising war tensions in the Middle East, as fears of World War 3 grow more intense. At this level, the analyst cautions investors to look toward a more patient strategy, saying that “Money is made in the sitting, weathering volatility, not flipping in and out of trades on every bit of news and price movement.” Thus, it is better to hold positions until the market finds its stable point. ETH Still Bullish In The Long-Term Despite the wave pattern pointing to a crash below $2,000 in the short term, the analyst says the long-term outlook for the Ethereum price remains bullish. The current decline, which is a Wave 2 retracement, the analyst explains, marked the end of a motif wave at the $2,700 resistance. Related Reading: Is Ethereum Price Set To Repeat History As 2017 Playbook Returns? Why This Time Could Be Bigger This suggests that once the current wave ends, there is the next wave, which is the bullish Wave 3. Once this is underway, the analyst’s chart shows a possibility of this wave carrying through to a new all-time high just under $5,000. The 4th wave is naturally bearish and will trigger a crash, while the 5th and final wave will send the Ethereum price to $7,000. The timeline for this to happen, as shown in the chart, will be through the year 2025 and into the early months of 2026. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana Correction About To End? Analyst Forecasts $130 Retest Before Next Wave Up",
      "link": "https://www.newsbtc.com/news/solana-correction-about-to-end-analyst-forecasts-130-retest-before-next-wave-up/",
      "summary": "Amid the geopolitical turmoil, Solana (SOL) has retraced 10% in the past week. Some analysts believe that the altcoin’s correction is about to end, but warned that a dip below a key support level might come first. Related Reading: SUI Preparing For New Highs As Falling Wedge Breakout Targets $5 Solana Eyes Key Retest Before Breakout After retesting the $168 resistance last Wednesday, Solana has fallen back to a key level fueled by the recent market pullback. The cryptocurrency has seen a 15% retracement from its monthly highs, trading around the $140 zone for the past three days. SOL has been hovering between the $145-$180 price range since its May breakout, falling to the range lows during the June market shakeouts. Since then, the altcoin has struggled to reclaim the $160-$170 mid-zone. Nonetheless, market watcher Lluciano considers that Solana “may dip a bit more, but the ultimate target is seriously huge.” The analyst highlighted SOL’s performance since April, noting that it ended its multi-month downtrend after breaking above its descending resistance at the end of March. After this price action, SOL retested the $100-$120 demand zone before breaking out to its current range in the following weeks. Now, the altcoin’s chart displays a one-month falling wedge pattern, with the upper boundary sitting around the $155-$160 area. To the analyst, a breakout from this pattern could send the cryptocurrency toward May’s $187 high resistance before propelling the price to retest the $240 mark. Similarly, trader Rose noted that SOL has been consolidating above the key $145 resistance and 50-day Moving Average (MA), signaling a potential breakout. “If confirmed, the price could rise toward targets at $165, $183, and $220,” they suggested. SOL To Underperform In Coming Months? Market watcher Crypto Bullet suggested that Solana’s correction is coming to an end. The analyst forecasted that SOL could soon lose its current range and retest the April consolidation range, around the $125-$135 area, to complete the correction. This would be followed by a bounce back into the current range before surging past the $200 barrier toward the $220-$250 targets, for “one more wave up” this cycle. Meanwhile, Altcoin Sherpa affirmed Solana won’t outperform like it did during the first half of the cycle. According to the analyst, the cryptocurrency won’t outperform Bitcoin (BTC) on any long-term timeframe “other than a few blips here and there.” Related Reading: Bitcoin Setting Up For ‘Large Move’ Amid $103,000 Retest – Key Levels To Watch He explained that the cycle’s leading altcoin isn’t “dead,” but that he doesn’t “see it having a run like it did in 2021/2024.” Notably, SOL is currently retesting its late November 2023 support levels against BTC, which previously sent it to yearly lows after failing to hold them. Altcoin Sherpa concluded that Solana will likely continue to climb against its USDT pair but continue to bleed in its SOL/BTC chart. As of this writing, Solana is trading at $145, a 12.1% decline in the monthly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Bitcoin Cash (BCH) Pops 8% Higher — Can The Momentum Continue?",
      "link": "https://www.newsbtc.com/analysis/bch/bitcoin-cash-bch-pops-500/",
      "summary": "Bitcoin Cash price started a major increase above the $475 resistance. BCH is consolidating and might aim for more gains above the $500 resistance. Bitcoin cash price started a fresh increase above the $480 level. The price is trading above $480 and the 100-hour simple moving average. There was a break above a key bearish trend line with resistance at $472 on the hourly chart of the BCH/USD pair (data feed from Kraken). The pair could start another increase if it clears the $500 resistance zone. Bitcoin Cash Price Starts Fresh Surge After forming a base above the $440 level, Bitcoin Cash price started a fresh increase. BCH outpaced Bitcoin and Ethereum to gain over 8%. There was a clear move above the $470 resistance zone. The price even surpassed $480 and tested the $495 resistance zone. Besides, there was a break above a key bearish trend line with resistance at $472 on the hourly chart of the BCH/USD pair. A high was formed near $505 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $455 swing low to the $502 high. Bitcoin cash price is now trading above $485 and the 100-hour simple moving average. Immediate resistance on the upside sits near the $500 level. A clear move above the $500 resistance might start a decent increase. The next major resistance is $505, above which the price might accelerate higher toward the $520 level. Any further gains could lead the price toward the $535 resistance zone. Are Dips Supported In BCH? If Bitcoin Cash price fails to clear the $500 resistance, it could start a fresh decline. Initial support on the downside is near the $490 level. The next major support is near the $480 level or the 50% Fib retracement level of the upward move from the $455 swing low to the $502 high. If the price fails to stay above the $480 support, the price could test the $470 support. Any further losses could lead the price toward the $450 zone in the near term. Technical indicators 4-hour MACD – The MACD for BCH/USD is losing pace in the bullish zone. 4-hour RSI (Relative Strength Index) – The RSI is currently above the 60 level. Key Support Levels – $490 and $480. Key Resistance Levels – $500 and $505."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Semler Scientific Appoints Joe Burnett as Director of Bitcoin Strategy, Targets 105,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/semler-scientific-appoints-joe-burnett-as-director-of-bitcoin-strategy-targets-105000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Semler-Scientific-Appoints-Joe-Burnett-as-Director-of-Bitcoin-Strategy-Targets-105000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/semler-scientific-appoints-joe-burnett-as-director-of-bitcoin-strategy-targets-105000-btc-by-2027\" rel=\"nofollow\"> </a></p> <p>Semler Scientific, the second U.S. publicly traded company to adopt Bitcoin as its primary treasury reserve asset, has appointed Joe Burnett as Director of Bitcoin Strategy while announcing a Bitcoin accumulation plan. The healthcare technology company targets holding 10,000 Bitcoin by year end 2025, 42,000 by 2026, and 105,000 by 2027.&#160; The announcement comes as [&#8230;]</p> <p>"
    },
    {
      "title": "President Donald Trump: America Will Show The World How To Win With Digital Assets Like Never Before",
      "link": "https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/President-Trump-Says-22We-Are-Going-to-Show-the-World-How-to-WIN-with-Digital-Assets-Like-Never-Before22.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before\" rel=\"nofollow\"> </a></p> <p>President Donald Trump posted on Truth Social Tuesday evening regarding recent Senate legislation, stating the U.S. will &#8220;show the World how to WIN with Digital Assets like never before.&#8221;"
    },
    {
      "title": "3 Misconceptions About US Debt",
      "link": "https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FRED-chart.png\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt\" rel=\"nofollow\"> </a></p> <p>This newsletter explores three common misconceptions about U.S. federal debt and deficits.</p> <p>"
    },
    {
      "title": "The Smarter Web Company Acquires £8.1M in Bitcoin For Treasury Holdings",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Smarter-Web-Company-Acquires-8.1M-in-Bitcoin-For-Treasury-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings\" rel=\"nofollow\"> </a></p> <p>The London listed firm now holds 346.63 Bitcoin worth £27.2 million, reinforcing its long-term strategy to integrate Bitcoin into corporate finance through its \"10 Year Plan.\"</p> <p>"
    },
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "SEC Thailand Opens Public Consultation on Crypto Listing Criteria",
      "link": "https://decrypt.co/326194/sec-thailand-public-consultation-crypto-listing-criteria",
      "summary": "Thailand's SEC has opened public feedback on new rules letting exchanges list self-issued tokens, with stronger disclosure requirements."
    },
    {
      "title": "South Korean Regulators Prepare for Spot Crypto ETFs This Year",
      "link": "https://decrypt.co/326191/south-korean-regulators-spot-crypto-etfs-this-year",
      "summary": "The country's financial regulator has submitted plans to launch crypto ETFs and won-based stablecoins by the second half of this year."
    },
    {
      "title": "North Korea Targets Crypto Professionals With New Malware in Hiring Scams",
      "link": "https://decrypt.co/326187/new-malware-crypto-job-scams-north-korea",
      "summary": "Hackers linked to Pyongyang are posing as Coinbase and Uniswap recruiters to deploy \"PylangGhost,\" a Python-based trojan."
    },
    {
      "title": "Semler Scientific Targets Hefty Bitcoin Stash Over Next 2 Years",
      "link": "https://decrypt.co/326183/semler-scientific-bitcoin-stash-2-years",
      "summary": "Once a cautious believer in crypto, Semler Scientific is now racing to become the second-largest corporate holder of Bitcoin."
    },
    {
      "title": "Arizona Senate Passes Bitcoin Reserve Bill for Seized Crypto, Heads to House For Debate",
      "link": "https://decrypt.co/326175/arizona-senate-passes-bitcoin-reserve-bill-for-seized-crypto-heads-to-house-for-debate",
      "summary": "The bill seeks to establish a state-managed digital asset fund using crypto seized through criminal forfeiture."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Arizona revives Bitcoin reserve bill and passes it in Senate",
      "link": "https://cryptobriefing.com/arizona-bitcoin-reserve-fund-bill/",
      "summary": "<p>Arizona's legislative actions on digital assets could set a precedent for integrating cryptocurrencies into state financial systems, despite political challenges.</p> <p>"
    },
    {
      "title": "Trump-affiliated company cuts stake in World Liberty Financial to 40%",
      "link": "https://cryptobriefing.com/world-liberty-stake-reduction/",
      "summary": "<p>The reduced stake may signal a strategic shift in investment focus, potentially impacting the company's influence in the crypto sector.</p> <p>"
    },
    {
      "title": "Seamless Protocol launches plug and play Leverage Tokens as ERC-20 assets on Base",
      "link": "https://cryptobriefing.com/launch-leveraged-defi-tokens/",
      "summary": "<p> Seamless Protocol debuts Leverage Tokens on Base, packaging passive DeFi strategies into tradable ERC-20s for one-click exposure.</p> <p>"
    },
    {
      "title": "Only 30% of crypto miners comply with Russia’s new rules, finance ministry official says",
      "link": "https://cryptobriefing.com/crypto-mining-compliance-russia/",
      "summary": "<p>The low compliance rate among crypto miners in Russia highlights challenges in enforcing regulations, potentially impacting energy policies and economic oversight.</p> <p>"
    },
    {
      "title": "Elon Musk’s X will soon launch investment and trading features as part of ‘everything app’ vision",
      "link": "https://cryptobriefing.com/financial-services-expansion-elon-musk-x/",
      "summary": "<p>Musk's X expansion into finance could redefine digital ecosystems, merging social media with financial services, impacting user engagement.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "OKB hits $54.7 after 42.4 mln token burn – Can it break through $56?",
      "link": "https://ambcrypto.com/okb-hits-54-7-after-42-4-mln-token-burn-can-it-break-through-56/",
      "summary": "<img alt=\"OKB hits $54.7 after 42.4 mln token burn - Can it break through $56?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-1-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />OKB surges to a monthly high as OKX burns 42.4 million tokens, incentivizing whale comeback."
    },
    {
      "title": "XRP price poised for breakout? Analyst reveals 4 key bullish signals",
      "link": "https://ambcrypto.com/xrp-price-poised-for-breakout-analyst-reveals-4-key-bullish-signals/",
      "summary": "<img alt=\"XRP\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika2-1-4.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />XRP is a coiled spring: Strong support, tight bands, calm leverage, and profit-taking cleared."
    },
    {
      "title": "Gate Releases May 2025 Transparency Report: Brand Revamp Ignites Strategic Acceleration",
      "link": "https://ambcrypto.com/gate-releases-may-2025-transparency-report-brand-revamp-ignites-strategic-acceleration/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"682\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-20-at-2.24.04 PM.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1230\" />Gate, a global leader in cryptocurrency trading, has released its May 2025 Transparency Report, revealing [&#8230;]"
    },
    {
      "title": "Solana short sellers on the run – THIS can fuel SOL’s next move!",
      "link": "https://ambcrypto.com/solana-short-sellers-on-the-run-this-can-fuel-sols-next-move/",
      "summary": "<img alt=\"Solana short sellers on the run: THIS can fuel SOL&#039;s next move\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-20T094841.908-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana’s sentiment flips bullish, but technical breakout depends on reclaiming Bollinger mid-band."
    },
    {
      "title": "FUNToken Announces Deflationary Update, Achieves Certik Certification",
      "link": "https://ambcrypto.com/funtoken-announces-deflationary-update-achieves-certik-certification/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"868\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/certik-pr-1.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1443\" />FUNToken, the leading token driving the future of Web3 gaming, has achieved a major milestone: [&#8230;]"
    }
  ]
}