{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: Vitalik's Plan Can Bring ETH to $3,000 and Crypto 'More Popular' Than Stocks in Korea",
      "link": "https://www.coindesk.com/markets/2025/06/04/asia-morning-briefing-vitaliks-plan-can-bring-eth-to-3000-and-crypto-more-popular-than-stocks-in-korea",
      "summary": ""
    },
    {
      "title": "Suspect in French Crypto Kidnappings Arrested in Morocco",
      "link": "https://www.coindesk.com/policy/2025/06/04/suspect-in-french-crypto-kidnappings-arrested-in-morocco",
      "summary": ""
    },
    {
      "title": "Circle Prices IPO at $31 Per Share, Valuing Stablecoin Issuer at $6.9 Billion",
      "link": "https://www.coindesk.com/markets/2025/06/04/circle-debuts-on-nyse-at-31-per-share-valuing-stablecoin-issuer-at-62-billion",
      "summary": ""
    },
    {
      "title": "Vitalik Buterin Uses Privacy Tool Railgun Again, Signaling Ongoing Embrace of On-Chain Anonymity",
      "link": "https://www.coindesk.com/tech/2025/06/04/vitalik-buterin-uses-privacy-tool-railgun-again-signaling-ongoing-embrace-of-on-chain-anonymity",
      "summary": ""
    },
    {
      "title": "The Protocol: Berachain Follows Ethereum’s Pectra Upgrade With ‘Bectra’",
      "link": "https://www.coindesk.com/tech/2025/06/04/the-protocol-berachain-follows-ethereum-s-pectra-upgrade-with-bectra",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin eyes $115K by July, but strong US job data to threaten rally: Analysts",
      "link": "https://cointelegraph.com/news/bitcoin-new-highs-july-us-jobs-data-threat-uptrend-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNkMWItNzA5Yy03YmNiLWJiMTctOTIwM2E5YTg1MGE5.jpg\" /></p><p>Bitfinex analysts tell that Bitcoin could surge next month if US job data turns out to be weaker than expected.</p>"
    },
    {
      "title": "Ukraine arrests man for breaching hosting accounts to mine crypto",
      "link": "https://cointelegraph.com/news/ukraine-arrests-man-accused-of-breaching-server-hosting-accounts-to-mine-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGZkM2UtODU2Ni03NWUzLTlkNmYtMGU0NWYzYWQ1NWQz.jpg\" /></p><p>Ukrainian police claimed the man’s actions caused a server hosting company to suffer losses estimated at over $4.4 million.</p>"
    },
    {
      "title": "Ethereum Foundation says next 18 months ‘pivotal’ amid new treasury policy",
      "link": "https://cointelegraph.com/news/ethereum-foundation-new-treasury-policy-18-months-pivotal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNkMDMtNTE5ZC03ZDk0LTljMmYtZWFmYjgyZWMzZDZl.jpg\" /></p><p>The Foundation backing the Ethereum blockchain has laid out a new treasury policy to ensure it allocates resources efficiently while supporting its DeFi ecosystem.</p>"
    },
    {
      "title": "Stablecoin giant Circle again boosts IPO to $1.05 billion",
      "link": "https://cointelegraph.com/news/stablecoin-issuer-circle-upsize-ipo-1-billion?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNkMzEtNmNlOS03ODViLTljNmYtZmZmYmJhOWEwZTAz.jpg\" /></p><p>USDC issuer Circle has again upsized its initial public offering above the marketed range, selling 34 million shares at $31 each.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "AEON Integrates TRON Network to Enable Seamless In-Store Payments",
      "link": "https://cryptoslate.com/aeon-integrates-tron-network-to-enable-seamless-in-store-payments/",
      "summary": "<p>Singapore &#8211; June 5, 2025 – AEON, the next-generation crypto framework built for payments, has integrated the TRON network to enable seamless in-store payments. Through AEON Pay, users can now transact using TRX, the native utility token of the TRON network. USDT and USDD on TRON for offline payments are also included to bring fast [&#8230;]</p> <p>"
    },
    {
      "title": "Moroccan police arrests suspect behind recent crypto-related kidnappings in France",
      "link": "https://cryptoslate.com/moroccan-police-arrests-suspect-behind-recent-crypto-related-kidnappings-in-france/",
      "summary": "<p>Moroccan police have arrested a dual-national French-Moroccan man wanted for an alleged connection with a series of kidnappings in France that targetted individuals with crypto holdings, Reuters reported on June 4, citing a source familiar with the case. According to the source, Moroccan police identified the man as Bajjou Badiss Mohamed AmiDe, who is 24 [&#8230;]</p> <p>"
    },
    {
      "title": "Systemic risk on the rise as leverage interdependencies tighten between CeFi, DeFi and crypto treasuries",
      "link": "https://cryptoslate.com/systemic-risk-on-the-rise-as-leverage-interdependencies-tighten-between-cefi-defi-and-crypto-treasuries/",
      "summary": "<p>Interconnections between centralized and decentralized crypto lending are heightening systemic risk, Galaxy Digital&#8217;s research arm said in a June 4 report on first-quarter borrowing data. The report estimated that as of March 31, over $39 billion in crypto-collateralized debt was outstanding across decentralized lending apps, centralized lenders, and crypto-backed stablecoin issuers. DeFi protocols accounted for [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation unveils comprehensive treasury plan to balance capital and privacy commitments",
      "link": "https://cryptoslate.com/ethereum-foundation-unveils-comprehensive-treasury-plan-to-balance-capital-and-privacy-commitments/",
      "summary": "<p>Ethereum Foundation has released a sweeping update to its treasury management strategy, signaling a more mature, structured approach to capital allocation amid ETH&#8217;s growing global influence and rising institutional scrutiny. The new framework, published on June 4, outlines how the foundation will manage reserves, deploy capital in DeFi protocols, and assess privacy standards, while maintaining [&#8230;]</p> <p>"
    },
    {
      "title": "Brazil’s central bank plans to use CBDC data to guide interest rate decisions",
      "link": "https://cryptoslate.com/brazils-central-bank-plans-to-use-cbdc-data-to-guide-interest-rate-decisions/",
      "summary": "<p>Brazil’s Central Bank plans to treat transaction data from its central bank digital currency (CBDC) infrastructure, called Drex, as a direct input for setting the country’s interest rate benchmark. Central bank executive Henrique Videira said on June 4 at the Token Nation conference in São Paulo that every payment and asset transfer recorded on Drex’s [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-reserve-gets-military-nod-senator-predicts-explosive-10-year-surge/",
      "summary": "Senator Cynthia Lummis, who leads the Senate Subcommittee on Digital Assets, says the US military backs a plan to create a Strategic Bitcoin Reserve. Jamie Dimon, the CEO of a major bank, recently called that plan a waste. Lummis pushed back. Related Reading: XRP Could Transform Your Finances Long Before $10K, Angel Investor Says Lummis told Bloomberg the military thinks having Bitcoin on hand matters. She said it could be a tool in the economic contest with China. Some see that as a bold step. Others say it’s risky. Military Backs Bitcoin Reserve According to the senator, military leaders say Bitcoin could help in an economic showdown. They see it as a way to hold value if traditional assets get hit by sanctions or big moves from other nations. She spoke about weapons and ammunitions being part of national security, but she added that a Bitcoin reserve is also vital. Some military voices have warned that future conflicts won’t just be fought on battlefields. Money and digital assets could play a key role too. Legislative And Executive Moves Based on reports, Lummis introduced a bill to have the US buy and hold 1 million BTC. That would mirror what countries do with gold. The idea is to pull funds from the Treasury or Federal Reserve rather than use new budget money. It has not moved far in Congress. Still, US President Donald Trump issued an order on March 6, 2025, to set up a Bitcoin reserve plus a digital asset stockpile for other coins. He said the government would use assets seized in civil and criminal actions to start the fund. That means some 200,000 BTC the government already has could be part of it. Lummis Sees Bitcoin Price Rising In The Next Decade Lummis unveiled a proprietary model forecasting a dramatic rise in Bitcoin’s price over the next decade, citing factors such as its fixed supply, growing institutional adoption, and expanding network effects. Analysts caution that such long-term forecasts hinge on unpredictable factors like regulatory shifts, technological breakthroughs, and market sentiment, any of which could derail even the most optimistic projections. She also praised Trump for pushing simple rules for crypto and for using digital coins as part of national strategy. Trump’s family runs a DeFi platform, a stablecoin project, and even some meme coins. Lummis thinks everyone will end up in the crypto economy sooner or later. Related Reading: $500M Bet On Solana: Education Platform Aims To Supercharge Its Treasury Skeptic Voices And Uncertain Path Jamie Dimon disagrees. He calls the Bitcoin reserve a waste of resources. Other experts worry about Bitcoin’s ups and downs. They say a strategic reserve shouldn’t ride on something that can swing 20% in a single day. Some economists at top universities give zero support to borrowing money to build a crypto stash. They argue it doesn’t make sense against the US’s nearly $36 trillion national debt. For now, the bill to buy 1 million BTC sits in committee. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Cardano (ADA) Struggles Deepen: Price Slips Further, Investors on Edge",
      "link": "https://www.newsbtc.com/analysis/ada/cardano-ada-struggles-0-65/",
      "summary": "Cardano price started a fresh decline below the $0.70 zone. ADA is now consolidating and might aim decline further below the $0.650 zone. ADA price started a fresh decline below $0.720 and $0.700. The price is trading below $0.70 and the 100-hourly simple moving average. There was a break below a bullish trend line with support at $0.6840 on the hourly chart of the ADA/USD pair (data source from Kraken). The pair could start a fresh decline if it dips below the $0.650 support zone. Cardano Price Dips Further In the past few days, Cardano saw a fresh decline below the $0.750, unlike Bitcoin and Ethereum. ADA even declined below the $0.70 level to enter a bearish zone. Besides, there was a break below a bullish trend line with support at $0.6840 on the hourly chart of the ADA/USD pair. The bears even pushed the price below the $0.70 level. A low was formed at $0.6626 and the price is now consolidating losses. Cardano price is now trading below $0.70 and the 100-hourly simple moving average. On the upside, the price might face resistance near the $0.6720 zone. It is near the 23.6% Fib retracement level of the recent decline from the $0.7026 swing high to the $0.6626 low. The first resistance is near $0.6825 or the 50% Fib retracement level of the recent decline from the $0.7026 swing high to the $0.6626 low. The next key resistance might be $0.6920. If there is a close above the $0.6920 resistance, the price could start a strong rally. In the stated case, the price could rise toward the $0.7350 region. Any more gains might call for a move toward $0.750 in the near term. Another Decline In ADA? If Cardano’s price fails to climb above the $0.6825 resistance level, it could start another decline. Immediate support on the downside is near the $0.6625 level. The next major support is near the $0.650 level. A downside break below the $0.650 level could open the doors for a test of $0.620. The next major support is near the $0.60 level where the bulls might emerge. Technical Indicators Hourly MACD – The MACD for ADA/USD is gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for ADA/USD is now below the 50 level. Major Support Levels – $0.650 and $0.620. Major Resistance Levels – $0.6825 and $0.700."
    },
    {
      "title": "Bitcoin Pullback or Setup? On-Chain Metrics Hint at What’s Coming Next",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-pullback-or-setup-on-chain-metrics-hint-at-whats-coming-next/",
      "summary": "Bitcoin is experiencing a short-term price decline. In the past 24 hours, the asset has fallen by approximately 9.3% to a trading value of $105,062. This pullback places Bitcoin roughly 8% below its all-time high recorded last month. The dip comes amid broader market volatility, but on-chain indicators and exchange data suggest deeper structural trends that may influence the next phase of Bitcoin&#8217;s price trajectory. Recent market analysis points to renewed accumulation among long-term holders, a spike in exchange withdrawals, and rising spot trading activity on Binance. These developments are being interpreted as signals of underlying strength despite recent price weakness. CryptoQuant contributor Amr Taha has provided a detailed breakdown of these emerging patterns, offering a perspective on how long-term dynamics may be shaping Bitcoin’s current market behavior. Related Reading: Bitcoin 3–5 Year Holders Slow Selloff—Waiting for Higher Prices? Binance Trading Volume Rises, Long-Term Holders Accumulate Since early June, Binance has seen its share of Bitcoin spot trading volume increase from 26% to 35%, positioning it more firmly as the dominant platform in the market. This increase in trading activity has occurred as Bitcoin approaches and tests key price levels. According to Taha, this surge may indicate renewed interest from retail and institutional traders alike, particularly as volatility draws more short-term market participants to major exchanges. In addition to exchange volume shifts, on-chain data reveals growing confidence among long-term Bitcoin holders. The Long-Term Holder (LTH) Net Position Realized Cap, a metric that reflects the value of coins held by entities with a holding period of over 155 days, has returned above $20 billion. Historically, this type of accumulation pattern has preceded periods of price expansion, as long-term investors tend to hold through corrections and avoid frequent selling. The rise in LTH realized cap suggests these entities are not exiting positions during this market dip, which may reduce available supply and support future upward movement. Bitcoin Large Exchange Withdrawals Signal Tightening Supply Beyond trading activity and holder behavior, Taha pointed out that another notable trend is emerging on centralized exchanges. Over a two-day period, Kraken and Bitfinex recorded net Bitcoin outflows exceeding 20,000 BTC, among the largest short-term withdrawals in recent months. Such movements are often interpreted as signals of investors shifting assets into self-custody, possibly in anticipation of long-term holding or strategic redeployment. Related Reading: Bitcoin Could Go ‘Bananas’ If Price Closes Above This Level, Top Analyst Says Combined, the rise in Binance’s market share, increased LTH accumulation, and exchange outflows present a picture of a market undergoing structural positioning rather than widespread exit activity. While the short-term price trend reflects a pullback from recent highs, the simultaneous withdrawal of supply and steady long-term holder confidence could act as foundational elements for potential future growth. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "XRP Price Dips to Support: Is a Bullish Rebound on the Horizon?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-dips-support-2-20/",
      "summary": "XRP price started a fresh increase above the $2.220 resistance zone. The price is now consolidating and might aim for a move above the $2.250 resistance. XRP price started a fresh increase above the $2.220 zone. The price is now trading above $2.220 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.185 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start another increase if it clears the $2.250 resistance zone. XRP Price Holds Support XRP price remained stable above the $2.050 support and started a decent upward move, beating Bitcoin and Ethereum. There was a move above the $0.2150 and $0.20 levels. The bulls were able to clear the $2.25 resistance zone. A high was formed at $2.2816 and the price is now correcting gains. The price dipped below the $2.25 level and the 50% Fib retracement level of the upward move from the $2.137 swing low to the $2.2816 high. The price is now trading above $2.20 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $2.185 on the hourly chart of the XRP/USD pair. It is near the 61.8% Fib retracement level of the upward move from the $2.137 swing low to the $2.2816 high. On the upside, the price might face resistance near the $2.2320 level. The first major resistance is near the $2.250 level. The next resistance is $2.2850. A clear move above the $2.2850 resistance might send the price toward the $2.320 resistance. Any more gains might send the price toward the $2.350 resistance or even $2.380 in the near term. The next major hurdle for the bulls might be $2.40. Downside Break? If XRP fails to clear the $2.25 resistance zone, it could start another decline. Initial support on the downside is near the $2.20 level. The next major support is near the $2.1850 level. If there is a downside break and a close below the $2.1850 level, the price might continue to decline toward the $2.150 support. The next major support sits near the $2.120 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.20 and $2.1850. Major Resistance Levels – $2.250 and $2.30."
    },
    {
      "title": "Ethereum Price Aims Higher in Shadow of Bitcoin’s Dip",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-aims-higher-2665/",
      "summary": "Ethereum price started a fresh increase above the $2,550 zone. ETH is now facing resistance near the $2,640 and $2,665 levels. Ethereum started a fresh increase above the $2,550 level. The price is trading above $2,550 and the 100-hourly Simple Moving Average. There is a key rising channel forming with support at $2,600 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend losses if it trades below the $2,600 support zone in the near term. Ethereum Price Consolidates Gains Ethereum price started a decent upward move above the $2,500 zone, beating Bitcoin. ETH price was able to climb above the $2,520 and $2,550 resistance levels. The price even cleared the $2,600 resistance zone and tested the $2,665 level. A high was formed at $2,677 and the price is now consolidating gains. There was a minor move below the $2,620 level. The price dipped below the $2,620 level and the 23.6% Fib retracement level of the upward move from the $2,476 swing low to the $2,677 high. Ethereum price is now trading above $2,550 and the 100-hourly Simple Moving Average. There is also a key rising channel forming with support at $2,600 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,640 level. The next key resistance is near the $2,665 level. The first major resistance is near the $2,720 level. A clear move above the $2,720 resistance might send the price toward the $2,780 resistance. An upside break above the $2,780 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,880 resistance zone or even $2,920 in the near term. Downside Break In ETH? If Ethereum fails to clear the $2,665 resistance, it could start a fresh decline. Initial support on the downside is near the $2,600 level. The first major support sits near the $2,575 zone and the 50% Fib retracement level of the upward move from the $2,476 swing low to the $2,677 high. A clear move below the $2,575 support might push the price toward the $2,500 support. Any more losses might send the price toward the $2,420 support level in the near term. The next key support sits at $2,350. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 zone. Major Support Level – $2,575 Major Resistance Level – $2,665"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Matador Technologies Raises C$1.64M To Invest in Their Bitcoin Reserve",
      "link": "https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Matador-Technologies-Raising-C1-Million-to-Invest-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve\" rel=\"nofollow\"> </a></p> <p>Matador Technologies announced it raised C$1,644,300 across the issuance of 2,652,097 units to add more bitcoin to their reserve.</p> <p>"
    },
    {
      "title": "Support The Blockchain Regulatory Certainty Act (BRCA) To Protect Noncustodial Services",
      "link": "https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Blockchain-Regulatory-Certainty-Act-Save-Our-Wallets-Bitcoin-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services\" rel=\"nofollow\"> </a></p> <p>Call your local elected officials and tell them to support the BRCA, which protects developers of noncustodial technology as well as a variety of services that preserve privacy and make it easier to scale Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: The Key To Scaling Bitcoin",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Layer2-Introduction.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bitcoin and other blockchains are robust and decentralized systems, but they do not scale. In order to make them work, a layered approach is necessary.</p> <p>"
    },
    {
      "title": "JPMorgan to Offer Clients Financing Against Bitcoin & Crypto ETFs",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-Morgan-Plans-to-Offer-Clients-Financing-Against-Crypto-ETFS.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs\" rel=\"nofollow\">JPMorgan to Offer Clients Financing Against Bitcoin &#038; Crypto ETFs</a></p> <p>JPMorgan Chase &#38; Co. plans to allow its trading and wealth-management clients to use cryptocurrency-linked assets, including spot Bitcoin exchange-traded funds (ETFs), as collateral for loans, according to Bloomberg. The bank will begin with BlackRock’s iShares Bitcoin Trust (IBIT), and additional ETFs are expected to be added over time. The policy will apply globally, spanning [&#8230;]</p> <p>"
    },
    {
      "title": "BTCPay Server: The Backbone of Bitcoin Commerce, 2025",
      "link": "https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_young_modern_wizard_male_futuristic_clothi_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025\" rel=\"nofollow\"> </a></p> <p>With plugins for Boltz swaps and WooCommerce, BTCPay Server’s open-source platform supports merchants globally, no middleman required.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Ethereum Foundation Sets Treasury Strategy to Back DeFi, Cut Spending Over Time",
      "link": "https://decrypt.co/323805/ethereum-foundation-treasury-strategy-back-defi-cut-spending",
      "summary": "The new policies seek to lower operating costs, establish strict triggers for ETH sales, and enforce “Defipunk” privacy standards."
    },
    {
      "title": "Reddit Files Lawsuit Against Anthropic Over Alleged Unauthorized Data Scraping",
      "link": "https://decrypt.co/323802/reddit-lawsuit-anthropic-alleged-unauthorized-data-scraping",
      "summary": "Reddit is accusing AI firm Anthropic of scraping content to train Claude, fueling a broader legal battle over the use of online data."
    },
    {
      "title": "Why Democrat Zoltan Istvan Is Backing Basic Income, Home Robots in California Governor Bid",
      "link": "https://decrypt.co/323798/democrat-zoltan-istvan-basic-income-home-robots-california-governor-bid",
      "summary": "Running to lead California, Zoltan Istvan said the state needs Universal Basic Income and robots before jobs begin to vanish."
    },
    {
      "title": "Stablecoin Giant Circle Raises $1.1B in IPO, Valued at $6.9B Ahead of NYSE Debut",
      "link": "https://decrypt.co/323795/stablecoin-giant-circle-raises-1-billion-ipo-nyse-debut",
      "summary": "Stablecoin firm Circle priced its shares at $31, above the marketed range, ahead of its trading debut on the NYSE under ticker CRCL."
    },
    {
      "title": "'Unclaimed' Bitcoin in California Could Be Seized—But There's a Catch",
      "link": "https://decrypt.co/323787/unclaimed-bitcoin-california-seized-theres-catch",
      "summary": "The California House passed a bill that would let the state seize crypto sitting on exchanges—but advocates say it's actually a good thing."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "JPMorgan Chase set to accept Bitcoin, crypto ETFs as loan collateral",
      "link": "https://cryptobriefing.com/jpmorgan-crypto-loan-collateral/",
      "summary": "<p>JPMorgan's move to accept crypto ETFs as collateral could accelerate mainstream adoption and integration of digital assets in traditional finance.</p> <p>"
    },
    {
      "title": "BlackRock’s Bitcoin ETF futures go live on Moscow Exchange as fund surpasses $70 billion AUM",
      "link": "https://cryptobriefing.com/bitcoin-futures-moscow-exchange/",
      "summary": "<p>The integration of Bitcoin ETFs into Russia's financial markets may signal a shift towards broader acceptance and regulation of crypto assets.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus files with SEC for potential $300M XRP reserve strategy, stock surges pre-market",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy/",
      "summary": "<p>Webus's strategic XRP reserve plan could enhance global payment solutions, potentially transforming cross-border transactions and boosting investor confidence.</p> <p>"
    },
    {
      "title": "Trump’s top crypto advisor meets with Pakistan blockchain chief to discuss Bitcoin",
      "link": "https://cryptobriefing.com/bitcoin-strategic-cooperation-pakistan/",
      "summary": "<p>Pakistan's strategic Bitcoin initiatives could strain IMF relations, highlighting challenges for emerging markets in crypto adoption.</p> <p>"
    },
    {
      "title": "Eric Trump threatens legal action over unauthorized Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/eric-trump-crypto-wallet-warning/",
      "summary": "<p>The incident highlights the complexities and potential legal challenges of using high-profile branding in the rapidly evolving crypto space.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Can BNB break new highs? 2 factors suggest strong upside",
      "link": "https://ambcrypto.com/can-bnb-break-new-highs-2-factors-suggest-strong-upside/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/20DCADF1-60F4-4C1E-B29C-B0AA9240B461.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB shows a high tendency for a rally as positive sentiment grows."
    },
    {
      "title": "DEXE bounces off $8.50 floor: Can bulls reclaim $11 and trap bears?",
      "link": "https://ambcrypto.com/dexe-bounces-off-8-50-floor-can-bulls-reclaim-11-and-trap-bears-again/",
      "summary": "<img alt=\"DEXE bounces off $8.50 floor: Can bulls reclaim $11 and trap bears again?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_33_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />DEXE rebounds by over 8% after breakdown below a key pennant support point to a continued bullish momentum."
    },
    {
      "title": "Bitcoin whales are dumping – Is the top in? Profit-taking hits $500M/hour",
      "link": "https://ambcrypto.com/bitcoin-whales-are-dumping-is-the-top-in-profit-taking-hits-500m-hour/",
      "summary": "<img alt=\"Bitcoin whales are dumping - Is the top in? Profit-taking hits $500M/hour\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-15.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />They might be selling, but they're certainly not panicked."
    },
    {
      "title": "Ethereum: Whales now hold $365mln in ETH – Is a run to $3.4K loading?",
      "link": "https://ambcrypto.com/ethereum-whales-now-hold-365mln-in-eth-is-a-run-to-3-4k-loading/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-04T131548.055-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ethereum whale demand surges as a bullish pattern nears breakout above $2,830."
    },
    {
      "title": "Satoshi Nakamoto surpasses Bill Gates in wealth with $116.7B net worth – Elon Musk next?",
      "link": "https://ambcrypto.com/satoshi-nakamoto-surpasses-bill-gates-in-wealth-with-116-7b-net-worth-elon-musk-next/",
      "summary": "<img alt=\"Satoshi Nakamoto surpasses Bill Gates in wealth with $116.7B net worth - Elon Musk next?\" class=\"attachment-full size-full wp-post-image\" height=\"1091\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Nakamoto-Is-Now-Richer-Than-Bill-Gate.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1939\" />He’s never been seen, but his crypto stash could soon overtake Zuckerberg, Buffett, and maybe Musk next."
    }
  ]
}