{
  "CoinDesk": [
    {
      "title": "Polkadot's DOT Slips 4% From Highs, Now Testing Support at $3.32 Level",
      "link": "https://www.coindesk.com/markets/2025/07/01/polkadots-dot-slips-4-from-highs-now-testing-support-at-332-level",
      "summary": ""
    },
    {
      "title": "SEC Approves Grayscale ETF That Includes BTC, ETH, SOL, XRP, ADA",
      "link": "https://www.coindesk.com/markets/2025/07/01/sec-approves-grayscale-etf-that-includes-btc-eth-sol-xrp-ada",
      "summary": ""
    },
    {
      "title": "Bitcoin Pulls Back to $106K After Record Monthly Close",
      "link": "https://www.coindesk.com/markets/2025/07/01/bitcoin-pulls-back-after-record-monthly-close",
      "summary": ""
    },
    {
      "title": "GENIUS Act Lacks ‘Necessary Guardrails’ For Investor Protection, NYAG Letitia James Tells Congress",
      "link": "https://www.coindesk.com/policy/2025/07/01/genius-act-lacks-necessary-guardrails-for-investor-protection-nyag-letitia-james-tells-congress",
      "summary": ""
    },
    {
      "title": "Congress' Budget Bill Advances From Senate Without Crypto Tax Provision",
      "link": "https://www.coindesk.com/policy/2025/07/01/congress-budget-bill-advances-from-senate-without-crypto-tax-provision",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Swissquote ordered to curb impersonation, fraud attempts",
      "link": "https://cointelegraph.com/news/swissquote-ordered-curb-impersonation-fraud-attempts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M2YjktZWE2NC03MTE2LWE3ZTgtZWRmNWIwNDlmODJh.jpg\" /></p><p>The company offers crypto trading on the platforms that it manages, including the mixed-asset trading platforms Swissquote and Yuh.</p>"
    },
    {
      "title": "How to build a Solana DApp for iOS and Android in 15 minutes, no back end needed",
      "link": "https://cointelegraph.com/news/how-to-build-a-solana-dapp-for-ios-and-android?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M3MzMtYTQ1Zi03OGQxLWIxNzEtNGIzNjI4NDI5YzY5.jpg\" /></p><p>Developers can build cross-platform Solana mobile apps with wallet integration, token actions and NFTs in just 15 minutes.</p>"
    },
    {
      "title": "XRP news update: Traders predict consolidation to $2.35 amid ETF speculation",
      "link": "https://cointelegraph.com/news/xrp-news-update-traders-predict-consolidation-to-dollar2-35-amid-etf-speculation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M2YWEtOGJlOC03MjEyLTliMWYtNGRiOTBmZjMyYTVk.jpg\" /></p><p>XRP trades in a tight range between $2 and $2.35, but the next price breakout could be driven by ETF speculators.</p>"
    },
    {
      "title": "US Senate passes Trump’s budget bill without provision on crypto taxes",
      "link": "https://cointelegraph.com/news/senate-budget-bill-amendment-crypto-taxes?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NjkyYzQtMjJjYS03MTY4LTg2NDItODIxYTliNTgwMjBh.jpg\" /></p><p>Wyoming Senator Cynthia Lummis had proposed that the legislation address double taxation for cryptocurrency miners and stakers.</p>"
    },
    {
      "title": "Strategy set to post $13B Bitcoin gains, but revenue stalls",
      "link": "https://cointelegraph.com/news/strategy-q2-13b-bitcoin-gains-revenue-stalls?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M3MWEtNmFiZi03NGYwLTgzMzEtNDhmNzRiMGVjODA4.jpg\" /></p><p>Michael Saylor's tech company is expected to post over $13 billion in unrealized gains from its Bitcoin holdings in the second quarter of 2025.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "UniCredit to offer Bitcoin exposure to professional clients via BlackRock IBIT-linked certificate",
      "link": "https://cryptoslate.com/unicredit-to-offer-bitcoin-exposure-to-professional-clients-via-blackrock-ibit-linked-certificate/",
      "summary": "<p>European banking behemoth UniCredit is entering the crypto arena with a structured product tied to BlackRock’s spot Bitcoin exchange-traded fund (ETF), Bloomberg News reported on July 1, citing an internal memo. Under the plan, UniCredit will offer professional clients a five-year, U.S. dollar-denominated investment certificate linked to BlackRock’s iShares Bitcoin Trust (IBIT). The product will [&#8230;]</p> <p>"
    },
    {
      "title": "SEC approves Grayscale Index ETF conversion, clears Solana, XRP, Cardano for spot trading",
      "link": "https://cryptoslate.com/sec-approves-grayscale-index-etf-conversion-clears-solana-xrp-cardano-for-spot-trading/",
      "summary": "<p>The Securities and Exchange Commission (SEC) has approved the proposal to convert the Grayscale Digital Large Cap Fund into an exchange-traded fund (ETF), completing the conversion of the crypto index product into an ETF structure. According to a July 1 filing, the ETF will issue trust units that track a basket of the five largest [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin powerhouse Strategy nears S&P 500 inclusion as net income soars",
      "link": "https://cryptoslate.com/bitcoin-powerhouse-strategy-nears-sp-500-inclusion-as-net-income-soars/",
      "summary": "<p>Strategy (formerly MicroStrategy), the largest public holder of Bitcoin, is again making headlines—this time for potentially qualifying for inclusion in the prestigious S&#38;P 500 index. On July 1, Jeff Walton, founder of MSTR True North, revealed that the company will likely report an $11 billion net income for the just-concluded second quarter of the year. [&#8230;]</p> <p>"
    },
    {
      "title": "Tuttle’s new ETFs could offer 2x gains or losses on SOL, TRUMP, XRP, and more starting July 16",
      "link": "https://cryptoslate.com/tuttles-new-etfs-could-offer-2x-gains-or-losses-on-sol-trump-xrp-and-more-starting-july-16/",
      "summary": "<p>Tuttle Capital has filed an amendment to shift the effective date for a series of crypto and meme-related leveraged exchange-traded funds (ETFs) to July 16. This move, first reported by Bloomberg&#8217;s ETF analyst Eric Balchunas on July 1, could signal the imminent launch of 10 new leveraged funds. These ETFs are poised to offer double [&#8230;]</p> <p>"
    },
    {
      "title": "Kraken Elected as Super Representative on the TRON Network",
      "link": "https://cryptoslate.com/kraken-elected-as-super-representative-on-the-tron-network/",
      "summary": "<p>Geneva, Switzerland, July 1, 2025 – TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet through blockchain technology and decentralized applications (dApps), today announced that Kraken, one of the world’s longest-standing and most secure crypto platforms, has been elected as a Super Representative (SR) on the TRON blockchain network. Kraken’s institutional-grade [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Price Risks Market Crash After Closing Below Final Weekly Resistance",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-risks-market-crash/",
      "summary": "Crypto analyst Rekt Capital has warned about a potential crash for the Bitcoin price, after the flagship crypto closed below a critical resistance level. The analyst also highlighted the level that BTC needs to reclaim to invalidate this bearish setup. Bitcoin Price Risks Crash With Weekly Close Below Resistance In an X post, Rekt Capital revealed that the Bitcoin price has closed below the final major weekly resistance at around $108,890. Based on this, he remarked that a possible early-stage Lower High resistance may be developing at around $107,720, with BTC at risk of crashing. The analyst added that Bitcoin will need to reclaim $108,890 as support on the daily to invalidate this Lower High. Related Reading: Pundit Warns Bitcoin Is Setting Up Liquidity Traps As It Campaigns For New ATHs In an earlier X post, Rekt Capital highlighted how significant it would have been if the Bitcoin price had closed above this final major weekly resistance. He noted that BTC had never performed such a weekly close. As such, if that had happened last week, he claimed it would not only be “historic” but would enable BTC to enjoy a new uptrend into new all-time highs (ATHs). However, the Bitcoin price now appears to be on a downtrend, having failed to hold above the $107,720 level successfully. BTC had reached an intraday high of $107,970 but has since then been on a decline and is now at risk of losing the $106,800 macro level. Crypto analyst Kevin Capital has warned that BTC being below this level puts it in the danger zone. Meanwhile, based on historical bull market cycles, Rekt Capital has suggested that the Bitcoin price still has some more upside left. In an X post, he stated that history suggests that Bitcoin may end its bull market in two to three months. BTC Still Fuel In The Tank Despite the recent Bitcoin price drop, crypto analyst Titan of Crypto declared that the flagship crypto still has fuel in the tank. He claimed that the weekly market structure remains strong with a series of higher highs and higher lows. The analyst added that the Relative Strength Index (RSI) is pushing towards its trendline. Related Reading: Bitcoin Price At $110,000: Why BTC Must Break Out Of This Wedge His accompanying chart showed that the Bitcoin price could still rally to as high as $140,000 between September and November later this year based on these higher highs and lows. Crypto analyst Stockmoney Lizards also recently predicted that BTC could reach as high as $145,000 by September. He alluded to dojis that had formed for the flagship crypto in its current corrective channel and declared they were bullish for Bitcoin. At the time of writing, the Bitcoin price is trading at around $106,800, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Network Volume Echoes Mid-2021 ‘Stable Equilibrium’ – Is A Big Move Brewing?",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-network-volume-echoes-mid-2021-stable-equilibrium-is-a-big-move-brewing/",
      "summary": "After rebounding from a local bottom of around $75,000 in April, Bitcoin (BTC) appears to be stuck in the $100,000 to $110,000 range, showing little indication of a clear directional trend. One key data point reflecting this indecision is Bitcoin’s network volume. Bitcoin Network Volume Stuck In Balance Zone According to a recent CryptoQuant Quicktake post by contributor AxelAdlerJr, Bitcoin’s network volume has stabilized in a state of &#8216;stable equilibrium,&#8217; reminiscent of the mid-2021 consolidation phase that preceded a major move. Related Reading: Bitcoin Binary CDD Hints At Healthy Consolidation, Not A Top For the uninitiated, Bitcoin network volume refers to the total value of BTC transferred across the blockchain over a specific period, typically used to gauge market activity and capital flow. Higher network volume suggests increased investor engagement and liquidity, while lower volume may indicate reduced interest or market stagnation. Notably, when BTC reached the upper end of its current range &#8211; around $110,000 &#8211; its average network volume surged to as high as $67 billion. Since then, the metric has slightly declined and now hovers around $58.7 billion. Since January 2024, Bitcoin’s average network volume has ranged between $40 billion and $80 billion. According to the CryptoQuant analyst, this corridor has become a key indicator of network activity balance and broader market sentiment. Historically, when the Bitcoin average volume approached the upper-end of the range at $80 billion, it coincided with local price peaks of $70,000 and $100,000. On the contrary, moves toward the lower-end &#8211; around $40 billion &#8211; were associated with short-term pullbacks, though these dips were often quickly bought up by market participants. Currently, the $58.7 billion reading sits near the midpoint of this range, mirroring the consolidation phase observed in mid-2021. The analyst explained: As long as the indicator remains above the $40 billion level, we can speak of a stable fundamental market condition. Rising volumes above the $80 billion mark will confirm strengthening activity and fresh capital inflow. On the other hand, a sustained drop below $40 billion will indicate weakening network demand and may be a harbinger of a deeper correction. Is BTC Preparing For A Big Move? While Bitcoin network volume suggests the market is in a state of equilibrium, some on-chain metrics hint at a potential breakout building in the background &#8211; possibly paving the way for renewed bullish momentum. Related Reading: Bitcoin Poised For Rally As Geopolitical Tensions Ease And Inflation Expectations Fall For example, the BTC short-term holder floor has been rising steadily in recent months, currently hovering around $98,000. This provides a strong support base, potentially preventing a sharp downside correction. However, selling pressure from miners and long-term holders is also beginning to increase &#8211; casting some uncertainty over BTC’s short-term price trajectory. At press time, BTC trades at $106,528, down 0.9% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "Ethereum Indecision Masks A Bullish Setup – Here’s Why BTC Holds The Key",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-indecision-close/",
      "summary": "CRYPTOWZRD, in his latest update on X, highlighted Ethereum&#8216;s indecisive close, suggesting the market is still searching for clear direction. Despite the uncertainty, he remains optimistic, noting that both Bitcoin and BTC dominance are showing strength that could benefit ETH in the near term, with $2,800 marked as the next major resistance. Mixed Signals Across Ethereum Key Timeframes In"
    },
    {
      "title": "Here’s What Will Happen If The Bitcoin Price Can Manage A Clean Break Above $108,500",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-break-above-108500/",
      "summary": "A crypto analyst has forecasted a powerful Wave 3 Bitcoin price rally that could take it toward new all-time highs between $160,000 and $200,000. Notably, this surge is expected to come with rising Bitcoin Dominance (BTC.D) and a delayed altcoin season, particularly if BTC can make a clean break above the $108,500 resistance level. Bitcoin Price Breakout To Spark Next Bull Run The Bitcoin price is currently hovering below a critical resistance level at $108,500, and according to a crypto analyst known as ‘BigMike7335’ on the X social media platform, a clean breakout and flip of this level into support could ignite an explosive Wave 3 bull run. Based on Elliott Wave Theory and Fibonacci Extension analysis, a successful move above this threshold could open the door to a bullish price surge with potential targets set in the $160,000 to $200,000 range. Related Reading: Bitcoin Flashes Double Top Above $106,000: FVG Says A Large Crash Is Coming The analyst’s chart shows that Bitcoin has already completed its Wave 1 of a five-wave impulse move, followed by an ABC corrective Wave 2. The market is also currently consolidating, and Bitcoin’s bullish momentum appears to be rebuilding. These positive developments are supported by a rising Stochastic Relative Strength Index (RSI) from the oversold region and a neutral-to-bullish RSI, both of which point toward upward price action. Notably, the 0.618 and 1.0 Fibonacci Extensions around $117,795 and $137,421, respectively, are highlighted as interim resistance zones where price momentum could temporarily slow before continuing upward. A clean breakout above $108,500 could also place Bitcoin above a heavy volume node visible in the volume profile within the chart, suggesting less overhead resistance and a stronger potential for a price rally. Furthermore, the analysis implies that during this powerful Wave 3 phase, Bitcoin Dominance will likely climb toward 70%. This increase in BTC.D would mean capital is concentrating in the leading cryptocurrency, which historically results in altcoins underperforming. As a result, the expected altcoin season for this cycle may be postponed, following the completion or cooling of Wave 3. Analyst Predicts $375,000 Bitcoin Bull Run Peak Crypto analyst TechDave has just sounded the alarm on what he calls the Bitcoin “launch signal”, a rare trigger that has only appeared four times in history and each time marked the start of major bull market rallies. This signal previously appeared in October 2012, July 2016, and July 2020—all preceding major upward moves that ended in new cycle peaks. Related Reading: Fading Spot Volumes And Muted Futures Sentiment Threaten To Send Bitcoin Below $99,000 Again Currently, the same signal is emerging this July, aligning with the previous cycle structures and reinforcing the expectation of a breakout phase. Notably, the formation has led to exponential gains, with each bull market run typically peaking months later. Following this historical pattern, TechDave now predicts a fresh cycle top for Bitcoin at $375,000. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "GameStop Inspired a Lingerie MMA League to Buy Bitcoin: SUBBD Token Soars?",
      "link": "https://www.newsbtc.com/news/gamestop-inspired-a-lingerie-mma-league-to-buy-bitcoin-subbd-token-soars/",
      "summary": "Shaun Donelly knows a hot item when he sees one – and Bitcoin’s the hottest item of them all. The CEO of the Lingerie Fighting Championship plans to build the company’s own Bitcoin treasury, and he’s taking inspiration from an unlikely source: GameStop. Is this a flash in the pan, or is the Lingerie Fighting Championship onto something? And what does it mean for the future of Bitcoin treasuries – and for innovative applications of the blockchain? From GameStop, to Strategy, and Back Again Remember the glory days of GameStop stonks? Back when Robinhood, the trading platform, and GameStop were household names, at least for a certain sector of the trading populace. Since the heady days of $81.25 $GME stock, back in 2021, GameStop has largely trundled along, doing its own thing. Over the past year, it traded in a fairly narrow range, up a little under 5%. But GameStop did make a big splash a few weeks ago, when it announced that it was taking a step back from Michael Saylor’s Strategy approach, and would be amassing its own Bitcoin treasury. Ironically, back in 2020 and 2021, when $GME was soaring, Michael Saylor had already started to take the approach with (Micro)Strategy that would make him famous, purchasing Bitcoin early and often. And as Bitcoin’s price rose, Strategy’s strategy paid off. So when GameStop announced that it would follow in Saylor’s footsteps, some heads turned. And without further ado, GameStop purchased 4,170 Bitcoin. GameStop Inspires LFC Back to Shaun Donelly. The LFC CEO watched GameStop make its big Bitcoin purchase and decided to follow suit. To that end, the LFC will purchase $230K of Bitcoin in the next month; they plan to spend up to $2M in the next six months. The move comes ahead of a series of first-ever UK shows, with key fighters in the LFC ready to take the stage. It’s not a trendsetting move, but rather one that follows a Bitcoin treasury strategy that has been adopted by companies both large and small alike, and even by the US government itself. And there’s every sign that GameStop isn’t done – the company has $450M of a potential $2.25B ready to deploy to bolster its Bitcoin supply, according to a recent SEC filing. Donelly hopes that his company can tap into the same energy Strategy did, and maybe even a bit of the same profit over the next decade; since making its first Bitcoin purchase, $MSTR stock is up 3,170%. There’s another project in the works that aims to take advantage of the healthy crypto climate. SUBBD Token aims to spice up the $85B content creation market with a combination of AI + blockchain. SUBBD Token ($SUBBD) – Bringing Fans and Creators Together with $SUBBD The SUBBD Token ($SUBBD) is another red-hot commodity. The SUBBD platform unleashes AI content management and production, bringing both together in one place for the first time. Creators gain new ways to connect with their fans, who can use $SUBBD to access exclusive content and receive subscription discounts. At the same time, the $SUBBD platform offers several AI tools, including: ✅ AI profile creation ✅ AI voice notes ✅ AI video generator ✅ AI livestream The entire suite can be used to boost AI influencers and to manage content from human creators. And with $SUBBD, both fans and creators alike can token-gate exclusive content to create new and more personal ways of interacting. The SUBBD Token presale, now on, has raised over $714K so far. Tokens are priced at $0.0558. Our price prediction shows the token price could reach $0.438by by the end of 2025, returning 684% to current investors. Learn how to buy SUBBD Token with our guide. Visit the SUBBD Token presale to learn more. From SUBBD to the LFC From GameStop to MicroStrategy and now to the Lingerie Fighting Championship, the Bitcoin treasury strategy continues to ripple across unexpected sectors. Shaun Donelly’s $2M commitment to BTC might seem unconventional, but it reflects a broader realization: Bitcoin – and crypto more broadly – is no longer fringe; it’s foundational. Projects like SUBBD Token are capitalizing on blockchain’s flexibility, merging AI, content creation, and fan engagement in powerful new ways. In the ring and online, the crypto fight is heating up. Remember to always do your own research; this isn’t financial advice."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "DDC Enterprise Finalizes $528 Million Financing to Accelerate Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/DDC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DDC Enterprise Limited (NYSE: DDC) has officially closed its $528 million financing deal to expand its corporate Bitcoin strategy. The funding, led by Anson Funds with participation from Animoca Brands, Kenetic Capital, and others, is one of the largest Bitcoin-focused capital raises by a NYSE-listed company.&#160; “This maximum aggregate $528 million capital commitment marks a [&#8230;]</p> <p>"
    },
    {
      "title": "Eric Trump’s American Bitcoin Raises $220 Million in Private Stock Sale To Buy More BTC",
      "link": "https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Gryphon-to-Merge-with-Eric-Trumps-American-Bitcoin-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc\" rel=\"nofollow\"> </a></p> <p>The Hut 8 sold over 11 million shares to investors, securing $215 million in net proceeds to expand its Bitcoin holdings and mining operations.</p> <p>"
    },
    {
      "title": "The One Big Beautiful Act Passes in the U.S. Senate — Without Bitcoin Tax Amendment",
      "link": "https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/One-Big-Beautiful-Act-Bitcoin-Magazine.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment\" rel=\"nofollow\"> </a></p> <p>Despite a push from Senator Cynthia Lummis (R-WY), an amendment regarding de minimus capital gains exemption on crypto spending was not included in the version of the One Big Beautiful Act that passed in the Senate.</p> <p>"
    },
    {
      "title": "Public Companies Are Buying More Bitcoin Than ETFs for Third Quarter in a Row",
      "link": "https://bitcoinmagazine.com/news/public-companies-are-buying-more-bitcoin-than-etfs-for-third-quarter-in-a-row",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Public-companies-are-buying-more-Bitcoin-than-ETFs-for-the-third-quarter-in-a-row-driven-by-favorable-regulations-and-a-desire-to-grow-investor-value.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/public-companies-are-buying-more-bitcoin-than-etfs-for-third-quarter-in-a-row\" rel=\"nofollow\"> </a></p> <p>Corporate treasuries have surpassed exchange-traded funds (ETFs) in Bitcoin accumulation for the third consecutive quarter, according to new data from Bitcoin Treasuries. Public companies acquired approximately 131,000 BTC in Q2 2025—an 18% increase from the previous quarter—compared to an 8% uptick, or 111,000 BTC, among ETFs.&#160; “The institutional buyer who is getting exposure to Bitcoin [&#8230;]</p> <p>"
    },
    {
      "title": "Italian Bank UniCredit SpA Announces Investment On BlackRock’s Bitcoin ETF IBIT",
      "link": "https://bitcoinmagazine.com/news/italian-bank-unicredit-spa-announces-investment-on-blackrocks-bitcoin-etf-ibit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Italian-Bank-UniCredit-SpA-Announces-Investment-On-BlackRocks-Bitcoin-ETF-IBIT.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/italian-bank-unicredit-spa-announces-investment-on-blackrocks-bitcoin-etf-ibit\" rel=\"nofollow\"> </a></p> <p>The bank offers professional clients a five-year structured product with protection against losses and exposure to Bitcoin ETF performance.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Grayscale ETF Holding XRP, Solana and Cardano Receives SEC Green Light",
      "link": "https://decrypt.co/328048/grayscale-etf-holding-xrp-solana-cardano-sec-green-light",
      "summary": "The regulator approved Grayscale's bid to convert a fund primarily focused on Bitcoin, but also holding other major cryptocurrencies, into an exchange-traded fund."
    },
    {
      "title": "Moon or Doom: Will Bitcoin See Fireworks on July 4?",
      "link": "https://decrypt.co/328015/bitcoin-price-prediction-108k-myriad-july-4",
      "summary": "Will Bitcoin close the week above $108,000? The odds on the Myriad prediction market have swung dramatically."
    },
    {
      "title": "Trump’s ‘Big Beautiful Bill’ Passes Senate—Without Bitcoin Tax Exemptions",
      "link": "https://decrypt.co/328037/trumps-big-beautiful-bill-passes-senate-without-bitcoin-tax-exemptions",
      "summary": "Crypto industry leaders had raced to include provisions in the bill that would have offered crypto miners and retail users key tax benefits—but the clock ran out."
    },
    {
      "title": "MACRO, CRYPTO UNICORNS, ROBINHOOD & NYC TAKEAWAYS",
      "link": "https://decrypt.co/videos/interviews/uK36sQMB/macro-crypto-unicorns-robinhood-nyc-takeaways",
      "summary": "XRP, DOGE lead majors with positive funding rates. BTC & ETH ETFs extend inflows streak. RexShares SOL staking ETF to go live Wednesday. SEC delays staking for Bitwise ETH ETF. Robinhood intros staking, tokenised stocks, L2 chain. Robinhood stock hits ATH on announcements. Raydium, XStocks launch tokenised stocks trading. Jupiter allows swap of SOL memecoins to stocks. ByBit, Backed collab for tokenised stocks, ETF. Centrifuge to launch tokenised S&amp;P 500 index. Lummis calls for end to unfair taxes on crypto. Stablecoin bill could be finalised by mid-July. Connecticut bans creation of state BTC reserve. Strategy buys $532m BTC. Bitmine to turn into Strategy of ETH, stock up 7x. Circle applies for National Trust Bank license in US. Baer now Head of Product at X, also SOL advisor. Katana launches L2 after $200m deposits."
    },
    {
      "title": "'Reset Button for the Degen Soul': Ethereum L2 Coin Flip Game Pairs Betting With AI-Powered Vibes",
      "link": "https://decrypt.co/327988/reset-button-degen-soul-ethereum-coin-flip-game-gambling-ai-vibes",
      "summary": "Betting on a coin flip isn’t bad odds when you’ve spent all day in the meme coin trenches—plus Token Yugijo gives you an AI-powered pal."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Nasdaq-listed Webus inks $100M funding deal with Ripple Strategy Holdings to support XRP reserve strategy, stock jumps 130% intraday",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy-funding/",
      "summary": "<p>Webus' strategic funding deal could enhance its market position in crypto mobility, potentially influencing blockchain adoption in related sectors.</p> <p>"
    },
    {
      "title": "SEC approves Grayscale’s proposal to convert BTC, ETH, XRP, ADA large-cap fund into a spot ETF",
      "link": "https://cryptobriefing.com/crypto-spot-etf-sec-approval/",
      "summary": "<p>The SEC's approval signals growing acceptance of crypto assets in traditional finance, potentially boosting market legitimacy and investor access.</p> <p>"
    },
    {
      "title": "SEC considers allowing crypto ETFs to launch without 19b-4 filing",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec/",
      "summary": "<p>Streamlining crypto ETF approvals could accelerate market growth, enhance investor access, and influence global regulatory approaches.</p> <p>"
    },
    {
      "title": "Tuttle Capital targets July 16 to launch 10 leveraged crypto ETFs, including XRP, BNB, TRUMP, and more",
      "link": "https://cryptobriefing.com/leveraged-crypto-etfs-tuttle-launch/",
      "summary": "<p>The launch of leveraged crypto ETFs could increase market volatility and attract both speculative interest and regulatory scrutiny.</p> <p>"
    },
    {
      "title": "Gloria AI links up with Kosher Capital to refine agent strategies using live signal feeds",
      "link": "https://cryptobriefing.com/autonomous-trading-agents-live-feeds/",
      "summary": "<p> Kosher Capital integrates Gloria AIs real-time news feeds to upgrade its 380 autonomous trading agents with macro and crypto intelligence.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "XRP price prediction – Bulls can reclaim $2.6 unless THIS happens first",
      "link": "https://ambcrypto.com/xrp-price-prediction-bulls-can-reclaim-2-6-unless-this-happens-first/",
      "summary": "<img alt=\"XRP price prediction - Bulls can reclaim $2.6 unless THIS happens first\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/XRP-price-prediction.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Over 1 billion XRP tokens have been bought and moved off exchanges in H1 2025."
    },
    {
      "title": "Bitcoin loses 50% whale flow! 2 reasons why BTC can still survive",
      "link": "https://ambcrypto.com/bitcoin-loses-50-whale-flow-2-reasons-why-btc-can-still-survive/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/5F743ECA-E3D3-4AB0-8718-A5F9BEB6E128.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin whales vanished fast, but are they gone for good?"
    },
    {
      "title": "Ethereum Futures spike against Bitcoin: What the 98% volume ratio means",
      "link": "https://ambcrypto.com/ethereum-futures-spike-against-bitcoin-what-the-98-volume-ratio-means/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-7.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can Ethereum truly challenge Bitcoin's dominance, or even lead a new \"altcoin season?\""
    },
    {
      "title": "SUI’s $164 mln token unlock triggers sell-off fears: Price crash ahead?",
      "link": "https://ambcrypto.com/suis-164-mln-token-unlock-triggers-sell-off-fears-price-crash-ahead/",
      "summary": "<img alt=\"SUI&#039;s $164 mln token unlock triggers sell-off fears: Price crash ahead?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Chandan-2025-07-01T162701.025_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Sui Network set to unlock 58.35 million tokens, worth $164.44 million."
    },
    {
      "title": "SOL price spikes on ETF launch with staking – Is $200 in sight or just hype?",
      "link": "https://ambcrypto.com/sol-price-spikes-on-etf-launch-with-staking-is-200-in-sight-or-just-hype/",
      "summary": "<img alt=\"SOL price spikes on ETF launch with staking - Is $200 in sight or just hype?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/SOL-ETF-.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />REX-Osprey SOL ETF with staking could make SOL 'unpopular' for earning yield."
    }
  ]
}