{
  "CoinDesk": [
    {
      "title": "Shiba Inu's Futures Open Interest Tops 7M SHIB as Price Recovery Meets Whale Selling",
      "link": "https://www.coindesk.com/markets/2025/07/09/shiba-inu-s-futures-open-interest-tops-7m-shib-as-price-recovery-meets-whale-selling",
      "summary": ""
    },
    {
      "title": "Tariffs Don't Budge Bitcoin, PNUT Pops on Musk Rant: Crypto Daybook Americas",
      "link": "https://www.coindesk.com/daybook-us/2025/07/09/tariffs-don-t-budge-bitcoin-pnut-pops-on-musk-rant-crypto-daybook-americas",
      "summary": ""
    },
    {
      "title": "'This Isn’t Decentralized,' Says Polymarket Power User as Zelenskyy's Suit Controversy Unfolds",
      "link": "https://www.coindesk.com/markets/2025/07/09/this-isnt-decentralized-says-polymarket-power-user-as-zelenskyys-suit-controversy-unfolds",
      "summary": ""
    },
    {
      "title": "Ripple Taps BNY Mellon to Custody Stablecoin Reserves as RLUSD Surpasses $500M",
      "link": "https://www.coindesk.com/business/2025/07/09/ripple-taps-bny-mellon-to-custody-stablecoin-reserves-as-rlusd-surpasses-usd500m",
      "summary": ""
    },
    {
      "title": "Trump's Tariff Threat Fails to Move the Needle on Fed Interest Rate Expectations",
      "link": "https://www.coindesk.com/markets/2025/07/09/trump-s-tariff-threat-fails-to-move-the-needle-on-fed-interest-rate-expectations",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Pump.fun token sale confirmed, Europe-based users barred: Bybit",
      "link": "https://cointelegraph.com/news/pumpfun-token-sale-confirmed-bybit-bars-european-users?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VmMGItZWRmNi03NzQxLWE4MTQtZDVjYzA1MmVlMjdk.jpg\" /></p><p>Bybit will host PumpFun’s PUMP token sale from July 12–15, but users in Europe will be excluded due to regulatory restrictions.</p>"
    },
    {
      "title": "Ether corporate treasuries critical for the ecosystem: Joseph Lubin",
      "link": "https://cointelegraph.com/news/eth-treasuries-are-criticical-for-the-ecosystem-ethereum-co-founder-joseph-lubin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VlYTAtOTc4NS03NDI4LTlmMDYtNWJhYjE4NzdiYTg2.jpg\" /></p><p>Ethereum co-founder Joseph Lubin said that corporate ETH treasuries are vital for driving ecosystem growth.</p>"
    },
    {
      "title": "Emirates airline signs MoU with Crypto.com to enable crypto payments",
      "link": "https://cointelegraph.com/news/emirates-crypto-com-crypto-payments?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzg4OTYtZGM3Ni03N2E1LTlhY2QtZjVhYmFjMDMyMGE0.jpg\" /></p><p>Emirates and Crypto.com will work together to introduce crypto payments and launch promotional campaigns to boost adoption.</p>"
    },
    {
      "title": "SOL price ’bull chart’ targets $300 as Solana ETF approval odds hit 99.7%",
      "link": "https://cointelegraph.com/news/sol-price-bull-chart-300-solana-etf-approval-odds-99-7-percent?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VlNjQtZGFlNS03MGM5LTgyYjMtNjM2MWY3Njc4NjM4.jpg\" /></p><p>SOL price analysts see the altcoin’s potential to rally to new all-time highs as a spot Solana ETF is likely to be approved this year.</p>"
    },
    {
      "title": "South Korea plans to lift crypto venture business restrictions",
      "link": "https://cointelegraph.com/news/south-korea-to-lift-crypto-venture-restrictions?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmNlYjUtYWNmYi03MDc0LTk1ZjgtZTA3M2E5Y2IxZmE0.jpg\" /></p><p>South Korea may lift restrictions on crypto firms, allowing them venture status and access to tax breaks, funding and regulatory benefits.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Polygon surges 10% ahead of Heimdall v2 upgrade",
      "link": "https://cryptoslate.com/polygon-surges-10-ahead-of-heimdall-v2-upgrade/",
      "summary": "<p>Polygon&#8217;s Proof-of-Stake (PoS) network will undergo a major consensus upgrade with the rollout of Heimdall v2 on July 10. Sandeep Nailwal, Polygon&#8217;s co-founder, described it as the most technically advanced hard fork the chain has undertaken since its launch in 2020. Following the announcement, the network&#8217;s native token, POL, gained nearly 10% within 24 hours, [&#8230;]</p> <p>"
    },
    {
      "title": "New Zealand to ban crypto ATMs in AML crackdown",
      "link": "https://cryptoslate.com/new-zealand-to-ban-crypto-atms-in-aml-crackdown/",
      "summary": "<p>New Zealand&#8217;s Ministry of Justice is set to ban crypto ATMs as part of a sweeping overhaul of the country&#8217;s anti-money laundering and counter-terrorism financing (AML/CFT) framework. The move forms part of a broader strategy to tighten regulations around financial crime while reducing compliance burdens for legitimate businesses. In a statement released on July 9, [&#8230;]</p> <p>"
    },
    {
      "title": "Survey finds gaps in mainstream Bitcoin coverage, leaving institutional investors exposed",
      "link": "https://cryptoslate.com/survey-finds-gaps-in-mainstream-bitcoin-coverage-leaving-institutional-investors-exposed/",
      "summary": "<p>A second-quarter survey of 18 mainstream news outlets logged 1,116 Bitcoin (BTC) stories and measured sentiment at 31% positive, 41% neutral, and 28% negative, according to Bitcoin analysis firm Perception. The data reveal a significant gap between finance-focused media that cover the market extensively and legacy publications that rarely address it. Sparse coverage Perception counted [&#8230;]</p> <p>"
    },
    {
      "title": "Joe Lubin forecasts Ethereum treasury strategies will reshape Wall Street perception",
      "link": "https://cryptoslate.com/joe-lubin-forecasts-ethereum-treasury-strategies-will-reshape-wall-street-perception/",
      "summary": "<p>Ethereum and Consensys co-founder Joe Lubin said companies adopting ETH treasury strategies will play a critical role in communicating the second-largest digital asset&#8217;s value to Wall Street, as major financial institutions ramp up blockchain use and process around 24 million transactions daily. Lubin made the statement during an interview with CNBC on July 8 in [&#8230;]</p> <p>"
    },
    {
      "title": "Stablecoin issuers’ $182 billion US Treasury hoard ranks 17th among countries, beating UAE and South Korea",
      "link": "https://cryptoslate.com/stablecoin-issuers-182-billion-us-treasury-hoard-ranks-17th-among-countries-beating-uae-and-south-korea/",
      "summary": "<p>Four US-dollar stablecoin issuers hold roughly $182 billion in US Treasury bills, an amount that would slot them 17th on the Treasury Department’s country-by-country league table. The amount in overnight Treasury-collateralized repos and Treasury-heavy money market funds would put the group between Norway’s $195.9 billion and Saudi Arabia’s $133.8 billion. Tether&#8217;s USDT tops the cohort. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Makes Trump’s Unspoken Crypto Top 5—What You Need To Know",
      "link": "https://www.newsbtc.com/xrp-news/xrp-makes-trump-unspoken-crypto-top-5/",
      "summary": "Trump Media &#38; Technology Group (TMTG) quietly lodged an S-1 with the US Securities and Exchange Commission late on July 8, seeking approval for the “Truth Social Crypto Blue Chip ETF.” Despite a swirl of social-media posts placing the paperwork in early June, the SEC’s time-stamp confirms the filing date as July 8. The prospectus sketches a five-coin portfolio weighted approximately 70 percent to bitcoin, 15 percent to ether, 8 percent to solana, 5 percent to Cronos and 2 percent to XRP, making it the first Trump-branded product to diversify beyond the two largest digital assets. The trust, structured as a Nevada business trust and sponsored by boutique issuer Yorkville America Digital, aims to list its shares on NYSE Arca. Foris DAX Trust — the US institutional arm of Crypto.com — is named digital-asset custodian, while authorized participants will create and redeem blocks of 10,000 shares in kind or for cash, subject to NYSE rule changes. The prospectus also discloses that staking rewards on ether, solana and cronos may be passed through to the fund, a design choice that would set a precedent among US spot-crypto ETFs. Related Reading: Pundit Explains Why XRP Stands To Gain Big From Ripple’s RLUSD Analyst Eric Balchunas of Bloomberg distilled the filing in two succinct posts on X: “New filing for the Truth Social Crypto Blue Chip ETF, which will be a spot crypto basket holding Bitcoin, Ether, Solana, XRP and Cronos,” he wrote; in a follow-up, he reproduced the pivotal language: “the Trust’s allocation… is initially expected to approximate 70% bitcoin, 15% ether, 8% SOL, 5% CRO and 2% XRP.” Those percentages now serve as the market’s working model for how the Trump universe ranks crypto’s ‘blue chips.’ Why Solana, Cronos And XRP? Overall, the allocation may serve as an implicit ranking of the top five crypto assets as viewed through the lens of Trump’s inner circle. Binance top trader by PnL Nachi (@alphawifhat) commented via X: “I think it&#8217;s useful to look at the allocation ratio of the Truth Social Crypto ETF [&#8230;] I see this as an indication of how Trump&#8217;s crypto team looks at the top crypto assets and what are the top 5 they want to value the most. This could be a catalyst to pump CRO as it&#8217;s a dark horse.” Solana’s climb to an 8 percent weight is more than a momentum trade. CME Group this spring announced cash-settled Solana futures pending CFTC sign-off, extending the same institutional rails that helped bitcoin and ether graduate into ETF form. Notably, the SEC has set a July deadline for spot Solana ETF refilings, indicating a potential approval before the October 2 deadline. Related Reading: XRP Set To Shock The Crypto Market With 30% Share, Analyst Predicts Cronos leaps over better-capitalized tokens because Crypto.com is literally powering Trump’s ETFs. “We are proud to partner with Trump Media and Yorkville… including the first-of-its-kind basket of tokens featuring CRO,” Crypto.com co-founder Kris Marszalek said in March when the multi-year, roughly $2.7 billion partnership was unveiled. Under the agreement, Crypto.com supplies custody, liquidity and back-end order routing for all Truth-branded funds. XRP brings up the rear at two percent, reflecting both its renewed legitimacy and its still-nascent institutional plumbing. On June 27, Ripple Labs announced that it will withdraw its cross appeal against the SEC. The token’s modest two-percent slice is politicized as much as it is financial. In early March a staffer from Ballard Partners—the K-Street shop that counts Ripple as a client—slipped Donald Trump draft language for a Truth Social post urging that XRP, Solana and Cardano be placed in a national “Crypto Strategic Reserve.” Trump hit “post” and only later discovered the Ripple connection; insiders told Politico he “was furious and felt like he’d been used.” Despite that, the inclusion of XRP still shows Trump’s ties with Ripple. At press time, XRP traded at $2.33. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Tether Secret Swiss Vault: The $8 Billion Gold Reserve Behind The Stablecoin",
      "link": "https://www.newsbtc.com/news/tether-usdt/tether-secret-swiss-vault-the-8-billion-gold-reserve-behind-the-stablecoin/",
      "summary": "Tether Holdings, the issuer of the market’s largest stablecoin, USDT, has revealed that it maintains a vault in Switzerland to safeguard an impressive $8 billion stockpile of gold. According to Bloomberg, the firm&#8217;s significant reserve of nearly 80 tons positions Tether as one of the largest gold holders globally, surpassed only by central banks and sovereign nations with the company based in El Salvador expressing intentions to expand its gold reserves further. Tether Reveals 5% Of Reserves In Precious Metals In a recent interview, Tether&#8217;s CEO, Paolo Ardoino, emphasized the security of their vault, claiming it to be among the most secure facilities worldwide. While he confirmed the vault’s location in Switzerland, he opted not to disclose its exact whereabouts, citing security concerns. Related Reading: PEPE Traders Spot Breakout Echo—Explosive Surge Back On The Table? Tether is best known for its stablecoin, USDT, which aims to maintain a one-to-one value with the US dollar. According to CoinMarketCap data, USDT dominates the stablecoin market with a capitalization of $158 billion. Circle’s USDC follows closely behind with a capitalization of $61 billion. However, both companies are expected to see a major surge in this metric as the recently approved US Senate stablecoin bill, the GENIUS Act, aims to provide issuers with a new regulatory framework that could further boost adoption and usage of the assets by traditional financial companies. The company also generates revenue by exchanging dollars for USDT tokens and investing the collateral in various assets, including US Treasuries. According to Tether&#8217;s latest financial report, precious metals now account for nearly 5% of the company’s reserves. Benefits Of The Gold-Backed XAUT Token In addition to USDT, Tether has introduced a gold-backed token known as XAUT, with each token representing one ounce of gold. Token holders have the option to redeem their XAUT for physical gold, which can be collected directly from the Swiss vault. Related Reading: Ethereum Sees $6 Billion In Tokenized Funds As Big Players Jump In Ardoino articulated a growing belief in gold as a safer asset compared to national currencies, particularly in light of rising concerns over the increasing debt levels in the United States. He noted that as these concerns grow, investors may seek alternatives, such as gold. The firm’s CEO further highlighted that every central bank within the BRICS nations is actively purchasing gold, which he believes has contributed to the rising price of the precious metal. Per the report, the decision to establish Tether&#8217;s own vault rather than relying on traditional precious metals vault operators was primarily influenced by cost considerations. As of press time, Circle’s newly launched stock, CRCL, has closed the trading day at $204, approximately a 31% gap between current valuations and their record price of $298. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Analyst Predicts 2,000% Cardano Rally: ‘Fractal Is Too Clean To Ignore’",
      "link": "https://www.newsbtc.com/news/cardano/analyst-predicts-2000-cardano-rally/",
      "summary": "Crypto-market commentator “Quantum Ascend” devoted a 8 June video to a single idea: the price structure that once catapulted Ethereum Classic to its bull-market peak is about to do the same for Cardano—and could deliver a twenty-fold advance if history “rhymes rather than repeats.” Speaking to his followers, the analyst opened by noting that ADA’s weekly chart “looks so similar” to the multi-year pattern that preceded Ethereum Classic’s vertical move in early 2021. “They have the same market makers,” he asserted, pointing out that Cardano founder Charles Hoskinson had early involvement in both projects. “It’s almost like a cheat code for this thing.” Cardano Set For 2,000% Explosion To illustrate the parallel, Quantum Ascend overlaid the two assets’ Elliott-wave counts. In his reading, Ethereum Classic completed its fifth impulsive wave during the last cycle, whereas Cardano is “waiting on that fifth wave” after a prolonged flag-shaped consolidation. He then dropped a Fibonacci retracement on Ethereum Classic’s 2020–21 third-to-fourth-wave segment, showing the final thrust topped out “just shy of the 2.36”—and repeated the exercise on Cardano’s current structure, which has advanced to the same proportional level. “Come on, it’s not perfect,” he conceded, “but you guys see how similar these structures are.” A second Fibonacci projection, stretching Cardano’s initial three-wave span to a full 1.618 extension, points to a conservative target “up around four bucks,” he said. But a more ambitious extrapolation of Ethereum Classic’s 3.618 climax would propel ADA into a zone between roughly 10.67 and 12.55—an area he calls his “primary” and “secondary” objectives. From the current price such a run would exceed 2,000 percent. “That’s violent,” he remarked after flicking his cursor to the comparative surge on the ETC chart. “Hopefully you can see how clean this is, because I feel really good about Cardano getting up into that $10 level.” Related Reading: Cardano (ADA) Turns Upward — Signs of a Recovery Emerge Quantum Ascend argued that the temporal spacing is also lining up. Ethereum Classic’s listing in August 2016 meant its multiyear base completed roughly four and a half years later; Cardano’s analogous base, begun in late 2017, is now of similar duration, though “the whole chart has taken a little bit longer on the consolidation.” For him, that extension merely “loads the spring” for a sharper repricing once last season begins in earnest. The analyst did allow for interim turbulence. In his scenario, ADA could hit the former all-time-high region around $3.12, “reject back down to $1.67” during a broader market-wide wave-four shake-out, and only then launch into a blow-off toward the upper Fibonacci cluster. Still, even that corrective loop reinforces the fractal: “Over here with Ethereum Classic it got to its last all-time high, rejected, and then went on one more big run.” Related Reading: Cardano Price Woes To Continue? Analyst Expects ADA To Fall To $0.47 Quantifying his own risk appetite, Quantum Ascend told viewers he is “pretty hyped on Cardano” and wants the token “in my portfolio because it is one of my higher-conviction plays for what’s about to happen here.” He concluded by sketching three tiers of price objectives—$4.90 (conservative), $10.67 (primary) and $12.45 (secondary). Whether altseason’s starting gun fires as cleanly as the fractal implies remains to be seen, but Quantum Ascend’s thesis hinges on a single proposition: when the same market makers move two historically linked assets through mirror-image patterns, ignoring the setup may prove costlier than betting against it. At press time, ADA traded at $0.59. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Is Already Outperforming Bitcoin In July, Is Altcoin Season Here?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-outperforming-bitcoin/",
      "summary": "With one week already gone in the month of July, Ethereum has already begun to perform better than Bitcoin. While the gap is still very close, the outperformance of Ethereum over Bitcoin for only the second time this year could signal the entrance of better things for the altcoin market. If this continues, then an altcoin season might be on the horizon, as historical data shows it always begins with ETH outperforming BTC. So, let’s take a look at how both assets have been performing. Ethereum Barrels Ahead Of Bitcoin In July So far, in the month of July, the Ethereum price has been putting in more green candles, suggesting that bulls are making their move again. This has led to a small outperformance when compared to the Bitcoin price over this time period and could be the signal that altcoin season could be starting soon. Related Reading: Shiba Inu Price Could See 180% Explosion As This Indicator Flashes Bullish Divergence Data from the CryptoRank website shows that Ethereum is already up more than 2.50% since the start of July. Meanwhile, the Bitcoin price, while having seen some price increases, is up only 1.20% at the time of this writing. Thus, Ethereum is already performing better in the month of July. If this outperformance continues, then this would be only the second time that the Ethereum price will be doing better than the Bitcoin price so far in 2025. The first was back in May, when the Ethereum price rallied by over 41% in one month. This was major compared to Bitcoin’s 11.1% move in that month. However, while the Bitcoin rally in the month of May saw its price reach new all-time highs, Ethereum continues to struggle and remains below its $4,800 all-time high levels. Nevertheless, Ethereum’s rally did translate to bullishness for the altcoin market as the likes of PEPE and BONK rallied by more than 100% in response to this. Related Reading: Bitcoin To Repeat Parabolic Phase From 2017 And 2021? Here’s The Target Given that Ethereum has led the altcoin season in the past, its outperformance of Bitcoin at this level remains a positive. If it continues, then the altcoin market could start to see further increases in price. And if Ethereum rises another 41% from here, it would put it right on the path to $4,000. However, the month of July has not historically been the best month for Ethereum, with an average return of +5.13%. The whole of the third quarter of the year is also a mixed bag for the altcoin, with an equal number of green and red closes over the last decade. Thus, it remains to be seen how the ETH price will perform this quarter and if it can successfully outpace Bitcoin. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana Ready For $160 Reclaim? Analysts Say Breakout Is A Matter Of Time",
      "link": "https://www.newsbtc.com/news/solana-ready-for-160-reclaim-analysts-say-breakout-is-a-matter-of-time/",
      "summary": "As the crypto market moves sideways, Solana (SOL) compresses between two key levels. Some analysts suggest that the cryptocurrency is about to break out and reclaim a crucial resistance level, which could trigger the long-awaited retest of the $200 barrier. Related Reading: Bitcoin Back In ‘Retesting Phase’ After Key Level Reclaim – The Calm Before The Storm? Solana Holds Key Support After recovering from last month’s downtrend, Solana has been attempting to reclaim the crucial $160 level to continue its bullish rally. The cryptocurrency traded between the $140-$180 range for two months, but briefly lost its post-breakout range in late June. Two weeks ago, SOL fell below the $130 area, hitting a two-month low of $126 on June 22. Since then, the altcoin has recovered, fueled by last week’s launch of a Solana staked crypto Exchange-Traded Fund (ETF) in the US by Rex Shares. Following the news, Solana’s price jumped toward the $160 resistance level but was rejected, hovering between the $145-$155 price range for the past week. On Tuesday, SOL fell below the $150 level, hitting the $147 support before bouncing. Analyst Ali Martinez noted that the $147.59 area is one of the most important support levels for Solana, as losing this level could trigger a pullback to the next key zone around the $141 mark. Similarly, market watcher Man of Bitcoin affirmed that SOL’s key support to maintain is around $141.91, adding that “a sustained break below this level would suggest that wave-C of (ii) is already underway.” The analyst previously warned that there is a potential scenario “with one more low in wave-5,” if the cryptocurrency doesn’t hold about the $148 mark. However, maintaining this support would build a base to target the local highs. SOL About To Retest $160? Analyst Carl Runefelt from The Moon Show affirmed that SOL is “about to break off” a triangle formation and test the $162 resistance. As the price compresses between the upper and lower boundaries, the analyst suggested that the cryptocurrency’s breakout is around the corner. Notably, Solana has been forming a one-week symmetrical triangle pattern in the daily chart. If the cryptocurrency successfully breaks above the $152-$153 zone, it could see a 10.87% jump toward the technical target of $167. The Cryptonomist highlighted that SOL broke out of a multi-day diagonal resistance on Sunday, which was retested and confirmed as support after bouncing around the $147 twice since the breakout. Related Reading: 50% Bitcoin Price Crash On The Horizon? Analyst Reveals $60,000 Target The analyst considers that the cryptocurrency is preparing for a continuation of its rally, targeting the one-week high and resistance of $160. Meanwhile, Crypto Jelle noted that despite the April downside deviation, Solana continues to trade within its $125-$180 Macro Range, currently hovering around the mid-range. To him, “it looks like it&#8217;s just waiting for BTC to break out. Once it reclaims $160, $200 should come quickly. Above there, new all-time highs are within reach.” As of this writing, Solana is trading at $151.51, a 3.6% increase in the weekly timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Showed Up in DC — And Washington Took Notice",
      "link": "https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Showed-Up-in-DC-—-And-Washington-Took-Notice-fotor-2025070812361.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/politics/bitcoin-showed-up-in-dc-and-washington-took-notice\" rel=\"nofollow\"> </a></p> <p>Reflections on the Bitcoin Policy Summit in Washington DC during May 2025. </p> <p>"
    },
    {
      "title": "Bow Valley Credit Union in Canada turns on Bitcoin purchases for Albertans",
      "link": "https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_an_orange_bull_running_through_an_Alberta_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans\" rel=\"nofollow\"> </a></p> <p>BVCU’s Bitcoin Gateway, with Balance Custody and Bull Bitcoin API, simplifies buying bitcoin. “Facilitates institutional adoption,” says Francis Pouliot. </p> <p>"
    },
    {
      "title": "KULR Secures $20M Bitcoin-Backed Credit Facility from Coinbase Credit",
      "link": "https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Secures-20M-Bitcoin-Backed-Credit-Facility-from-Coinbase-Credit.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit\" rel=\"nofollow\"> </a></p> <p>The deal sets up a multi-draw loan facility worth up to $20 million to expand its Bitcoin holdings.</p> <p>"
    },
    {
      "title": "Sequans Closes $384 Million Investment To Launch Bitcoin Treasury Initiative",
      "link": "https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Sequans-Closes-384-Million-Investment-To-Launch-Bitcoin-Treasury-Initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a fabless semiconductor company focusing on 5G/4G IoT semiconductor technology, has officially closed a $384 million strategic investment to kick off its Bitcoin treasury initiative. The deal combines $195 million in equity financing and $189 million in secured convertible debentures, reflecting growing institutional appetite for Bitcoin. The Offering included the sale of over [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet Enters ‘Bitcoin Gold Rush’ with Plans to Buy 210,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Metaplanet-Enters-Bitcoin-Gold-Rush-with-Plans-to-Buy-210000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027\" rel=\"nofollow\">Metaplanet Enters &#8216;Bitcoin Gold Rush&#8217; with Plans to Buy 210,000 BTC by 2027</a></p> <p>Japan’s top bitcoin treasury firm aims to grow its holdings to 210,000 BTC by 2027 and wants to use its growing reserves to buy cash-generating businesses.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Getting Started With Myriad",
      "link": "https://decrypt.co/resources/getting-started-with-myriad",
      "summary": "Myriad's prediction market ecosystem enables you to make predictions using points and USDC. Here’s how to get set up and start using it."
    },
    {
      "title": "OmegaPro Founders Charged Over $650 Million Crypto ‘Global Fraud Scheme’",
      "link": "https://decrypt.co/329241/omegapro-founders-charged-over-650-million-crypto-global-fraud-scheme",
      "summary": "The duo allegedly used lavish Dubai events and luxury displays to lure investors into a bogus forex scheme that collapsed in 2023."
    },
    {
      "title": "New Zealand to Ban Crypto ATMs, Cap Transfers in AML Regime Shake-Up",
      "link": "https://decrypt.co/329228/new-zealand-bans-crypto-atms-caps-transfers",
      "summary": "With 221 machines nationwide, New Zealand joins countries reining in crypto kiosks over rising financial crime concerns."
    },
    {
      "title": "Inside North Korea's Hiring Scams Targeting Crypto Firms",
      "link": "https://decrypt.co/329225/inside-north-korea-hiring-scams-crypto-firms",
      "summary": "Companies and recruiters are warning that North Korea is hiring Europeans as fronts for job interviews, and the problem is only getting worse."
    },
    {
      "title": "Grok Glitch Inspires Wave of ‘MechaHitler’ Meme Coins",
      "link": "https://decrypt.co/329219/grok-glitch-inspires-mechahitler-meme-coins",
      "summary": "Rogue AI hallucinations by Grok have given rise to new crypto memes as well as associated tokens on Solana and Ethereum."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Ripple taps BNY to secure RLUSD stablecoin with institutional-grade custody",
      "link": "https://cryptobriefing.com/enterprise-stablecoin-custody-rlusd/",
      "summary": "<p>Ripple's partnership with BNY Mellon could accelerate institutional crypto adoption, enhancing trust and bridging traditional finance with digital assets.</p> <p>"
    },
    {
      "title": "Airline giant Emirates to accept Bitcoin and crypto payments for flights, services",
      "link": "https://cryptobriefing.com/emirates-crypto-payments-flights/",
      "summary": "<p>Emirates' crypto payment integration could accelerate digital currency adoption in global travel, aligning with Dubai's financial innovation goals.</p> <p>"
    },
    {
      "title": "Trillion-dollar bank clears Bitwise crypto ETF for advisor-managed accounts",
      "link": "https://cryptobriefing.com/crypto-etf-approval-bitwise-bank/",
      "summary": "<p>Institutional adoption of crypto ETFs signals a shift towards mainstream acceptance, potentially increasing crypto's role in diversified portfolios.</p> <p>"
    },
    {
      "title": "Phantom introduces in-wallet perps trading powered by Hyperliquid",
      "link": "https://cryptobriefing.com/in-wallet-perps-trading-phantom/",
      "summary": "<p>Phantom's integration of perpetual futures trading could significantly enhance user engagement and broaden crypto market accessibility.</p> <p>"
    },
    {
      "title": "ProShares’ XRP futures ETF listed on DTCC under ticker UXRP",
      "link": "https://cryptobriefing.com/proshares-xrp-etf-dtcc-listing/",
      "summary": "<p>The listing of ProShares' XRP futures ETF on DTCC suggests growing institutional interest and potential market expansion for crypto ETFs.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bonk.fun flips Pump.fun – What does this mean for the Solana-based meme’s demand?",
      "link": "https://ambcrypto.com/bonk-fun-flips-pump-fun-what-does-this-mean-for-the-solana-based-memes-demand/",
      "summary": "<img alt=\"Bonk.fun flips Pump.fun - What does this mean for the Solana-based meme&#039;s demand?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox-1-2.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The dominance of Bonk.fun against Pump.fun could kickstart Solana-based meme demand."
    },
    {
      "title": "New Meme Coin Little Pepe (LILPEPE) Exceeds $4,475,000 as Presale Stage 4 Wraps Up Early",
      "link": "https://ambcrypto.com/new-meme-coin-little-pepe-lilpepe-exceeds-4475000-as-presale-stage-4-wraps-up-early/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"414\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Screenshot-2025-07-09-165017.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"738\" />The meme coin landscape has just been shaken by a rising powerhouse—Little Pepe (LILPEPE). With [&#8230;]"
    },
    {
      "title": "Cronos crypto soars 16% – Is CRO poised for more gains?",
      "link": "https://ambcrypto.com/cronos-cryptos-16-surge-explained-is-cro-poised-for-more-gains/",
      "summary": "<img alt=\"Cronos [CRO]\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-33.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Cronos price rallies after Truth Social filed for Crypto Blue Chip ETF."
    },
    {
      "title": "Ethereum vs. Solana: The $630B altcoin battle – Who will lead Q3?",
      "link": "https://ambcrypto.com/ethereum-vs-solana-the-630b-altcoin-battle-who-will-lead-q3/",
      "summary": "<img alt=\"SOL vs. ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika-1-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can Solana reassert dominance against Ethereum in Q3?"
    },
    {
      "title": "PENGU’s short-term price targets – A triangle breakout, $1M inflows, and more…",
      "link": "https://ambcrypto.com/pengus-short-term-price-targets-a-triangle-breakout-1m-inflows-and-more/",
      "summary": "<img alt=\"PENGU&#039;s short-term price targets - A triangle breakout, $1M Inflows, and more...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-08T174945.508-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PENGU’s rising inflows and breakout structure have been in line with renewed market activity, social engagement."
    }
  ]
}