{
  "CoinDesk": [
    {
      "title": "EU Central Bank Commits to Distributed Ledger Technology Settlement Work",
      "link": "https://www.coindesk.com/policy/2025/07/01/eu-central-bank-commits-to-distributed-ledger-technology-settlement-work",
      "summary": ""
    },
    {
      "title": "Why Is Ether Struggling Near $2,400 Even as More Firms Add ETH to Their Treasuries?",
      "link": "https://www.coindesk.com/markets/2025/07/01/why-is-ether-struggling-near-usd2-400-even-as-more-firms-add-eth-to-their-treasuries",
      "summary": ""
    },
    {
      "title": "Solana Drops Below $146 Despite Imminent Launch of First U.S.-Based SOL Staking ETF",
      "link": "https://www.coindesk.com/markets/2025/07/01/solana-drops-below-usd146-despite-imminent-launch-of-first-u-s-based-sol-staking-etf",
      "summary": ""
    },
    {
      "title": "Polkadot's DOT Slips 4% From Highs, Now Testing Support at $3.32 Level",
      "link": "https://www.coindesk.com/markets/2025/07/01/polkadots-dot-slips-4-from-highs-now-testing-support-at-332-level",
      "summary": ""
    },
    {
      "title": "SEC Approves Grayscale ETF That Includes BTC, ETH, SOL, XRP, ADA",
      "link": "https://www.coindesk.com/markets/2025/07/01/sec-approves-grayscale-etf-that-includes-btc-eth-sol-xrp-ada",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "SOL ETF news gain evaporates, while chart warns of another 20% drop",
      "link": "https://cointelegraph.com/news/sol-etf-news-gain-evaporates-while-chart-warns-of-another-20percent-drop?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGY2NjEtMzY3NS03ODQwLWEwYWQtYWM2YTM4NmEzMjgz.jpg\" /></p><p>SOL retraced its ETF rally, and with over 14% of supply concentrated at $144, holding this key support is critical to avoid a deeper correction.</p>"
    },
    {
      "title": "SEC approves conversion of Grayscale&#039;s large-cap crypto fund into ETF",
      "link": "https://cointelegraph.com/news/sec-conversion-grayscale-large-cap-crypto-fund-etf?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWE3ODQtNmJmNC03MTc1LWEyZGUtMDQwMTZhYjdmNTkz.jpg\" /></p><p>Grayscale has slowly narrowed the arbitrage opportunities on its crypto trusts by converting them into exchange-traded funds.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "US regulator considers simplified path to market for crypto ETFs",
      "link": "https://cointelegraph.com/news/us-considers-simplified-path-to-market-crypto-etfs?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWE3ODQtNmJmNC03MTc1LWEyZGUtMDQwMTZhYjdmNTkz.jpg\" /></p><p>The United States Securities and Exchange Commission is reportedly considering simplifying the listing process for certain crypto ETFs.</p>"
    },
    {
      "title": "Bitcoin at risk of deeper drop as BTC slips below key support levels",
      "link": "https://cointelegraph.com/news/bitcoin-at-risk-of-deeper-drop-as-btc-slips-below-key-support-levels?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NzIyMTgtMTFiYS03NTU4LTk1ZTctNmM4MmZmMWY2MWJh.jpg\" /></p><p>A revisit to the $100,000 level seems likely now that BTC price slipped below two key support levels.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Ethereum dev Zack Cole launches initiative to fund ‘tokenless’ projects, promote ETH burning mechanisms",
      "link": "https://cryptoslate.com/ethereum-dev-zack-cole-launches-initiative-to-fund-tokenless-projects-promote-eth-burning-mechanisms/",
      "summary": "<p>Ethereum developer Zak Cole is spearheading a new initiative called the Ethereum Community Foundation (ECF), which will primarily work to enhance the digital asset&#8217;s economic value. The initiative was announced during the Ethereum Community Conference in Cannes, France. Founded by Cole and a group of ecosystem supporters, the ECF has reportedly already raised &#8220;millions&#8221; and [&#8230;]</p> <p>"
    },
    {
      "title": "Figma discloses $70M Bitcoin exposure via Bitwise ETF in IPO filing, plans another $30M buy",
      "link": "https://cryptoslate.com/figma-discloses-70m-bitcoin-exposure-via-bitwise-etf-in-ipo-filing-plans-another-30m-buy/",
      "summary": "<p>Figma’s initial public offering (IPO) prospectus reveals that the design software company holds approximately $69.5 million of the Bitwise Bitcoin ETF (BITB). According to a July 1 filing, a table lists the ETF under level-1 marketable securities at $69.533 million. The document also stated that the board authorized a $55 million purchase on March 3, [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin holders exhibit ‘diamond hands’ as unrealized profits swell past $1 trillion",
      "link": "https://cryptoslate.com/bitcoin-holders-exhibit-diamond-hands-as-unrealized-profits-swell-past-1-trillion/",
      "summary": "<p>Bitcoin (BTC) investors have kept their coins off exchanges in recent weeks, even as market-wide profitability climbed to levels that typically trigger distribution, according to a July 1 report from Glassnode. Bitcoin fell from $106,000 to $99,000 during last week’s Israel-Iran flare-up, but buyers defended the short-term holder cost basis at $98,300 and pushed the [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin dips to $105k on Q3 open despite record monthly close",
      "link": "https://cryptoslate.com/bitcoin-dips-to-105k-on-q3-open-despite-record-monthly-close/",
      "summary": "<p>The crypto market saw significant declines on July 1 despite Bitcoin&#8217;s record monthly close the day prior amid continued institutional and corporate accumulation. Bitcoin (BTC) managed to maintain its footing above the $105,000, but altcoins experienced drastic declines, with some posting double-digit percentage losses for the day. Bitcoin fell nearly 2% to a low of [&#8230;]</p> <p>"
    },
    {
      "title": "Corporate treasuries double ETF Bitcoin buys in H1, signaling aggressive boardroom adoption",
      "link": "https://cryptoslate.com/corporate-treasuries-double-etf-bitcoin-buys-in-h1-signaling-aggressive-boardroom-adoption/",
      "summary": "<p>Public companies bought 245,510 Bitcoin (BTC) in the first half of the year, more than 2x higher than the 118,424 BTC absorbed by exchange-traded funds (ETFs) during the same period. The year-to-date figure marks a 375% jump from the 51,653 BTC corporations acquired in the first half of 2024. ETFs, by contrast, purchased 56% less [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Michael Saylor Drops $500 Million On Bitcoin—What’s His Next Move?",
      "link": "https://www.newsbtc.com/news/bitcoin/michael-saylor-drops-500-million-on-bitcoin-whats-his-next-move/",
      "summary": "MicroStrategy has just added another 4,980 Bitcoin to its stash, spending about $531 million at an average of $106,801 per coin. That brings the company’s total haul to 597,325 BTC. Related Reading: Crypto Bombshell: Developer Claims XRP Could Hit $20,000 At today’s market price, those holdings are worth over $64 billion, compared with the roughly $42.4 billion MicroStrategy (now Strategy) has put in, fees included. According to the June 30 filing with the US Securities and Exchange Commission, Strategy &#8211; led by billionaire Michael Saylor &#8211; is sitting on nearly $21.6 billion in unrealized gains. Strategic Bitcoin Push Strategy bought its latest batch during the week ending June 29. The firm has already snapped up 88,062 BTC worth nearly $10 billion so far this year. Back in 2024, the company picked up 140,538 BTC at a cost of $13 billion. Company data shows a Bitcoin yield of almost 20% year‑to‑date, with 7.8% gained in the second quarter alone. That edges Strategy closer to its goal of a 25% yield by the end of 2025. Strategy has acquired 4,980 BTC for ~$531.9 million at ~$106,801 per bitcoin and has achieved BTC Yield of 19.7% YTD 2025. As of 6/29/2025, we hodl 597,325 $BTC acquired for ~$42.40 billion at ~$70,982 per bitcoin. $MSTR $STRK $STRF $STRD https://t.co/xvWnSkfukS — Michael Saylor (@saylor) June 30, 2025 Corporate Treasury Trend Strategy now controls almost 3% of all the Bitcoin ever mined out of the 21 million cap. That dominance has inspired 134 publicly traded firms to follow suit, adding Bitcoin to their corporate treasuries. Recent adopters include Twenty One, US President Donald Trump’s media firm Trump Media, and GameStop. In Japan, Metaplanet added 1,005 BTC this week to bring its total to 13,350 BTC. Over in Europe, The Blockchain Group bought 60 BTC, lifting its holdings to 1,788 BTC valued at around €161.3 million. 🟠 The Blockchain Group has acquired 60 BTC for ~€5.5 million at ~€91,879 per bitcoin and has achieved BTC Yield of 1,270.7% YTD, 69.3% QTD. As of 6/30/2025, $ALTBG holds 1,788 $BTC for ~€161.3 million at ~€90,213 per bitcoin⚡️@_ALTBG Europe&#8217;s First Bitcoin Treasury Company… https://t.co/BmcqZzvfoz — Alexandre Laizet ⚡️ (@AlexandreLaizet) June 30, 2025 New Trading Products Arrive Cryptocurrency exchanges are racing to meet all this demand. On June 28, Gemini rolled out a tokenized version of Strategy stock for investors in the EU. That marks the exchange’s first tokenized equity offering in that region. Shares of Strategy have climbed nearly 5% over the past month, trading around $391, according to Google Finance data. Related Reading: Insane Or Insightful? VC Firm Says XRP Could Reach Nearly $9,000 In Just 5 Years Price Resistance Looms Bitcoin itself has been holding near $108,000. It rose as much as 3% over the weekend to hit $108,798. Some traders, like MN Capital founder Michael van de Poppe, expect a brief pullback before BTC tries to breach $109,000. That level sits on the four-hour chart as a clear resistance point. Data from CoinGlass shows nearly $50 million in liquidity stacked at $109,500. If Bitcoin can clear the $110,000–$112,300 zone, it could trigger a short squeeze that pushes prices into fresh record territory. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "XRP Roadmap To $8.5: Why The Next Impulse Could Start Soon",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-roadmap-to-8-5/",
      "summary": "XRP is starting to draw attention again as signs of a potential breakout begin to take shape. With market sentiment gradually shifting and XRP holding key support levels, analysts suggest that the stage may be set for the next impulse wave. If momentum continues to build and critical resistances are cleared, XRP could be on the verge of an explosive price rally to $8.5. Elliott Wave Points To Major XRP Price Breakout Paul Webborn, a crypto analyst on X (formerly Twitter), has released a new XRP forecast update, reinforcing his bullish stance on the third-largest cryptocurrency. In his analysis, the market expert reveals that XRP may be entering a powerful impulse phase, with projected targets potentially reaching or even surpassing $8 in the current cycle. Related Reading: Analyst Says XRP Is Moving According To Plan, Here’s Why $1.90 Is Important Webborn’s analysis applies Elliott Wave Theory to track XRP’s price movements from its June 2022 low, identifying that point as the start of a new bullish cycle. The chart provides a visual roadmap of XRP’s next moves based on the impulse wave structure. The cryptocurrency is expected to experience a short-term rise to initial targets below $8, followed by a brief pullback before a final rally that could push XRP to new all-time highs. Notably, the chart shows that primary Waves A and B have already played out, and XRP is now progressing through Wave C, which is unfolding in five intermediate waves. Intermediate waves 1 through 4 appear complete, with Wave 5 still forming. Webborn notes that this final fifth wave is expected to break down into five smaller minor waves. Minor wave 3 is projected to push XRP toward the $5 and $6 range, while the full extension of Wave C could carry it to between $8 and $10. The analyst has set an invalidation level at $1.90, meaning any move below that would break the current bullish structure and possibly lead to further downward pressure on the XRP price. Webborn predicts that if the $1.90 level is broken, XRP could potentially experience a crash toward new lows around $0.287, marking more than an 87% decline from its present market price. However, the chart suggests that this low has already been reached, further reinforcing the bullish narrative that the altcoin may be on the verge of a major upward breakout. While Webborn has provided no specific timeline for his optimistic forecast, the analyst believes that the coming few months could be explosive as the market enters the next phase of the impulse. Update On Price Action Lately, the XRP price has maintained strong support above $2, showing strength despite an extended consolidation period. CoinMarketCap data shows that the cryptocurrency is currently trading at $2.22, reflecting a modest 1.35% rise over the past day. Related Reading: Analyst Puts XRP Cycle High At $20-$30, Here’s Why Although XRP is still priced significantly below its all-time high, data from CoinCodex shows that market sentiment remains highly bullish. The cryptocurrency’s Fear and Greed Index also currently sits at 64, firmly in the ‘Greed’ zone. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Solana Hits New Milestone: Wallets Holding 0.1+ SOL Reach Record High",
      "link": "https://www.newsbtc.com/news/solana/solana-hits-new-milestone-wallets-holding-0-1-sol-reach-record-high/",
      "summary": "Solana has returned to the spotlight as speculation around a potential Solana ETF approval gains momentum. While still unconfirmed, growing signals from market insiders suggest that regulatory green lights may not be far off. If approved, a Solana ETF would mark a major milestone for the ecosystem, opening the door to traditional capital flows and broader institutional exposure, similar to what Bitcoin and Ethereum experienced following their own ETF breakthroughs. For long-term investors, this development could set the foundation for a new phase of sustainable growth. Related Reading: Strong Ethereum Accumulation Detected: LTH Buying Heavy During June Consolidation Supporting this bullish outlook is fresh data from Glassnode, which shows that the number of wallets holding over 0.1 SOL has reached a new all-time high. This milestone marks an increase in retail participation and growing confidence in Solana&#8217;s long-term potential. As the network continues to mature, the rise in small holders also signals expanding grassroots adoption—an encouraging sign during a period of market uncertainty. While short-term price action may still be driven by broader macro trends, sentiment around Solana is clearly improving. If ETF approval becomes a reality, the combination of increased accessibility and rising on-chain adoption could significantly boost Solana’s market position in the coming months. Solana Growing On-Chain Adoption Solana is currently trading below the $150 mark after experiencing a sharp retracement from its May high. The asset has lost more than 20% in value since peaking earlier this cycle, driven largely by broader market consolidation and declining risk appetite across altcoins. Despite the recent pullback, SOL continues to hold a strong support zone near the $135–$140 range, which has proven resilient during previous sell-offs. Analysts remain cautiously optimistic, noting that a sustained push above key supply zones—particularly the $155–$165 range—could reignite bullish momentum. However, the market remains in a phase of indecision. Price action across major assets, including Solana, reflects uncertainty as traders wait for a clear breakout or breakdown to confirm the next move. Without a strong catalyst, SOL may continue to consolidate alongside the broader altcoin market. Amid the sideways price action, one encouraging signal is the growing on-chain adoption. Top analyst Ali Martinez shared data from Glassnode showing that the number of wallets holding over 0.1 SOL has reached a new all-time high, now exceeding 11.44 million. This steady rise in non-zero wallets points to expanding retail participation and long-term holder confidence, even as short-term volatility persists. The divergence between price action and user adoption suggests that Solana’s fundamental growth remains intact. If momentum returns and macro conditions improve, Solana may be well-positioned for a breakout, especially with ETF rumors fueling speculative interest. For now, the $150 level remains a psychological pivot as the market watches for signs of direction. Related Reading: Bitcoin Dominance Shows Bearish Divergence – Altseason Could Be Near SOL Price Action Details: Key Levels To Watch Solana (SOL) is currently trading at $149.30, just below the key resistance confluence of the 50-day, 100-day, and 200-day moving averages, all clustered between $150 and $151. This area has acted as a strong technical barrier, and SOL&#8217;s repeated failure to reclaim it reflects the market&#8217;s hesitancy amid broader uncertainty. After rallying to $159.99 earlier in the session, bears stepped in and pushed the price back down, closing the candle with a bearish wick, signaling ongoing selling pressure. The chart reveals a prolonged consolidation pattern that has developed since the mid-May rejection near $180. Despite several bounce attempts, SOL has not been able to regain bullish momentum. The volume profile also suggests fading interest during upswings, a common trait during accumulation or exhaustion phases. Notably, price remains above the March low, preserving a key higher low structure, which is crucial for the broader bullish outlook. Related Reading: Bitcoin Struggles Below ATH After Weeks Of Failed Attempts – $109K Level In Focus If SOL breaks above the $151–$155 range with sustained volume, it could trigger a move toward $180. However, failure to clear this resistance might lead to another test of support around $135. Traders should watch for a decisive close above the moving average cluster to confirm trend continuation, especially with ETF speculation fueling long-term optimism. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Tron Shows Adoption Strength As Volume Still Led By Big Transfers – Details",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-shows-adoption-strength-as-volume-still-led-by-big-transfers-details/",
      "summary": "Tron (TRX) is once again in the spotlight as it tests the upper and lower boundaries of a key consolidation range that has held for months. The price has been oscillating between $0.211 and $0.295—a range that has acted as both support and resistance since the start of the year. With volatility gradually returning to the crypto market, a breakout from this zone could set the stage for a major directional move. A confirmed push above $0.295 could open the door for a rally toward uncharted territory, while a break below $0.211 might signal a deeper correction. Related Reading: Strong Ethereum Accumulation Detected: LTH Buying Heavy During June Consolidation According to new data from CryptoQuant, large transactions are currently driving volume dominance on the Tron network. While the majority of transactions on TRON are under $1,000 in size—showing that retail users are actively engaged—it is the high-value transfers that account for most of the total volume, highlighting growing institutional or whale interest in the network. As broader market conditions remain uncertain and altcoins begin to show signs of life, the coming weeks will be critical for TRX. Whether bulls or bears take control will likely depend on how the price reacts to this well-defined consolidation range. Tron Eyes Expansion Amid Growing Network Activity Tron has captured significant attention in recent weeks, driven by a combination of major announcements and strong on-chain activity. A report two weeks ago revealed that Tron is preparing to go public via a reverse merger with Nasdaq-listed SRM Entertainment. While full details have yet to be confirmed by official channels, sources familiar with the matter suggest the process is underway. If completed, this move could mark a historic moment for the blockchain space, giving Tron greater exposure to traditional investors and boosting institutional legitimacy. Despite these developments, price action remains locked in a consolidation phase. The broader market’s volatility and macro uncertainty continue to suppress directional momentum for TRX. However, network fundamentals tell a different story—Tron’s on-chain activity is booming. Top analyst Darkfost highlighted a key insight: large transactions currently drive volume dominance on the TRON network. Although more than 1 million USDT transactions on TRON are below $1,000, just 16,000 transfers above $100,000 dominate in terms of volume. This divergence shows that while retail usage is high, major players are still actively moving large amounts of capital on the network. The consistent dominance of small transfers reflects Tron&#8217;s accessibility and everyday utility among users, while the growing transaction count signals expanding adoption. Together, these factors suggest that Tron is building strong foundations, regardless of short-term price direction. The coming weeks could be pivotal, especially if the public listing advances and TRX breaks its multi-month price range. Related Reading: Bitcoin Dominance Shows Bearish Divergence – Altseason Could Be Near TRX Consolidates Near Resistance Amid Growing Momentum Tron is currently trading at $0.2787 after several weeks of sideways movement, as shown in the chart. The asset remains in a well-defined consolidation range between the $0.211 support zone and the $0.295 resistance. Despite several attempts, TRX has been unable to decisively break through the upper boundary, signaling market hesitation. However, the overall price structure remains constructive. The 50-day, 100-day, and 200-day simple moving averages (SMA) are all trending upward, with price currently testing the 50-day SMA as dynamic resistance. This alignment supports the argument for a longer-term bullish structure, even as short-term consolidation continues. Volume has slightly picked up in recent days, suggesting a growing interest among traders. A clear breakout above $0.295 would likely trigger a new upward phase and bring fresh highs into play. Until then, traders are watching for confirmation, as the market tests the upper boundary of the range. Related Reading: Ethereum Sees $269M In Net Inflows In 24H – Bullish Momentum Accelerates With strong fundamentals, increasing on-chain activity, and speculation about Tron’s public listing via reverse merger, momentum could accelerate soon. If bulls can maintain the $0.27–$0.28 level and push above $0.295, TRX could enter price discovery for the first time in months, opening the door to higher valuations. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Risks Market Crash After Closing Below Final Weekly Resistance",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-risks-market-crash/",
      "summary": "Crypto analyst Rekt Capital has warned about a potential crash for the Bitcoin price, after the flagship crypto closed below a critical resistance level. The analyst also highlighted the level that BTC needs to reclaim to invalidate this bearish setup. Bitcoin Price Risks Crash With Weekly Close Below Resistance In an X post, Rekt Capital revealed that the Bitcoin price has closed below the final major weekly resistance at around $108,890. Based on this, he remarked that a possible early-stage Lower High resistance may be developing at around $107,720, with BTC at risk of crashing. The analyst added that Bitcoin will need to reclaim $108,890 as support on the daily to invalidate this Lower High. Related Reading: Pundit Warns Bitcoin Is Setting Up Liquidity Traps As It Campaigns For New ATHs In an earlier X post, Rekt Capital highlighted how significant it would have been if the Bitcoin price had closed above this final major weekly resistance. He noted that BTC had never performed such a weekly close. As such, if that had happened last week, he claimed it would not only be “historic” but would enable BTC to enjoy a new uptrend into new all-time highs (ATHs). However, the Bitcoin price now appears to be on a downtrend, having failed to hold above the $107,720 level successfully. BTC had reached an intraday high of $107,970 but has since then been on a decline and is now at risk of losing the $106,800 macro level. Crypto analyst Kevin Capital has warned that BTC being below this level puts it in the danger zone. Meanwhile, based on historical bull market cycles, Rekt Capital has suggested that the Bitcoin price still has some more upside left. In an X post, he stated that history suggests that Bitcoin may end its bull market in two to three months. BTC Still Fuel In The Tank Despite the recent Bitcoin price drop, crypto analyst Titan of Crypto declared that the flagship crypto still has fuel in the tank. He claimed that the weekly market structure remains strong with a series of higher highs and higher lows. The analyst added that the Relative Strength Index (RSI) is pushing towards its trendline. Related Reading: Bitcoin Price At $110,000: Why BTC Must Break Out Of This Wedge His accompanying chart showed that the Bitcoin price could still rally to as high as $140,000 between September and November later this year based on these higher highs and lows. Crypto analyst Stockmoney Lizards also recently predicted that BTC could reach as high as $145,000 by September. He alluded to dojis that had formed for the flagship crypto in its current corrective channel and declared they were bullish for Bitcoin. At the time of writing, the Bitcoin price is trading at around $106,800, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Wallet of Satoshi Partners With Spark To Offer Self-Custodial Bitcoin Lightning Experience",
      "link": "https://bitcoinmagazine.com/news/wallet-of-satoshi-partners-with-spark-to-offer-self-custodial-bitcoin-lightning-experience",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Wallet-of-Satoshi-Partners-With-Spark-To-Offer-Self-Custodial-Bitcoin-Lightning-Experience.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/wallet-of-satoshi-partners-with-spark-to-offer-self-custodial-bitcoin-lightning-experience\" rel=\"nofollow\"> </a></p> <p>Wallet of Satoshi will be in a beta version, bringing self-custody lightning wallets to Spark platform.</p> <p>"
    },
    {
      "title": "Figma Reveals $70M Bitcoin ETF Holdings, Plans to Buy $30M More",
      "link": "https://bitcoinmagazine.com/news/figma-reveals-70m-bitcoin-etf-holdings-plans-to-buy-30m-more",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Figma-Reveals-70M-Bitcoin-ETF-Holdings-Plans-to-Buy-30M-More.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/figma-reveals-70m-bitcoin-etf-holdings-plans-to-buy-30m-more\" rel=\"nofollow\"> </a></p> <p>The design software company invested $55M in a Bitwise Bitcoin ETF and got board approval to convert $30M USDC into Bitcoin.</p> <p>"
    },
    {
      "title": "DDC Enterprise Finalizes $528 Million Financing to Accelerate Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/DDC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ddc-enterprise-finalizes-528-million-financing-to-accelerate-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DDC Enterprise Limited (NYSE: DDC) has officially closed its $528 million financing deal to expand its corporate Bitcoin strategy. The funding, led by Anson Funds with participation from Animoca Brands, Kenetic Capital, and others, is one of the largest Bitcoin-focused capital raises by a NYSE-listed company.&#160; “This maximum aggregate $528 million capital commitment marks a [&#8230;]</p> <p>"
    },
    {
      "title": "Eric Trump’s American Bitcoin Raises $220 Million in Private Stock Sale To Buy More BTC",
      "link": "https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Gryphon-to-Merge-with-Eric-Trumps-American-Bitcoin-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/eric-trumps-american-bitcoin-raises-220-million-in-private-stock-sale-to-buy-more-btc\" rel=\"nofollow\"> </a></p> <p>The Hut 8 sold over 11 million shares to investors, securing $215 million in net proceeds to expand its Bitcoin holdings and mining operations.</p> <p>"
    },
    {
      "title": "The One Big Beautiful Act Passes in the U.S. Senate — Without Bitcoin Tax Amendment",
      "link": "https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/One-Big-Beautiful-Act-Bitcoin-Magazine.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-one-big-beautiful-act-passes-in-the-u-s-senate-without-bitcoin-tax-amendment\" rel=\"nofollow\"> </a></p> <p>Despite a push from Senator Cynthia Lummis (R-WY), an amendment regarding de minimus capital gains exemption on crypto spending was not included in the version of the One Big Beautiful Act that passed in the Senate.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Cloudflare Hits the Kill Switch on AI Crawlers—And an Entire Industry Cheers",
      "link": "https://decrypt.co/328057/cloudflare-hits-kill-switch-ai-crawlers-entire-industry-cheers",
      "summary": "The world’s largest internet security provider just defaulted to blocking AI crawlers—and lets publishers set a price for scraping."
    },
    {
      "title": "High on DOGE? Cannabis Company Makes Dogecoin Treasury Play",
      "link": "https://decrypt.co/328071/high-doge-cannabis-company-dogecoin-treasury-play",
      "summary": "Publicly traded cannabis company Dogecoin Cash Inc. is embracing the real DOGE after previously stockpiling a derivative meme coin."
    },
    {
      "title": "MARA Bitcoin Production Slides 25% as Mining Environment Toughens",
      "link": "https://decrypt.co/328076/mara-bitcoin-production-slides-25-as-mining-environment-toughens",
      "summary": "The Florida-based firm produced 237 fewer Bitcoin in June compared to the month prior, but said in its latest report that it would increase its network’s power by 40%."
    },
    {
      "title": "Fed Chair Powell Says Trump Policies to Blame for Lack of Rate Cuts",
      "link": "https://decrypt.co/328069/fed-chair-powell-says-trump-policies-blame-lack-rate-cuts",
      "summary": "Powell said Tuesday that if not for President Trump's aggressive tariff policies, the Fed would have likely already cut interest rates in 2025."
    },
    {
      "title": "Why Is Robinhood Building on Arbitrum Instead of Solana?",
      "link": "https://decrypt.co/328070/why-is-robinhood-building-on-arbitrum-instead-of-solana",
      "summary": "A Kraken spokesperson told that the company is working to bring xStocks to chains beyond Solana."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Figma IPO filing shows $70M in BTC ETFs, gets board nod for $30M more",
      "link": "https://cryptobriefing.com/bitcoin-corporate-treasury-figma/",
      "summary": "<p>Figma's S-1 reveals $70M in Bitcoin ETFs and board approval for $30M BTC via USDC, highlighting its Bitcoin corporate treasury strategy.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus inks $100M funding deal with Ripple Strategy Holdings to support XRP reserve strategy, stock jumps 130% intraday",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy-funding/",
      "summary": "<p>Webus' strategic funding deal could enhance its market position in crypto mobility, potentially influencing blockchain adoption in related sectors.</p> <p>"
    },
    {
      "title": "SEC approves Grayscale’s proposal to convert BTC, ETH, XRP, ADA large-cap fund into a spot ETF",
      "link": "https://cryptobriefing.com/crypto-spot-etf-sec-approval/",
      "summary": "<p>The SEC's approval signals growing acceptance of crypto assets in traditional finance, potentially boosting market legitimacy and investor access.</p> <p>"
    },
    {
      "title": "SEC considers allowing crypto ETFs to launch without 19b-4 filing",
      "link": "https://cryptobriefing.com/crypto-etf-approval-sec/",
      "summary": "<p>Streamlining crypto ETF approvals could accelerate market growth, enhance investor access, and influence global regulatory approaches.</p> <p>"
    },
    {
      "title": "Tuttle Capital targets July 16 to launch 10 leveraged crypto ETFs, including XRP, BNB, TRUMP, and more",
      "link": "https://cryptobriefing.com/leveraged-crypto-etfs-tuttle-launch/",
      "summary": "<p>The launch of leveraged crypto ETFs could increase market volatility and attract both speculative interest and regulatory scrutiny.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "45 mln MOVE pulled from Binance – Will bulls stay in control?",
      "link": "https://ambcrypto.com/45-mln-move-pulled-from-binance-will-bulls-stay-in-control/",
      "summary": "<img alt=\"45 mln MOVE pulled from Binance - Will bulls stay in control?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Lennox.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Buybacks by Movement Labs could be a hint of a potential trend to the upside."
    },
    {
      "title": "Is this the future of Wall Street? Robinhood brings U.S. stocks on-chain in Europe",
      "link": "https://ambcrypto.com/is-this-the-future-of-wall-street-robinhood-brings-u-s-stocks-on-chain-in-europe/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-8.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A 131% surge in HOOD stock followed the news, but adoption and regulation remain key."
    },
    {
      "title": "SYRUP pulls back to $0.5, but there’s an opportunity ahead",
      "link": "https://ambcrypto.com/syrup-pulls-back-to-0-5-but-theres-an-opportunity-ahead/",
      "summary": "<img alt=\"SYRUP pulls back to $0.5, but there&#039;s an opportunity ahead\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/SYRUP-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The daily price chart showed that SYRUP bulls remained dominant, and traders can look to buy."
    },
    {
      "title": "XRP price prediction – Bulls can reclaim $2.6 unless THIS happens first",
      "link": "https://ambcrypto.com/xrp-price-prediction-bulls-can-reclaim-2-6-unless-this-happens-first/",
      "summary": "<img alt=\"XRP price prediction - Bulls can reclaim $2.6 unless THIS happens first\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/XRP-price-prediction.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Over 1 billion XRP tokens have been bought and moved off exchanges in H1 2025."
    },
    {
      "title": "Bitcoin loses 50% whale flow! 2 reasons why BTC can still survive",
      "link": "https://ambcrypto.com/bitcoin-loses-50-whale-flow-2-reasons-why-btc-can-still-survive/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/5F743ECA-E3D3-4AB0-8718-A5F9BEB6E128.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin whales vanished fast, but are they gone for good?"
    }
  ]
}