{
  "CoinDesk": [
    {
      "title": "Ethereum Developer Proposes 6-Second Block Times to Boost Speed, Slash Fees",
      "link": "https://www.coindesk.com/tech/2025/06/24/ethereum-developer-proposes-6-second-block-times-to-boost-speed-slash-fees",
      "summary": ""
    },
    {
      "title": "Bitcoin Set for Biggest Mining Difficulty Drop Since July 2021",
      "link": "https://www.coindesk.com/markets/2025/06/24/bitcoin-set-for-biggest-mining-difficulty-drop-since-july-2021",
      "summary": ""
    },
    {
      "title": "Hong Kong Family Office VMS to Allocate Up to $10M to First Crypto Play: Bloomberg",
      "link": "https://www.coindesk.com/business/2025/06/24/hong-kong-family-office-vms-to-allocate-up-to-10m-to-first-crypto-play-bloomberg",
      "summary": ""
    },
    {
      "title": "Nasdaq Futures Chalk Out Golden Cross Near Record High, Offering Bullish Cues to Bitcoin",
      "link": "https://www.coindesk.com/markets/2025/06/24/nasdaq-futures-chalk-out-golden-cross-near-record-high-offering-bullish-cues-to-bitcoin",
      "summary": ""
    },
    {
      "title": "U.S. Housing Regulator Could Let Crypto Be Considered in Mortgage Applications",
      "link": "https://www.coindesk.com/business/2025/06/24/us-housing-regulator-could-let-crypto-be-considered-in-mortgage-applications",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "US housing agency may allow crypto assets in mortgage qualification",
      "link": "https://cointelegraph.com/news/federal-housing-finance-agency-investigates-crypto-for-mortgage-qualification?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2ExMjYtNDc3Yi03Yjk2LWExYTgtZGE0NzMyNDZjODhi.jpg\" /></p><p>The US Federal Housing Finance Agency is reviewing whether crypto holdings like Bitcoin could be used to qualify for mortgages.</p>"
    },
    {
      "title": "Turkey tightens crypto rules with source, purpose checks on transfers",
      "link": "https://cointelegraph.com/news/turkey-tighten-crypto-oversight-source-purpose-checks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2ExNjEtMTgzNS03N2M5LWEzNzUtMzkwODFmZTBiNmU2.jpg\" /></p><p>Turkey’s Finance Ministry plans new rules requiring crypto platforms to collect source and purpose data, with limits on stablecoin transfers.</p>"
    },
    {
      "title": "Why is Bitcoin price up today?",
      "link": "https://cointelegraph.com/news/why-is-bitcoin-price-up-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvMjk3NTY5OWMtYWJkZC00ZjdiLWJkMzUtNzQyNjdhNTcwMTE3.jpg\" /></p><p>Bitcoin price is up on June 24 as multiple BTC market metrics show an improvement in investor sentiment.</p>"
    },
    {
      "title": "Bitcoin makes up one-third of investor crypto portfolios in 2025",
      "link": "https://cointelegraph.com/news/bitcoin-accounts-one-third-investor-portfolios-in-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzE5NWItMGQ0OS03MGI4LTgzODMtYmM3OTViNjU0M2Y1.jpg\" /></p><p>Institutional Bitcoin allocation is on the rise, while retail BTC holdings are falling in favor of altcoins with a strong ETF approval chances, such as XRP.</p>"
    },
    {
      "title": "Hardware wallet Ledger launches offline recovery key for new wallets",
      "link": "https://cointelegraph.com/news/hardware-wallet-ledger-offline-recovery-keys-new-wallets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2EwYzktMzdiOS03OGI1LWIxODYtNWI3YjA5MTg2NjMz.jpg\" /></p><p>Unlike Ledger’s previously released key recovery product, Ledger Recover, the new Ledger Recovery Key is always offline and doesn’t require identification.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "XRP leads crypto market rally as Iran-Israel’s tentative ceasefire lifts sentiment",
      "link": "https://cryptoslate.com/xrps-lead-crypto-market-rally-as-iran-israels-tentative-ceasefire-lifts-sentiment/",
      "summary": "<p>Crypto markets bounced back in early Asian trading hours on June 24, sparked by US President Donald Trump&#8217;s announcement that a ceasefire had been reached between Israel and Iran. On June 24, Trump posted on Truth Social: &#8220;CONGRATULATIONS TO EVERYONE! It has been fully agreed by and between Israel and Iran that there will be [&#8230;]</p> <p>"
    },
    {
      "title": "Ark Invest’s Cathie Wood dumps $110M more Circle shares amid valuation surge flipping Robinhood",
      "link": "https://cryptoslate.com/ark-invests-cathie-wood-dumps-another-110m-in-circle-shares-amid-valuation-surge-that-flipped-robinhoods-value/",
      "summary": "<p>Cathie Wood&#8217;s ARK Invest sold around $110 million worth of Circle (CRCL) shares on June 23, continuing a wave of profit-taking just weeks after the stablecoin issuer went public. According to the firm&#8217;s latest trading disclosure, the firm&#8217;s ARK Innovation ETF (ARKK) offloaded the most significant chunk of CRCL with the sale of 306,921 shares, [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin surges to $105k amid fragile Iran-Israel ceasefire agreement as tensions rise again",
      "link": "https://cryptoslate.com/shorts-wrecked-as-bitcoin-retakes-105k-after-israel-accepts-ceasefire-following-final-iran-volley/",
      "summary": "<p>BREAKING: The BBC is now reporting new missile launches from Iran at 08.30 BST, potentially breaking the ceasefire just moments after Israel&#8217;s acceptance. Iran has denied the accusation. Bitcoin returned above $105,000 early Monday after Israel formally accepted a ceasefire proposal brokered by the United States, capping a volatile 48-hour period that saw rapid escalations [&#8230;]</p> <p>"
    },
    {
      "title": "Dark market activity on Telegram persists despite $27B Huione ban – Elliptic",
      "link": "https://cryptoslate.com/dark-market-activity-on-telegram-persists-despite-27b-huione-ban-elliptic/",
      "summary": "<p>Telegram-based dark markets rapidly filled the gap left by Huione Guarantee after the $27 billion marketplace disappeared on May 13, according to a June 23 Elliptic report. Elliptic noted that Telegram banned thousands of Huione Guarantee channels and usernames once researchers traced billions of USDT-denominated sales to pig-butchering scams. However, data shows that merchants immediately [&#8230;]</p> <p>"
    },
    {
      "title": "FTX fights back against 3AC’s ‘unreasonable and unsupportable’ $1.53B claim",
      "link": "https://cryptoslate.com/ftx-fights-back-against-3acs-unreasonable-and-unsupportable-1-53b-claim/",
      "summary": "<p>FTX’s bankruptcy lawyers have pushed back forcefully against a $1.53 billion claim filed by failed crypto hedge fund Three Arrows Capital (3AC), calling the demand “illogical” and warning that it would unfairly drain funds from FTX’s legitimate creditors. In new court documents submitted on June 20, FTX’s legal team asked a Delaware bankruptcy judge to [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Repeats Its 2021 Pattern—Analyst Warns Final Crash Still Ahead",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-repeats-its-2021-pattern-analyst-warns-final-crash-still-ahead/",
      "summary": "Bitcoin rallied above $105,000 in mid-morning European trading on Tuesday, clawing back losses sustained over the weekend after dipping below six figures for the first time since May. Yet the respite may prove fleeting, says veteran technician Quantum Ascend (@quantum_ascend). Bitcoin Price Mirrors 2021 On side-by-side charts of the current cycle and the 2021-to-2024 arc, the analyst argued that Bitcoin is “the same exact pattern—run-up, one high, back down, second high,” followed by an ABC corrective sequence that in 2021 bottomed only after a second, deeper flush. “Gut says no,” he told viewers when asked whether last Friday’s sell-off had already marked capitulation. “We’ve been talking about this ABC since March… people were calling for new lows; I said nope, we got five waves at the top, we got an ABC and then we go— and that’s when the alts take off.” His base case now envisions a relief rally toward the $107,000–$108,000 band—the level where a trend-line projected from the two post-halving peaks intersects—before a final leg lower drives price into what he calls the “pain box” sandwiched between the 0.702 and 0.618 Fibonacci retracements of the entire rally from last October’s $58,000 breakout. In 2021 that zone ultimately wicked to the exact 0.618, a move he believes could repeat, implying spot levels between roughly $96,500 and $92,000. “This measurement fits the parameter now… if it wants to turn around and rip, great,” he conceded, “but there’s still a very good chance that was not the end.” Related Reading: Bitcoin STHs Capitulate: 14,700 BTC Moved To Exchanges At Loss Internally, the analyst parses the current drop as the developing C-wave of a larger flat, subdividing into a classic five-wave impulse. Wave three, he notes, appears complete; wave four “could come up high,” granting altcoins a short-lived pop, “but hopefully, again, sooner than later, we roll over.” He cites 2021’s July fractal, when Bitcoin bounced 20% before sliding a final time, as a psychological template. “When there’s a big news narrative event,” he observed, “we’ll get a little relief—people think it’s done—then wham, one more thing to scare retail.” Macro sentiment, he argues, remains fragile. The Chicago Mercantile Exchange gap at $92,000 is drawing “average-retail” bids, a setup he characterises as a “washing machine” in which professional money fronts liquidity only to fade it. “Retail is just a washing machine, man… that buy isn’t going to get filled,” he warned. Still, he reiterated long-term optimism, revealing he “hammered some buys” during Monday’s dip and advising his followers to dollar-cost average—“not financial advice”—through the turbulence. Related Reading: Bears Will Be Washed Out Of Bitcoin If This Happens Quantum Ascend’s upside target for the ensuing impulsive advance is comparatively restrained: $132,000, a level he says enjoys “two pieces of confluence” and would coincide with “the alts moment” when Bitcoin dominance finally cracks. “We will eventually work our way back up near the top of this B-wave… flag a little, and then boom,” he predicted, referencing November 2021’s so-called “Trump pump” that ignited a multisector altcoin surge. For now, traders watch the 0.702–0.618 pocket and the mooted relief ceiling at $108,000. Should Bitcoin slice through support without that interim bounce, the analyst says, the flush could conclude “sooner than later,” clearing the runway for what he calls “the next few months—our moment.” In his sign-off he urged viewers to “be an adult, live through it,” but also confessed palpable excitement: “I feel really good about where we’re at.” Whether the market shares his confidence will likely become clear once the final C-wave verdict arrives—perhaps, he hopes, within the week. At press time, BTC traded at $105,077. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Israel, Iran Ceasefire Ignites Crypto Surge As Bitcoin Tops $106,000—Details",
      "link": "https://www.newsbtc.com/news-3/israel-iran-ceasefire-ignites-crypto-surge-as-bitcoin-tops-106000-details/",
      "summary": "An unexpected peace in the Middle East created waves in the crypto market on 24th June, 2025. Iran and Israel agreed to cease hostilities, and US President Donald Trump termed it a &#8220;Complete and Total CEASEFIRE.&#8221; Related Reading: Bitcoin Paces $15 Billion YTD Influx Amid 10-Week Fund Flow Streak The traders had waited days with their hearts in their mouths as missiles soared and oil anxiety mounted. Then peace talks took hold, and digital-asset markets responded almost as quickly as the news broke. 💥BREAKING: TRUMP ANNOUNCES CEASEFIRE BETWEEN IRAN AND ISRAEL. BULLISH FOR MARKETS! 🚀 pic.twitter.com/M9PZM9UsB8 — Crypto Rover (@rovercrc) June 24, 2025 Bitcoin Breaks Through Key Level According to reports, Bitcoin leapt more than 5% within minutes of the ceasefire announcement. It shot past $106,000 before settling just above $105,000. That’s a sharp rebound after prices dipped below $99,000 at the height of the conflict. Investors who had been on the sidelines scrambled back in, driving trading volumes higher on exchanges worldwide. Ethereum And Altcoins Move Up Based on data from market trackers, Ethereum climbed over $2,400 in the hours following the news. A handful of smaller tokens also had a big day. Sei jumped 32%, while Dogwifhat surged 20%. Aptos wasn’t far behind, gaining about 10%. When the top coins gain traction, it often pushes smaller projects higher too, and today was no exception. IRAN CONFIRMS CEASEFIRE AGREEMENT WITH ISRAEL Iran has officially confirmed it has agreed to a ceasefire with Israel, signaling a critical de-escalation in one of the world’s most volatile conflicts. Markets may react swiftly to the easing geopolitical risk. https://t.co/1HKhmbqEGr pic.twitter.com/868bWekGte — Crypto Town Hall (@Crypto_TownHall) June 24, 2025 Market Cap Rebounds Rapidly The global cryptocurrency market cap reached $3.21 trillion, with a 4.40% increase in one session. Prior to the ceasefire, investors moved money into gold and the US dollar in case oil supplies were impaired. &#8220;CONGRATULATIONS TO EVERYONE! It has been fully agreed by and between Israel and Iran that there will be a Complete and Total CEASEFIRE (in approximately 6 hours from now, when Israel and Iran have wound down and completed their in progress, final missions!), for 12 hours, at… pic.twitter.com/Tdj8bPUd0w — U.S. State Dept &#8211; Near Eastern Affairs (@StateDept_NEA) June 23, 2025 As reports of peace circulated, those same investors funneled cash back into digital assets and equities. You could almost feel the relief in the tickers flashing green across trading screens. Experts Cautious On Future Edul Patel, CEO of Mudrex, told reporters that the market had picked up “bullish momentum” after the ceasefire. He noted that some altcoins rallied as much as 13% in one day. Market analysts pointed out how traders “bought the dip” when Bitcoin briefly tumbled under $99,000, helping it finish the day near $105,000. Related Reading: Stablecoin Wars Ignite: Peter Schiff Champions Gold-Backed Digital Assets Even so, they warn the calm may not be for long. A flare-up in the region or hints of a rate hike from the US Federal Reserve could send prices swinging again. Traders are celebrating today’s gains, but there’s a sense of caution in chat rooms and trading floors. Peace is welcome, but stability in crypto often depends on more than a single announcement. For now, though, the market is riding high—and investors are hoping that this ceasefire really does stick. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Dogecoin About To Explode? ‘Don’t Send It Too Hard,’ Analyst Warns",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-dont-send-it-too-hard-analyst/",
      "summary": "The news that Iran and Israel have agreed to a ceasefire brokered by US President Donald Trump may have marked the bottom for the Dogecoin price. Via X, independent chartist Maelius (@MaeliusCrypto) uploaded a weekly DOGE/USDT study that he believes is tracing an unusually clean, nested 1-2, 1-2 “spring-loaded” Elliott set-up – the kind of formation that often precedes an outsized third-wave rally. “DOGE … Market makers, please, don’t send it too hard,” the analyst joked on 23 June, imploring liquidity desks to let the structure mature before unleashing volatility. Dogecoin Ready To Explode? In Maelius’ count, the second of the two minor wave-twos ended last week when price tagged $0.142 and immediately snapped higher. That inflection, visible on his chart as the tip of a long lower wick, occurred exactly where the 200-week exponential moving average ($0.142) intersects a rising support trend-line that has tracked Dogecoin since late-2023 – a textbook area for long-term money to defend. The bounce printed on Sunday’s weekly close, giving technicians a hard reference point for risk. If the wave map is correct, the composite third wave that now follows could push into the $1.10–$1.30 corridor, Maelius annotates. A fourth-wave pause somewhere near $0.60 would then reset oscillators before a terminal fifth wave above $1.60 completes the cycle. While the analyst stops short of publishing time targets, the price levels are etched in full on the chart, making the roadmap unambiguous. Related Reading: Dogecoin Crash Far From Over? Analyst Reveals The Target Underlying demand is also drawn into the picture. A broad green rectangle labelled “DEMAND” spans roughly $0.12–$0.17. Last week’s wick once again penetrated that zone before reversing, adding statistical weight to its importance. At the bottom of Maelius’ chart lies the WaveTrend Oscillator (WTO), comprising a fast line (WT1), a slow line (WT2) and a histogram that plots their spread. The analyst shades the band between about –60 and –30 in green to denote the oversold floor. Both momentum lines double-bottomed in that zone in autumn 2024 and April this year, immediately before price rocketed higher. Related Reading: Crypto Analyst Predicts $4 Dogecoin After Exhausted Selling Phase As of Sunday’s close WT1 prints –18.49 and WT2 –33.21, with the histogram at –22.80. In other words, momentum is cooling but could be reversing as it is touching Maelius’ bottom zone as in previous instances. Sceptics note that a nested 1-2 count can fail if price undercuts the second wave-two, and that liquidity-driven memecoins are intrinsically prone to whipsaw. Even Maelius tempered his enthusiasm in a follow-up exchange when a follower warned of a “choppy summer,” replying: “We are almost in July bro, one or two months of chop not changing anything if [it] happens.” For now the battleground is clear: as long as Dogecoin holds above the converging 200-week EMA–trend-line nexus and the upper rim of the demand zone, the wave thesis remains intact and the next directional verdict will belong to the market rather than the meme. At press time, DOGE traded at $0.1634, up 17% since the bottom on Sunday. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Is Ethereum Staging A Repeat Of 2021? Here’s Why A 200% Surge Could Follow",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-repeat-of-2021/",
      "summary": "Ethereum saw a notable decline in its price over the last week, and the weekend culmination pulled the price back towards levels not seen in over one month. The movement tracks with the established bearish trend of the month of June and continues to show mounting sell pressure on the cryptocurrency. However, with this decline has emerged a trend similar to what was seen back in 2021, right before the market picked up and saw the beginning of the altcoin season. Ethereum Price Crash Similar To 2021 Looking at the current Ethereum price action and that of what was seen back in Q2 2021, there have been some striking similarities. Most especially, how the Ethereum price has performed in the month of June so far has been the same as what happened back in June 2021. Related Reading: Bears Will Be Washed Out Of Bitcoin If This Happens In 2021, the Ethereum price began the month of June trading above $2,600. However, as the month went on, the altcoin suffered multiple declines and crashed below $2,000 before it was over. Eventually, the price would find its bottom somewhere around $1,600 before the decline was over. Fast forward four years to the year 2025, and the month of June is showing the same trend. June 2025 had begun with the Ethereum price trending above $2,600 before the bears took control. Since then, the altcoin has crashed by more than 20%, and looks primed for more. Using the historical performance, it would suggest that the Ethereum price decline is far from over. If there is a repeat of June 2021, then Ethereum could suffer another 20% crash before the month of June is over, to find its bottom somewhere between $1,600 and $1,700. The Trigger For Altcoin Season Given that Ethereum is the largest altcoin in the market, it is naturally the trigger for the altcoin season. Looking back on 2021, the altcoin season began when the Ethereum price began to rally. But the recovery did not begin until the month of July, and eventually lasted into the month of November. Related Reading: XRP On-Chain Activity Down 80% In 5 Months, Experts Argue Bullish/Bearish Implications So far, investors are already looking positively toward July 2025, as there have been rumors of a rate cut. This is expected to trigger a market rally for risk assets such as Bitcoin and Ethereum, coupled with the fact that a resolution to the Iran-Israel war could be in the works. If this trend holds, then it is possible that the Ethereum price would begin to rally in July. As seen in 2021, Ethereum would end up rising over 200% in the course of five months, to put in a new all-time high in the month of November. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "This Bitcoin Zone Could Be Market’s Next True ‘Pivot,’ Says Glassnode",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-zone-markets-next-true-pivot-glassnode/",
      "summary": "The on-chain analytics firm Glassnode has highlighted the $97,000 to $98,000 zone as an important one for Bitcoin. Here&#8217;s why. Bitcoin CBD Suggests Build Up Of Supply In This Range In a new post on X, Glassnode has discussed about a potentially significant zone for Bitcoin based on the Cost Basis Distribution. The Cost Basis Distribution (CBD) is an indicator that measures the amount of the BTC supply that investors last purchased or transferred at the various price levels. As is visible in the above graph, there is a dense supply zone located between $97,000 to $98,000. Generally, investors are quite sensitive to retests of their cost basis, so a large amount of them (or alternatively, a few large holders) having their acquisition level inside a narrow range could make retests of it significant for Bitcoin. Related Reading: Bitcoin STHs Capitulate: 14,700 BTC Moved To Exchanges At Loss When the mood in the market is bullish, holders can react to retests of their cost basis from above by buying more. They may do so believing that the same level would end up proving profitable again in the future and the retrace is just a &#8216;dip.&#8217; The cryptocurrency suffered a plunge yesterday and nearly touched this region. Since then, however, things have turned around for the asset and it has gained some distance over it once more. In the event that the decline does continue, which may not be too unexpected given the volatile geopolitical situation at the moment, the zone could end up acting as the next true pivot for Bitcoin, according to the analytics firm. While the CBD tells us where the cryptocurrency&#8217;s supply is concentrated, it doesn&#8217;t contain any information about who bought or sold at those price levels. Glassnode&#8217;s behavioral cohorts, investor groups divided on the basis of their behavior, solve this problem. Here is a chart that shows the trend in the Bitcoin supply held by these holder cohorts over the past few years: There are five of these behavior groups. First Buyers (green) include the investors who are buying Bitcoin for the very first time. As displayed in the chart, the supply of this group has been on the rise, indicating fresh demand has been coming in. Momentum Buyers (blue) are those that capitalize on market momentum by buying during uptrends. On the opposite spectrum are the Conviction Buyers (purple), who buy despite falling prices. Finally, there are the Loss Sellers (red) and Profit Takers (yellow), who correspond to investors exiting at a loss and profit, respectively. During the past couple of weeks, the former cohort has seen an increase of 29%, a sign that weak hands have been capitulating. Related Reading: Consolidation Takes Its Toll: Bitcoin Investors No Longer Greedy That said, the analytics firm has noted, &#8220;Conviction Buyers also increased, suggesting sentiment isn’t collapsing. Some are cutting losses &#8211; others are actively lowering their cost basis.&#8221; BTC Price At the time of writing, Bitcoin is floating around $103,900, down more than 4% in the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Sequans Launches $384M Bitcoin Treasury Initiative with Swan Bitcoin Partnership",
      "link": "https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Sequans-Launches-384M-Bitcoin-Treasury-Initiative-with-Swan-Bitcoin-Partnership.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-launches-384m-bitcoin-treasury-initiative-with-swan-bitcoin-partnership\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a France-based developer of 5G and IoT semiconductor technology, has announced a move into Bitcoin with a new treasury initiative backed by a $384 million private placement.&#160;&#160; The funding includes $195 million in equity securities and $189 million in convertible secured notes. Sequans plans to allocate this capital toward building a Bitcoin position [&#8230;]</p> <p>"
    },
    {
      "title": "The Blockchain Group Acquires 75 BTC After €7.2M Raise",
      "link": "https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/10.4B-Bitcoin-Firm-Unchained-Announces-First-Regulated-Bitcoin-Native-Trust-Company-1.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-blockchain-group-acquires-75-btc-after-e7-2m-raise\" rel=\"nofollow\"> </a></p> <p>Total holdings reach 1,728 BTC as YTD yield climbs to 1,231.7%, reinforcing its Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Fintech Company DigiAsia Corp to Launch Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Southeast-Asian-fintech-company-aims-to-raise-100-million-for-long-term-Bitcoin-holdings-as-part-of-their-corporate-treasury-initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/fintech-company-digiasia-corp-to-launch-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>DigiAsia Corp, a leading Southeast Asian Fintech-as-a-Service platform, has signed an indicative term sheet for up to $3 million in non-recourse debt financing to kickstart its Bitcoin treasury acquisition strategy. The funding comes from High West Capital Partners and is expected to close within 45 days.&#160; The $3 million facility represents the first phase of [&#8230;]</p> <p>"
    },
    {
      "title": "ECD Automotive Design Secures $500M Facility to Acquire Bitcoin",
      "link": "https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ECD-Automotive-Design-Secures-500M-Facility-to-Acquire-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ecd-automotive-design-secures-500m-facility-to-acquire-bitcoin\" rel=\"nofollow\"> </a></p> <p>Luxury auto builder will grow its Bitcoin treasury, expand operations, and offer $21,000 in upgrades to early customers who pay with Bitcoin and other crypto.</p> <p>"
    },
    {
      "title": "Anthony Pompliano Announces $1 Billion Merger in Record Bitcoin Treasury Company Fundraise",
      "link": "https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ProCap-Financial-has-raised-over-750-million-in-the-largest-initial-funding-round-for-a-public-Bitcoin-treasury-company.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/anthony-pompliano-announces-1-billion-merger-in-record-bitcoin-treasury-company-fundraise\" rel=\"nofollow\"> </a></p> <p>Anthony Pompliano announced a $1 billion merger creating ProCap Financial through a Special Purpose Acquisition Company (SPAC) transaction with Columbus Circle Capital Corp. (CCCM). The deal represents the largest initial fundraise in history for a public Bitcoin treasury company, raising $516.5 million in equity and $235 million in convertible notes.&#160;&#160; ProCap Financial will operate with [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Altcoins Surge on Trump’s Israel-Iran Ceasefire Announcement—But Will it Last?",
      "link": "https://decrypt.co/326660/altcoins-surge-on-trumps-israel-iran-ceasefire-announcement-but-will-it-last",
      "summary": "Bitcoin recovered most of the weekend’s losses due to the Iran-Israel conflict—but questions remain over whether the ceasefire will hold."
    },
    {
      "title": "US Housing Regulator to Study Crypto Holdings in Mortgage Qualification Process",
      "link": "https://decrypt.co/326657/us-housing-regulator-study-crypto-mortgage",
      "summary": "FHFA Director Bill Pulte, a longtime crypto supporter, said the agency will examine how digital assets factor into home loan qualification."
    },
    {
      "title": "Crypto Scam Markets Thrive Again After Telegram’s Cleanup Attempt: Report",
      "link": "https://decrypt.co/326653/crypto-scam-markets-thrive-telegram",
      "summary": "Platforms such as Shuangying and Fully Light have surged after the Huione ban, with transactions increasing three to fourfold."
    },
    {
      "title": "Israeli Man Accused of Spying for Iran in Exchange for Crypto",
      "link": "https://decrypt.co/326647/israeli-man-spying-iran-for-crypto",
      "summary": "A Tel Aviv resident allegedly photographed sensitive sites and received thousands in crypto, authorities say."
    },
    {
      "title": "Tech That Could Prove Whether Iran’s Uranium Was Destroyed",
      "link": "https://decrypt.co/326588/tech-irans-uranium-destroyed",
      "summary": "Satellite images reveal damage, but experts suggest that new technology may be able to verify what actually happened underground."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Bitcoin drops below $100K, then rebounds after Iran reportedly fires missiles toward US military targets in Qatar and Iraq",
      "link": "https://cryptobriefing.com/bitcoin-price-drop-mideast-tensions/",
      "summary": "<p>Geopolitical tensions can significantly impact cryptocurrency markets, highlighting their volatility and sensitivity to global events.</p> <p>"
    },
    {
      "title": "Crypto fund veterans to raise $100M to build BNB strategic reserve",
      "link": "https://cryptobriefing.com/bnb-treasury-strategy-listed-company/",
      "summary": "<p>The initiative could diversify crypto investment strategies, potentially increasing BNB's market influence and public company crypto adoption.</p> <p>"
    },
    {
      "title": "Fintech giant Fiserv to launch FIUSD stablecoin and digital asset platform with Circle, Paxos, and Solana",
      "link": "https://cryptobriefing.com/fiusd-stablecoin-platform-launch/",
      "summary": "<p>Fiserv's FIUSD launch could revolutionize digital payments, enhancing real-time transactions and expanding blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Michael Saylor’s Strategy makes smallest Bitcoin purchase since mid-March",
      "link": "https://cryptobriefing.com/strategy-bitcoin-acquisition-record/",
      "summary": "<p>Saylor's ongoing Bitcoin acquisitions highlight a strategic commitment to digital assets, potentially influencing market dynamics and investor sentiment.</p> <p>"
    },
    {
      "title": "Hackers exploit Trezor’s website to send phishing emails",
      "link": "https://cryptobriefing.com/trezor-security-alert-phishing-warning/",
      "summary": "<p>This incident highlights the growing sophistication of phishing attacks, underscoring the need for enhanced cybersecurity measures in crypto platforms.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin – How the Israel-Iran ceasefire affects BTC’s short-term outlook",
      "link": "https://ambcrypto.com/bitcoin-how-the-israel-iran-ceasefire-affects-btcs-short-term-outlook/",
      "summary": "<img alt=\"Bitcoin Israel Iran ceasefire deal\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Israel-Iran-ceasefire-deal.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Assessing BTC's next path after Israel-Iran ceasefire deal."
    },
    {
      "title": "29% more Bitcoin holders selling at a loss: What does this mean?",
      "link": "https://ambcrypto.com/29-more-bitcoin-holders-selling-at-a-loss-what-does-this-mean/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-4-1-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Short-term holders get crushed while conviction buyers quietly prepare for the next leg."
    },
    {
      "title": "Pompliano’s ProCap to go public with $1B in Bitcoin after $750M SPAC deal",
      "link": "https://ambcrypto.com/pomplianos-procap-to-go-public-with-1b-in-bitcoin-after-750m-spac-deal/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-9.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />As more companies follow Strategy's path, Anthony Pomplanio raises the stakes quite a bit."
    },
    {
      "title": "‘Dump your altcoins for Bitcoin treasuries, ’ Adam Back tells altcoin traders!",
      "link": "https://ambcrypto.com/dump-your-altcoins-for-bitcoin-treasuries-adam-back-tells-altcoin-traders/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/AltcoinseasonBitcoindominance.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin treasury stocks may be a better speculative asset than altcoins."
    },
    {
      "title": "$180, a major test for Solana – A fall below this level means…",
      "link": "https://ambcrypto.com/180-a-major-test-for-solana-a-fall-below-this-level-means/",
      "summary": "<img alt=\"$180, a major test for Solana - A fall below this level means...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_53_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana network booms with user activity, but a bullish breakout hinges on the $180 resistance level."
    }
  ]
}