{
  "CoinDesk": [
    {
      "title": "Trump Media and Semler Scientific Could Be Cheapest Bitcoin Treasury Companies by This Metric",
      "link": "https://www.coindesk.com/markets/2025/06/09/trump-media-and-semler-scientific-could-be-cheapest-bitcoin-treasury-companies-by-this-metric",
      "summary": ""
    },
    {
      "title": "U.S. SEC Chair Says Working on 'Innovation Exemption' for DeFi Platforms",
      "link": "https://www.coindesk.com/policy/2025/06/09/u-s-sec-chair-says-working-on-innovation-exemption-for-defi-platforms",
      "summary": ""
    },
    {
      "title": "Plasma’s XPL Token Sale Attracts $500M as Investors Chase Stablecoin Plays",
      "link": "https://www.coindesk.com/markets/2025/06/09/plasmas-xpl-token-sale-attracts-500m-as-investors-chase-stablecoin-plays",
      "summary": ""
    },
    {
      "title": "Paraguay President's X Account Hacked, Shares Bitcoin Scam",
      "link": "https://www.coindesk.com/policy/2025/06/09/paraguay-presidents-x-account-hacked-shares-bitcoin-scam",
      "summary": ""
    },
    {
      "title": "Red-Hot Circle Already Has Two ETFs Devoted to It in the Works",
      "link": "https://www.coindesk.com/markets/2025/06/09/bitwise-proshares-file-for-etfs-tracking-soaring-circle-shares",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin chart pattern, return of ‘HODL mode’ point to imminent all-time BTC price high",
      "link": "https://cointelegraph.com/news/bitcoin-chart-pattern-return-of-hodl-mode-point-to-imminent-all-time-btc-price-high?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmMzNmEtNDg2ZS03M2RiLThlYjQtMmQzZTE5NDU0MThm.jpg\" /></p><p>An uptick in long-term Bitcoin holders and BTC’s start-of-week price break above $108,000 could be a sign that new highs are in order.</p>"
    },
    {
      "title": "Paraguay warns of ‘irregular activity’ after post claiming BTC is legal tender",
      "link": "https://cointelegraph.com/news/paraguay-president-santiago-pena-bitcoin-legal-tender?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU1ZTQtZGU0Yy03ZTdhLWJkMTEtYjg2YjVmZDEzNTBk.jpg\" /></p><p>An X post by Paraguay’s President Santiago Peña claimed the country had recognized Bitcoin as legal tender, but the official government account soon urged users to “dismiss any recently published content.”</p>"
    },
    {
      "title": "Hong Kong to use Chainlink protocol in CBDC pilot project",
      "link": "https://cointelegraph.com/news/hong-kong-government-chainlink-ccip-cbdc-pilot-project?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU1YzktY2M1Ny03NjFmLTgxMTMtZmFlZDA1YTI3MzUx.jpg\" /></p><p>The study involving Chainlink's Cross-Chain Interoperability Protocol is one of many initiatives exploring use cases for a potential Hong Kong CBDC, or e-HKD.</p>"
    },
    {
      "title": "Price predictions 6/9: SPX, DXY, BTC, ETH, XRP, BNB, SOL, DOGE, ADA, HYPE",
      "link": "https://cointelegraph.com/news/price-predictions-6-9-spx-dxy-btc-eth-xrp-bnb-sol-doge-ada-hype?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzU1YTctMjg2NC03NmY3LTk2NTctZmYxNDYyYWVkNDAz.jpg\" /></p><p>Bitcoin price pushed through a critical overhead resistance level, possibly opening the door to new all-time highs.</p>"
    },
    {
      "title": "Nasdaq-listed fintech Netcapital acquires crypto native protocol Mixie",
      "link": "https://cointelegraph.com/news/netcapital-acquires-mixie-web3-gaming-crypto-merger?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2IxNTktYWEyZS03Y2Q5LWI1MWEtNWRhNTQ5NDJhYzkz.jpg\" /></p><p>Shares of NCPL surged more than 16% on the news of the Mixie acquisition and are up 48% year-to-date.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Visa, Chainlink successfully complete CBDC, stablecoin swap between Hong Kong, Australia",
      "link": "https://cryptoslate.com/visa-chainlink-successfully-complete-cbdc-stablecoin-swap-between-hong-kong-australia/",
      "summary": "<p>Visa and Chainlink have completed a key milestone in the Hong Kong Monetary Authority’s (HKMA) e-HKD+ Pilot Programme, successfully testing a cross-border blockchain transaction using central bank digital currency (CBDC) and stablecoins. The trial, conducted in partnership with ANZ, ChinaAMC, and Fidelity International, is one of the first real-world simulations of programmable money being used [&#8230;]</p> <p>"
    },
    {
      "title": "SEC Chair Paul Atkins backs DeFi, rejects forced intermediaries during latest roundtable speech",
      "link": "https://cryptoslate.com/sec-chair-paul-atkins-backs-defi-rejects-forced-intermediaries-during-latest-roundtable-speech/",
      "summary": "<p>US Securities and Exchange Commission (SEC) Chairman Paul Atkins told the agency’s fifth cryptocurrency roundtable on June 9 that the ability to hold crypto without an intermediary belongs at the core of US law. Atkins opened the “DeFi and the American Spirit” session by linking decentralized (DeFi) finance with the country’s traditions of private property [&#8230;]</p> <p>"
    },
    {
      "title": "Paraguay’s presidency swiftly debunks Bitcoin legal tender hoax, confirms X account hack",
      "link": "https://cryptoslate.com/paraguays-presidency-swiftly-debunks-bitcoin-legal-tender-hoax-confirms-x-account-hack/",
      "summary": "<p>The Paraguayan government made an official statement that President Santiago Peña’s verified X account was hacked and published an unauthorized declaration that Bitcoin (BTC) would be made legal tender on June 9."
    },
    {
      "title": "Tether to democratize Bitcoin mining with open-source software debut",
      "link": "https://cryptoslate.com/tether-to-democratize-bitcoin-mining-with-open-source-software-debut/",
      "summary": "<p>Tether is building a gateway for new players to enter Bitcoin mining by releasing its Bitcoin Mining OS (MOS) as open-source software by the end of 2025, according to CEO Paolo Ardoino. In a June 9 post on X, Ardoino explained that the move will lower barriers for small and independent miners. Tether expects to [&#8230;]</p> <p>"
    },
    {
      "title": "Strategy buys another 1,045 Bitcoin to push its stash to nearly 3% of supply",
      "link": "https://cryptoslate.com/insights/strategy-buys-another-1045-bitcoin-to-push-its-stash-to-nearly-3-of-supply/",
      "summary": "<p>Strategy has acquired an additional 1,045 Bitcoin (BTC) $110.2 million, according to a June 9 filing with the US Securities and Exchange Commission. The purchase occurred between June 2 and June 8 at an average price of $105,426 per coin. Strategy’s total Bitcoin stash now amounts to 582,000 BTC. The company&#8217;s average price now stands [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Consolidates As Momentum Builds – Analyst Has $3K In Sight For June",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-consolidates-as-momentum-builds-analyst-has-3k-in-sight-for-june/",
      "summary": "Ethereum has remained firm above key support levels despite the broader market pullback in recent weeks. While many altcoins have shown weakness, ETH continues to trade above the $2,400–$2,500 zone, signaling strength and positioning itself for a potential recovery. After a volatile start to the year that saw steep declines, analysts are increasingly calling for a breakout, with some suggesting Ethereum could soon reclaim lost ground if current conditions hold. Related Reading: Bitcoin And Ethereum Defend Key Moving Averages – Bullish Signal Or Temporary Relief? However, not everyone agrees on the bullish outlook. Some traders warn that Ethereum’s recent consolidation may precede another leg down, especially if resistance near $2,800 remains unbroken. The debate highlights the uncertainty hanging over the market as macro risks and shifting liquidity continue to influence short-term direction. Top analyst Ted Pillows recently shared his view, noting that Ethereum is still consolidating after a strong May. While this pause may seem neutral, he pointed to rising ETF inflows and growing network activity as leading indicators of renewed demand. According to Pillows, these signals often precede price expansion, suggesting that ETH may just be gearing up for its next move. Ethereum Holds Firm As Market Volatility Builds Toward A Decisive Move Ethereum is navigating a critical moment as the broader crypto market faces heightened volatility and mounting uncertainty. Still trading 48% below its all-time high, ETH has shown impressive resilience, holding firm above key support levels even as sentiment wavers. The market remains on edge following renewed tensions between Elon Musk and US President Donald Trump — a dynamic that has triggered risk-off behavior and short-term instability across assets. Despite the noise, Ethereum continues to show underlying strength. Bitcoin remains stable near its highs, and many altcoins appear to be coiling for potential breakout moves. In this context, the coming weeks could prove decisive for ETH, which has so far managed to consolidate after a bullish May without breaking key structure. Ted Pillows noted in a recent update that Ethereum is still consolidating, and that’s not necessarily bearish. According to his view, rising ETF inflows and accelerating network activity suggest that renewed demand is quietly building behind the scenes. Historically, these have been leading indicators of a breakout, and ETH looks well-positioned to take advantage. Momentum is shifting, and bulls are eyeing the $2,800 level as the next key threshold. Reclaiming that level could trigger a move toward $3,000 in June. Beyond that, if macro conditions remain stable, Ethereum could realistically push to $4,000 by Q3 2025. For now, ETH remains in consolidation mode — but with strength in the fundamentals, technical structure, and on-chain trends, the case for a breakout is growing stronger. The next move will be crucial, not just for Ethereum, but for the broader altcoin market heading into summer. Related Reading: Ethereum Consolidates Below $2,800 – Bulls Need This Level To Trigger Next Leg Up ETH Holds Mid-Range Structure Amid Continued Consolidation Ethereum continues to trade within a tight range, holding at $2,513 after briefly dipping to $2,479 earlier in the session. As seen on the daily chart, ETH remains in consolidation beneath the key resistance at $2,659, marked by the 200-day simple moving average (SMA), which has capped several upside attempts throughout June. Despite failing to break out, the structure remains constructive. The 34-day EMA ($2,435.80) and 50-day SMA ($2,284.93) continue to act as dynamic support. ETH recently bounced off the 34 EMA after testing that level for three consecutive days, signaling buyers are still present and defending key zones. Meanwhile, volume remains muted, reflecting indecision and lack of conviction from both bulls and bears. For now, the $2,430–$2,660 range defines the battleground. A daily close above the 200 SMA would indicate bullish continuation toward the $2,800 level. Conversely, a breakdown below $2,430 could trigger a larger retrace toward $2,200. Related Reading: Solana Key Indicator Flashes Buy Signal On Daily Chart – Rally Ahead? Ethereum&#8217;s current behavior reflects a market waiting for a catalyst. With rising ETF inflows and steady on-chain activity, momentum could return quickly, but until then, ETH remains trapped in a sideways grind. The next confirmed move out of this range will likely dictate the trend heading into late June. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Pundit Says Do Not Ignore Ethereum Amid New All-Time Highs In Major Metric",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-ath-in-major-metric/",
      "summary": "Ethereum is back in sharp focus across the crypto market following a recent rally to $2,800 that has added fresh layers of bullish momentum to its long-term narrative. At the time of writing, Ethereum is trying to register a footing above $2,500, but this subdued price action masks what an analyst is calling one of the most critical technical and on-chain moments in Ethereum’s recent history. Ethereum Weekly Engagement Hits Record High According to Crypto Patel, a crypto analyst on the social media platform X, Ethereum&#8217;s weekly engagement has reached an all-time high, surpassing all previous peaks seen since 2022. The accompanying chart below shows a steep rise in the number of unique addresses interacting with Ethereum’s ecosystem. Related Reading: Is Ethereum Back In Business? Morningstar Candlestick Pattern Tells A Story According to the most recent data, the number of weekly active addresses stands at 17.4 million, representing an increase of almost 17% in just seven days. Notably, May 2025 saw the most significant growth in engagement, with each of the past three weeks witnessing at least 15 million active addresses. Meanwhile, the Layer 2 multiplier, which reflects adoption across Ethereum’s scaling solutions, has climbed to 7.55x, marking an 18.63% jump over the same period. Crypto Patel described the development as impossible to ignore, adding that the momentum is building fast, and warned followers to stay ready as Ethereum prepares for what could be a dramatic next leg up. “It’s impossible to ignore $ETH right now,” he remarked. Despite a minor 4.31% decline in cross-chain activity in the past seven days, the overall engagement trend confirms that more users are entering the Ethereum ecosystem. Analyst Predicts $9,000 To $10,000 ETH Price Target Complementing this on-chain momentum is a broader technical perspective offered by another crypto analyst known as XForceGlobal on the social media platform X. In a detailed Elliott Wave analysis also shared on X, the analyst noted that Ethereum has successfully completed a complex corrective structure and is now poised to enter a powerful new impulsive phase. According to the chart, the bearish scenario has been invalidated by recent price behavior, and a new bullish cycle is now underway as Ethereum is currently playing out a bullish B wave. Related Reading: Ethereum Price At $8,000: Pundit Predicts Parabolic Run For ETH If this bullish B wave plays out as expected, XForceGlobal projects a major price surge with a target range between $9,000 and $10,000 for Ethereum. Specifically, the analyst identified a $9,410 price target for sometime in the next year. However, the analyst outlines a hypothetical fallback to the $576 zone if the C corrective wave unfolds. Nonetheless, the current wave structure shows an increased likelihood of Ethereum surging higher rather than breaking down. The analyst concluded by stating, “We can now confidently scrap the bearish case. The impulse opened the door for potential new highs.” At the time of writing, Ethereum is trading at $2,493 with a recent intraday high of $2,537. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "$106K Bitcoin A ‘Safer’ Buy Than $25K—XRP Lawyer Drops Bombshell",
      "link": "https://www.newsbtc.com/news/bitcoin/106k-bitcoin-a-safer-buy-than-25k-xrp-lawyer-drops-bombshell/",
      "summary": "A well-known cryptocurrency attorney and XRP advocate, John Deaton, is urging investors to stay bullish on Bitcoin even as it hovers near $106,000. He’s put about 80% of his net worth into BTC at an average price below $25,000. Rather than fret over today’s high sticker, he says the odds favor more gains ahead than losses. Related Reading: Blank Pi Network Wallets Spark Outcry—What’s The Network Hiding? Deaton’s Big Bet According to Deaton, buying at six figures isn’t too late. He calls today’s price range “more asymmetrical,” meaning the upside is greater than the downside. He’s put 80% of his wealth into Bitcoin. His average entry cost was less than $25,000. Still, he sees room to run even from around $106,000. Macro Concerns Drive Interest Based on reports, Deaton worries about soaring national debt in the US and fresh tariffs from US President Donald Trump’s time in office. He flags endless money printing by central banks as a red flag. I’m not in favor of telling people living paycheck to paycheck (me until 15 years ago) to take out a mortgage on their primary home to buy Bitcoin (I’m not suggesting that that’s what David is recommending either), but I am in the process of selling real estate, and although my… https://t.co/JMB1zgeazW — John E Deaton (@JohnEDeaton1) June 8, 2025 He says all these moves are chipping away at trust in fiat cash. With only 21 million BTC ever to be mined, Bitcoin can’t be inflated away. That fixed supply, he argues, makes it a solid hedge against a shaky dollar. Corporate And State Adoption Institutional demand is also on the rise. MicroStrategy—now called Strategy—holds more than 200,000 BTC, worth tens of billions of dollars. And in the last seven days, 16 companies have added Bitcoin to their balance sheets. On the government side, Rep. Tim Burchett introduced a bill to turn a Trump executive order into law, creating a US Strategic Bitcoin Reserve. Countries like Pakistan, Ukraine, and Ireland are weighing similar steps. They want to see if holding Bitcoin could protect their foreign exchange plans. Skeptics Voice Worries Not everyone agrees with Deaton’s rosy outlook. Economist Peter Schiff, a gold advocate, says Bitcoin has no real value and is too wild to be a safe haven. He tweeted that today’s rally is just hype. Deaton doesn’t shy away from such criticism. He admits he has “confirmation and wealth-preservation bias.” He still insists Bitcoin is the best store of value during today’s economic storms. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Deaton warns against buying with money you can’t afford to lose. He tells people living paycheck-to-paycheck not to risk their homes or take out loans just to buy crypto. His basic message is simple: look past daily price swings and ask where the world’s money is headed. If you share his concerns about the dollar and believe institutions will keep piling in, his bet on Bitcoin could pay off. But anyone on the sidelines should be ready for big swings and should only invest what they can handle. Featured image from Pexels, chart from TradingView"
    },
    {
      "title": "Bitcoin Weekly Chart Flexes Strength—Is The Moonshot Just Getting Started?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-chart-flexes-strength/",
      "summary": "Bitcoin is making waves once again, flashing strength on the weekly chart as it closes well above key moving averages. With momentum indicators still favoring the bulls and no signs of exhaustion in sight, the current setup hints that the rally might be far from over. Could this be the beginning of an even bigger breakout? Bitcoin Stays Elevated: Bulls Show No Signs of Fatigue In a recent update shared on X, Shaco AI highlighted Bitcoin’s continued bullish momentum, pointing to strong weekly performance on the BTC/USDT chart. The analyst noted that BTC has “ballooned past recent expectations,” closing the week at an impressive $105,700. Related Reading: Bitcoin At A Crossroads: $97,000 Cost Basis Holds Key To Next Breakout This places the asset well above its 25-week Simple Moving Average (SMA) of $95,009.55 and the 50-week SMA at $83,318.12, an encouraging technical signal that suggests Bitcoin’s uptrend remains firmly intact. As Shaco AI put it, “The party isn’t over yet,” hinting that bullish sentiment could carry BTC even higher. Technical indicators further support this upbeat outlook. The Relative Strength Index (RSI) currently reads 63.51, indicating that buying momentum remains robust without entering overbought territory. This suggests that traders are still comfortable accumulating at current levels, and the market hasn&#8217;t yet reached a point of exhaustion. Furthermore, the Moving Average Convergence Divergence (MACD) remains firmly in positive territory at 5835.33. The MACD&#8217;s positioning reflects steady buyer interest and a favorable trend structure, both of which are crucial for sustaining an upward move. Volume Slackens While Price Nears Critical Resistance Zone The analyst went on to point out that despite the bullish setup currently seen on Bitcoin’s chart, the enthusiasm might be tempered by softening trading volume. Specifically, trading volume has only reached 95,302, significantly lower than the average volume of 179,421. Related Reading: Bitcoin Price Slips Again, Triggering Fresh Fears of a Deeper Correction This discrepancy signals a noticeable dip in market participation, raising the question of whether the ongoing price rally has enough fuel to sustain its momentum in the short term. As the analyst emphasized, this drop in volume is worth watching closely since it may influence the momentum of next week’s price action. Looking at the broader picture, Bitcoin is approaching a major resistance level at $111,980. This key barrier represents a potential turning point; either it gets broken and paves the way for further upside, or it holds and prompts a short-term correction. Should a pullback occur, the analyst noted that BTC appears to have a comfortable support zone at $49,000, which could act as a solid cushion. In any case, the analyst suggests keeping a close eye on how these technical levels play out, as they could dictate Bitcoin’s next big move. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "XRP Price Remains Bullish Above $2, This Falling Channel Says $3.8 Is Coming",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-remains-bullish-above-2/",
      "summary": "The XRP price is holding strongly above $2, maintaining its momentum as technical indicators show signs of a bullish trend. Notably, a distinct Falling Channel on the XRP price chart suggests that a breakout could be brewing, with a potential rally toward $3.8 in sight. XRP Price Holds Steady As Bulls Target $3.8 A technical analysis by Rose Premium Signals reveals that XRP is currently flashing strong bullish signals following a breakout from a long-term Falling Channel. Earlier in January, XRP broke past $3 but experienced a strong correction that has kept its price down ever since. Despite the ongoing downtrend, XRP has been firmly holding above the $2 threshold as it prepares for new all-time highs. Related Reading: What Happens To The XRP Price If The 2017 Fractal Plays Out Again? Previously, XRP traded within a descending range for several months, forming lower highs and lower lows. However, recent price action has seemingly invalidated this downtrend structure with a decisive breakout above the upper boundary of the Falling Channel, indicating a potential trend reversal and the beginning of a bullish continuation. The chart shared by Rose Premium Signals on X (formerly Twitter) shows that after the breakout, XRP has been consolidating above the former resistance-turned-support zone, around the $2 level. The analyst confidently states that XRP’s outlook remains inherently bullish despite past downtrends, suggesting that the recent consolidation pattern indicates that bulls are still in control. Notably, the breakout above the Falling Channel is significant, as it typically implies a strong upside move, especially on higher time frames. Projected price targets based on technical formation are positioned at $2.9520, $3.3967, and $3.8767. Interestingly, the highest projected target exceeds XRP’s all-time high of $3.84 and reflects a 73.54% increase from current price levels. It’s important to note that these bullish targets forecasted by Rose Premium Signals align with historical resistance zones and measured moves from the Falling Channel breakout. If momentum sustains and market conditions remain favorable, XRP could rally toward these targets over the coming weeks, potentially offering significant upside for long-term holders and traders. Analyst Says Buy The Dip, With Ideal Entry At $1.85 While forecasting several optimistic targets for XRP, Rose Premium Signals emphasized a strategy of buying the altcoin during dips. This method aims to capitalize on low price points to maximize potential gains as XRP rebounds. Related Reading: Wave Count Analysis Reveals The XRP Price Trigger Point For Take-Off The analyst‘s chart highlights the $1.85 support level with a clear “Buy Here” label, suggesting that this level is considered an ideal entry point should the price revisit it. Currently, XRP is trading at $2.23, meaning a drop to $1.85 would represent a 17.04% decrease. According to the analysis, this support level also marks the base of the recent Falling Channel breakout, providing a favorable risk-reward setup for those looking to enter or expand their positions. Featured image from iStock, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "KULR Technology Group Announces $300 Million ATM Offering To Invest in Their Bitcoin Treasury",
      "link": "https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/KULR-Technology-Group-Announces-300-Million-ATM-Offering-To-Invest-in-Their-Bitcoin-Treasury.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-technology-group-announces-300-million-atm-offering-to-invest-in-their-bitcoin-treasury\" rel=\"nofollow\"> </a></p> <p>KULR entered a $300 million ATM offering to fund its Bitcoin treasury reserve, with Cantor Fitzgerald &#038; Co. and Craig-Hallum Capital Group LLC.</p> <p>"
    },
    {
      "title": "BlackRock’s iShares Bitcoin Trust Shatters ETF Growth Record, Surpassing $70 Billion in Just 341 Days",
      "link": "https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BlackRock.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blackrocks-ishares-bitcoin-trust-shatters-etf-growth-record-surpassing-70-billion-in-just-341-days\" rel=\"nofollow\"> </a></p> <p>BlackRock’s iShares Bitcoin Trust (IBIT) has officially made history. The Bitcoin ETF surged past $70 billion in assets under management (AUM), reaching the milestone in just 341 trading days. This achievement makes IBIT the fastest ETF to ever hit that threshold.&#160; To put that into perspective, the previous record-holder—SPDR Gold Shares (GLD)—took 1,691 days to [&#8230;]</p> <p>"
    },
    {
      "title": "New York City Won’t Be Issuing BitBonds Any Time Soon",
      "link": "https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/New-York-City-Mayor-Eric-Adams-Bitcoin-BitBonds.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/new-york-city-wont-be-issuing-bitbonds-any-time-soon\" rel=\"nofollow\"> </a></p> <p>At Bitcoin 2025, NYC mayor, Eric Adams, proclaimed that he’s going to push to issue a BitBond, but judging by his past inaction on Bitcoin as well as a statement from NYC’s comptroller, odds are New Yorkers won’t see a BitBond in the near future.</p> <p>"
    },
    {
      "title": "Japan’s ANAP Holdings Launches Full Bitcoin Business Strategy with Goal of Over 1,000 BTC by August 2025",
      "link": "https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ANAP.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/japans-anap-holdings-launches-full-bitcoin-business-strategy-with-goal-of-over-1000-btc-by-august-2025\" rel=\"nofollow\"> </a></p> <p>ANAP Holdings, Inc. (3189: Tokyo Standard Market) has officially announced the launch of its “Bitcoin Business” in a formal corporate filing, detailing an entry into Bitcoin focused operations across treasury, finance, fashion, and mining. In a statement signed by President and CEO Yuta Sawaki, the company confirmed that its consolidated subsidiary ANAP Lightning Channel will [&#8230;]</p> <p>"
    },
    {
      "title": "Investment Holding Company Belgravia Hartford Capital Makes First Bitcoin Purchase as Part of Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/investment-holding-company-belgravia-hartford-capital-makes-first-bitcoin-purchase-as-part-of-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Investment-Holding-Company-Belgravia-Hartford-Capital-Makes-First-Bitcoin-Purchase-as-Part-of-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/investment-holding-company-belgravia-hartford-capital-makes-first-bitcoin-purchase-as-part-of-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Belgravia Hartford Capital purchased 4.86 BTC for $500,000.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "'Bitcoin First' KULR Technology Seeks $300 Million to Boost BTC Holdings",
      "link": "https://decrypt.co/324242/bitcoin-first-kulr-technology-seeks-300-million-to-boost-btc-holdings",
      "summary": "The publicly traded company holds 920 Bitcoin, worth just under $1 billion on Monday."
    },
    {
      "title": "Bitcoin Avoids Death Cross, Ethereum Stabilizes and Fartcoin Defies Gravity: Analysis",
      "link": "https://decrypt.co/324246/bitcoin-death-cross-ethereum-stabilizes-fartcoin",
      "summary": "Technical indicators signal potential rebounds for Bitcoin and Ethereum while Fartcoin meme coin momentum accelerates."
    },
    {
      "title": "Bitcoin Treasury The Blockchain Group Eyes $342 Million Raise to Buy More BTC",
      "link": "https://decrypt.co/324238/bitcoin-treasury-the-blockchain-group-eyes-342-million-raise-to-buy-more-btc",
      "summary": "The publicly traded firm aims to amass more Bitcoin for its corporate treasury through an “at-the-market”-type offering, in partnership with a Paris-based asset manager."
    },
    {
      "title": "Justin Sun-Linked BiT Global Drops Coinbase Lawsuit Over Wrapped Bitcoin",
      "link": "https://decrypt.co/324211/justin-sun-bit-global-drops-coinbase-lawsuit-wrapped-bitcoin",
      "summary": "Following the case dismissal, Coinbase Chief Legal Officer Paul Grewal said the exchange has \"zero plans\" to relist Wrapped Bitcoin (WBTC)."
    },
    {
      "title": "Argentine President Milei Exonerated in Libra Meme Coin Probe",
      "link": "https://decrypt.co/324201/argentine-president-milei-exonerated-libra-meme-coin-probe",
      "summary": "Milei promoted the Solana-based meme coin in February—and caused a stir."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "How UK crypto taxes work and what you need to know",
      "link": "https://cryptobriefing.com/how-uk-crypto-taxes-work/",
      "summary": "<p>The increasing scrutiny on crypto tax compliance in the UK highlights the need for investors to maintain accurate records and understand tax obligations.</p> <p>"
    },
    {
      "title": "Did Paraguay just make Bitcoin legal tender? Suspected hack of president’s X account sparks confusion",
      "link": "https://cryptobriefing.com/paraguay-bitcoin-legal-tender-hack/",
      "summary": "<p>The incident highlights the vulnerability of digital platforms in disseminating misinformation, potentially impacting national and global markets.</p> <p>"
    },
    {
      "title": "ProShares, Bitwise seek SEC approval for ETFs tracking Circle stock",
      "link": "https://cryptobriefing.com/circle-stock-etfs-proshares-bitwise/",
      "summary": "<p>The approval of these ETFs could enhance investor access to crypto-related equities, potentially boosting market liquidity and innovation.</p> <p>"
    },
    {
      "title": "Tether to open-source Bitcoin Mining Operating System to empower small, mid-sized miners, says Paolo Ardoino",
      "link": "https://cryptobriefing.com/tether-bitcoin-mining-open-source/",
      "summary": "<p>Tether's open-source MOS could democratize Bitcoin mining, enhancing decentralization and security while enabling smaller players to compete.</p> <p>"
    },
    {
      "title": "Bitcoin rises as key US-China trade talks commence in London",
      "link": "https://cryptobriefing.com/bitcoin-market-reaction-us-china-trade/",
      "summary": "<p>Bitcoin's rebound highlights its sensitivity to geopolitical events, underscoring its potential as a barometer for global economic tensions.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Dogecoin’s price could rally by 32%, but here’s the catch…!",
      "link": "https://ambcrypto.com/dogecoins-price-could-rally-by-32-but-heres-the-catch/",
      "summary": "<img alt=\"Dogecoin&#039;s price could rally by 32%, but here&#039;s the catch...!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-09T173332.809_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Everyone's favourite memecoin may be set to head in a different direction soon."
    },
    {
      "title": "Bitcoin network goes silent: Lowest activity in months raises questions about utility",
      "link": "https://ambcrypto.com/bitcoin-network-goes-silent-lowest-activity-in-months-raises-questions-about-utility/",
      "summary": "<img alt=\"BTC\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-5-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin’s price surges, but on-chain activity declines, sparking debate over its real-world utility"
    },
    {
      "title": "KAIA defies low liquidity to rally 14% – Can it target $0.135 next?",
      "link": "https://ambcrypto.com/kaia-defies-low-liquidity-to-rally-14-can-it-target-0-135-next/",
      "summary": "<img alt=\"KAIA\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/B08C0A92-5BD4-4333-AA5A-C818C4C9D417.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />KAIA has led the market race and shows no signs of slowing down."
    },
    {
      "title": "Bitcoin: THESE reasons show why you should consider HODLing BTC",
      "link": "https://ambcrypto.com/bitcoin-these-reasons-show-why-you-should-consider-hodling-btc/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-10.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin’s quiet phase signals indecisiveness, with declining exchange activity and potential volatility ahead."
    },
    {
      "title": "BlockDAG is breaking records fast: Why June 13’s GO LIVE reveal is the big date",
      "link": "https://ambcrypto.com/blockdag-is-breaking-records-fast-why-june-13s-go-live-reveal-is-the-big-date/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"501\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-09-174804.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"897\" />The crypto market is no stranger to hype. But what separates BlockDAG from the rest [&#8230;]"
    }
  ]
}