{
  "CoinDesk": [
    {
      "title": "Coinbase Unlocks DeFi Opportunities for XRP and Dogecoin Holders on Base",
      "link": "https://www.coindesk.com/markets/2025/06/05/coinbase-unlocks-defi-opportunities-for-xrp-and-dogecoin-holders-on-base",
      "summary": ""
    },
    {
      "title": "XRP Drops 3% as Selling Pressure Overwhelms Support Level",
      "link": "https://www.coindesk.com/markets/2025/06/05/xrp-drops-3-as-selling-pressure-overwhelms-support-level",
      "summary": ""
    },
    {
      "title": "Dogecoin Struggles to Reclaim $0.19 Threshold as Bearish Sentiment Persists",
      "link": "https://www.coindesk.com/markets/2025/06/05/dogecoin-struggles-to-reclaim-019-threshold-as-bearish-sentiment-persists",
      "summary": ""
    },
    {
      "title": "WazirX's Restructuring Plan Declined by Singapore Court, Hacked Indian Exchange Says",
      "link": "https://www.coindesk.com/markets/2025/06/05/wazirxs-restructuring-plan-declined-by-singapore-court-hacked-indian-exchange-says",
      "summary": ""
    },
    {
      "title": "Profit-Taking Continues in Crypto Market as Dogecoin, Cardano's ADA Lead Majors Slide",
      "link": "https://www.coindesk.com/markets/2025/06/05/profit-taking-continues-in-crypto-market-as-dogecoin-cardanos-ada-lead-majors-slide",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "US seizes 145 domains, crypto linked to BidenCash dark web market",
      "link": "https://cointelegraph.com/news/us-seizes-crypto-145-domains-bidencash-dark-web-market?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNlZGMtN2I2YS03MGM5LWJmOGEtNjA2ODhiYjViMjQ5.jpg\" /></p><p>US authorities seized 145 domains and crypto linked to BidenCash, a dark web market accused of selling millions of stolen credit cards.</p>"
    },
    {
      "title": "Crypto leverage trader James Wynn loses $25M on Bitcoin bet",
      "link": "https://cointelegraph.com/news/crypto-leverage-trader-james-wynn-loses-25m-bitcoin-bet?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzNlMDctY2JmZi03NjEyLWI3OTAtMzdiY2MzZjVkYTA3.jpg\" /></p><p>Hyperliquid leverage trader James Wynn has claimed the market is being manipulated against him after he was liquidated for 240 Bitcoin, worth $25 million.</p>"
    },
    {
      "title": "California advances bill on unclaimed crypto and merchant payments",
      "link": "https://cointelegraph.com/news/california-moves-forward-bill-unclaimed-crypto-merchant-payments?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWU5ZDEtNWRhOC03MjNlLWFmYzctMGRlNTQ4NWMxMTcw.jpg\" /></p><p>The bill has seen contention online, but Satoshi Action Fund’s Eric Peterson says it updates the state’s unclaimed property laws so crypto doesn’t get liquidated.</p>"
    },
    {
      "title": "Bitcoin bulls’ biggest threat is 2-month ‘tariff ultimatums’ trap: Analyst",
      "link": "https://cointelegraph.com/news/bitcoin-bulls-threat-us-president-donald-trump-tariffs-ultimatums-crypto-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjFmMjgtZGQyOS03MTljLTlkNWMtYWYzODZkYzJjMGMw.jpg\" /></p><p>An end to the “tariff sabre rattling” may see Bitcoin rallying to $120,000 this month, Swyftx lead analyst Pav Hundal tells .</p>"
    },
    {
      "title": "SEC wins $1.1M as alleged crypto conman a no-show in court",
      "link": "https://cointelegraph.com/news/sec-wins-1-million-alleged-crypto-conman-no-show-court?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzA1OWQtNzVjMC03M2YzLTlhZjQtMzUxNjRhOWExMTc0.jpg\" /></p><p>The SEC sued Keith Crews in 2023 alleging he ran a crypto fraud scheme, but he failed to answer the complaint, leading a judge to hand a default win to the regulator.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "AEON Integrates TRON Network to Enable Seamless In-Store Payments",
      "link": "https://cryptoslate.com/aeon-integrates-tron-network-to-enable-seamless-in-store-payments/",
      "summary": "<p>Singapore &#8211; June 5, 2025 – AEON, the next-generation crypto framework built for payments, has integrated the TRON network to enable seamless in-store payments. Through AEON Pay, users can now transact using TRX, the native utility token of the TRON network. USDT and USDD on TRON for offline payments are also included to bring fast [&#8230;]</p> <p>"
    },
    {
      "title": "Moroccan police arrests suspect behind recent crypto-related kidnappings in France",
      "link": "https://cryptoslate.com/moroccan-police-arrests-suspect-behind-recent-crypto-related-kidnappings-in-france/",
      "summary": "<p>Moroccan police have arrested a dual-national French-Moroccan man wanted for an alleged connection with a series of kidnappings in France that targetted individuals with crypto holdings, Reuters reported on June 4, citing a source familiar with the case. According to the source, Moroccan police identified the man as Bajjou Badiss Mohamed AmiDe, who is 24 [&#8230;]</p> <p>"
    },
    {
      "title": "Systemic risk on the rise as leverage interdependencies tighten between CeFi, DeFi and crypto treasuries",
      "link": "https://cryptoslate.com/systemic-risk-on-the-rise-as-leverage-interdependencies-tighten-between-cefi-defi-and-crypto-treasuries/",
      "summary": "<p>Interconnections between centralized and decentralized crypto lending are heightening systemic risk, Galaxy Digital&#8217;s research arm said in a June 4 report on first-quarter borrowing data. The report estimated that as of March 31, over $39 billion in crypto-collateralized debt was outstanding across decentralized lending apps, centralized lenders, and crypto-backed stablecoin issuers. DeFi protocols accounted for [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation unveils comprehensive treasury plan to balance capital and privacy commitments",
      "link": "https://cryptoslate.com/ethereum-foundation-unveils-comprehensive-treasury-plan-to-balance-capital-and-privacy-commitments/",
      "summary": "<p>Ethereum Foundation has released a sweeping update to its treasury management strategy, signaling a more mature, structured approach to capital allocation amid ETH&#8217;s growing global influence and rising institutional scrutiny. The new framework, published on June 4, outlines how the foundation will manage reserves, deploy capital in DeFi protocols, and assess privacy standards, while maintaining [&#8230;]</p> <p>"
    },
    {
      "title": "Brazil’s central bank plans to use CBDC data to guide interest rate decisions",
      "link": "https://cryptoslate.com/brazils-central-bank-plans-to-use-cbdc-data-to-guide-interest-rate-decisions/",
      "summary": "<p>Brazil’s Central Bank plans to treat transaction data from its central bank digital currency (CBDC) infrastructure, called Drex, as a direct input for setting the country’s interest rate benchmark. Central bank executive Henrique Videira said on June 4 at the Token Nation conference in São Paulo that every payment and asset transfer recorded on Drex’s [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin’s Key Investors Double Down, Buy Another 79,000 BTC",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoins-key-double-down-buy-another-79000-btc/",
      "summary": "On-chain data shows the large Bitcoin investors have added to their holdings in the past week, a sign that could be bullish for BTC&#8217;s price. Bitcoin Investors With 10 To 10,000 BTC Have Added To Their Holdings In a new post on X, the on-chain analytics firm Santiment has talked about the latest trend in the Bitcoin supply held by the 10 to 10,000 BTC investors. The on-chain indicator of relevance here is the &#8220;Supply Distribution,&#8221; which tells us about the total number of tokens that a particular wallet group is carrying right now. Related Reading: Bitcoin ATH Fails To Hype Retail—Demand Is Actually Down Addresses or investors are placed into these cohorts based on the size of their balance. For example, the 1 to 10 coins group includes all holders owning between 1 and 10 tokens of the cryptocurrency. In the context of the current discussion, the groups lying inside the 10 to 10,000 BTC range are of interest. This wide range includes some of the key holders of the sector like the sharks and whales. These investors own significant holdings, so their behavior can often be worth keeping an eye on. Now, here is the chart shared by the analytics firm that shows the trend in the Bitcoin Supply Distribution of the 10 to 10,000 BTC holders over the last few months: As is visible in the above graph, the Bitcoin supply held by the 10 to 10,000 BTC investors has registered a significant jump over the past week, implying this group has purchased a net number of coins. More specifically, the members of the cohort have collectively added 79,244 BTC to their wallets in this period. At the current exchange rate, this amount converts to a whopping $8.3 billion. Related Reading: Bitcoin 3–5 Year Holders Slow Selloff—Waiting for Higher Prices? From the chart, it&#8217;s visible that this accumulation from the key investors has arrived while BTC has been going down after forming a new all-time high (ATH). This could be a potential indication that these holders still believe in the rally and see this drawdown as just a dip opportunity. That said, the 10 to 10,000 range is a bit wide, so while it does include the big-money investors, it also mixes up their behavior with some of the less-significant hands. Fortunately for Bitcoin, it would appear that the whales (1,000 to 10,000 BTC) agree with this trend of buying, as the chart shared by analyst Ali Martinez implies. As displayed in the graph, the whales of the cryptocurrency have added around 30,000 tokens to their holdings during the past few days, meaning that it&#8217;s not just the mid-sized hands buying this dip. BTC Price At the time of writing, Bitcoin is floating around $105,200, down over 2% in the last seven days. Featured image from Dall-E, Santiment.net, chart from TradingView.com"
    },
    {
      "title": "Ethereum Eyes 15% Move Amid Key Resistance Retest – Breakout Or Rejection Next?",
      "link": "https://www.newsbtc.com/news/ethereum-eyes-15-move-amid-key-resistance-retest-breakout-or-rejection-next/",
      "summary": "Ethereum (ETH) is retesting a crucial resistance level amid its daily 3% recovery. The cryptocurrency has been rejected from this area since last month’s market recovery, failing to continue its bullish rally. As its price continues its sideways trajectory, an analyst suggests that a 15% move is coming. Related Reading: Bitcoin To Face ‘One Last Speed Bump’ Before Rally To $140,000 – Analyst Ethereum Price Compressing Within Key Levels Since its early May breakout, Ethereum has been trading between the $2,475-$2,680 price range, failing to turn the range’s upper boundary as support for nearly a month. Amid last week’s market pullback, the cryptocurrency retraced around 11% from its three-month high of $2,788 to the range’s lower boundary, bouncing from this area on Monday. At the start of the week, ETH reclaimed the $2,500 mark and continued its recovery rally toward the $2,600 resistance. On Wednesday, the King of Altcoins saw a 3.2% daily surge toward the local range high resistance before retracing to the $2,635 level. Carl Runefelt from The Moon Show highlighted the cryptocurrency’s recent performance, affirming that Ethereum is “showing confidence” by staying inside a key formation in the daily timeframe. According to the chart, Ethereum has been forming an ascending triangle since the May rally, with the upper line around the $2,680-$2,700 mark. Moreover, ETH’s price has been compressing between the support and resistance lines, suggesting a potential 15% move if the price breaks out of the pattern. Runefelt forecasted a surge toward the $3,100 level if the Altcoin reclaims the crucial resistance level. However, if the price is rejected once again from this level, the analyst considers that Ethereum could drop to the $2,300 support zone. Crypto Bullet pointed out a similar pattern on multiple ETH charts, suggesting that a 15%-20% breakout is imminent for the cryptocurrency. Per"
    },
    {
      "title": "$63 Billion in Bitcoin Scooped Up by New Whales, Is $135K Still in Play?",
      "link": "https://www.newsbtc.com/bitcoin-news/63-billion-in-bitcoin-scooped-up-by-new-whales-is-135k-still-in-play/",
      "summary": "Bitcoin is so far facing a notable pullback in price, with its price now down roughly 5.8% from its all-time high recorded last month. At the time of writing, the asset currently trades at $105,062, marking a 1.1% decrease in the past day. Despite the pullback, on-chain data indicates a significant change in market behavior among large investors. A new set of Bitcoin whales—wallets holding 1,000 BTC or more with coins aged less than six months—has been accumulating the asset at an accelerated pace. Related Reading: Bitcoin Derivatives Reset: Neutral Funding And Whale Withdrawals Hint At Bullish Shift Young Whale Holdings Surge as Supply Share Tightens According to a recent analysis published by CryptoQuant contributor “onchained,” this accumulation trend may reflect renewed conviction among high-capital participants preparing for future catalysts. Between March 1 and June 4, 2025, the amount of Bitcoin held by this group of “new whales” more than doubled from approximately 500,000 BTC to over 1.1 million BTC. This represents an increase of around $63 billion in value. During the same period, their share of Bitcoin’s total circulating supply grew from 2.5% to 5.6%, effectively removing an amount equivalent to nearly ten months of Bitcoin mining output from active circulation. Notably, this measure excludes long-dormant wallets, helping isolate recent capital inflows. This trend suggests a combination of long-term positioning and active supply absorption, which historically has preceded significant price volatility. Analysts view the emergence of new whale activity as a signal of shifting market structure, especially when paired with tightening supply conditions. If these entities continue to withdraw BTC from circulation without signs of immediate distribution, it could signal a period of price compression followed by upside volatility. Technical Patterns Suggest Possible Breakout Levels From a technical analysis perspective, Bitcoin may be forming a new bullish pattern. According to a recent post by the analyst known as “Titan of Crypto,” the asset has broken out of a right-angled descending broadening wedge, a chart pattern that can imply a trend reversal or continuation depending on confirmation. #Bitcoin to $135,000 in 2025? 📈$BTC has broken out of a right-angled descending broadening wedge. If price holds above the breakout zone, $135,000 becomes a realistic target. Structure is clean. pic.twitter.com/KqTkquDNhn — Titan of Crypto (@Washigorira) June 3, 2025 If the price maintains levels above the wedge’s breakout zone, historical analysis suggests a potential upside target near $135,000 in 2025. This technical view aligns with the broader narrative of positioning ahead of expected macroeconomic catalysts. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin Reserve Gets Military Nod, Senator Predicts Explosive 10-Year Surge",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-reserve-gets-military-nod-senator-predicts-explosive-10-year-surge/",
      "summary": "Senator Cynthia Lummis, who leads the Senate Subcommittee on Digital Assets, says the US military backs a plan to create a Strategic Bitcoin Reserve. Jamie Dimon, the CEO of a major bank, recently called that plan a waste. Lummis pushed back. Related Reading: XRP Could Transform Your Finances Long Before $10K, Angel Investor Says Lummis told Bloomberg the military thinks having Bitcoin on hand matters. She said it could be a tool in the economic contest with China. Some see that as a bold step. Others say it’s risky. Military Backs Bitcoin Reserve According to the senator, military leaders say Bitcoin could help in an economic showdown. They see it as a way to hold value if traditional assets get hit by sanctions or big moves from other nations. She spoke about weapons and ammunitions being part of national security, but she added that a Bitcoin reserve is also vital. Some military voices have warned that future conflicts won’t just be fought on battlefields. Money and digital assets could play a key role too. Legislative And Executive Moves Based on reports, Lummis introduced a bill to have the US buy and hold 1 million BTC. That would mirror what countries do with gold. The idea is to pull funds from the Treasury or Federal Reserve rather than use new budget money. It has not moved far in Congress. Still, US President Donald Trump issued an order on March 6, 2025, to set up a Bitcoin reserve plus a digital asset stockpile for other coins. He said the government would use assets seized in civil and criminal actions to start the fund. That means some 200,000 BTC the government already has could be part of it. Lummis Sees Bitcoin Price Rising In The Next Decade Lummis unveiled a proprietary model forecasting a dramatic rise in Bitcoin’s price over the next decade, citing factors such as its fixed supply, growing institutional adoption, and expanding network effects. Analysts caution that such long-term forecasts hinge on unpredictable factors like regulatory shifts, technological breakthroughs, and market sentiment, any of which could derail even the most optimistic projections. She also praised Trump for pushing simple rules for crypto and for using digital coins as part of national strategy. Trump’s family runs a DeFi platform, a stablecoin project, and even some meme coins. Lummis thinks everyone will end up in the crypto economy sooner or later. Related Reading: $500M Bet On Solana: Education Platform Aims To Supercharge Its Treasury Skeptic Voices And Uncertain Path Jamie Dimon disagrees. He calls the Bitcoin reserve a waste of resources. Other experts worry about Bitcoin’s ups and downs. They say a strategic reserve shouldn’t ride on something that can swing 20% in a single day. Some economists at top universities give zero support to borrowing money to build a crypto stash. They argue it doesn’t make sense against the US’s nearly $36 trillion national debt. For now, the bill to buy 1 million BTC sits in committee. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Cardano (ADA) Struggles Deepen: Price Slips Further, Investors on Edge",
      "link": "https://www.newsbtc.com/analysis/ada/cardano-ada-struggles-0-65/",
      "summary": "Cardano price started a fresh decline below the $0.70 zone. ADA is now consolidating and might aim decline further below the $0.650 zone. ADA price started a fresh decline below $0.720 and $0.700. The price is trading below $0.70 and the 100-hourly simple moving average. There was a break below a bullish trend line with support at $0.6840 on the hourly chart of the ADA/USD pair (data source from Kraken). The pair could start a fresh decline if it dips below the $0.650 support zone. Cardano Price Dips Further In the past few days, Cardano saw a fresh decline below the $0.750, unlike Bitcoin and Ethereum. ADA even declined below the $0.70 level to enter a bearish zone. Besides, there was a break below a bullish trend line with support at $0.6840 on the hourly chart of the ADA/USD pair. The bears even pushed the price below the $0.70 level. A low was formed at $0.6626 and the price is now consolidating losses. Cardano price is now trading below $0.70 and the 100-hourly simple moving average. On the upside, the price might face resistance near the $0.6720 zone. It is near the 23.6% Fib retracement level of the recent decline from the $0.7026 swing high to the $0.6626 low. The first resistance is near $0.6825 or the 50% Fib retracement level of the recent decline from the $0.7026 swing high to the $0.6626 low. The next key resistance might be $0.6920. If there is a close above the $0.6920 resistance, the price could start a strong rally. In the stated case, the price could rise toward the $0.7350 region. Any more gains might call for a move toward $0.750 in the near term. Another Decline In ADA? If Cardano’s price fails to climb above the $0.6825 resistance level, it could start another decline. Immediate support on the downside is near the $0.6625 level. The next major support is near the $0.650 level. A downside break below the $0.650 level could open the doors for a test of $0.620. The next major support is near the $0.60 level where the bulls might emerge. Technical Indicators Hourly MACD – The MACD for ADA/USD is gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for ADA/USD is now below the 50 level. Major Support Levels – $0.650 and $0.620. Major Resistance Levels – $0.6825 and $0.700."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Matador Technologies Raises C$1.64M To Invest in Their Bitcoin Reserve",
      "link": "https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Matador-Technologies-Raising-C1-Million-to-Invest-in-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/matador-technologies-raises-c1-64m-to-invest-in-their-bitcoin-reserve\" rel=\"nofollow\"> </a></p> <p>Matador Technologies announced it raised C$1,644,300 across the issuance of 2,652,097 units to add more bitcoin to their reserve.</p> <p>"
    },
    {
      "title": "Support The Blockchain Regulatory Certainty Act (BRCA) To Protect Noncustodial Services",
      "link": "https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Blockchain-Regulatory-Certainty-Act-Save-Our-Wallets-Bitcoin-1.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/support-the-blockchain-regulatory-certainty-act-brca-to-protect-noncustodial-services\" rel=\"nofollow\"> </a></p> <p>Call your local elected officials and tell them to support the BRCA, which protects developers of noncustodial technology as well as a variety of services that preserve privacy and make it easier to scale Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin Layer 2: The Key To Scaling Bitcoin",
      "link": "https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Layer2-Introduction.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/bitcoin-layer-2-the-key-to-scaling-bitcoin\" rel=\"nofollow\"> </a></p> <p>Bitcoin and other blockchains are robust and decentralized systems, but they do not scale. In order to make them work, a layered approach is necessary.</p> <p>"
    },
    {
      "title": "JPMorgan to Offer Clients Financing Against Bitcoin & Crypto ETFs",
      "link": "https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/JP-Morgan-Plans-to-Offer-Clients-Financing-Against-Crypto-ETFS.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/jpmorgan-to-offer-clients-financing-against-bitcoin-crypto-etfs\" rel=\"nofollow\">JPMorgan to Offer Clients Financing Against Bitcoin &#038; Crypto ETFs</a></p> <p>JPMorgan Chase &#38; Co. plans to allow its trading and wealth-management clients to use cryptocurrency-linked assets, including spot Bitcoin exchange-traded funds (ETFs), as collateral for loans, according to Bloomberg. The bank will begin with BlackRock’s iShares Bitcoin Trust (IBIT), and additional ETFs are expected to be added over time. The policy will apply globally, spanning [&#8230;]</p> <p>"
    },
    {
      "title": "BTCPay Server: The Backbone of Bitcoin Commerce, 2025",
      "link": "https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_young_modern_wizard_male_futuristic_clothi_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/btcpay-server-the-backbone-of-bitcoin-commerce-2025\" rel=\"nofollow\"> </a></p> <p>With plugins for Boltz swaps and WooCommerce, BTCPay Server’s open-source platform supports merchants globally, no middleman required.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Amazon to Spend $10 Billion on North Carolina Data Centers for AI Expansion",
      "link": "https://decrypt.co/323815/amazon-10-billion-north-carolina-data-centers-ai-expansion",
      "summary": "Amazon’s AI expansion may boost jobs, but it risks concentrating innovation in Big Tech’s hands, an expert told ."
    },
    {
      "title": "Japanese Company Ispace's Probe Expected to Land On The Moon Tomorrow",
      "link": "https://decrypt.co/323812/japanese-company-ispaces-probe-land-moon-tomorrow",
      "summary": "The Tokyo-listed company aims to land its RESILIENCE probe on the moon Friday, marking its second attempt to reach the lunar surface."
    },
    {
      "title": "US Seizes Crypto and 145 Domains Linked to Dark Web Marketplace",
      "link": "https://decrypt.co/323809/us-seizes-crypto-145-domains-dark-web-marketplace",
      "summary": "BidenCash served 117,000 users and trafficked over 15 million stolen credit cards and personal data before being taken down."
    },
    {
      "title": "Ethereum Foundation Sets Treasury Strategy to Back DeFi, Cut Spending Over Time",
      "link": "https://decrypt.co/323805/ethereum-foundation-treasury-strategy-back-defi-cut-spending",
      "summary": "The new policies seek to lower operating costs, establish strict triggers for ETH sales, and enforce “Defipunk” privacy standards."
    },
    {
      "title": "Reddit Files Lawsuit Against Anthropic Over Alleged Unauthorized Data Scraping",
      "link": "https://decrypt.co/323802/reddit-lawsuit-anthropic-alleged-unauthorized-data-scraping",
      "summary": "Reddit is accusing AI firm Anthropic of scraping content to train Claude, fueling a broader legal battle over the use of online data."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "JPMorgan Chase set to accept Bitcoin, crypto ETFs as loan collateral",
      "link": "https://cryptobriefing.com/jpmorgan-crypto-loan-collateral/",
      "summary": "<p>JPMorgan's move to accept crypto ETFs as collateral could accelerate mainstream adoption and integration of digital assets in traditional finance.</p> <p>"
    },
    {
      "title": "BlackRock’s Bitcoin ETF futures go live on Moscow Exchange as fund surpasses $70 billion AUM",
      "link": "https://cryptobriefing.com/bitcoin-futures-moscow-exchange/",
      "summary": "<p>The integration of Bitcoin ETFs into Russia's financial markets may signal a shift towards broader acceptance and regulation of crypto assets.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Webus files with SEC for potential $300M XRP reserve strategy, stock surges pre-market",
      "link": "https://cryptobriefing.com/webus-xrp-reserve-strategy/",
      "summary": "<p>Webus's strategic XRP reserve plan could enhance global payment solutions, potentially transforming cross-border transactions and boosting investor confidence.</p> <p>"
    },
    {
      "title": "Trump’s top crypto advisor meets with Pakistan blockchain chief to discuss Bitcoin",
      "link": "https://cryptobriefing.com/bitcoin-strategic-cooperation-pakistan/",
      "summary": "<p>Pakistan's strategic Bitcoin initiatives could strain IMF relations, highlighting challenges for emerging markets in crypto adoption.</p> <p>"
    },
    {
      "title": "Eric Trump threatens legal action over unauthorized Trump-branded crypto wallet",
      "link": "https://cryptobriefing.com/eric-trump-crypto-wallet-warning/",
      "summary": "<p>The incident highlights the complexities and potential legal challenges of using high-profile branding in the rapidly evolving crypto space.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "$6mln bet on Hyperliquid – Will HYPE move to $40 or fall back?",
      "link": "https://ambcrypto.com/6mln-bet-on-hyperliquid-will-hype-move-to-40-or-fall-back/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-04T152552.148-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Whale buys, stable funding, and heatmap clusters build a strong case for a breakout."
    },
    {
      "title": "Joe Lubin says sovereign wealth funds are eyeing Ethereum – Is a mega ETH buy incoming?",
      "link": "https://ambcrypto.com/joe-lubin-says-sovereign-wealth-funds-are-eyeing-ethereum-is-a-mega-eth-buy-incoming/",
      "summary": "<img alt=\"Joe Lubin says sovereign wealth funds are eyeing Ethereum - Is a mega ETH buy Incoming?\" class=\"attachment-full size-full wp-post-image\" height=\"821\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Lubin-says-Sovereign-Wealth-Funds-eye-Ethereum.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1459\" />What’s driving major sovereign funds to eye Ethereum now?"
    },
    {
      "title": "All about SPX6900’s uptrend – Why $1.2 level could be next buying opportunity",
      "link": "https://ambcrypto.com/all-about-spx6900s-uptrend-why-1-2-level-could-be-the-next-buying-opportunity/",
      "summary": "<img alt=\"All about SPX6900&#039;s uptrend - Why $1.2 level could be the next buying opportunity\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/SPX-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The Fibonacci retracement levels served as resistance, but they were broken and flipped to support by SPX bulls."
    },
    {
      "title": "Strategy’s MSTR stock leads with 5% gains thanks to bold capital moves, Bitcoin’s recovery",
      "link": "https://ambcrypto.com/strategys-mstr-stock-leads-with-5-gains-thanks-to-bold-capital-moves-bitcoins-recovery/",
      "summary": "<img alt=\"Strategy&#039;s MSTR stock leads with 5% gains thanks to bold capital moves, Bitcoin&#039;s recovery\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/MSTRstock.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />MSTR's mid-week rally may be at risk ahead of potential macro-driven volatility."
    },
    {
      "title": "Tracking Bitcoin’s dominance and how investors can prepare themselves",
      "link": "https://ambcrypto.com/tracking-bitcoins-dominance-and-how-investors-can-prepare-themselves/",
      "summary": "<img alt=\"Tracking Bitcoin&#039;s dominance and how investors can prepare themselves\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Dominance-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin Dominance is now at levels not seen since 2022, with the same showing no signs of slowing down."
    }
  ]
}