{
  "CoinDesk": [
    {
      "title": "NEAR Protocol Surges 5% as Buyers Dominate Amid Middle East Tensions",
      "link": "https://www.coindesk.com/markets/2025/06/19/near-protocol-surges-5-as-buyers-dominate-amid-middle-east-tensions",
      "summary": ""
    },
    {
      "title": "XRP Tests Key Support as Traders Watch for Breakout Signal",
      "link": "https://www.coindesk.com/markets/2025/06/19/xrp-tests-key-support-as-traders-watch-for-breakout-signal",
      "summary": ""
    },
    {
      "title": "SOL Slips Below $144 Even as Sol Strategies Eyes Nasdaq to Deepen Its Bet",
      "link": "https://www.coindesk.com/markets/2025/06/19/sol-slips-below-usd144-even-as-sol-strategies-eyes-nasdaq-to-deepen-its-bet",
      "summary": ""
    },
    {
      "title": "Elon Musk's X to Offer Investments, Trading 'Soon:' FT",
      "link": "https://www.coindesk.com/business/2025/06/19/elon-musks-x-to-offer-investments-trading-soon-ft",
      "summary": ""
    },
    {
      "title": "Crypto for Advisors: Digital Asset Tax Preparation",
      "link": "https://www.coindesk.com/coindesk-indices/2025/06/18/crypto-for-advisors-digital-asset-tax-preparation",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Telegram&#039;s Pavel Durov approved to leave France temporarily",
      "link": "https://cointelegraph.com/news/pavel-durov-leave-france-limited-period?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2EwMjEtMmJjZS03NGM2LWIxYzEtZWI1ZDZiMjU2NTQy.jpg\" /></p><p>The Telegram founder will once again be allowed to travel to Dubai for a short period before returning to France, where his case is ongoing.</p>"
    },
    {
      "title": "Ethereum bulls must break $2.8K: What will trigger a &#039;violent move&#039;?",
      "link": "https://cointelegraph.com/news/ethereum-bulls-break-2-8k-what-will-trigger-a-violent-move?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzg4OTItYWQ2Yy03MzQ1LTliNzMtYzg4YTA5YjNlYTgx.jpg\" /></p><p>Shrinking liquid supply, persistent ETF demand, and strong technical factors could push ETH price above $4,000.</p>"
    },
    {
      "title": "How crypto experts find 100x coins before anyone else",
      "link": "https://cointelegraph.com/news/trendspotting-in-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmZiODUtY2FiOS03ZDcyLTgyZTAtZTUzYjczN2QyMjdi.jpg\" /></p><p>Trendspotting in crypto means more than luck. By using tools like Dune Analytics, Santiment and onchain data, you can uncover promising projects before the crowd catches on.</p>"
    },
    {
      "title": "Here’s what Bitcoin did while the US added to its $37T debt",
      "link": "https://cointelegraph.com/explained/heres-what-bitcoin-did-while-the-us-added-to-its-37t-debt?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy84MDYzOTRiMzc1NWE1Y2FiYjI0MjAzYjFmNTdiMmM0Mi5qcGc=.jpg\" /></p><p>As Washington printed trillions, Bitcoin evolved into a global asset class, trusted by nations and corporations, amid growing US debt concerns.</p>"
    },
    {
      "title": "Crypto&#039;s true revolution is about humanity, not technology",
      "link": "https://cointelegraph.com/news/the-human-case-for-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzM1ODItYmE2Yy03YmI2LWJmNWMtOWY3NjBhZDYwODk5.jpg\" /></p><p>Crypto isn’t just about technology or speculation. It’s about restoring dignity and agency to those left behind by traditional finance. Crypto offers a path to financial dignity through education and inclusion.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "PancakeSwap extends lead as monthly DEX volume tops $500B",
      "link": "https://cryptoslate.com/pancakeswap-extends-lead-as-monthly-dex-volume-tops-500b/",
      "summary": "<p>Decentralized exchanges processed over $513.5 billion in trading volume over the past 30 days. Daily turnover averaged $15.93 billion, keeping pace with the seven-day total of $107 billion and indicating a sustained rise rather than a short-term spike. If sustained, the current monthly rate would annualize to over $6 trillion in trading volume, more than [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum’s strategic reserves hit nearly 1% of supply as top holders dominate",
      "link": "https://cryptoslate.com/insights/ethereums-strategic-reserves-hit-nearly-1-of-supply-as-top-holders-dominate/",
      "summary": "<p>The amount of Ethereum (ETH) held in strategic reserves is nearing a critical benchmark, with nearly 1% of the crypto’s total circulating supply now held by major organizations and institutions. Data from the Strategic ETH Reserve shows that approximately 1,167,712 ETH, valued at nearly $2.96 billion, is currently designated as a strategic holding. This figure [&#8230;]</p> <p>"
    },
    {
      "title": "South Korea moves closer to spot Bitcoin ETFs as FSC explores proposal",
      "link": "https://cryptoslate.com/south-korea-moves-closer-to-spot-bitcoin-etfs-as-fsc-explores-proposal/",
      "summary": "<p>South Korea&#8217;s top financial regulator is working on a detailed roadmap to support the launch of digital asset spot exchange-traded funds. According to a June 19 report by Herald Economy, the Financial Services Commission revealed the move during a policy update to the State Affairs Planning Committee. The FSC plans to roll out its proposal [&#8230;]</p> <p>"
    },
    {
      "title": "Iran-based Nobitex vows user protection despite $100 million attack by Israel-linked hacktivists",
      "link": "https://cryptoslate.com/iran-based-nobitex-vows-user-protection-despite-100-million-attack-by-israel-linked-hacktivists/",
      "summary": "<p>Iranian crypto exchange Nobitex has confirmed that it lost nearly $100 million in a cyberattack by a politically motivated hacking group. The breach, which occurred on July 18, has shaken the local crypto community and triggered a government-imposed curfew on crypto trading platforms nationwide. The attack was claimed by an Israel-linked group calling itself Gonjeshke [&#8230;]</p> <p>"
    },
    {
      "title": "Open source AI might kill us. Closed AI could enslave us. Choose your apocalypse.",
      "link": "https://cryptoslate.com/open-ai-might-kill-us-closed-ai-might-enslave-us-choose-your-future/",
      "summary": "<p>There’s a familiar discomfort creeping in again, something I felt in the early 2010s as I watched social media&#8217;s promises of connection and community unravel into mass manipulation. Facebook and propaganda bots were the first dominoes. Cambridge Analytica, Brexit, global elections, it all felt like a betrayal of the internet’s original dream. Now, in the [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Why The June 22 Date Is Important As Bitcoin Price Flirts With $100,000",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-action-on-june-22/",
      "summary": "The Bitcoin price action is currently testing investors&#8217; nerves as it hovers around $100,000. While it flirts with this psychological level, analysts are highlighting June 22, 2025, as a key date for potential volatility. Backed by both historical volatility patterns and technical indicators, this date is gearing up to be a critical window for Bitcoin’s next move. Bitcoin Price Braces For Volatility On June 22 Bitcoin is entering a decisive phase as it trades above the $100,000 mark, with technical signals identified by TradingView expert ‘readCrypto’ aligning around a critical time frame—-June 22. The chart analysis shows that June 22 is an important date, signaling the projected start of Bitcoin’s next volatility window, with a potential to break out or break down depending on how the flagship cryptocurrency reacts to key support and resistance zones. Related Reading: Analyst Predicts Bitcoin Price Crash As War Tensions Mount In Middle East Currently, Bitcoin is trading at $104,731, close to a pivotal confluence range between $104,463 and $106,133—a zone highlighted as a structural mid-point. This area is defined by the DOM (60) and a Heikin-Ashi high point on the price chart, marking the formation of a recent upper boundary. Moreover, the lower end of the range sits around $99,705, which is the HA-High support level, where the price has previously been tested but not yet broken. According to the analyst, the June 22 date is important because it coincides with the confluence of key price levels with the M-Signal indicator on the weekly chart. This indicator is currently rising and aligning near the $99,705 HA-high level. If Bitcoin falls below this level, it could signal the start of a deeper corrective move, possibly toward the monthly M-Signal line or even the $89,294 region, corresponding with the 2.618 Fibonacci. Conversely, if Bitcoin holds above this level and breaks out of the $108,316 resistance, momentum could shift back to the upside. The analyst has set upper bullish targets near $109,598 and $111,696, reflecting the final resistance zone before new highs. Support Zones And Momentum Indicate Tense Standoff Moving past readCrypto’s volatility-driven projection, the TradingView analyst’s Bitcoin chart shows that the On-Balance-Volume (OBV) oscillator remains below the zero line. This suggests that despite recent gains, selling pressure may still be dominating the broader market. However, the histogram in the chart shows signs of waning momentum on the sell side. Related Reading: Brace For Impact: Bitcoin Price Primed For Deep Correction Below $90,000 This divergence aligns with Bitcoin’s weakening Stochastic Relative Strength Index (RSI), which indicates momentum may be cooling. The low OBV readings, combined with the recent bounce from a lower support range, also underscore an intense standoff within the market. If Bitcoin breaks below the Heikin Ashi high point at $99,705, a retest of new lows at $89,294 is more than likely. Until then, readCrypto’s analysis shows that all eyes are on the $104,000 to $106,000 zone. The area between $99,705 and $108,316 now defines the high-boundary consolidation range. A confirmed move outside this range, mainly triggered during the June 21-13 window, could dictate Bitcoin’s next major move. Featured image from Pixabay, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Mirrors Bitcoin 2017-2021 Pattern – $4,000 Is The Trigger Point",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-mirrors-bitcoin-2017-2021-pattern-4000-is-the-trigger-point/",
      "summary": "Ethereum is trading within a tight range that has held for several weeks, forming the kind of compression structure that often leads to a significant breakout. Despite heightened volatility in global markets driven by escalating tensions in the Middle East, ETH has remained resilient, holding strong above key demand zones around the $2,500–$2,600 area. The current environment is marked by uncertainty, with geopolitical conflict and macroeconomic risks weighing on investor sentiment. Yet Ethereum’s price structure suggests that bulls are patiently building momentum. Related Reading: Bitcoin Consolidates as Realized Profits Stay Low – No Signs Of Major Sell-Off Yet Top analyst Ted Pillows shared a technical outlook, pointing out that Ethereum is mirroring the same consolidation pattern that Bitcoin followed during its 2017–2021 cycle. In that historical setup, BTC compressed into a tight range before entering a parabolic rally once the upper boundary was broken. If Ethereum follows a similar path, the next move could be dramatic, especially if it clears major resistance levels like $2,800. As long as ETH holds range support and absorbs both upside and downside wicks, this setup remains intact. A breakout above the current range could ignite a fresh leg up for Ethereum—and possibly spark renewed strength across the altcoin market. Ethereum Builds Momentum As Market Awaits Clarity Ethereum is currently trading in a tight range, consolidating just above the $2,600 level and holding firm despite macroeconomic and geopolitical headwinds. After rallying nearly 80% from its April lows, ETH appears to be preparing for a decisive move in the coming sessions. However, with escalating tensions between Israel and Iran and uncertainty surrounding possible U.S. involvement, broader markets remain cautious. Until clarity emerges on the geopolitical front, sideways price action may persist. Still, Ethereum’s price structure remains constructive. Strong consolidation above key demand zones reflects ongoing buyer interest and a lack of heavy selling pressure. This behavior often precedes major moves, as investors accumulate ahead of expected volatility. Some market participants remain cautious, warning of a possible retrace below the $2,400 level if demand falters or broader risk sentiment weakens. In contrast, bullish analysts like Ted Pillows suggest a more optimistic outlook. According to Pillows, Ethereum is closely following the path Bitcoin took during its 2017–2021 cycle, where tight consolidation ultimately led to a breakout and parabolic rally. In this view, ETH’s real explosive phase won’t begin until it breaks above $4,000. If this scenario plays out, Ethereum could trigger a broader altcoin surge and shift overall crypto market sentiment bullish once again. Related Reading: Tron Shows Real Growth: Transaction Volume Soars While Success Rate Stays Above 96% ETH Technical Analysis: Consolidation Near Key Levels The 3-day Ethereum chart shows a prolonged consolidation phase as ETH trades near the $2,500 mark. Despite geopolitical uncertainty and rising macroeconomic risks, Ethereum has held above the $2,400 support zone, forming a tight range just below the critical resistance at $2,775. This area also coincides with the 200-day SMA (red line), which continues to cap upward momentum. ETH remains above the 50-day (blue) and 100-day (green) SMAs, suggesting bullish momentum is intact, though lacking follow-through. The recent candle bodies show decreasing volatility, with wicks on both sides being absorbed—a classic sign of compression that often precedes a large move. Related Reading: Ethereum Golden Cross Approaching – Will History Repeat? Volume has declined slightly compared to the breakout in early May, indicating a temporary pause in bullish conviction. However, if Ethereum manages a higher close above the $2,775 resistance, it could trigger an impulsive breakout targeting the $3,000 level. On the downside, a break below $2,400 would invalidate the current structure and expose ETH to a deeper correction toward $2,100. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "XRP 5-Wave Count Shows When The Price Will Hit All-Time Highs Above $5",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-5-wave-above-5/",
      "summary": "Crypto analyst XForce has again alluded to the 5-Wave count to show when the XRP Price is likely to hit a new all-time high (ATH) above $5. As part of his analysis, the analyst also declared that there is no reason to be bearish on the altcoin at the moment. XRP To Rally Above $5 Based On 5-Wave Count In an X post, XForce shared an accompanying chart that showed that XRP could rally above $5 on the Wave 3 impulsive move to the upside. The altcoin could even rally to double digits and touch $13 on this move. The chart also showed that XRP will reach this target by year-end or early next year. Related Reading: XRP To End 7-Month Consolidation After 700% Surge – Is A Major Move Coming? Based on the 5-Wave count, XRP will then witness a price correction to around $5 on Wave 4 before it then rallies to around $25 on Wave 5, an impulsive move to the upside. XForce is confident that the current price action is going according to plan. He noted that the macro direction was met with very little margin of error. Furthermore, the crypto analyst remarked that everything from the Wave 4 triangle breakout to the anticipated 1 to 2 pullback following the 5-wave impulse followed the blueprint. In line with this, he declared that there is no valid reason to adopt a bearish stance unless the market invalidates the bullish case for XRP. XForce also affirmed that XRP is within the bounds of the same two scenarios but that the ultra-bullish scenario of a rally to double digits is gaining more credibility by the day. The more conservative scenario for the altcoin is a rally to $4, which could still mark a new all-time high for XRP. The analyst earlier declared that all scenarios on the medium timeframe still show the altcoin reaching a new ATH in this market cycle. XRP Consolidation Has Reached Its Peak In an X post, crypto analyst CasiTrades stated that the XRP consolidation has finally reached its apex and that something big is coming next. She remarked that the altcoin could either record an explosive breakout or see one final sharp drop to support that ignites a breakout. Either way, XRP looks likely to rally to the upside soon. Related Reading: XRP Price At $27: Guardian Arch Formation Predictions 1,000% Move CasiTrades stated that the XRP price continues to struggle with the $2.25 level. As long as this level remains resistance, she claimed that it increases the likelihood of the altcoin dropping to support levels at $2.01, $1.90, and even $1.55. However, the analyst declared that these aren’t bearish targets but momentum zones, where the market grabs the liquidity it needs to build momentum for Wave 3. At the time of writing, the XRP price is trading at around $2.16, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Bitcoin Is The Purest AI Trade, Says Wall Street Veteran",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-purest-ai-trade-wall-street-veteran/",
      "summary": "Macro investor Jordi Visser has published a Substack essay arguing that Bitcoin is “the purest AI trade,” a claim he says has followed him “in nearly every one of my videos, Substack posts, and conversations with Anthony Pompliano.” The piece, released yesterday under the title You Don’t Find Bitcoin, Bitcoin Finds You: Why It’s the Purest AI Trade, sets out a personal and macro-economic narrative that Visser believes binds artificial-intelligence disruption to the rise of the world’s first decentralised digital asset. Visser, who now heads AI Macro Nexus Research at 22V Research after three decades trading derivatives at Morgan Stanley, running a global-macro hedge fund, and ultimately serving as president and CIO of Weiss Multi-Strategy Advisers, frames the essay as a pre-emptive answer to critics who “don’t see it or understand it.” “This statement wasn’t born from a single insight but rather a journey that unfolded across three distinct steps and four accelerating forces that helped me connect the dots between monetary policy, exponential innovation, and a world shifting faster than our corporate, financial, and government systems can handle,” he writes. The three steps, he explains, were “personal awakening, macro-economic context, and the recognition of Bitcoin as foundational infrastructure for the digital economy.” Why Bitcoin Is The Ultimate AI Trade The four forces Visser identifies as central to his thesis span the domains of monetary policy, technology, and sovereignty. The first, he writes, is “unprecedented fiscal and monetary intervention which I believe marked the final climax of the global government debt super-cycle and ultimately the dollar as the global reserve currency.” In his view, the pandemic-era explosion in government spending exposed the limits of fiat systems propped up by central bank liquidity. Related Reading: Buy Bitcoin Now? Not Yet—Analyst Says Time Holds The Key The second force centers on structural deflation: “deflationary pressure from exponential technologies.” Visser sees AI and automation as not just economic disruptors but forces that drive prices downward across the board—pressuring legacy systems built on perpetual inflation and debt. The third pillar of his argument is institutional erosion. “Accelerating institutional obsolescence through AI,” he warns, will hollow out bureaucracies and corporate incumbents that are too slow to adapt to exponential change. Finally, Visser cites “Bitcoin’s emergence as a sovereign digital asset—independent, decentralised, and not defined by any nation-state.” In contrast to fiat currencies reliant on state power and monetary intervention, Bitcoin exists as an autonomous, verifiable infrastructure layer for the digital economy. Visser dates his “personal awakening” to early 2021, when the pandemic-era money print collided with a household epiphany: “Asset prices jumped and crypto prices were rising daily, and I was struck by the fact that my 13-year-old son … could explain the space in a way that I could not understand.” That curiosity pushed him toward Michael Saylor’s corporate-treasury bet on Bitcoin and Paul Tudor Jones’s description of the asset as “the fastest horse in the race,” convincing him that “Bitcoin [was] a rational response to an irrational system looking for a new one.” The second intellectual milestone came through Jeff Booth’s book The Price of Tomorrow, from which Visser lifts the line: “Innovation is always deflationary for the economy so the baseline for inflation is always negative.” Booth’s argument, he says, revealed “an Economic Trilemma” in which a debt-laden industrial economy can only survive by tapping government balance-sheets, even as a capital-light digital economy accelerates away. The result, he warns, is a fragile fiat system propped up by “artificially low rates, quantitative easing, and fiscal stimulus” that cannot be maintained indefinitely. Visser’s third pivot came with Marc Andreessen’s 2014 essay Why Bitcoin Matters. Andreessen’s framing of the Bitcoin white paper as a monetary protocol—“on par with the creation of the internet itself”—convinced Visser to stop viewing Bitcoin as a challenger to sovereign currency and start seeing it as “the base-layer for a new, decentralised economic system.” Stablecoins, he concedes, may bridge fiat and crypto, but they remain “tethered to the very institutions they’re trying to outrun.” Related Reading: $150,000 Bitcoin Is In Play—Unless This One Macro Metric Snaps The final, self-described “force” is AI itself: “For years, we’ve said software is eating the world. But now, AI is eating software and soon it will eat everything in its path.” He argues that intelligent agents will erode the scarcity premia that support most legacy assets, leaving Bitcoin—algorithmically finite and independent of any issuer—as “sovereignty at digital scale.” In one of the essay’s bleakest forecasts he writes, “AI will destroy everything eventually—not maliciously, but systematically. And the economic system we’ve built on top of scarcity, debt, and centralisation is not equipped to survive it.” Visser closes by channelling Saylor’s mantra—“You don’t find Bitcoin, Bitcoin finds you”—to explain why adoption is emerging first in the periphery: retail investors in emerging markets, smaller firms outcompeted by big-tech AI monopolies, and early-mover states such as El Salvador. “This bottom-up foundation is setting the stage for a future top-down capital rotation as FOMO and greed eventually force more and more of the doubters in,” he concludes. “That’s why Bitcoin is, in many ways, the purest AI trade—an opt-out of a system being reshaped by intelligence no one fully controls. At press time, BTC traded at $104,816. Featured image image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin’s Momentum Wobbles—Analyst Predicts Correction Below $94K",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoins-momentum-wobbles-analyst-predicts-correction-below-94k/",
      "summary": "Bitcoin’s recent climb to $105,000 has done little to shake off the worries piling up around its momentum. The world’s biggest cryptocurrency eked out a 0.03% gain in the last 24 hours but still sits 3.5% lower than it did a week ago. According to analyst Captain Faibik, this mix of flat gains and fading strength could mean traders are buying Bitcoin at the top. Related Reading: Iran’s Top Crypto Hub Loses $82 Million To Hackers With Israeli Links—Details Bearish RSI Divergence Signals Weakness Based on data, the Relative Strength Index (RSI) has drifted downward after peaking near 80, even as Bitcoin’s price pushed to fresh highs. The RSI now sits at 61.88, a clear sign that buyers are losing steam. Traders often watch for this kind of mismatch—when price goes up but RSI goes down—because it can spell a coming pullback. History shows it doesn’t always lead to a crash, but it does make a correction more likely. After carving out fresh highs, it feels like Bitcoin has hit its ceiling, according to Fabik, and a pullback into the $92,000–$94,000 zone could be on the cards. This setup usually sparks a quick correction, so many traders will be watching closely and tightening up their strategies as the market could shift in a hurry. $BTC is showing a massive RSI Bearish divergence on the weekly chart..!! It looks like Bitcoin has topped out and is now Ready for a major correction toward the 92–94k Range..📉 Just like it bottomed out at 16k in November 2022, We bought the dip and now we’re selling the… pic.twitter.com/W25HCAxkIa — Captain Faibik 🐺 (@CryptoFaibik) June 18, 2025 Resistance Levels Keep Price In Check Bitcoin has bumped into stiff barriers around $108,000 and $109,000, both set on May 19. An ascending trendline from December 2024 has also been capping gains for weeks. These levels are proving tough to clear. If Bitcoin can’t break through soon, sellers may step in. Faibik points out that hitting these walls and seeing RSI divergence at the same time often marks the high point before a drop. This Activity Points To Caution The derivatives market adds another layer to the story. Trading volume in Bitcoin futures and options rose by 1.60%, taking total activity to around $100 billion. Open interest, meanwhile, slid down 1.30% to nearly $70 billion. This suggests some players are closing their bets rather than piling on new ones. In the past 24 hours, liquidations have wiped out $71 million in long positions. That kind of pain can trigger more sell‑offs if people rush to protect their profits. Related Reading: Tether Enforces Freeze On $12 Million In Tron Funds Over Illicit Activity Past Patterns Offer Mixed Lessons Looking back, Bitcoin’s rebound in 2022 followed a different playbook. Back then, price hit a low near $16,000 and built strength even as RSI climbed from oversold levels. That setup led to a strong rally. Today, though, the RSI is nowhere near oversold territory. It’s more of a warning flag than a green light. Captain Faibik reminds traders that past wins don’t guarantee future results. Conditions now include higher interest rates and deeper institutional interest, which can change how Bitcoin reacts to the same signals. Featured image from Trade Brains, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "President Donald Trump: America Will Show The World How To Win With Digital Assets Like Never Before",
      "link": "https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/President-Trump-Says-22We-Are-Going-to-Show-the-World-How-to-WIN-with-Digital-Assets-Like-Never-Before22.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/president-donald-trump-america-will-show-the-world-how-to-win-with-digital-assets-like-never-before\" rel=\"nofollow\"> </a></p> <p>President Donald Trump posted on Truth Social Tuesday evening regarding recent Senate legislation, stating the U.S. will &#8220;show the World how to WIN with Digital Assets like never before.&#8221;"
    },
    {
      "title": "3 Misconceptions About US Debt",
      "link": "https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/FRED-chart.png\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/3-misconceptions-about-us-debt\" rel=\"nofollow\"> </a></p> <p>This newsletter explores three common misconceptions about U.S. federal debt and deficits.</p> <p>"
    },
    {
      "title": "The Smarter Web Company Acquires £8.1M in Bitcoin For Treasury Holdings",
      "link": "https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Smarter-Web-Company-Acquires-8.1M-in-Bitcoin-For-Treasury-Holdings.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-smarter-web-company-acquires-8-1m-in-bitcoin-for-treasury-holdings\" rel=\"nofollow\"> </a></p> <p>The London listed firm now holds 346.63 Bitcoin worth £27.2 million, reinforcing its long-term strategy to integrate Bitcoin into corporate finance through its \"10 Year Plan.\"</p> <p>"
    },
    {
      "title": "‘Ancient’ Bitcoin Supply Now Outpacing Newly Mined BTC: Fidelity Report",
      "link": "https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/‘Ancient-Bitcoin-Supply-Now-Outpacing-Newly-Mined-BTC-Fidelity-Report.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ancient-bitcoin-supply-now-outpacing-newly-mined-btc-fidelity-report\" rel=\"nofollow\"> </a></p> <p>Over 17% of all bitcoin has remained untouched for a decade, while 27 public companies hold more than 800,000 BTC combined.</p> <p>"
    },
    {
      "title": "The Trolls Are Coming: Defending Bitcoin Mining from Patent Trolls",
      "link": "https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_GenerateThe-Trolls-Are-Coming_-Defending-Bitcoin-Mining-from-Patent-Trollsd_Image_9ib8k29ib8k29ib8-fotor-20250618125328.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/legal/the-trolls-are-coming-defending-bitcoin-mining-from-patent-trolls\" rel=\"nofollow\"> </a></p> <p>The clash between Malikie Innovations and Bitcoin miners exemplifies a classic conflict between open innovation and legacy fiat intellectual property rights.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Nasdaq-Listed Healthcare Firm Opens Bitcoin Treasury With $20 Million BTC Buy",
      "link": "https://decrypt.co/326068/nasdaq-listed-healthcare-firm-opens-bitcoin-treasury-with-20-million-btc-buy",
      "summary": "Publicly-traded health sciences company Prenetics joins a growing list of companies adopting a Bitcoin treasury strategy."
    },
    {
      "title": "How Will Bitcoin Defend Against Quantum Computing? This Project Just Raised $6M",
      "link": "https://decrypt.co/326065/how-bitcoin-defend-against-quantum-computing-project-raised-6m",
      "summary": "Project 11 is working on protecting the leading crypto network against the potential threat."
    },
    {
      "title": "Musk's X to Debut Trading and Payment System. But Where is Dogecoin?",
      "link": "https://decrypt.co/326063/musk-to-debut-trading-payment-system-x-but-where-is-dogecoin",
      "summary": "Musk’s X Money will soon roll out the feature, according to an FT report, but no sign yet of crypto integration, including Dogecoin."
    },
    {
      "title": "Bitcoin Sidechain Plasma Eyes 'Late Summer' Mainnet Launch Following Massive ICO",
      "link": "https://decrypt.co/326052/bitcoin-sidechain-plasma-eyes-late-summer-mainnet-launch-following-massive-ico",
      "summary": "Plasma is aiming to create “stablecoin chain number one” after securing $1 billion in deposits for its upcoming XPL token pre-sale."
    },
    {
      "title": "CIRCLE STOCKS PUMPS, TRUMP WAITING ON IRAN ACTION, FED TO WAIT & SEE",
      "link": "https://decrypt.co/videos/interviews/y8C9YzRJ/circle-stocks-pumps-trump-waiting-on-iran-action-fed-to-wait-see",
      "summary": ". FOMO HOUR LIVE ON DEGENZ. Degenz Live is the only content you need for crypto, macro, trading, gambling and risk-taking. Powered by MYRIAD MARKETS, REKT BRANDS and YEET CASINO. Crypto volatile as Israel-Iran strikes continue. Circle stock pumps on GENIUS Act passing. Crypto is future, and we’ll own it: Trump. Trump urges House to pass GENIUS Act. Ohio exempts BTC payments under $200 from taxes. Stablecoin market cap exceeds $250bn. CryptoCom, Deribit to accept BUIDL as collateral. Coinbase to allow USDC to be used as collateral. ‘Coinbase Payments’ launched, stock pops. SOL Strategies to go public in the US. Lion Group raises $600m for HYPE treasury. Jump Trading plans reentry into crypto. Brokerage FalconX in talks for IPO. Crypto lenders now hold $60b in assets. First spot XRP ETF launches in Canada. 00:00 - Intro to the show 02:20 - Tylers top news stories 06:05 - Mando appears 08:00 - FOMC recap 10:30 - Macro and ongoing conflicts 15:00 - Mando tweets 18:00 - Where is BTC price going? 19:40 - Crypto Equities 24:00 - Coinbase utility news 26:30 - Farokhs Myraid stonk idea... 28:20 - Twitter/X's \"everything app\" 32:50 - Myriad Season 2, New Site and New Markets 43:20 - REKT launch at 7-11 with Glitch Mob gig 46:10 - YEET giveway LINKS https://x.com/DegenzLive https://linktr.ee/DegenzLive https://kick.com/degenzlive https://www.instagram.com/degenzlive https://creators.spotify.com/pod/profile/degenzlive PARTNERS https://rekt.com/ https://yeet.com/ https://myriad.markets/ #bitcoin #crypto #trading #news #gambling"
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump-affiliated company cuts stake in World Liberty Financial to 40%",
      "link": "https://cryptobriefing.com/world-liberty-stake-reduction/",
      "summary": "<p>The reduced stake may signal a strategic shift in investment focus, potentially impacting the company's influence in the crypto sector.</p> <p>"
    },
    {
      "title": "Seamless Protocol launches plug and play Leverage Tokens as ERC-20 assets on Base",
      "link": "https://cryptobriefing.com/launch-leveraged-defi-tokens/",
      "summary": "<p> Seamless Protocol debuts Leverage Tokens on Base, packaging passive DeFi strategies into tradable ERC-20s for one-click exposure.</p> <p>"
    },
    {
      "title": "Only 30% of crypto miners comply with Russia’s new rules, finance ministry official says",
      "link": "https://cryptobriefing.com/crypto-mining-compliance-russia/",
      "summary": "<p>The low compliance rate among crypto miners in Russia highlights challenges in enforcing regulations, potentially impacting energy policies and economic oversight.</p> <p>"
    },
    {
      "title": "Elon Musk’s X will soon launch investment and trading features as part of ‘everything app’ vision",
      "link": "https://cryptobriefing.com/financial-services-expansion-elon-musk-x/",
      "summary": "<p>Musk's X expansion into finance could redefine digital ecosystems, merging social media with financial services, impacting user engagement.</p> <p>"
    },
    {
      "title": "Binance co-founder calls for crypto platforms to implement ‘will function’ for asset inheritance",
      "link": "https://cryptobriefing.com/crypto-inheritance-tools-platforms/",
      "summary": "<p>Implementing a 'will function' in crypto platforms could ensure secure asset transfer, addressing inheritance challenges in digital finance.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin in control as altcoins slow down – Will this trend continue?",
      "link": "https://ambcrypto.com/bitcoin-in-control-as-altcoins-slow-down-will-this-trend-continue/",
      "summary": "<img alt=\"Bitcoin in control as altcoins slow down - Will this trend continue?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-35.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A brutal volume gap and ETF hype leave alts out in the cold."
    },
    {
      "title": "PEPE whales exit with losses: Is confidence in the memecoin fading?",
      "link": "https://ambcrypto.com/pepe-whales-exit-with-losses-is-confidence-in-the-memecoin-fading/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-19T145901.101-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PEPE faces bearish pressure as whales exit and weak on-chain signals weigh on recovery."
    },
    {
      "title": "Raydium’s 25% ‘phantom pump’ – Is this a time for caution?",
      "link": "https://ambcrypto.com/raydiums-25-phantom-pump-is-this-a-time-for-caution/",
      "summary": "<img alt=\"Raydium&#039;s 25% &#039;phantom pump&#039; - Is this a time for caution?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Evans-2025-06-19T114019.492-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />RAY’s Upbit-driven rally faces pressure as on-chain and sentiment metrics weaken across the board."
    },
    {
      "title": "Avalanche sees $6.5 mln ETH flow in 24 hours, yet its DeFi volume crashed – Why?",
      "link": "https://ambcrypto.com/avalanche-sees-6-5-mln-eth-flow-in-24-hours-yet-its-defi-volume-crashed-why/",
      "summary": "<img alt=\"Avalanche sees $6.5 mln ETH flow in 24 hours, yet its DeFi volume crashed - Why?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250619_124834_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />AVAX becomes appealing to market investors."
    },
    {
      "title": "Bitcoin stalls as demand wanes – What this means for BTC’s next steps",
      "link": "https://ambcrypto.com/bitcoin-stalls-as-demand-wanes-what-this-means-for-btcs-next-steps/",
      "summary": "<img alt=\"Bitcoin stalls as demand wanes - What this means for BTC&#039;s next steps\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kelvin-_51_.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Market equilibrium holds as Bitcoin long-term holders remain firm."
    }
  ]
}