{
  "CoinDesk": [
    {
      "title": "Asia Morning Briefing: ETH Bulls Eye $3K as Validator Backbone Upgrade Rolls In",
      "link": "https://www.coindesk.com/markets/2025/06/29/asia-morning-briefing-eth-bulls-eye-3k-as-validator-backbone-upgrade-rolls-in",
      "summary": ""
    },
    {
      "title": "Bitcoin Jumps After Trump Says Growth Will Offset Deficits, Boosting Bull Case for BTC and Gold",
      "link": "https://www.coindesk.com/markets/2025/06/29/bitcoin-jumps-after-trump-says-growth-will-offset-deficits-boosting-bull-case-for-btc-and-gold",
      "summary": ""
    },
    {
      "title": "BNB Hovers Above $648 as Maxwell Hard Fork Upgrade Set to Double Block Production Speed",
      "link": "https://www.coindesk.com/markets/2025/06/29/bnb-hovers-above-usd648-as-maxwell-hard-fork-upgrade-set-to-double-block-production-speed",
      "summary": ""
    },
    {
      "title": "Ondo Finance: ‘2025 Will Be the Year of Tokenized Stocks’",
      "link": "https://www.coindesk.com/markets/2025/06/29/ondo-finance-2025-will-be-the-year-of-tokenized-stocks",
      "summary": ""
    },
    {
      "title": "Coinbase Outpaces S&P 500 With 43% June Rise as Stablecoin Narrative Grows: CNBC",
      "link": "https://www.coindesk.com/markets/2025/06/28/coinbase-outpaces-s-and-p-500-with-43-june-rise-as-stablecoin-narrative-grows-cnbc",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Arbitrum jumps 17% on speculation of partnership with Robinhood",
      "link": "https://cointelegraph.com/news/arbitrum-gains-speculation-robinhood-partnership?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDUvMDE5NmM5OTUtMjJiOS03OGFiLTg4MWYtNTZjYTVhMDJjNGQ0.jpg\" /></p><p>Speculation has been growing of a potential tie-up between Arbitrum and Robinhood Markets after an X post.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Growing dissatisfaction among young people to drive BTC price: Analyst",
      "link": "https://cointelegraph.com/news/growing-dissatisfaction-young-people-drive-btc-price?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2JkN2YtNjVlNS03ZDljLTgzMmItNGJlM2JlYzhlOTlj.jpg\" /></p><p>Jordi Visser argued that growing dissatisfaction among those 25 and younger with the current financial system will increase BTC adoption.</p>"
    },
    {
      "title": "Bitcoin aims for highest weekly close: Will HYPE, BCH, LINK, and SEI follow?",
      "link": "https://cointelegraph.com/news/bitcoin-aims-for-highest-weekly-close-will-hype-bch-link-and-sei-follow?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2JjYjYtOTgzYS03NjhhLWJlOWItNDcxN2Q3ZDM1YzY3.jpg\" /></p><p>Bitcoin price made a weekend rush on the $109,000 resistance and HYPE, BCH, LINK and SEI could be the first altcoins to rally if BTC bulls secure new highs.</p>"
    },
    {
      "title": "Saylor signals impending Bitcoin buy for 11th consecutive week",
      "link": "https://cointelegraph.com/news/saylor-signals-bitcoin-buy-11-consecutive-weeks?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzQ2ZDUtMGZhNi03NDRkLWJlMWItM2JhM2M4NmFjYmU5.jpg\" /></p><p>Michael Saylor's Strategy is up over 52% on its Bitcoin investment, representing an unrealized capital gain of over $21.8 billion.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Saylor says BTC Treasury companies can grow as fast as they can issue credit and buy Bitcoin",
      "link": "https://cryptoslate.com/saylor-says-btc-treasury-companies-can-grow-as-fast-as-they-can-issue-credit-and-buy-bitcoin/",
      "summary": "<p>At the BTC Prague conference this week, Strategy (formerly MicroStrategy) co-founder Michael Saylor stated that Bitcoin treasury companies can grow as quickly as they can issue equity and credit to purchase Bitcoin. Delving into the business model of Bitcoin treasury companies like Strategy, Saylor explained how corporate investment in BTC can far outpace individual investments. [&#8230;]</p> <p>"
    },
    {
      "title": "Sovereignists vs. Globalists: Why blockchain’s lasting promise is sovereignty",
      "link": "https://cryptoslate.com/sovereignists-vs-globalists-why-blockchains-lasting-promise-is-sovereignty/",
      "summary": "<p>The following is a guest post and opinion from Adrian Brinkn, Co-Founder of Anoma and Namada. Decentralization is the most misunderstood word in the blockchain industry. It’s become a dogma, a checkbox, and a marketing slogan. But decentralization is not the prize; it’s just a tool. The real goal is not decentralization; it’s sovereignty—the practical [&#8230;]</p> <p>"
    },
    {
      "title": "Utopia or dystopia? The race to build God-like AI is humanity’s ultimate gamble",
      "link": "https://cryptoslate.com/utopia-or-dystopia-the-race-to-build-god-like-ai-is-humanitys-ultimate-gamble/",
      "summary": "<p>I had to hold two separate interviews with Sentient to sit with the information, digest it, and follow up. AI is not my area of expertise, and it’s a topic I’m wary of, given that I struggle to see favorable outcomes (and being labeled an “AI doomer” in this industry is enough to get you [&#8230;]</p> <p>"
    },
    {
      "title": "Vitalik Buterin says pluralistic ZK digital IDs are the ‘best realistic solution’ to preserve privacy",
      "link": "https://cryptoslate.com/vitalik-buterin-says-pluralistic-zk-digital-ids-are-the-best-realistic-solution-to-preserve-privacy/",
      "summary": "<p>Ethereum co-founder Vitalik Buterin believes that one-per-person digital ID systems, despite using zero-knowledge proofs (ZK proofs), carry risks to privacy. ZK proof wrapped IDs offered by World ID (formerly Worldcoin) using biometric data and ZK proofs have been gaining traction, recently crossing 10 million users. Therefore, in his blog on Saturday, Buterin suggested ‘pluralistic identity’ [&#8230;]</p> <p>"
    },
    {
      "title": "Financial advisor Ric Edelman says crypto should make up 10-40% of a portfolio",
      "link": "https://cryptoslate.com/financial-advisor-ric-edelman-says-crypto-should-make-up-10-40-of-a-portfolio/",
      "summary": "<p>Financial advisors should be recommending clients to allocate between 10% to 40% of their portfolio to crypto, influential investment manager Ric Edelman told CNBC on Friday. According to Edelman, founder of the Digital Assets Council of Financial Professionals, the percentage of allocation to crypto should be decided based on the client’s risk appetite. Therefore, he [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Price Tests Resistance — Breakout Could Spark Rally",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-tests-resistance-2520/",
      "summary": "Ethereum price started a fresh increase above the $2,480 zone. ETH is now consolidating gains and might soon aim for a move above the $2,520 resistance. Ethereum started a fresh upward move above the $2,450 level. The price is trading above $2,450 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,440 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it remains stable above the $2,420 zone in the near term. Ethereum Price Eyes More Gains Ethereum price started a fresh increase above the $2,420 support level, like Bitcoin. ETH price was able to clear the $2,450 and $2,480 resistance levels to move into a positive zone. The bulls even pushed the price above the $2,500 zone. However, the bulls were active above the $2,500 level. A high was formed at $2,523 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2,394 swing low to the $2,523 high. Ethereum price is now trading above $2,450 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $2,440 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,520 level. The next key resistance is near the $2,550 level. The first major resistance is near the $2,580 level. A clear move above the $2,580 resistance might send the price toward the $2,650 resistance. An upside break above the $2,650 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,720 resistance zone or even $2,800 in the near term. Downside Correction In ETH? If Ethereum fails to clear the $2,520 resistance, it could start a fresh decline. Initial support on the downside is near the $2,480 level. The first major support sits near the $2,460 zone or the 50% Fib retracement level of the upward move from the $2,394 swing low to the $2,523 high. A clear move below the $2,460 support might push the price toward the $2,440 support. Any more losses might send the price toward the $2,400 support level in the near term. The next key support sits at $2,350. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,440 Major Resistance Level – $2,520"
    },
    {
      "title": "Bitcoin Price Uptrend Intact — Extension Likely if Momentum Holds",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-uptrend-intact-108k/",
      "summary": "Bitcoin price started a fresh increase above the $107,500 zone. BTC is now consolidating and might aim for a move above the $108,800 resistance. Bitcoin started a fresh increase above the $107,500 zone. The price is trading above $107,500 and the 100 hourly Simple moving average. There is a bullish trend line forming with support at $107,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $106,500 zone. Bitcoin Price Eyes More Gains Bitcoin price started a fresh increase above the $105,000 zone. BTC gained pace and was able to climb above the $105,500 and $106,500 levels to enter a positive zone. The bulls pushed the price above the $107,500 resistance and the price tested the $108,800 zone. A high was formed at $108,792 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $106,477 swing low to the $108,792 high. Bitcoin is now trading above $107,000 and the 100 hourly Simple moving average. There is also a bullish trend line forming with support at $107,600 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $109,800 level. The first key resistance is near the $109,200 level. A close above the $109,200 resistance might send the price further higher. In the stated case, the price could rise and test the $110,000 resistance level. Any more gains might send the price toward the $112,000 level. Downside Correction Reaction In BTC? If Bitcoin fails to rise above the $108,800 resistance zone, it could start another decline. Immediate support is near the $107,800 level. The first major support is near the $107,500 level and the trend line. The next support is now near the $107,200 zone and the 61.8% Fib retracement level of the upward move from the $106,477 swing low to the $108,792 high. Any more losses might send the price toward the $106,500 support in the near term. The main support sits at $105,500, below which BTC might gain bearish momentum. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $107,500, followed by $107,200. Major Resistance Levels – $108,800 and $110,000."
    },
    {
      "title": "Bitcoin Consolidating Below $108,000 But Eyes $115,000 Target",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-consolidating-below-108000-but-eyes-115000-target/",
      "summary": "Bitcoin’s price action has been relatively stable in recent days, currently trading just above $107,000 after briefly touching previous highs near $108,000. Amid this backdrop, technical analysis from a popular crypto analyst on the TradingView platform outlined a compelling structural setup forming on Bitcoin’s daily chart. The analysis shows that Bitcoin&#8217;s action is in a compression phase that could precede a breakout to $115,000 very soon. Related Reading: Stablecoin Skepticism Grows As IMF Official Challenges Their Money Role Compression Structure Forming Below $108,000 Resistance Bitcoin&#8217;s price action is currently following movements in traditional risk assets like the S&#38;P 500 and Nasdaq, both of which have recovered following the recent de-escalation of geopolitical tensions in the Middle East. Against this backdrop, crypto analyst RLinda shared an outlook on TradingView that highlights a structural setup forming on the D1 chart and predicts a breakout to as high as $115,000 if some resistance levels are cleared. According to RLinda, Bitcoin is in the middle of a compression phase just below the $108,100 resistance level. This follows what the analyst describes as a false breakout above $100,000, which led to a brief distribution and now an active accumulation zone. The daily chart shows price action gradually tightening within the $106,500 to $108,100 range since June 25, the essence of which the analyst called a pause for a breather before a possible continuation of growth. The current setup has already established well-defined boundaries, with support at $106,500 and $108,100 as immediate resistance. A breakout above this immediate resistance would pave the way for the next resistance around $110,400 and bring Bitcoin within striking distance of its all-time high at $111,000. On the other hand, a short-term pullback toward $105,650 is still possible before a new move to the upside. Bitcoin Price Levels To Watch Bitcoin&#8217;s price action is really pressing on this resistance level around $108,000 and is building momentum for a breakout once the price level gives way. The key resistance levels to monitor are stacked around $108,100, $108,900, and $110,400. As long as the structure between $106,500 and $108,100 holds, and Bitcoin&#8217;s price is sticky near the top of that zone, the breakout scenario becomes increasingly probable. Although there are currently no reasons for a decline on the daily and weekly candlestick charts, the analyst noted that a temporary pullback to $105,650 or even $104,650 cannot be ruled out. However, even such a pullback would likely only serve as a retest but still keep the broader setup intact. Related Reading: The $100K Mirage: Bitcoin’s Rally Not Backed By On-Chain Strength At the time of writing, Bitcoin is trading at $107,457, up by 0.5% in the past 24 hours. The breakout trigger is still at $108,100. If broken, Bitcoin could easily move to new highs around $115,000. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Trump Backs Bitcoin in Latest White House Speech – Best Crypto to Buy Before the Next Bull Run",
      "link": "https://www.newsbtc.com/news/trump-backs-bitcoin-latest-white-house-speech-best-crypto-to-buy-before-next-bull-run/",
      "summary": "In Friday&#8217;s White House press conference, Donald Trump yet again declared his support for Bitcoin, calling it &#8216;amazing&#8217; and pointing out its growing use in the economy. It has become amazing. I mean, it is the jobs that it produces, and I notice more and more you pay in Bitcoin. People are saying it takes a lot of pressure off the dollar, and it is a great thing for our country. – Donald Trump in latest White House speech In this article, we&#8217;ll quickly touch upon Trump&#8217;s latest pro-crypto comments, how they could spark another altcoin rally, and what the best crypto to buy is if you wish to capitalize on the momentum before the next leg up. Trump Says Bitcoin is Relieving Dollar Strain Easily the most notable piece of Trump&#8217;s speech was his claim that Bitcoin is relieving pressure off the US dollar. This is &#8216;a much more significant statement than what it seems at first glance,&#8217; says digital asset researcher Anders. According to Anders, Trump&#8217;s comment suggests he understands the &#8216;Triffin dilemma,&#8217; which is a long-standing economic paradox, and that he&#8217;s probably keen on using crypto to solve it. The Triffin dilemma is the term used to describe the conflict faced by the country (in this case, the USA) whose currency (the US dollar) serves as the world&#8217;s reserve currency. The &#8216;dilemma&#8217; is that while the US dollar becomes stronger by boosting its global demand, this very strength then widens the country&#8217;s trade deficit. A stronger dollar makes imports cheaper and exports become more expensive. Using a cryptocurrency like Bitcoin – or XRP, which is a more &#8216;US-made&#8217; crypto than $BTC – could help ease pressure on USD. If investments flow in the form of $BTC rather than $USD, it would reduce demand for the dollar, weakening it and, therefore, correcting the trade deficit. All in all, Trump&#8217;s renewed endorsement adds momentum to the crypto narrative. It positions Bitcoin (and potentially other tokens) as a genuinely strategic financial tool. With that in mind, here are a few cryptos that could benefit from Bitcoin&#8217;s latest tap on the shoulder. 1. BTC Bull Token ($BTCBULL) – Best Crypto to Buy Now, Offering Free $BTC Airdrops BTC Bull Token ($BTCBULL) is one of the best cryptos to invest in right now because, first and foremost, it&#8217;s the ONLY one offering free $BTC to its token holders. Buy $BTCBULL and store it in Best Wallet, and whenever Bitcoin crosses $150K and $200K for the first time, you&#8217;ll automatically receive your share of free $BTC. Additionally, holding BTC Bull Token will also beef up your crypto portfolio. That&#8217;s because the token is predicted to surge 277% and reach $0.0096 by 2026. One $BTCBULL is currently priced at just $0.00258, and the project has in total raised over $7.6M (and counting) in early investor funding. Another reason for this new crypto&#8217;s potential bright future is its token burn mechanism. Simply put, the developers will shave off a part of the total token supply with rising Bitcoin prices. This will create artificial scarcity and upward price pressure, especially during Bitcoin bull runs. It&#8217;s a clever way of aligning the token&#8217;s growth with Bitcoin&#8217;s momentum. 2. Bitcoin Hyper ($HYPER) – Putting the Bitcoin Blockchain on Steroids Bitcoin is undoubtedly the OG crypto and blockchain, but it wasn&#8217;t really built with Web3 adoption in mind. It only processes seven transactions per second, as opposed to Solana&#8217;s 2K-3K TPS. Enter Bitcoin Hyper ($HYPER). This new meme coin on presale aims to build the first-ever Layer 2 on Bitcoin that will directly tackle the problems of scalability and programmability on the network. By leveraging a Canonical Bridge and integrating the Solana Virtual Machine (SVM), it will convert your $BTC from a traditional L1 asset into a high-speed, scalable L2 asset. You&#8217;ll be able to use this &#8216;wrapped&#8217; Bitcoin on L2 for lightning-fast payments and swaps, as well as lending and staking on DeFi apps, NFT platforms, and gaming dApps. Also, according to our Bitcoin Hyper price prediction, the token could be the next crypto to explode. It could reach $0.253 by 2030 – a nearly 2,000% gain from current prices. $HYPER is currently in presale, which is why you can buy it for a low price of $0.012075. Even though the presale is fresh out of the oven, it has amassed a chunky $1.7M so far. Here&#8217;s how to buy it. 3. Useless Coin ($USELESS) – Viral New Meme Coin with No Intrinsic Value or Utility Useless Coin ($USELESS) is the newest and perhaps the perfect epitome of what meme coins truly stand for: community-driven degen fun without any real utility or intrinsic value. With no staking, governance mechanisms, or revenue generation outside liquidity fees, $USELESS is almost a satirical take on all the other so-called utility tokens flooding the market right now. It launched just over a couple of weeks ago and has already gained over 92%. Currently trading at $0.1665, $USELESS is hitting new all-time highs as we speak, so this might be a good time to get in. Wrapping Up With Donald Trump&#8217;s latest remarks on Bitcoin signaling renewed support for the crypto world, high-potential newcomers like BTC Bull Token ($BTCBULL) and Bitcoin Hyper ($HYPER) can surge big time. That said, keep in mind that investments in crypto are highly risky. This article isn&#8217;t financial advice, so only invest after doing your own research."
    },
    {
      "title": "Bitcoin Spot ETFs Register $2 Billion Inflows As Institutional Demand Surges – Details",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-spot-etfs-register-2-billion-inflows-as-institutional-demand-surges-details/",
      "summary": "The US Bitcoin spot ETFs logged over $2 billion in net inflows last week, marking a three-week streak of positive momentum. Despite a bearish start to June, with $128.81 million in net outflows during the first trading week, investor appetite soon quickly rebounded. This turnaround has resulted in a cumulative $4.63 billion in deposits over the past three weeks. Related Reading: The $100K Mirage: Bitcoin’s Rally Not Backed By On-Chain Strength Bitcoin ETFs On Impressive 14-Day Positive Streak Despite Market Uncertainty On Friday June 27, the 12 US Bitcoin ETFs registered net inflows of $501.27 million bringing the aggregate deposits of the last week to a staggering $2.22 billion. According to data from ETF tracking site SoSoValue, the clean streak of daily inflows from last week extends the ETFs’ positive performance to 14 consecutive days. In analyzing individual ETF data from this week, the BlackRock IBIT registered $1.31 billion in net deposits solidifying its position as the market’s unrivalled leader. Meanwhile, Fidelity’s FBTC and Ark/21 Shares’ ARKB also experienced substantial cumulative inflows of $504.40 million and $268.14 million, respectively. Grayscale’s BTC, VanEck’s HODL, Valkyrie’s BRRR, Invesco’s BTCO, and Franklin Templeton’s EZBC also recorded moderate net flows ranging from $1million &#8211; $25 million. In familiar fashion, Grayscale’s GBTC produced the only net outflows losing $5.69 million in withdrawals, but still retains its position as the third largest Bitcoin ETF with $19.79 billion in net assets. Following this week, the US Bitcoin Spot ETFs have now recorded $4.50 billion in net flows in June signaling a resolute demand from institutional investors despite Bitcoin market troubles. Notably, the premier cryptocurrency has witnessed extensive corrections since hitting a new all-time high of $111,790 on May 22. Over the last month, BTC has made no new price discovery trading largely between $100,000 and $110,000 to form a descending price channel. While this price performance reflects a neutral market sentiment, the high influx of capital into the Bitcoin ETFs signal a long-term confidence by institutional investors on Bitcoin’s price appreciation prospects. Related Reading: Ethereum Holds Critical Long-Term Channel – Next Move Could Be Parabolic Ethereum ETFs Log $283 Million In Deposit To Close Out H1 2025 In other developments, SoSoValue data also reveals that US Ethereum Spot ETFs notched up a cumulative inflow of $283.41 million over the last week extending their positive streak to seven consecutive weeks. In June alone, these ETFs saw total inflows of $1.13 billion, marking their largest monthly gain in 2025. As of the time of writing, the total net assets of the Ethereum ETFs stand at $9.88 billion, accounting for 3.37% of Ethereum’s market capitalization. Meanwhile, Ethereum continues to trade at $2,441 with Bitcoin prices set around $107,339. Featured image from Nairametrics, chart from Tradingview"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Takes a Lot of Pressure Off The Dollar, Says Donald Trump",
      "link": "https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Takes-a-Lot-of-Pressure-Off-The-Dollar-Says-Donald-Trump.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump\" rel=\"nofollow\"> </a></p> <p>President Donald Trump is backing Bitcoin, calling it a vital American asset that the US must continue to dominate.</p> <p>"
    },
    {
      "title": "How The IMF Prevents Global Bitcoin Adoption (And Why They Do It)",
      "link": "https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/IMF-Blocking-Bitcoin-Adoption.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it\" rel=\"nofollow\"> </a></p> <p>IMF loans halt nation-state Bitcoin plans—only debt-free countries like Bhutan push forward. Grassroots use still thrives.</p> <p>"
    },
    {
      "title": "Lnfi Network Integrates RGB Protocol to Enhance Lightning Network",
      "link": "https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_A_futuristic_digital_dashboard_glowing_wit_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network\" rel=\"nofollow\"> </a></p> <p>Lnfi Network adopts RGB for Bitcoin’s Lightning, enabling secure asset trading. Nostr’s encryption stops manipulation.</p> <p>"
    },
    {
      "title": "If Institutions Are Buying Why Isn’t The Bitcoin Price Going Up?",
      "link": "https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/If-Institutions-Are-Buying-Why-Isnt-The-Bitcoin-Price-Going-Up.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up\" rel=\"nofollow\"> </a></p> <p>Bitcoin price not soaring despite institutional billions? Uncover why profit-taking and derivatives hold it back, with a breakout looming!</p> <p>"
    },
    {
      "title": "Tahini’s Bitcoin Treasury: How a Family Chain Outsmarted Inflation",
      "link": "https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/tahini-bitcoin-2020-treasury-playbook.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation\" rel=\"nofollow\"> </a></p> <p>Tahini’s, a Canadian fast-casual chain, embraced Bitcoin in 2020, leveraging it to compete with giants like McDonald’s. Here’s their treasury playbook.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin Holds Steady as ECB Forum Looms, Traders Gear for Volatility Shift",
      "link": "https://decrypt.co/327730/bitcoin-holds-steady-as-ecb-forum-looms-traders-gear-for-volatility-shift",
      "summary": "Bitcoin remains rangebound, as options and on-chain data point to rising volatility amid looming macro policy shifts."
    },
    {
      "title": "This Week in Crypto Games: 'Raini: The Lords of Light' Shutting Down, 'Eve Frontier' Trial",
      "link": "https://decrypt.co/327726/this-week-crypto-games-raini-lords-light-eve-frontier",
      "summary": "Avalanche card game Raini: The Lords of Light is closing soon, Eve Frontier launched a free trial period, and more."
    },
    {
      "title": "Bitcoin Alkanes: The Next Big BTC Innovation After Ordinals and Runes?",
      "link": "https://decrypt.co/327721/bitcoin-alkanes-next-big-btc-innovation-after-ordinals-runes",
      "summary": "The Alkanes metaprotocol enables the creation of apps, NFTs, and tokens on Bitcoin. Will it fuel a new wave of BTC innovation?"
    },
    {
      "title": "The 6 Doomsday Scenarios That Keep AI Experts Up at Night",
      "link": "https://decrypt.co/327246/6-doomsday-scenarios-keep-ai-experts-up-night",
      "summary": "Experts warn the real AI threat is not destruction, but subtle manipulation that makes us surrender willingly."
    },
    {
      "title": "The Biggest Games Releasing in July 2025",
      "link": "https://decrypt.co/327301/biggest-games-releasing-july-2025",
      "summary": "July’s light on blockbusters, but Switch 2 shines with Donkey Kong Bananza, while Grounded 2 and Ninja Gaiden keep things interesting."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "REX-Osprey Ethereum, Solana staked ETFs may launch soon as SEC raises no objections",
      "link": "https://cryptobriefing.com/staking-etf-launch-eth-sol/",
      "summary": "<p>The potential launch of staked ETH and SOL ETFs could enhance crypto market liquidity and signal regulatory openness to innovative financial products.</p> <p>"
    },
    {
      "title": "Ripple drops cross-appeal as SEC set to follow, closing XRP case",
      "link": "https://cryptobriefing.com/ripple-sec-agreement-ends/",
      "summary": "<p>Ripple and SEC end their prolonged legal dispute as both sides drop appeals, marking a pivotal ripple sec agreement in crypto regulation.</p> <p>"
    },
    {
      "title": "Robinhood rolls out micro XRP, Solana futures following token relisting",
      "link": "https://cryptobriefing.com/micro-futures-contracts-xrp-solana/",
      "summary": "<p>Robinhood's expansion into micro crypto futures could democratize access to digital asset trading, potentially increasing market participation.</p> <p>"
    },
    {
      "title": "Trump backs Bitcoin adoption amid claims it could ease pressure on the dollar",
      "link": "https://cryptobriefing.com/trump-bitcoin-adoption-dollar/",
      "summary": "<p>Trump's endorsement of Bitcoin could accelerate its mainstream adoption, potentially reshaping global financial dynamics and US economic policy.</p> <p>"
    },
    {
      "title": "The power of crypto journaling: how tracking your trades can transform your success",
      "link": "https://cryptobriefing.com/crypto-trading-journal-success/",
      "summary": "<p>A crypto trading journal helps track trades, refine strategies, manage emotions, and boost discipline for better results.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Chainlink bulls beware! – Could LINK be topping out at $13.4?",
      "link": "https://ambcrypto.com/chainlink-bulls-beware-could-link-be-topping-out-at/",
      "summary": "<img alt=\"Chainlink at a crossroads: On-chain metrics signal a potential local price top\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chainlink-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Chainlink did not show signs of network-wide accumulation in recent months, and holders were willing to sell based on short-term price moves."
    },
    {
      "title": "Bitcoin miners suffer at 12-year low – But why aren’t they selling?",
      "link": "https://ambcrypto.com/bitcoin-miners-suffer-at-12-year-low-but-why-arent-they-selling/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-20-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />If revenue keeps falling will miners finally break and start selling?"
    },
    {
      "title": "SEI’s user activity soars – Is a short squeeze near as price nears $0.35?",
      "link": "https://ambcrypto.com/seis-user-activity-soars-is-a-short-squeeze-near-as-price-nears-0-35/",
      "summary": "<img alt=\"Sei [SEI]\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-29T145427.668-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SEI breaks out of a months-long downtrend as user growth and social buzz accelerate."
    },
    {
      "title": "Bitcoin: Will Q3 unlock BTC’s path to $110K and beyond?",
      "link": "https://ambcrypto.com/bitcoin-will-q3-unlock-btcs-path-to-110k-and-beyond/",
      "summary": "<img alt=\"Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-2-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />With volatility building, Bitcoin’s next leg hinges on who gets caught in the net."
    },
    {
      "title": "Pi Network: A host of new upgrades, but PI prices barely flinched – Why?",
      "link": "https://ambcrypto.com/pi-network-a-host-of-new-upgrades-but-pi-prices-barely-flinched/",
      "summary": "<img alt=\"Pi Network\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-2-3.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Is there a disconnect between innovation and market momentum?"
    }
  ]
}