{
  "CoinDesk": [
    {
      "title": "Why is XRP Up Today? Trio of Catalysts Sees Token Outperform Wider Crypto Market",
      "link": "https://www.coindesk.com/markets/2025/06/28/why-is-xrp-up-today-trio-of-catalysts-sees-token-outperform-wider-crypto-market",
      "summary": ""
    },
    {
      "title": "Bitcoin Treasury Corp Boosts Holdings to 771 BTC, Plans Lending After $51M Buy",
      "link": "https://www.coindesk.com/markets/2025/06/28/bitcoin-treasury-corp-boosts-holdings-to-771-btc-plans-lending-after-usd51m-buy",
      "summary": ""
    },
    {
      "title": "Ripple to Drop Cross-Appeal Against SEC, Ending Years-Long Legal Battle With SEC",
      "link": "https://www.coindesk.com/policy/2025/06/27/ripple-to-drop-cross-appeal-against-sec-ending-years-long-legal-battle-with-sec",
      "summary": ""
    },
    {
      "title": "Bitvavo Secures a MiCA License From the Netherlands",
      "link": "https://www.coindesk.com/policy/2025/06/27/bitvavo-secures-a-mica-license-from-the-netherlands",
      "summary": ""
    },
    {
      "title": "Gemini Rolls Out Tokenized Stocks in EU, Starting With Strategy Shares",
      "link": "https://www.coindesk.com/business/2025/06/27/gemini-rolls-out-tokenized-stocks-in-eu-starting-with-strategy-shares",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Emerging economies have sparked crypto’s most important retail revolution yet",
      "link": "https://cointelegraph.com/news/emerging-economies-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDZkMzYtYTBjMy03Y2UzLWFhNzYtMWRhNjMzMGQ5OWM5.jpg\" /></p><p>Emerging markets are not just adopting crypto, they’re redefining it. People in high-friction economies set new standards for the global crypto ecosystem.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Crypto cards outpace banks in micro-spending in Europe: Report",
      "link": "https://cointelegraph.com/news/crypto-cards-outpace-banks-europe-small-payments?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2I2NjYtZjJmNS03YzViLWFiNjctNzkzNDIwNTVhNzdm.jpg\" /></p><p>Crypto cards now rival banks for everyday purchases in Europe, with nearly half of transactions under $12 and online spending far above the eurozone average.</p>"
    },
    {
      "title": "Vitalik introduces ‘pluralistic’ IDs to protect privacy in digital identity systems",
      "link": "https://cointelegraph.com/news/vitalik-introduces-pluralistic-ids-protect-privacy-in-digital-systems?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2I2MjgtYTBhZS03YjE0LTliYjgtZjJlMGY4MDI3OThm.jpg\" /></p><p>Vitalik Buterin warns that single digital IDs could erode pseudonymity, proposing pluralistic systems to safeguard privacy and fair access.</p>"
    },
    {
      "title": "How high can XRP price go?",
      "link": "https://cointelegraph.com/news/how-high-can-xrp-price-go?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzNlNWQtZDg4YS03MTlmLWFhMWUtZjY4ZmJjNDdjNzdl.jpg\" /></p><p>XRP whale flows flipped positive in May for the first time in months, signaling renewed accumulation and growing bullish sentiment.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Is Cardano’s plan to convert part of ADA treasury into Bitcoin a wise move?",
      "link": "https://cryptoslate.com/is-cardanos-plan-to-convert-part-of-ada-treasury-into-bitcoin-a-wise-move/",
      "summary": "<p>The following is a guest post and analysis from Shane Neagle, Editor In Chief fromThe Tokenist. On June 13th, Charles Hoskinson, the co-founder of Ethereum (ETH) and founder of Cardano (ADA), made a bold proposition. In order to put Cardano on the decentralized finance (DeFi) map, the blockchain ecosystem should establish a sovereign wealth fund. [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto needs to return to first principles",
      "link": "https://cryptoslate.com/crypto-needs-to-return-to-first-principles/",
      "summary": "<p>The following is a guest post and opinion of Rob Viglione, CEO of Horizen Labs. In 2009, Bitcoin was born from a radical vision: a decentralized, transparent financial system designed to empower individuals over institutions. Yet somewhere along the way, that vision was clouded by short-term profiteering, insider deals, and misaligned incentives. To reclaim its [&#8230;]</p> <p>"
    },
    {
      "title": "Billions in corporate buys can’t budge Bitcoin—5 reasons the BTC price won’t move",
      "link": "https://cryptoslate.com/billions-in-corporate-buys-cant-budge-bitcoin-5-reasons-the-btc-price-wont-move/",
      "summary": "<p>From Michael Saylor to David Bailey, Anthony Pompliano to Jack Mallers, and everyone in between, there’s a rising tide of executives buying bitcoin for their corporate treasuries. Large companies and Wall Street are vacuuming up billions of dollars’ worth of BTC every week, yet its price remains relatively untouched. One Bitcoiner took to Twitter to [&#8230;]</p> <p>"
    },
    {
      "title": "Gemini launches tokenized US stock trading in EU starting with MSTR",
      "link": "https://cryptoslate.com/gemini-launches-tokenized-us-stock-trading-in-eu-starting-with-mstr/",
      "summary": "<p>Crypto exchange Gemini has launched tokenized Strategy (MSTR) shares for customers in the EU, marking the beginning of its rollout of tokenized U.S. equities on blockchain networks. The offering, enabled through a partnership with tokenization platform Dinari, allows Gemini users to buy fractional shares of Strategy as on-chain tokens backed by real securities. MSTR tokens [&#8230;]</p> <p>"
    },
    {
      "title": "Crypto payments soar 630% in Bolivia, central bank reports $430M since lifting ban",
      "link": "https://cryptoslate.com/crypto-payments-soar-630-in-bolivia-central-bank-reports-430m-since-lifting-ban/",
      "summary": "<p>The Bolivian central bank reported on June 27 that domestic crypto transactions totaled $430 million in the 12 months since regulators reopened formal payment rails, a 630% jump over the previous year. The Banco Central de Bolivia (BCB) reported that users processed 10,193 operations worth BOB 611 million as of May 31, 2025, approximately $88 [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Crypto Analyst Predicts $10,000 ATH For Ethereum This Cycle, Here’s Why",
      "link": "https://www.newsbtc.com/news/ethereum/10000-ath-for-ethereum/",
      "summary": "Crypto analyst XForce has predicted that Ethereum could reach a new all-time high (ATH) of $10,000 in this market cycle. He acknowledged that there is yet to be a macro fundamental that supports this bullish outlook, but remarked that it remains “ideal.” Ethereum Eyeing Rally To As High As $10,000 In an X post, XForce stated that Ethereum is still looking to shoot for a new ATH this cycle and could end around $9,000 to $10,000. This followed his remarks that ETH’s move up on the shorter timeframes was objectively impulsive. In other words, these rallies were bullish with real-time technical indicators. Related Reading: Is Ethereum Staging A Repeat Of 2021? Here’s Why A 200% Surge Could Follow As to what could drive this Ethereum rally to $10,000, XForce noted that there is no macro scenario providing a good look. However, he remarked that this rally to this ambitious target remains only ideal in nature, given the context. The analyst added that this idea remains his primary prediction for now. Crypto analyst Venturefounder also recently predicted that Ethereum could reach this $10,000 price target in this market cycle. However, the analyst declared that ETH’s run to this ambitious target depends on whether the altcoin is able to flip $4,000 into support by the fourth quarter of this year. Crypto analyst Titan of Crypto also recently suggested that Ethereum was ready for a lift-off. In an X post, he stated that after a failed breakout, ETH deviated below and found support right on the cloud. Now, the altcoin is back within the range. For a bullish momentum to resume, Titan of Crypto claimed that ETH must clear the cloud and reclaim the Kijun around $2,500. The analyst had previously predicted that Ethereum could rally to $8,500 in this market cycle. An Ultra Bullish Scenario For ETH In response to his initial X post, XForce provided an alternative scenario for Ethereum, in which it could rally to as high as $150,000. The analyst remarked that it would be wild to see this play out, but that it remains an option based on an idealized 5-wave structure. ETH is expected to reach the $150,000 target on Wave 5. Related Reading: Ethereum Price Crash To $2,100 Triggers Fear, But Why Are Analysts Predicting A Rally To $6,000? XForce’s accompanying chart showed that Ethereum could reach this $150,000 target by July 2028. The analyst remarked that the uber bullish scenario remains his alternative because there seems to be no logical approach for ETH to reach such levels. He again warned that neither scenario provides the proper context on the macro, but only remains ideal. As such, based on logic, XForce remarked that it is best to choose the best of the worst. At the time of writing, the Ethereum price is trading at around $2,400, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Gemini Just Tokenized a Bitcoin-Heavy Stock – 3 of the Best Altcoins to Ride the Wave",
      "link": "https://www.newsbtc.com/news/gemini-tokenize-bitcoin-heavy-stock-best-altcoins/",
      "summary": "Gemini, a popular crypto exchange, has just launched a tokenized version of Michael Saylor’s Strategy (MSTR) stock for EU users. Strategy is a Bitcoin-investing firm currently holding 592,345 $BTC, making it one of the largest institutional holders of the asset. As such, a tokenized version of Strategy’s stock is an indirect but powerful way of offering on-chain participants more $BTC exposure. This also bridges the gap between traditional stock markets and on-chain infrastructure by addressing key issues like limited trading hours and high international fees. Gemini has partnered with Dinari in an attempt to offer more liquidity and transparency by leveraging the latter’s tokenization-on-demand model. Read on to learn more about this exciting development and why it could positively impact your crypto portfolio. We’ll also highlight the best altcoins you can invest in right now. Tokenized Stocks Are Here, and Crypto Investors Should Be Excited Tokenization converts real-world assets into digital tokens. For example, Tether Gold ($XAUT) is the tokenized version of gold. Currently, $MSTR is the only US equity stock to be tokenized for EU investors. However, Gemini says that more such tokenized stocks and ETFs will be launched soon. It&#8217;s fair to say that tokenization is the future of investing, as it closes the gap between the traditional stock market and blockchain participation. It allows crypto investors to diversify their portfolios without leaving the secure environment. Gemini’s choice of $MSTR also aligns well with crypto enthusiasts because it offers them the opportunity to invest in a crypto-native firm. Considering all this, this is probably an opportune time to invest in some hot new meme coins, i.e., if you wish to ride the tokenization trend. 1. Snorter Token ($SNORT) – Best Altcoin to Buy Now, Swipe Liquidity in New Meme Coins Snorter Token ($SNORT) is a new crypto changing the way retailers trade meme coins. It&#8217;s a Telegram-based trading bot that swipes liquidity in newly listed meme coins with automatic limit, stop, and stop-loss orders. Additionally, Snorter Bot only charges 0.85% as trading fees, as opposed to the 1% charged by competitors Banana Gun and Bonk Bot. To access the industry-lowest trading fees, though, you&#8217;ll have to be a $SNORT holder. Owning $SNORT also comes with the potential to make 1,400% returns in less than five years, as the crypto is predicted to explode and reach $1.25 by 2030. In addition to comprehensive security, Snorter Bot also comes with an excellent copy-trading feature, allowing you to mimic successful traders without leaving the Telegram chat. $SNORT is currently in presale, with over $1.35M in funding so far. Even better, you can buy one token for just $0.0965. 2. BTC Bull Token ($BTCBULL) – Only Crypto to Buy Now for Free $BTC Airdrops BTC Bull Token ($BTCBULL) is the newest – and probably the smartest – way to become a part of Bitcoin&#8217;s success story. As the digital gold climbs to new highs, so can your portfolio if you buy $BTCBULL and store it in Best Wallet. That way, you&#8217;ll be eligible for free Bitcoin airdrops. Yep, BTC Bull Token is the ONLY crypto in the world to offer token holders free (and real) $BTC. These airdrops will occur every time Bitcoin hits a new milestone, like $150K and $200K. Plus, $BTCBULL is expected to surge 277% and reach $0.0096 by 2026. Furthermore, the developers have also planned to follow a deflationary approach. Under this, a handful of $BTCBULL tokens will be burnt off every time Bitcoin climbs up by $50K. This will ensure continuing token hype and price appreciation. If you want to benefit from $BTCBULL, buy the token now while it&#8217;s still in presale. The project has in total raised over $7.5M, and each token is currently available for just $0.00258. Here&#8217;s how to buy it. 3. Dog (Bitcoin) ($DOG) – Canine-Themed Crypto Poised to Pump With dog-themed meme coins expected to make a strong comeback thanks to the SEC warming up to the idea of a $DOGE ETF, $DOG could be one of the next cryptos to explode. $DOG might not be as mainstream as, say, Dogecoin or Shiba Inu, but it stands out because it&#8217;s built directly on the Bitcoin blockchain. It&#8217;s a community-driven token with no real utility other than to prove crypto degens some meme coin fun right on Bitcoin, one of the most secure blockchains out there. $DOG is currently trading at $0.003911, having gained more than 28% over the past 7 days. According to recent price action, it&#8217;s about to break out of a descending triangle pattern, so we can expect a surge sooner rather than later. Conclusion With a major crypto exchange like Gemini launching a tokenized version of a US stock, it wouldn&#8217;t be wrong to say that the sky&#8217;s the limit for digital assets. If you&#8217;d like front-row seats to this revolution, consider investing in high-potential tokens like Snorter Token ($SNORT) and BTC Bull Token ($BTCBULL). However, bear in mind that none of this is financial advice; the crypto market is highly volatile. So, kindly do your own research before investing."
    },
    {
      "title": "ONDO Breaks Out Of Ascending Channel – Analyst Sets $0.29 Target",
      "link": "https://www.newsbtc.com/altcoin/ondo-breaks-out-of-ascending-channel-analyst-sets-0-29-target/",
      "summary": "ONDO is under pressure after a sharp 33% decline from its May highs, reflecting growing uncertainty and bearish momentum across the market. Once a standout performer, the token has lost steam as sentiment shifts and price action turns decisively negative. While some traders are still watching for potential rebounds, many analysts are now calling for a breakdown, warning that the current structure could give way to deeper losses if key support levels fail to hold. Related Reading: Bitcoin Forms 4-Year Inverse H&#38;S Pattern – Neckline Break Could Send It Parabolic The mood around ONDO remains divided. Some investors view the dip as a healthy retrace in a broader uptrend, while others see it as the start of a more extended correction. Top analyst Ali Martinez has added to the cautious outlook, noting that ONDO is breaking out of an ascending channel to the downside—an often bearish signal. This pattern suggests that momentum is weakening and that the token could soon test lower demand zones. With ONDO hovering near key technical levels and volume thinning, the coming days will be critical. If the breakdown continues, the price could revisit earlier consolidation areas. For now, bearish pressure dominates, and bulls must defend support convincingly to prevent further downside. Bulls Struggle To Hold Structure As Risks Grow As the broader altcoin market braces for a decisive move, ONDO remains trapped in a bearish structure, unable to establish clear demand. Bulls have struggled to reclaim momentum or push price above critical supply zones needed to maintain the long-term uptrend. With sellers dominating and key support levels under pressure, ONDO’s technical structure appears fragile. Despite recent weakness, some market participants remain cautiously optimistic about ONDO’s longer-term potential. Macro narratives around real-world asset tokenization continue to support fundamental interest, but short-term price action remains a challenge. The inability to hold above prior consolidation ranges suggests that buyers are not yet stepping in with enough conviction to flip the trend. Ali Martinez has raised alarms by highlighting a concerning technical development: ONDO is breaking out of an ascending channel—this time to the downside. Historically, this pattern signals a shift in market structure and sets the stage for more aggressive downside moves. Martinez’s outlook points to a potential slide toward the $0.29 level, which would mark a significant breakdown from current prices. For now, ONDO trades in a vulnerable position. If bulls fail to reclaim higher levels and restore momentum, the altcoin risks accelerating its decline. However, if sentiment shifts and broader market strength returns, ONDO could still recover in the coming months. Related Reading: Ethereum Staking Hits Record High: 29.02% Of Supply Locked Signals Long-Term Conviction ONDO Breaks Below Moving Averages As Bearish Momentum Builds ONDO is trading at $0.747 after failing to hold above key moving averages, with both the 50-day ($0.93) and 200-day ($1.00) simple moving averages now acting as overhead resistance. The current price structure on the 3-day chart shows a consistent downtrend, with lower highs and lower lows forming since the March peak. Price has now broken below the prior consolidation zone, signaling growing bearish momentum. The rejection from the $1.00 psychological level earlier this quarter added to downward pressure, and the break of the $0.80 level confirms that bulls are losing control of short-term structure. If ONDO continues to trade below both moving averages, it may struggle to find solid demand in the near term. Related Reading: Chainlink Reclaims Key Structure – Quiet Accumulation Could Fuel $25–$30 Surge Key historical resistance remains at $1.51, but with ONDO currently 50% below that level and forming a bearish structure, downside risk continues to dominate. A breakdown below $0.70 could accelerate the fall, potentially targeting the $0.60–$0.50 range where previous demand clusters formed in late 2023. For bulls to regain momentum, ONDO must reclaim the 50-day SMA and close above $0.85. Until then, the chart favors the bears, and the trend suggests caution for long positions. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "The $100K Mirage: Bitcoin’s Rally Not Backed By On-Chain Strength",
      "link": "https://www.newsbtc.com/news/bitcoin/the-100k-mirage-bitcoins-rally-not-backed-by-on-chain-strength/",
      "summary": "Bitcoin briefly climbed back above $100,000 this month, pushing close to the $108,000 level before a new pullback. The move looks strong on the surface. But based on reports from Glassnode, much of that surge came from traders using borrowed funds, not fresh buyers piling in. Related Reading: Stablecoin Skepticism Grows As IMF Official Challenges Their Money Role Speculative Bets Fuel Recent Rally According to on-chain data, late-June’s volume on Bitcoin futures stayed high as prices marched upward. Traders betting on short-term gains drove the market, even as the excitement behind the rally faded. Funding rates and the three-month futures basis both moved lower, signaling less bullish conviction. In other words, fewer people were making big, long bets on Bitcoin these days. Spot Market Remains Quiet Spot trading did not follow the futures boom. At its $111,910 peak in May, daily spot volume hovered around $7.65 billion. That’s well below the previous cycle highs, which topped $20 billion on some days. Based on reports, new cash from retail or long-term holders stayed on the sidelines instead of flooding in. Institutional Buyers Still Adding Big firms did keep buying. This week saw Michael Saylor&#8217;s Strategy, Metaplanet and ProCap BTC together pick up about $1 billion worth of Bitcoin. At the same time, US-listed Bitcoin ETFs bought over $1.5 billion in fresh supply. Those steady purchases hint at genuine interest from institutions, even if short-term traders set the pace recently. Supply Tightness Could Drive Prices Glassnode now shows just 7 million BTC left freely available on exchanges. Roughly 14 million BTC are held by people who haven’t moved their coins in ages. That supply squeeze could support prices if demand holds up. But it also means any sudden sell-off might hit hard when exchange wallets run low. What Comes Next For Bitcoin All in all, the recent jump above $100,000 feels more like a sprint by margin players than a marathon fueled by new believers. Corrections often follow rallies driven by heavy margin activity. Yet, the ongoing buying by big companies and ETFs offers a buffer. If they keep at it, Bitcoin may need a breather now but could rally again later. Related Reading: TRUMP Token In Trouble? Over $4 Million Liquidity Exit Sparks Crash Fears As of June 28, Bitcoin traded at $106,500, down 0.85% on the day. Market watchers will be looking for a return of fresh spot demand or a stabilizing of futures bets before declaring the uptrend back on solid ground. Featured image from Unsplash, chart from TradingView"
    },
    {
      "title": "Ethereum Holds Critical Long-Term Channel – Next Move Could Be Parabolic",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-holds-critical-long-term-channel-next-move-could-be-parabolic/",
      "summary": "Ethereum is showing signs of renewed strength, trading 75% above its April lows as bulls attempt to reclaim lost ground. Despite this impressive recovery, ETH still sits roughly 98% below its all-time highs, leaving significant room for growth if bullish momentum accelerates. Market sentiment is shifting, with many analysts and investors eyeing Ethereum as the leading candidate to spark the long-awaited altseason. Related Reading: Bitcoin Forms 4-Year Inverse H&#38;S Pattern – Neckline Break Could Send It Parabolic Top analyst Ted Pillows recently shared a technical view suggesting that Ethereum has once again retested its lower channel — a pattern that has historically preceded explosive rallies in previous market cycles. In both 2017 and 2021, this same setup led to massive gains, and some believe this cycle could be no different. With macro conditions still uncertain but risk appetite growing across crypto markets, Ethereum’s price action is being closely watched. If the pattern holds, ETH could be on the verge of a powerful breakout that pulls the broader altcoin market along with it. Whether this becomes a historic launchpad or another consolidation phase remains to be seen, but for now, Ethereum is clearly at the center of attention. Ethereum Holds Key Support As Historic Pattern Signals Bullish Potential Ethereum is trading at a crucial technical level after reclaiming the $2,400 mark, where bulls and bears are locked in a tug-of-war. Buyers have managed to defend the key support zone, but upward momentum remains muted as broader market sentiment remains cautious. Geopolitical tensions and tightening macroeconomic conditions continue to shape risk appetite, making many investors hesitant to fully commit to high-beta assets like Ethereum. Still, the long-term setup is attracting attention from seasoned analysts. Pillows points to a recurring historical pattern that could define Ethereum’s trajectory in the coming months. According to his analysis, ETH has retested its lower trend channel once in each major market cycle, and each retest has preceded extraordinary rallies. In 2017, Ethereum surged 300x from this setup. In 2021, it delivered a 50x return. If history even partially repeats itself, a conservative 6x move would send ETH above the $10,000 mark. The setup is technically sound and aligns with the broader sentiment that Ethereum could lead the next altcoin rally, especially if Bitcoin breaks into price discovery. While uncertainty remains, ETH’s current position is a pivotal zone. If bulls manage to maintain structure and push toward range highs, the conditions for a breakout may soon align. Related Reading: Ethereum Staking Hits Record High: 29.02% Of Supply Locked Signals Long-Term Conviction ETH Holds $2,400 Level But Faces Resistance Ethereum is consolidating around $2,422 after reclaiming the $2,400 support zone, but the chart shows that bulls face significant resistance just above current levels. On the 12-hour timeframe, ETH has struggled to break above the 50- and 100-period simple moving averages, currently sitting at $2,518 and $2,536, respectively. This cluster of resistance has capped every recent attempt to move higher, reinforcing it as a short-term barrier that bulls must overcome to regain momentum. ETH&#8217;s failed breakdown below $2,200 earlier this week now looks like a bear trap, as buyers stepped in aggressively to reclaim lost ground. Still, without a decisive break above $2,530, Ethereum remains vulnerable to another retest of the $2,300–$2,200 support zone. Related Reading: Ethereum Fakes Out Bears – Altcoin Rally Depends On Key Level Breakout The 200-period SMA near $2,160 remains a key downside level to watch — if price fails to hold above it on future dips, bears could regain control. For now, Ethereum appears to be range-bound, caught between macro uncertainty and bullish hopes for an altseason. A breakout above $2,550 would confirm renewed strength and open the door for a push toward $2,800. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Takes a Lot of Pressure Off The Dollar, Says Donald Trump",
      "link": "https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Takes-a-Lot-of-Pressure-Off-The-Dollar-Says-Donald-Trump.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-takes-a-lot-of-pressure-off-the-dollar-says-donald-trump\" rel=\"nofollow\"> </a></p> <p>President Donald Trump is backing Bitcoin, calling it a vital American asset that the US must continue to dominate.</p> <p>"
    },
    {
      "title": "How The IMF Prevents Global Bitcoin Adoption (And Why They Do It)",
      "link": "https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/IMF-Blocking-Bitcoin-Adoption.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/featured/how-the-imf-prevents-global-bitcoin-adoption-and-why-they-do-it\" rel=\"nofollow\"> </a></p> <p>IMF loans halt nation-state Bitcoin plans—only debt-free countries like Bhutan push forward. Grassroots use still thrives.</p> <p>"
    },
    {
      "title": "Lnfi Network Integrates RGB Protocol to Enhance Lightning Network",
      "link": "https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Leonardo_Phoenix_10_A_futuristic_digital_dashboard_glowing_wit_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/lnfi-network-integrates-rgb-protocol-to-enhance-lightning-network\" rel=\"nofollow\"> </a></p> <p>Lnfi Network adopts RGB for Bitcoin’s Lightning, enabling secure asset trading. Nostr’s encryption stops manipulation.</p> <p>"
    },
    {
      "title": "If Institutions Are Buying Why Isn’t The Bitcoin Price Going Up?",
      "link": "https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/If-Institutions-Are-Buying-Why-Isnt-The-Bitcoin-Price-Going-Up.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/why-isnt-the-bitcoin-price-going-up\" rel=\"nofollow\"> </a></p> <p>Bitcoin price not soaring despite institutional billions? Uncover why profit-taking and derivatives hold it back, with a breakout looming!</p> <p>"
    },
    {
      "title": "Tahini’s Bitcoin Treasury: How a Family Chain Outsmarted Inflation",
      "link": "https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/tahini-bitcoin-2020-treasury-playbook.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/tahinis-bitcoin-treasury-how-a-family-chain-outsmarted-inflation\" rel=\"nofollow\"> </a></p> <p>Tahini’s, a Canadian fast-casual chain, embraced Bitcoin in 2020, leveraging it to compete with giants like McDonald’s. Here’s their treasury playbook.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "'FIFA Rivals' Review: Should You Play This NFT Soccer Game?",
      "link": "https://decrypt.co/327247/fifa-rivals-review-should-you-play-nft-soccer-game",
      "summary": "Following the success of NFL Rivals, Mythical Games is back with FIFA Rivals on iOS and Android. Here's our take on the NFT soccer game."
    },
    {
      "title": "How Much Bitcoin Has Iran Mined? It's Complicated",
      "link": "https://decrypt.co/327381/how-much-bitcoin-iran-mined-complicated",
      "summary": "Individuals, schools, and mosques in Iran are illegally mining Bitcoin to avoid high bills, making it difficult to estimate BTC holdings."
    },
    {
      "title": "Will Solana, XRP, Dogecoin and Other Crypto ETFs Take Off?",
      "link": "https://decrypt.co/327243/will-solana-xrp-dogecoin-other-crypto-etfs-take-off",
      "summary": "Analysts are not sure just how well ETFs giving investors exposure to altcoins like XRP, Solana, and Dogecoin would fare if approved."
    },
    {
      "title": "Trump Blames Biden for Banks Blocking Crypto: 'There Is a Lot of Debanking'",
      "link": "https://decrypt.co/327531/trump-blames-biden-banks-blocking-crypto-debanking",
      "summary": "President Trump unloaded on the issue of crypto debanking Friday, but stopped short of committing to issuing an executive order on the subject."
    },
    {
      "title": "'Rogue' Police Are Destroying Bitcoin ATMs: Bitcoin Depot Legal Chief",
      "link": "https://decrypt.co/327503/rogue-police-are-destroying-bitcoin-atms-bitcoin-depot-legal-chief",
      "summary": "Chris Ryan said that police may be breaking the law in some instances and that the provider of the machines is entitled to the funds."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Ripple drops cross-appeal as SEC set to follow, closing XRP case",
      "link": "https://cryptobriefing.com/ripple-sec-agreement-ends/",
      "summary": "<p>Ripple and SEC end their prolonged legal dispute as both sides drop appeals, marking a pivotal ripple sec agreement in crypto regulation.</p> <p>"
    },
    {
      "title": "Robinhood rolls out micro XRP, Solana futures following token relisting",
      "link": "https://cryptobriefing.com/micro-futures-contracts-xrp-solana/",
      "summary": "<p>Robinhood's expansion into micro crypto futures could democratize access to digital asset trading, potentially increasing market participation.</p> <p>"
    },
    {
      "title": "Trump backs Bitcoin adoption amid claims it could ease pressure on the dollar",
      "link": "https://cryptobriefing.com/trump-bitcoin-adoption-dollar/",
      "summary": "<p>Trump's endorsement of Bitcoin could accelerate its mainstream adoption, potentially reshaping global financial dynamics and US economic policy.</p> <p>"
    },
    {
      "title": "The power of crypto journaling: how tracking your trades can transform your success",
      "link": "https://cryptobriefing.com/crypto-trading-journal-success/",
      "summary": "<p>A crypto trading journal helps track trades, refine strategies, manage emotions, and boost discipline for better results.</p> <p>"
    },
    {
      "title": "Bitcoin retreats after Fed’s preferred inflation gauge shows mild uptick",
      "link": "https://cryptobriefing.com/bitcoin-pce-inflation-gauge-impact/",
      "summary": "<p>Bitcoin's volatility highlights economic uncertainty, with inflation concerns and potential Fed rate decisions impacting market stability.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Solana hits major resistance again – But something’s different this time",
      "link": "https://ambcrypto.com/solana-hits-major-resistance-again-but-somethings-different-this-time/",
      "summary": "<img alt=\"Solana hits major resistance again - But something&#039;s different this time\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Chandan-2025-06-28T131347.121_11zon.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Could $21 million in exchange inflows spark another sell-off?"
    },
    {
      "title": "Trump torches Fed, Biden – calls debanking ‘very dangerous’ for U.S. economy",
      "link": "https://ambcrypto.com/trump-torches-fed-biden-calls-debanking-very-dangerous-for-u-s-economy/",
      "summary": "<img alt=\"Trump torches Fed, Biden - calls debanking ‘very dangerous’ for U.S. economy\" class=\"attachment-full size-full wp-post-image\" height=\"637\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Trump-Blames-Biden-for-Banks-Blocking-Crypto.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1132\" />“Very bad and very dangerous” – Trump eyes a comeback with new orders?"
    },
    {
      "title": "Bitcoin’s Q3 outlook uncertain – Is another liquidation event coming?",
      "link": "https://ambcrypto.com/bitcoins-q3-outlook-uncertain-is-another-liquidation-event-coming/",
      "summary": "<img alt=\"Bitcoin’s Q3 outlook uncertain - Is another liquidation event coming?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-1-8.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />New highs, old risk: Is Bitcoin's foundation cracking?"
    },
    {
      "title": "PENGU jumps 22% on ETF buzz – Why are traders still betting against it?",
      "link": "https://ambcrypto.com/pengu-jumps-22-on-etf-buzz-why-are-traders-still-betting-against-it/",
      "summary": "<img alt=\"PENGU jumps 22% on ETF buzz - Why are traders still betting against it?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-17-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Can PENGU bulls flip $0.012 or will shorts get the last laugh?"
    },
    {
      "title": "North Korean hackers pose as IT staff, drain $1 mln from Web3 projects",
      "link": "https://ambcrypto.com/north-korean-hackers-pose-as-it-staff-drain-1-mln-from-web3-projects/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"918\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/ZachXBT-reports-1m-loss.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1632\" />One click reopened the mint contract and one hour later, thousands of NFTs were dumped."
    }
  ]
}