{
  "CoinDesk": [
    {
      "title": "Polkadot's DOT Gains as Much as 5% as Bitcoin Nears All-Time Highs",
      "link": "https://www.coindesk.com/markets/2025/07/10/polkadots-dot-gains-as-much-as-5-as-bitcoin-nears-all-time-highs",
      "summary": ""
    },
    {
      "title": "BIT Mining Surges 250% on Solana Pivot",
      "link": "https://www.coindesk.com/business/2025/07/10/bit-mining-surges-250-on-solana-pivot",
      "summary": ""
    },
    {
      "title": "Ether, AI Coins Steal Bitcoin’s Spotlight: Crypto Daybook Americas",
      "link": "https://www.coindesk.com/daybook-us/2025/07/10/ether-ai-coins-steal-bitcoins-spotlight-crypto-daybook-americas",
      "summary": ""
    },
    {
      "title": "Europe’s Financial Watchdog Probes Malta Over Fast-Track MiCA Authorizations",
      "link": "https://www.coindesk.com/policy/2025/07/10/europe-s-financial-watchdog-probes-malta-over-mica-and-fast-track-authorizations",
      "summary": ""
    },
    {
      "title": "Bitcoin's Q2 Boom Being Fueled by Corporates: Bitwise",
      "link": "https://www.coindesk.com/markets/2025/07/10/bitcoins-q2-boom-being-fueled-by-corporates-bitwise",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Researchers foil $10M DeFi backdoor in thousands of smart contracts",
      "link": "https://cointelegraph.com/news/venn-network-defi-backdoor-rescue?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NWZkOTQtNWEyYy03NGQxLTgyYzAtZGI1NjUxNTc3ZjNj.jpg\" /></p><p>The Venn Network team suspects the attack was linked to the North Korean Lazarus Group, citing its complexity and widespread deployment.</p>"
    },
    {
      "title": "Coinbase unlocks off-exchange settlement for institutions amid ‘high’ demand",
      "link": "https://cointelegraph.com/news/coinbase-off-exchange-settlement-institutions-high-demand?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2Y0MGEtNjYyNS03NmMzLWI4MmUtYmVjNzM4YTZmMzky.jpg\" /></p><p>Coinbase has partnered with Copper to offer off-exchange settlement via ClearLoop, aiming to meet growing institutional demand for secure crypto trading.</p>"
    },
    {
      "title": "XAI teases Grok upgrades; Musk says AI could discover new physics",
      "link": "https://cointelegraph.com/news/xai-grok-7-upgrade-musk-ai-physics?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2NiOTktY2FmYi03OWE4LWFjN2QtM2I3YTE2NTEwYTg4.jpg\" /></p><p>Elon Musk said Grok may soon discover new physics as xAI works on a more advanced, vision-capable model.</p>"
    },
    {
      "title": "Linqto bankruptcy no threat to pre-IPO markets, says EquityZen",
      "link": "https://cointelegraph.com/news/linqto-bankruptcy-no-threat-pre-ipo-markets-equityzen?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2YzMzEtOTJhZS03YTUzLWIxMjMtYjA0Y2U4M2RhNWM4.jpg\" /></p><p>Ripple ranks as one of the top 10 pre-IPO companies on EquityZen, while major crypto firms like Tether and Gemini saw the largest spike in popularity in Q2 2025.</p>"
    },
    {
      "title": "NFT sales hit $2.8B in first half of 2025 as trading volumes tank",
      "link": "https://cointelegraph.com/news/nft-sales-volume-h1-2025-dappradar-cryptoslam?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2YzMWItNWNkNS03NmI5LWE4OTEtNjYwZGNjOTgwNDA2.jpg\" /></p><p>CryptoSlam data shows that NFT sales volumes reached $2.82 billion in the first half of 2025, while DappRadar data shows a continued drop in trading volumes.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Coinbase Bitcoin premium indicates US demand led surge to $112,000",
      "link": "https://cryptoslate.com/insights/bitcoin-hits-record-112k-amid-intensified-us-investor-interest/",
      "summary": "<p>Bitcoin, which had spent much of the past month trading within a narrow range, suddenly broke out to a new all-time high of $112,000 on July 9. The surge coincided with a sharp increase in the &#8220;Coinbase Premium,&#8221; a key indicator used to gauge Bitcoin demand among US investors. According to data from CryptoQuant, BTC [&#8230;]</p> <p>"
    },
    {
      "title": "Jack Dorsey endorses privacy-focused chat app White Noise amid own app launch plan",
      "link": "https://cryptoslate.com/jack-dorsey-endorses-privacy-focused-chat-app-white-noise-amid-own-app-launch-plan/",
      "summary": "<p>Jack Dorsey, the founder of Twitter and CEO of Block, has thrown his support behind a new messaging application called White Noise. His endorsement follows the recent release of his white paper for Bitchat, a Bluetooth-based messaging platform without internet connectivity. Bitchat aims to be a privacy-first chat app that ditches the internet altogether to [&#8230;]</p> <p>"
    },
    {
      "title": "Shorts wrecked from $539M worth of liquidations as Bitcoin reaches new ATH",
      "link": "https://cryptoslate.com/insights/shorts-wrecked-from-539m-worth-of-liquidations-as-bitcoin-reaches-new-ath/",
      "summary": "<p>In the past 24 hours, the crypto derivatives market saw $539 million in liquidations, with an overwhelming $469.87 million of that coming from short positions. This wipeout came as Bitcoin reached a new ATH of $111,936 on Binance, before settling slightly lower at $111,230, a 2.33% increase from the day&#8217;s opening at $108,693. Bitcoin&#8217;s upward move [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum regains $2,700 amid lowest long/short ratio in two years and ETF cash floods",
      "link": "https://cryptoslate.com/ethereum-regains-2700-amid-lowest-long-short-ratio-in-two-years-and-etf-cash-floods/",
      "summary": "<p>Ethereum (ETH) reclaimed the $2,700 threshold one day after spot exchange-traded funds (ETFs) listed in the US tracking the asset surpassed $4.5 billion in cumulative net inflows on July 8, according to Farside Investors&#8217; data. As of press time, Ethereum is priced at $2,723.98, up by 4.1% in the past 24 hours. ETH lost the [&#8230;]</p> <p>"
    },
    {
      "title": "Rex-Osprey Solana staking ETF doubles cumulative inflows to $41M on July 8",
      "link": "https://cryptoslate.com/rex-osprey-spot-solana-etf-doubles-cumulative-inflows-to-41m-on-july-8/",
      "summary": "<p>The first US-listed spot Solana exchange-traded fund (ETF) received $21 million of net inflows on July 8, lifting its running total to $41.2 million, based on Farside Investors’ data. The one-day addition to the Rex-Osprey’s Solana + Staking ETF (SSK) 104% of the $20.2 million raised over the previous three trading sessions, effectively doubling net [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Ethereum Back At Range Highs: Breakout Above $2,800 Could Ignite Altseason",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-back-at-range-highs-breakout-above-2800-could-ignite-altseason/",
      "summary": "Ethereum surged over 5% yesterday, pushing past the key $2,700 level and signaling renewed strength across the altcoin market. After weeks of sideways action and uncertainty, this move marks a small but significant breakout, reigniting bullish sentiment among investors and traders. The breakout comes as Bitcoin continues to consolidate below its all-time highs, allowing ETH and other altcoins to take the lead. Related Reading: Bitcoin 30-Day Average Funding Rate Drops – Bullish Setup Takes Shape Market participants are closely watching Ethereum’s price action, as its movements often set the tone for the broader altcoin space. Top analyst Ted Pillows shared a technical view highlighting that ETH is once again trading at the top of its recent range. A breakout above this level could confirm the beginning of a larger expansion phase for altcoins. With bullish momentum building and Ethereum holding strong above reclaimed support levels, traders are becoming increasingly confident that the altcoin market may be on the verge of a broader breakout. However, key resistance still lies ahead, and the next few days will be crucial in determining whether Ethereum has the strength to continue higher and lead a new leg up in the crypto cycle. Ethereum Trades at Range Highs: Breakout Looms Ethereum has spent the past several weeks consolidating in a well-defined range between approximately $2,400 and $2,800, a structure that began forming in early May. Despite short-term volatility, ETH has held key support levels, suggesting that bulls remain in control. Now, with price action pushing toward the upper boundary of the range once again, the market is watching closely to see whether Ethereum can break through resistance and initiate a sustained rally. The broader macroeconomic backdrop has shifted in favor of risk assets. In the US, strong labor market data and wage growth have helped ease concerns of an economic slowdown. Meanwhile, the resolution of several global geopolitical tensions has reduced uncertainty, allowing markets to stabilize. This supportive environment could give Ethereum the fuel it needs to attempt a breakout. Ted Pillows recently highlighted that Ethereum is now trading at the range highs again — a level that has repeatedly capped price advances in recent months. According to Pillow, a confirmed breakout above the $2,800 resistance would likely trigger renewed momentum for ETH and potentially spark a broader move across the altcoin market. Related Reading: Ethereum Price Action Signals Momentum Shift: BTC Sleeps And ETH Moves $2,800 Resistance Now In Sight Ethereum is showing renewed strength as it breaks out of a multi-week consolidation range, with the latest 12-hour candle closing above $2,760. The price action has decisively reclaimed the $2,700 level and is now testing the critical $2,800 resistance zone. This breakout is supported by a clear surge in volume, confirming bullish momentum. The 50, 100, and 200-period moving averages are all trending upwards and currently sit well below the current price, a strong technical sign of sustained momentum. ETH has moved above all three key SMAs, confirming that bulls are in control in the short to medium term. Notably, this is the highest ETH has traded since early June, and the candle structure resembles a classic continuation breakout setup. Related Reading: ERC-20 Stablecoin Supply Hits All-Time High At $121B – Liquidity On The Rise A successful daily close above $2,800 would open the door for an expansion toward the $3,000 level and potentially higher if momentum holds. However, the key now lies in whether buyers can sustain this move without immediate rejection at resistance. If ETH can hold above $2,700 and build support, the breakout could serve as a launchpad for altcoins, especially as Ethereum often leads broader market moves. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "‘Real’ Crypto Bull Run Just Beginning, Says Analyst—Here’s Why",
      "link": "https://www.newsbtc.com/news/real-crypto-bull-run-just-beginning-analyst/",
      "summary": "In a livestream broadcast on X, independent market technician Kevin, known online as @Kev_Capital_TA, argued that crypto markets are only now entering what he called “the real bull run,” pointing to a confluence of technical signals, macroeconomic data and inter-market correlations that he believes have not been fully appreciated by traders. The Real Bull Run Starts Here Kevin placed particular emphasis on the behavior of Tether dominance (USDT.D), the share of crypto market capitalization held in the dollar-pegged stablecoin. The analyst displayed two long-term logarithmic USDT.D charts, each showing an initial sharp decline followed by what he described as a “rising channel slash bear flag.” In both 2024 and the present structure, the measured-move target of the pattern sits at 3.70 percent. “It’s really astonishing how this is kind of attempting to play out,” he said, stressing that any sustainable rally in risk assets will require that level to be reached. “The two key words that are going to be the most important words over the next couple of weeks are follow through.” Related Reading: Crypto Market Cap On Track To $4.5 Trillion As Q3 Unfolds – Details He then overlaid a macro descending triangle on a separate two-week USDT.D chart dating back to March 2020. Each time the two-week Stochastic RSI crossed downward, the dominance metric fell sharply, coinciding with periods of strength in Bitcoin and altcoins. The latest cross, now curling lower, again targets 3.70 percent. If that support were to give way, Kevin allowed, a deeper slide toward “the two-percent handle” could mark a “peak bull market” phase—though he cautioned against speculating that far ahead. The technical discussion broadened to Bitcoin’s hash-ribbon indicator, which tracks miner capitulation and recovery. Historically, weekly “buy” signals have preceded 40 to 100 percent upside moves within nine weeks, with what Kevin called a “100 percent hit rate” over eight years of back-testing. Kevin linked the on-chain data to macro conditions. Citing the real-time inflation gauge “Truthflation,” he highlighted a 1.66 percent reading—below the Federal Reserve’s nominal 2 percent target—and falling import prices, both of which, he argued, increase the odds of an imminent shift to easier policy. “If Truthflation stays below 2 percent, you’re going to get the easing you want,” he said, predicting that markets would price in an end to quantitative tightening ahead of any official announcement. “Retail traders are becoming more educated than they’ve ever been.… The market will sniff out rate cuts coming.” Altcoin capital rotation formed a second pillar of the bullish thesis. Ethereum’s market-share chart, he said, had been basing at 2019-2020 lows, with monthly MACD, Stochastic RSI and Market Cipher signals all turning up. Early reallocations into ETH-beta names such as Chainlink and Uniswap are already “up 60 percent” from their accumulation zones, he claimed, framing the moves as the foothills of a broader run. Nonetheless, he warned viewers not to wait for central-bank confirmation: “Don’t be the person sitting on the sidelines waiting for Powell to come out saying QT is over.” Related Reading: XRP Set To Shock The Crypto Market With 30% Share, Analyst Predicts Turning to Bitcoin itself, Kevin acknowledged that the benchmark still faces substantial resistance. Price must clear the March record, then the $112,000–$116,000 range and, ultimately, $120,000 before “thin air” opens a path to $140,000–$150,000. Similarly, the “total three” index—market cap excluding Bitcoin and Ethereum—needs a daily close above $877 billion and, crucially, the yellow-shaded resistance band that has capped rallies five times since February. Only then, he argued, would a new all-time high for the broader alt-basket come into view. Despite the optimism, Kevin repeatedly returned to the notion that conviction without confirmation is premature. “We need to see real deal price action,” he said, noting that Bitcoin’s daily RSI has not reached the 90-plus “euphoria” zone since 2017. He called"
    },
    {
      "title": "XRP Forms Inverse Head And Shoulders Pattern, Why A Surge To $3.3 Is Possible",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-inverse-head-shoulders/",
      "summary": "XRP has been one of the most-watched altcoins recently, with multiple developments emerging for its parent company, Ripple. However, while Ripple has seen a lot of positives, XRP has continued to struggle when it comes to price. Amid the selling, bulls have put up an impressive fight to hold the support above $2.2 for the time being. This has led to the formation of a new inverse head and shoulders pattern that could signal a reversal is coming. Analyst Highlights Bullish Formation For XRP Price Crypto analyst TheSignalyst, in a new analysis, showed that the XRP price has begun another bullish formation. This time around, it is the Inverse Head and Shoulders pattern that often precedes a surge for an asset. Not only has this formation come at a critical junction, it happened while bulls have maintained strong support levels. Related Reading: Altcoins Reclaim Trendline That Led To 2021 Explosion, Will History Repeat Itself? Through the market downtrend, the XRP price has been able to hold above $1.75 and $2, which the analyst points out as a major level. The return to this support level has brought a fresh wave of bullishness, and the XRP price could be ready for another uptrend from here. Presently, all eyes are on this support level, and TheSignalyst revealed that if XRP is able to hold this level, then the rally could be in motion. They point to the green neckline, which is shown in the chart as sitting just above $2.3, and this is the resistance that needs to be broken for the price to rally in the short term. For the long term, the analyst suggests that a clean break above the $2.66 level is needed. This is what would provide confirmation for a bullish continuation. If the setup holds, then the analyst puts the top of formation as high as $3.3 in the long term. Analysts Predict Higher Prices The calls for higher prices for XRP have grown louder, especially as investors have begun to make their bets once again. Analyst Crypto Virtuos pointed out that the XRP trading volume saw a notable uptick of 125% in a 24-hour period as interest ballooned once again. Related Reading: Bitcoin Price Crash To $92,000 Or New ATHs? Analyst Explains The 2 Options Amid this rise in momentum, the crypto analyst, just like TheSignalyst, also explained that $2.3 is the hurdle that is holding the XRP price back now. Therefore, the cryptocurrency does need to overtake this level if it is to see a continuation of the uptrend. At the time of writing, the XRP price is still trending below $2.3, with sellers showing signs of exhaustion. Once the selling stops, then the bulls could trigger another upward wave to retest the resistance at $2.3 once again. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Bitcoin Consolidates Below All-Time High as Spot Market Drives Momentum",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-consolidates-below-all-time-high-as-spot-market-drives-momentum/",
      "summary": "Bitcoin’s price movement remains in focus as it continues to consolidate just below its previous all-time high. Despite a brief surge that brought it within range of its $111,000 peak, the asset has struggled to establish a breakout. As of the time of writing, Bitcoin is trading around $108,927, representing a 0.2% increase over the past 24 hours. The persistence of this consolidation phase comes amid growing market discussions around spot and derivatives behavior. Related Reading: Bitcoin’s Liquidity Lifeline Just Got Cut—What You Need To Know Binance Spot-Perpetual Delta Reflects Cautious Leverage One of the more notable on-chain observations comes from CryptoQuant contributor BorisVest, who analyzed the prolonged negative delta between spot and perpetual prices on Binance. According to the analyst, this delta has remained in negative territory since December 2024. That means the spot price of Bitcoin has consistently traded above the perpetual futures price on Binance, an unusual structure during what appears to be a bullish market trend. “When the delta flipped negative last December, Bitcoin had just marked a then-ATH,” BorisVest noted. He explained that this divergence signaled an aggressive buildup of long positions in the perpetual market, just before Bitcoin corrected to $74,000. Despite Bitcoin reaching new highs recently, the delta still hasn’t reversed. “The sustained gap shows that leveraged traders have yet to commit to the rally in full,” he added. This trend could indicate a phase of accumulation in the spot market, which historically precedes stronger price movements. The analyst also warned that when perpetual prices eventually flip above spot prices, it may signal a shift toward a more speculative environment. In such scenarios, sudden price corrections could occur if long positions are unwound rapidly. Traders monitoring the spot-perpetual relationship can potentially use this as a signal to adjust their risk exposure. Dollar Weakness May Signal Tailwinds for Bitcoin Another CryptoQuant analyst, Darkfost, highlighted a macroeconomic trend that could further influence Bitcoin’s trajectory, the weakening US dollar. The US Dollar Index (DXY), which tracks the value of the dollar relative to a basket of foreign currencies, is currently trading at its most significant deviation below its 200-day moving average in over two decades. This decline coincides with rising US debt levels and has historically aligned with strength in risk-on assets like Bitcoin. Darkfost pointed out that when the dollar loses its traditional safe-haven appeal, capital often flows toward alternative assets. Related Reading: Bitcoin Price Crash To $92,000 Or New ATHs? Analyst Explains The 2 Options “Historical data shows that these periods have consistently benefited Bitcoin,” the analyst stated. While Bitcoin has yet to respond in full to this shift, the trend could support a future upward move, especially if liquidity continues to increase. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "Bitcoin Rally Ahead? DXY Breakdown Suggests Capital Shift To Risk-On Assets",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-rally-ahead-dxy-breakdown-suggests-capital-shift-to-risk-on-assets/",
      "summary": "The US national debt recently hit a new all-time high (ATH), surging above $36.5 trillion and putting significant pressure on the US Dollar Index (DXY). As the DXY struggles under the weight of mounting debt, crypto analysts believe capital may soon shift to risk-on assets like Bitcoin (BTC). DXY Breakdown Suggests Bitcoin Rally According to a recent CryptoQuant Quicktake post by contributor Darkfost, the DXY has dropped to a historically weak level, currently trading 6.5 points below its 200-day moving average (MA) &#8211; the largest deviation in the past 21 years. Related Reading: Bitcoin Short-Term Holder Floor Rises Toward $100,000, Reinforcing Bullish Sentiment For the uninitiated, the DXY measures the value of the US dollar relative to a basket of six major foreign currencies, including the euro, yen, pound, Canadian dollar, Swedish krona, and Swiss franc. It is widely used as an indicator of USD strength or weakness and often influences investor sentiment across global financial markets. While a breakdown in the DXY might seem alarming at first, it historically benefits risk-on assets like BTC. A weakening dollar typically precedes capital rotation into alternative asset classes. Following that logic, the recent softness in the USD could prompt investors to reassess their portfolios &#8211; potentially increasing allocation to digital assets. Darkfost illustrated this point with the below chart. The chart highlights periods where the DXY traded below its 365-day MA. Historically, these phases have aligned with strong BTC price appreciation. The analyst added: We are currently in a phase where the weakness of the DXY could fuel a new rise in BTC but the price didn&#8217;t reacted yet. This tool serves as a valuable indicator for identifying early bull market phases and periods of euphoria, not because of pure technical triggers, but because it reflects increasing liquidity potentially flowing into crypto markets. According to data from CoingGecko, BTC is currently trading just about 2.2% below its ATH of $111,814 recorded on May 22. With BTC decisively breaking through a bullish flag, the flagship cryptocurrency looks set to hit a new ATH in the near-term. Some Warning Signs To Watch Out For Despite a favorable macro backdrop, several warning signs could dampen BTC’s bullish momentum. For instance, Bitcoin’s Apparent Demand metric has recently turned negative. Related Reading: Bitcoin Realized Dominance Signals Weak Hands Capitulating, Strong Hands Rising Similarly, some on-chain metrics suggest that the BTC rally may be running out of steam. Bitcoin’s NVT Golden Cross recently showed signs of a potential local top. That said, Bitcoin continues to show resilience, absorbing persistent selling pressure in the derivatives market and avoiding a breakdown below the $100,000 mark. At press time, BTC trades at $109,520, up 0.7% over the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Hits New All Time High at $112,000 As Corporations Buy Record Amounts of BTC",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-at-112000-as-corporations-buy-record-amounts-of-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-at-112000-As-Corporations-Buy-Record-Amounts-of-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-at-112000-as-corporations-buy-record-amounts-of-btc\" rel=\"nofollow\"> </a></p> <p>Bitcoin's ATH signals a new era of institutional adoption, with major players like BlackRock, Strategy, and Smarter Web Company expanding their commitment to the digital asset.</p> <p>"
    },
    {
      "title": "Donald Trump Jr. Invests $4 Million in Bitcoin Treasury Company Thumzup Media",
      "link": "https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Donald-Trump-Jr.-Invests-4-Million-in-Bitcoin-Treasury-Company-Thumzup-Media.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media\" rel=\"nofollow\"> </a></p> <p>The social media firm, which reported just $151 in revenue last quarter, has drawn Trump Jr.’s interest after adopting a Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Myths Busted And Conflicts of Interest Noted at Senate Banking Crypto Market Structure Hearing",
      "link": "https://bitcoinmagazine.com/news/myths-busted-and-conflicts-of-interest-noted-at-senate-banking-crypto-market-structure-hearing",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Crypto-Market-Structure-Hearing-July-9-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/myths-busted-and-conflicts-of-interest-noted-at-senate-banking-crypto-market-structure-hearing\" rel=\"nofollow\"> </a></p> <p>U.S. senators and crypto specialists propose stipulations for digital asset market structure legislation while highlighting the reality of illicit financing on public blockchains and noting the Trump family’s crypto dealings.</p> <p>"
    },
    {
      "title": "Emirates Signs A Deal To Integrate Bitcoin And Crypto Payments",
      "link": "https://bitcoinmagazine.com/news/emirates-signs-a-deal-to-integrate-bitcoin-and-crypto-payments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Dubai-just-became-the-first-government-in-the-world-to-allow-people-to-pay-for-public-services-using-cryptocurrency-thanks-to-a-new-partnership-with-Crypto.com_.-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/emirates-signs-a-deal-to-integrate-bitcoin-and-crypto-payments\" rel=\"nofollow\"> </a></p> <p>Emirates has signed a memorandum of understanding with Crypto.com to integrate Bitcoin and crypto payments into its booking systems, marking a significant step toward mainstream adoption of Bitcoin in the travel industry. The agreement, signed in the presence of Emirates Chairman Sheikh Ahmed bin Saeed Al Maktoum, will enable customers to pay for flights using [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Expands Bitcoin Mining Operations to 750 PH/s, Targets 1.25 EH/s by Late Summer",
      "link": "https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Expands-Bitcoin-Mining-Operations-to-750-PHs-Targets-1.25-EHs-by-Late-Summer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer\" rel=\"nofollow\"> </a></p> <p>KULR Technology Group, Inc., a Bitcoin-first company focused on sustainable energy solutions, announced today the successful deployment of 3,570 Bitmain S19 XP 140T mining machines in Asuncion, Paraguay. This new infrastructure brings KULR’s total Bitcoin mining capacity to 750 petahash per second (PH/s), with a goal of reaching 1.25 exahash per second (EH/s) by late [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Snoop Dogg’s Telegram NFT Drop Sold Out in Half an Hour",
      "link": "https://decrypt.co/329480/snoop-doggs-telegram-nft-drop-sold-out-in-half-an-hour",
      "summary": "The collab with Telegram’s TON blockchain appears to show that celebrity-led NFTs, at least on apps like it, aren’t entirely dead."
    },
    {
      "title": "Circle's USDC Is Being Adopted by Jack Ma Payment Giant Ant Group",
      "link": "https://decrypt.co/329488/circles-usdc-jack-ma-payment-giant-ant-group",
      "summary": "The Chinese parent company of Alipay is set to incorporate the stablecoin into its blockchain platform, as per unconfirmed reports."
    },
    {
      "title": "Video Game Performers Secure AI Consent Rules in New SAG-AFTRA Deal",
      "link": "https://decrypt.co/329479/video-game-performers-ai-consent-rules",
      "summary": "Studios agree to \"strike suspension language\" preventing AI scabs and substantial pay increases through 2027."
    },
    {
      "title": "Australia’s Tokenization Push Could Cement ‘Even Greater Financial Control’",
      "link": "https://decrypt.co/329454/australia-tokenization-push-greater-financial-control",
      "summary": "Australia has approved 24 tokenized asset use cases under Project Acacia, enabling real-money trials across major banks and fintechs."
    },
    {
      "title": "Elon Musk’s xAI Launches ‘Remarkable, Terrifying’ Grok 4 Model",
      "link": "https://decrypt.co/329451/elon-musks-xai-launches-remarkable-terrifying-grok-4-model",
      "summary": "xAI’s latest AI model aims to challenge OpenAI, even as the team quietly addresses past missteps this week."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "xAI introduces Grok 4; Musk predicts Grok will start inventing new technologies by 2026",
      "link": "https://cryptobriefing.com/grok-4-ai-model-xai/",
      "summary": "<p>Grok 4's advancements could revolutionize technology and physics, potentially reshaping industries and scientific understanding by 2026.</p> <p>"
    },
    {
      "title": "Ben ‘BitBoy’ Armstrong faces six charges for harassing phone calls, released after arrest",
      "link": "https://cryptobriefing.com/bitboy-legal-troubles-armstrong-arrest/",
      "summary": "<p>The ongoing legal issues surrounding Ben Armstrong highlight the potential reputational risks and legal challenges for crypto influencers.</p> <p>"
    },
    {
      "title": "SEC pushes back decision on in-kind creations and redemptions for BlackRock Ethereum ETF",
      "link": "https://cryptobriefing.com/sec-ethereum-etf-decision-delay/",
      "summary": "<p>The SEC's delay in approving in-kind processes for crypto ETFs may slow innovation and market efficiency in the digital asset space.</p> <p>"
    },
    {
      "title": "Bitcoin hits $112K new ATH after breaking past key resistance",
      "link": "https://cryptobriefing.com/bitcoin-hits-new-all-time-high-at-112k/",
      "summary": "<p>The surge in Bitcoin's value highlights increased institutional interest and regulatory optimism, but also underscores heightened market volatility.</p> <p>"
    },
    {
      "title": "Donald Trump Jr.-backed Thumzup to acquire Ether, XRP, Solana following board approval",
      "link": "https://cryptobriefing.com/bitcoin-treasury-strategy-trump-investment/",
      "summary": "<p>Thumzup's crypto expansion, despite financial losses, highlights a growing trend of Trump-affiliated ventures embracing digital assets.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "POPCAT soars 16%, hits 3-week high – Is $0.40 within reach?",
      "link": "https://ambcrypto.com/popcat-soars-16-hits-3-week-high-is-0-40-within-reach/",
      "summary": "<img alt=\"Popcat\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-35.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Popcat rallies 16% in 24 hours reaching $0.3403 amid whale accumulation but risk of a pullback remains elevated."
    },
    {
      "title": "Pump.Fun’s token sale set for July 12 – $600M target & more…",
      "link": "https://ambcrypto.com/pump-funs-token-sale-set-for-july-12-150b-tokens-600m-target/",
      "summary": "<img alt=\"PumpFun\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Benjamin-2025-07-10T102351.730.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />33% of 1 trillion PUMP token supply or $1.32B will be sold by July 15."
    },
    {
      "title": "$40M lost! – All about GMX’s V1 hack and what to watch out for",
      "link": "https://ambcrypto.com/40m-lost-all-about-gmxs-v1-hack-and-what-to-watch-out-for/",
      "summary": "<img alt=\"Crypto Hack\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-10T115652.219-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />GMX faces a $40M loss from a V1 exploit, adding to 2025's growing crypto attack trend."
    },
    {
      "title": "Top 7 Telegram trading bots of July 2025",
      "link": "https://ambcrypto.com/top-7-telegram-trading-bots-of-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1280\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/dima-solomin-4_BbIPL8KOI-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Trading bots are automated software tools that are used to execute trades depending on predefined [&#8230;]"
    },
    {
      "title": "Top 8 DEXs to watch out for in July 2025",
      "link": "https://ambcrypto.com/top-8-dexs-to-watch-out-for-in-july-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1277\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/traxer-kM6QNrgo0YE-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />DEX or Decentralized exchanges are essentially blockchain-based peer-to-peer marketplaces that allow users to conduct transactions [&#8230;]"
    }
  ]
}