{
  "CoinDesk": [
    {
      "title": "Jack Mallers: How We Started Our Bitcoin Treasury Company",
      "link": "https://www.coindesk.com/business/2025/07/08/jack-mallers-how-we-started-our-bitcoin-treasury-company",
      "summary": ""
    },
    {
      "title": "SharpLink Gaming Jumps 26% as Ether Treasury Tops 200K ETH",
      "link": "https://www.coindesk.com/markets/2025/07/08/sharplink-gaming-jumps-26-as-ether-treasury-tops-200k-eth",
      "summary": ""
    },
    {
      "title": "Trump-Linked Truth Social Plans Crypto ETF as Digital Asset Franchise Expands",
      "link": "https://www.coindesk.com/policy/2025/07/08/trump-linked-truth-social-plans-crypto-etf-as-digital-asset-franchise-expands",
      "summary": ""
    },
    {
      "title": "Core Scientific Cut to Neutral as CoreWeave Deal Adds Complexity: H.C. Wainwright",
      "link": "https://www.coindesk.com/markets/2025/07/08/core-scientific-cut-to-neutral-as-coreweave-deal-adds-complexity-hc-wainwright",
      "summary": ""
    },
    {
      "title": "CoinDesk 20 Performance Update: Uniswap (UNI) Gains 3.8% as Index Inches Higher",
      "link": "https://www.coindesk.com/coindesk-indices/2025/07/08/coindesk-20-performance-update-uniswap-uni-gains-3-8-as-index-inches-higher",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Ethereum &#039;mega whales&#039; are stacking harder than pre-95% rally in 2002",
      "link": "https://cointelegraph.com/news/ethereum-mega-whales-stacking-harder-than-pre-95-percent-rally-2002?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWMzMmItZDU3ZS03NzcxLWE1ZDctMjRhMDRmNDJhZTY5.jpg\" /></p><p>Ethereum is eyeing a breakout toward $3,400 as it consolidates within a bull pennant, echoing classic continuation patterns from past rallies.</p>"
    },
    {
      "title": "Blockchain restores women’s power in AI",
      "link": "https://cointelegraph.com/news/blockchain-women-s-power-in-ai?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhjYWUtZGI0OS03YjNmLTk3M2UtNmM0MzFmMzQ3YTBl.jpg\" /></p><p>As AI threatens to deepen gender disparities in the workforce, blockchain technology can be a powerful tool to empower women to reclaim their rightful place in the digital future.</p>"
    },
    {
      "title": "Thailand’s 5-year crypto tax break: What they’re not telling you",
      "link": "https://cointelegraph.com/explained/thailands-5-year-crypto-tax-break-what-theyre-not-telling-you?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8xZGEwMWY1NmI2YzI2MGI5MzhmNzg1NTVlM2M0OGMwMC5qcGc=.jpg\" /></p><p>Thailand’s five-year tax break on crypto capital gains looks like a dream for investors, but the fine print reveals a strategic push for surveillance, platform control and regulatory dominance.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Falcon USD stablecoin loses dollar peg amid liquidity, collateral concerns",
      "link": "https://cointelegraph.com/news/falcon-usd-stablecoin-depegs-liquidity-collateral-concerns?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjdmYTMtMDVmOC03MDQwLWI4ZWYtMjY5N2EwOTNiM2Rh.jpg\" /></p><p>Falcon Finance’s Falcon USD (USDf) lost its dollar peg on Tuesday amid falling liquidity, collateral quality concerns and accusations of mismanagement.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "BlackRock’s IBIT Bitcoin ETF could surpass Satoshi Nakamoto’s holdings by May 2026",
      "link": "https://cryptoslate.com/insights/blackrocks-ibit-bitcoin-etf-could-surpass-satoshi-nakamotos-holdings-by-may-2026/",
      "summary": "<p>BlackRock&#8217;s IBIT Spot Bitcoin ETF has officially crossed 700,000 BTC in assets under management, valued at approximately $76 billion as of July 17. The milestone comes just 18 months after the fund&#8217;s launch in January 2024, marking a rapid accumulation pace that has drawn industry-wide attention. Bloomberg Senior ETF Analyst Eric Balchunas highlighted the achievement [&#8230;]</p> <p>"
    },
    {
      "title": "Truth Social files for ETF holding BTC, ETH, SOL, XRP and CRO",
      "link": "https://cryptoslate.com/truth-social-files-for-etf-holding-btc-eth-sol-xrp-cro/",
      "summary": "<p>Truth Social, the media platform affiliated with US President Donald Trump, has submitted a new application to the US Securities and Exchange Commission (SEC) for a spot crypto exchange-traded fund (ETF). The proposed vehicle, titled the Truth Social Crypto Blue Chip ETF, aims to provide direct exposure to a basket of leading digital assets, including [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet wants to use Bitcoin as collateral to access bank financing",
      "link": "https://cryptoslate.com/metaplanet-wants-to-use-bitcoin-as-collateral-to-access-bank-financing/",
      "summary": "<p>Metaplanet, the Japanese Bitcoin treasury firm, has revealed a bold strategy to convert its growing Bitcoin reserves into capital for acquiring profitable businesses. According to a July 8 Financial Times report, Metaplanet CEO Simon Gerovich said the company is preparing for a second phase where it can use Bitcoin as collateral to access bank financing. [&#8230;]</p> <p>"
    },
    {
      "title": "Pump.fun eyes EVM expansion amid Bonk.fun rivalry",
      "link": "https://cryptoslate.com/pump-fun-eyes-evm-expansion-amid-bonk-fun-rivalry/",
      "summary": "<p>Pump.fun, a Solana-based token launchpad platform, is reportedly set to roll out a range of updates, with a possible expansion into the Ethereum ecosystem. This move comes as the platform faces mounting competition in the rapidly growing token generation market. Pump.fun&#8217;s new updates? On July 7, Dumpster DAO, a crypto trading and research platform, reported [&#8230;]</p> <p>"
    },
    {
      "title": "Over 500 Chinese creditors challenge FTX over $470M payout freeze",
      "link": "https://cryptoslate.com/over-500-chinese-creditors-challenge-ftx-over-470m-payout-freeze/",
      "summary": "<p>Chinese creditors affected by FTX&#8217;s latest legal maneuver are ramping up efforts to challenge the bankrupt exchange&#8217;s request to delay payouts to users in 49 jurisdictions with restrictive or uncertain crypto laws. The group is turning to US courts and regulators, raising concerns about fairness, transparency, and procedural integrity. Speaking with , a Chinese creditor [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Breakout or Breakdown? XRP $2.35 Test Could Decide Its Next Move",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-next-move-hinges-on-2-35/",
      "summary": "XRP is showing mixed signals across timeframes, leaving traders on edge as the price approaches the key $2.35 level. While a recent breakout from a falling wedge on the 3-day chart suggests a bullish reversal, the 4-hour chart reveals signs of slowing momentum and a possible rising wedge. With buyers and sellers locked in a battle, $2.35 could be the tipping point that decides whether XRP surges higher or slips into a near-term correction. XRP Breaks Out Of Falling Wedge On 3-Day Chart In an X post, LSplayQ highlighted a key technical development on the XRP 3-day price chart, pointing to a breakout from a falling wedge pattern. This type of pattern is commonly associated with bullish reversals, signaling that market sentiment may be shifting in favor of the bulls. Related Reading: XRP Silent Accumulation: A Falling Wedge On The Verge Of Explosion Following the breakout, XRP is currently trading around $2.26, and according to LSplayQ, the move suggests that buyers are stepping back in to reclaim control. The price action marks a significant shift after an extended period of downward compression within the wedge. If the bullish momentum continues, LSplayQ notes that XRP could target a breakout level near $2.72, which represents an upside potential of roughly 20% from the current price. That said, LSplayQ also warns of the risk of a pullback if XRP fails to hold above the wedge breakout level. In such a scenario, the price could retest the $2.10 zone as a potential support. Overall, the technical outlook leans bullish, as long as XRP maintains its position above the breakout level. Rising Wedge Pattern Signals Caution Ahead In a post on X, The Crypto Bushman pointed out that XRP is pushing higher on the 4-hour chart, but warned that seasoned traders are keeping a close eye on what lies beneath the surface. Related Reading: XRP Price Pops and Drops — Can Bulls Regain Control? According to the analyst, the price is currently trading above both the 20- and 50-day EMAs, which typically signals short-term strength. However, the overall structure appears to be forming a rising wedge, a pattern often linked to potential reversals. At the same time, momentum is beginning to fade, with the MACD flattening and volume tapering off, which Bushman describes as classic signs of a potential trap move. The Crypto Bushman emphasized that a failure to break cleanly above $2.35 could lead to the setup rolling over. In that case, the $2.25 zone becomes a critical level to watch for a possible breakdown and shift in sentiment. On the flip side, a strong breakout backed by volume could fuel another leg up toward $2.50 if buying pressure returns decisively. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Sees $6 Billion In Tokenized Funds As Big Players Jump In",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-sees-6-billion-in-tokenized-funds-as-big-players-jump-in/",
      "summary": "Ethereum’s smart-contract platform has crossed a major line. According to data shared by Token Terminal on X, the total value of tokenized assets on Ethereum now tops $6 billion. That figure covers products from asset managers, fund houses and blockchain firms. It proves institutions are treating on‑chain finance as more than a tech demo. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 Top Firms Drive Token Growth BlackRock leads the pack. The world’s largest asset manager holds the biggest share of tokenized AUM on Ethereum. Close behind are Franklin Templeton, WisdomTree, Superstate, Apollo and Ondo Finance. Franklin Templeton focused on parts of its US Government Money Fund. WisdomTree launched funds you can buy through a mobile app. Superstate and Apollo each add smaller but steady sums. Based on reports, these six names together make up most of the $6 billion milestone. Tokenized AUM on @ethereum is at an all-time high World&#8217;s biggest financial services firms &#38; asset managers are tokenizing assets on Ethereum pic.twitter.com/5Xl4XXYQ3O — Token Terminal 📊 (@tokenterminal) July 6, 2025 Adoption Speed Since Mid-2023 The climb didn’t happen in a day. Adoption started slowly around mid‑2023. It rose further in early 2024. Then by January 2025, the line on the stacked chart shot straight up. That jump comes as BlackRock and Franklin Templeton pour in fresh tokens. Faster trades and fewer middlemen are big draws. Trades that once took days can now settle in minutes or seconds. That kind of speed appeals to big investors, who want clarity and a clear audit trail. This push into tokenized finance shows a shift in how big firms manage money. Ethereum still faces questions about scaling. If gas fees jump again, trading costs could rise sharply. Related Reading: Bitcoin Meets Heartbreak In Drake’s Latest Track—Details On Rules &#38; New Fund Types Regulators in the US, Europe and Asia have yet to set clear rules. A clampdown in one region might push firms toward other chains or private blockchains. Competition from Solana, Avalanche and new networks is already heating up. With $6 billion on‑chain, tokenized assets are past the trial stage. More firms will likely join once rules firm up and scaling solutions roll out. Markets could see new fund types, cross‑border trades and on‑chain yield tools. For now, Ethereum holds the lead. Yet the next hurdles—fee pressure, rule making and rival chains—will test whether it can keep growing. Featured image from Meta, chart from TradingView"
    },
    {
      "title": "2025’s Biggest Bitcoin Bull Trigger Is Still Hidden, Expert Reveals",
      "link": "https://www.newsbtc.com/bitcoin-news/2025-biggest-bitcoin-bull-trigger-still-hidden/",
      "summary": "In a conversation with The Bitcoin Economy podcast, Bloomberg Intelligence ETF analyst James Seyffart argued that the next, and potentially largest, leg of institutional demand for spot-Bitcoin exchange-traded funds will not come from pension funds, endowments, or sovereign wealth managers. Instead, it will arise when the country’s fragmented network of registered investment advisers (RIAs) finally gains full discretionary clearance to recommend Bitcoin ETFs to ordinary clients. “The biggest bull case for the ETFs has been the unlocking of RIAs in 2025,” Seyffart said. “Right now the vast majority of the assets are stuck in that middle ground where, if a client specifically asks to buy a Bitcoin ETF, the adviser can act—but the adviser cannot initiate the recommendation.” The Biggest Bull Case For Bitcoin In 2025 Seyffart broke the compliance bottleneck into a traffic-light schema that most financial advisers will recognise. A red-light firm bars Bitcoin entirely; a yellow-light firm permits unsolicited purchases (“If you come to me and ask for it, I can do it”); and a green-light firm allows the adviser to solicit an allocation (“I can recommend that you put two percent of your portfolio in Bitcoin”). Related Reading: Bitcoin’s Liquidity Lifeline Just Got Cut—What You Need To Know Wire-house broker–dealers—which still custody trillions of dollars—largely remain in the red or yellow camps, paralysed by multi-year due-diligence committees. Independent RIAs, by contrast, “were the early adopters,” Seyffart noted, because they “don’t have to wait for a due-diligence team of a bunch of people sitting in New York.” Yet even among independents, most advisers outsource portfolio construction to centralised model portfolios; until those models flag Bitcoin ETFs as eligible holdings, discretionary uptake will stay muted. Seyffart’s focus on 2025 is calendrical, not calendrical: the first full-calendar year after launch gives compliance teams twelve months of daily NAV history—often a hard requirement before a new ETF can graduate from yellow to green status. “Usually it can take two to three years before an ETF gets approved,” he said, but the extraordinary size and liquidity of the spot-Bitcoin cohort is already accelerating that cycle. Crucially, the next Form 13F reporting deadline on 15 August 2025 will reveal second-quarter holdings as of 30 June. Seyffart expects the data to confirm that “a lot more RIAs have come online and [are] buying this for their clients,” providing the first concrete measure of green-light conversions. Related Reading: Bitcoin In For Another 460% Run? This Rare Fiat Signal Just Returned If the gatekeeping retreats, model-portfolio architects can incorporate Bitcoin’s historically uncorrelated returns into strategic-allocation frameworks. That in turn would grant advisers legal cover to solicit Bitcoin exposure, unleashing a flywheel of inflows. Seyffart cautioned that the same compliance teams will demand iron-clad fiduciary justifications—volatility, custody and tax treatment remain live concerns—but he argued that the ETFs now provide a wrapper familiar to any wealth platform. Seyffart’s thesis is that the moment a critical mass of compliance committees flips from yellow to green—allowing advisers to recommend Bitcoin rather than merely transact it—flows could dwarf everything seen to date. Whether that inflection arrives in the next 12 months will determine, in his view, “the biggest bull case for Bitcoin.” At press time, BTC traded at $108,250. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "50% Bitcoin Price Crash On The Horizon? Analyst Reveals $60,000 Target",
      "link": "https://www.newsbtc.com/news/bitcoin/50-bitcoin-price-crash-60000/",
      "summary": "Despite the Bitcoin price holding up quite nicely above $100,000 and remaining very close to its all-time high levels, there continues to be expectations of a massive crash that would rock the market. Pseudonymous crypto analyst FriendlyRox points to a number of indicators for this, going from volume to momentum, all pointing to a possible price crash. What is the expected result of this? Losing the $100,000 psychological level and then falling to previous peaks. Bitcoin Price At Risk With Dwindling Volume And Momentum In the analysis, FriendlyRox highlighted the decline in major metrics such as momentum and volume as the major driver of the forecasted price crash. This comes amid bullish news dominating the headlines, such as institutions increasing their Bitcoin holdings and supply on exchanges falling toward new lows, meaning investors are choosing to hold for higher prices. Related Reading: Ethereum Ready For Explosive Breakout: $5,791 The Minimum Target–Analyst The decline in the volume has been apparent after the Bitcoin price had fallen below $100,000 before bouncing back up in June. So far, in the month of July, the Bitcoin trading volumes have trended lower, with data from Coinglass showing consistent daily volumes below $100 billion. At the same time, there has also been a decline in momentum, with the analyst pointing out a negative divergence in this metric. Furthermore, the Bitcoin price has also flashed a historical trend that has usually predated market tops. This is price reaching the 50 EMA (Exponential Moving Average) and then retracing. FriendlyRox revealed that in the past, whenever the price touched the 50 EMA and then extended back, it usually signalled a crash, and the Bitcoin price has done this now, extending even further. Other metrics that have also flashed bearishness include the RSI and the MACD, both of which are now showing a loss of momentum as they moved into the negative. All of these factors happening together at the same time have painted a pretty bleak picture for the leading cryptocurrency by market cap. BTC Bottom Targets With the lineup of bearish developments, the crypto analyst has predicted an approximately 50% from here. As volume continues to decrease and momentum slides into the negative, they expect that the Bitcoin price will be looking to retrace back to the 50 EMA. Related Reading: Bitcoin Must Hold $106,000 And $98,000 To Avoid Breakdown The interesting fact here is that the 50 EMA falls below the previous Bitcoin price peak, putting it at $60,000. A crash of this magnitude would only be rivaled by the COVID crash in 2020 and the FTX-induced market crash back in 2022. But nevertheless, it would mean a wipeout for altcoins across the board. As for the timeframe for when this could happen, there is no definite timeline. Going by the analyst’s chart, it could take a couple of years for this to completely play out, with the analyst closing with: “Let us see how it unfolds.” Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "No New Bitcoin Buys: Strategy Takes A Breather After 3 Consecutive Months",
      "link": "https://www.newsbtc.com/bitcoin-news/no-new-bitcoin-buys-strategy-takes-a-breather-after-3-consecutive-months/",
      "summary": "Strategy (previously MicroStrategy), the Bitcoin proxy firm co-founded by Bitcoin bull Michael Saylor, has made headlines once again on Monday, but not for its usual Bitcoin acquisitions, but for its notable absence of purchases during the week of June 30 to July 6. This marks the first time since late March that the largest corporate holder of BTC has not added to its impressive treasury, which currently stands at 597,325 Bitcoin, valued at approximately $64.71 billion. Strategy Bitcoin Investment Hits A Pause The lack of activity in Bitcoin acquisitions is surprising, especially given Strategy&#8217;s aggressive purchases over the past few months. These purchases have brought the company close to holding nearly 3% of the cryptocurrency’s total supply. From April 7 through June 29, the company invested $6.77 billion in acquiring 69,140 BTC, averaging about $97,906 per coin. At current market prices, these investments have appreciated by 10.4%, now worth around $7.49 billion. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 In terms of trading, Strategy&#8217;s stock (trading on the Nasdaq under the ticker symbol MSTR) saw a slight decline of 0.7% during morning trading hours, which is in line with the 0.8% drop in Bitcoin prices. As of this writing, MSTR closed the day at $395. This highlights the close relationship between the company’s performance and the volatility of the cryptocurrency market. However, the company&#8217;s stock has enjoyed a rise of 38.5% in 2025, outpacing BTC’s 16.1% increase and the S&#38;P 500&#8217;s modest gain of 6.1%. Up To $4.2 Billion For Future BTC Investments In addition to this pause in BTC purchases, Strategy did not issue any new common or preferred shares during the specified week. However, the company announced a sales agreement to potentially issue and sell up to $4.2 billion in 10% preferred stock. According to Monday’s press release on the matter by the Bitcoin proxy firm, the proceeds from this sales agreement are earmarked for general corporate purposes, which include future BTC acquisitions and working capital needs. Related Reading: Bitcoin To Repeat Parabolic Phase From 2017 And 2021? Here’s The Target The new preferred stock, known as Series A Perpetual Stride Preferred Stock, will be sold in a “disciplined manner,” taking market conditions into account, highlighting the firm’s ongoing commitment to leveraging its financial strategies to enhance its BTC holdings, even as it temporarily steps back from direct purchases. At the time of writing, BTC is trading at $107,855, marking a 1.5% decline within the last 24 hours, increasing the gap between the current price and its record by 3.5%. This follows a failed attempt last week to overcome the cryptocurrency&#8217;s most significant resistance level of $110,000 and establish a new all-time high above its current record of $111,800. Featured image from DALL-E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Ego Death Capital Closes $100 Million Raise to Scale Bitcoin Companies",
      "link": "https://bitcoinmagazine.com/news/ego-death-capital-closes-100-million-raise-to-scale-bitcoin-companies",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/EGO-DEATH-CAPITAL.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ego-death-capital-closes-100-million-raise-to-scale-bitcoin-companies\" rel=\"nofollow\"> </a></p> <p>Ego Death Capital has closed its second fund, totaling $100 million, to invest exclusively in software companies building businesses on the Bitcoin protocol. The firm is positioning itself as a lead Series A investor in an ecosystem where scalable, Bitcoin-native firms are beginning to achieve positive cash flow. &#8220;We&#8217;re in Bitcoin, investing in true companies [&#8230;]</p> <p>"
    },
    {
      "title": "U.S. Court Brings Coin Center’s Tornado Cash Appeal To A Close",
      "link": "https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Tornado-Cash-Trial.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close\" rel=\"nofollow\"> </a></p> <p>Coin Center’s appeal to the U.S. Treasury Department’s Office of Foreign Asset Control (OFAC) regarding Tornado Cash is now over.</p> <p>"
    },
    {
      "title": "CleanSpark Announces Mining 685 Bitcoin Worth Over $74 Million In June",
      "link": "https://bitcoinmagazine.com/news/cleanspark-announces-mining-685-bitcoin-worth-over-74-million-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/CleanSpark-Announces-Bitcoin-Mining-Results-From-June-2025.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/cleanspark-announces-mining-685-bitcoin-worth-over-74-million-in-june\" rel=\"nofollow\"> </a></p> <p>CleanSpark mined 685 bitcoin in June, sold 578 BTC for over $61 million, and became the first miner to reach 50 EH/s using fully self-operated infrastructure.</p> <p>"
    },
    {
      "title": "Nakiki SE to Become First German Public Company With ‘Pure’ Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/nakiki-se-to-become-first-german-public-company-with-pure-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Nakiki-SE-to-Become-First-German-Public-Company-With-‘Pure-Bitcoin-Treasury-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/nakiki-se-to-become-first-german-public-company-with-pure-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>German listed company plans to become the nation’s first public firm with a pure Bitcoin treasury.</p> <p>"
    },
    {
      "title": "Trustodial: An Ontological Dilemma",
      "link": "https://bitcoinmagazine.com/technical/trustodial-an-ontological-dilemma",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Trustodial.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/trustodial-an-ontological-dilemma\" rel=\"nofollow\"> </a></p> <p>\"Trustodial\" systems like statechains introduce a dilemma in terms of what constitutes self custodial.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bitcoin Volatility Hovers Near Historical Low, but 'Beware the Quiet,' Analysts Warn",
      "link": "https://decrypt.co/329046/bitcoin-volatility-hovers-near-historical-low-but-beware-the-quiet-analysts-warn",
      "summary": "The QCP Capital analysts warned that Q3-Q4 could bring \"fireworks\" as ETF inflows create a supply squeeze."
    },
    {
      "title": "Robinhood CEO Wants 'Thousands' of Private Companies Tokenized on Platform",
      "link": "https://decrypt.co/329075/robinhood-ceo-thousands-private-companies-tokenized",
      "summary": "OpenAI denounced Robinhood’s offering of its private stock as a crypto token, but the trading app wants to add thousands more to its roster."
    },
    {
      "title": "UK Jails Duo for $2M Fake Crypto Consultancy Scam",
      "link": "https://decrypt.co/329067/uk-jails-duo-for-2m-fake-crypto-consultancy-scam",
      "summary": "The scheme involved the pair cold-calling 65 victims and convincing them to invest in a fake crypto consultancy firm."
    },
    {
      "title": "BlackRock's Bitcoin ETF Breaks the 700,000 BTC Barrier",
      "link": "https://decrypt.co/329047/blackrocks-bitcoin-etf-breaks-the-700000-btc-barrier",
      "summary": "The fund’s popularity could help Bitcoin's volatility remain relatively low—at least in the short term, according to analysts."
    },
    {
      "title": "What Are Coin Mixers and How Do They Work?",
      "link": "https://decrypt.co/resources/what-are-coin-mixers-tornado-cash-how-do-they-work",
      "summary": "Coin mixers like Tornado Cash have faced sanctions for aiding money laundering, but advocates argue they have legitimate use cases."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Cardano Foundation unveils blockchain-based tool to simplify audit compliance and enhance financial reporting",
      "link": "https://cryptobriefing.com/blockchain-esg-compliance-cardano-reeve/",
      "summary": "<p>Cardano's blockchain tool could revolutionize audit compliance, boosting transparency and trust across various sectors and enhancing ESG efforts.</p> <p>"
    },
    {
      "title": "Trump’s Truth Social files S-1 for Crypto Blue Chip ETF holding BTC, ETH, XRP, SOL, and CRO",
      "link": "https://cryptobriefing.com/crypto-blue-chip-etf-launch/",
      "summary": "<p>The launch of a crypto ETF by Truth Social could significantly influence mainstream adoption and regulatory perspectives on digital assets.</p> <p>"
    },
    {
      "title": "Government-backed Sequans secures $384M to kick off Bitcoin treasury initiative, stock jumps 60% pre-market",
      "link": "https://cryptobriefing.com/sequans-bitcoin-treasury-initiative/",
      "summary": "<p>Sequans' Bitcoin initiative may boost its financial resilience and shareholder value, potentially influencing other tech firms to explore crypto.</p> <p>"
    },
    {
      "title": "Ripple CEO Brad Garlinghouse to testify before US Senate Banking Committee on crypto legislation",
      "link": "https://cryptobriefing.com/crypto-market-legislation-senate-hearing/",
      "summary": "<p>Garlinghouse's testimony could accelerate US crypto regulation, potentially fostering innovation and consumer protection in digital markets.</p> <p>"
    },
    {
      "title": "SEC pushes Solana ETF issuers to refile by end of July, signals fast-track approval path",
      "link": "https://cryptobriefing.com/solana-etf-approval-sec-fast-track/",
      "summary": "<p>The SEC's expedited process for Solana ETFs could accelerate mainstream crypto adoption and diversify investment options in the US market.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "MSTR stock dips 2% – Is Strategy’s Bitcoin bet still paying off?",
      "link": "https://ambcrypto.com/mstr-stock-dips-2-is-strategys-bitcoin-bet-under-pressure/",
      "summary": "<img alt=\"MSTR stock slides\" class=\"attachment-full size-full wp-post-image\" height=\"734\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/MSTR-stock-slides.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1305\" />Everyone’s watching MSTR’s next move, will $14B in Bitcoin gains be enough to silence critics?"
    },
    {
      "title": "1,140 ETH moved after 10 years – Will Ethereum prices react?",
      "link": "https://ambcrypto.com/1140-eth-moved-after-10-years-will-ethereum-prices-react/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-08T114601.648-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite headline moves, Ethereum’s on-chain data reflects bullish signals and rising community engagement."
    },
    {
      "title": "Bitcoin miners stock up, BTC slows: History points to what’s coming next",
      "link": "https://ambcrypto.com/bitcoin-miners-stock-up-btc-slows-history-points-to-whats-coming-next/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-32.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />What will miners do next? Hold or sell?"
    },
    {
      "title": "Fidelity’s Solana ETF delay raises concerns – ‘No approvals until fall’",
      "link": "https://ambcrypto.com/fidelitys-solana-etf-delay-raises-concerns-no-approvals-until-fall/",
      "summary": "<img alt=\"SOL ETF\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/SolanaSOLETFFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Analysts expect temporary pause on crypto ETF summer - Details."
    },
    {
      "title": "VIC crypto soars 60% in 24 hours – Is the rally just beginning?",
      "link": "https://ambcrypto.com/vic-crypto-soars-60-in-24-hours-is-the-rally-just-beginning/",
      "summary": "<img alt=\"VIC crypto soars 60% in 24 hours - Is the rally just beginning?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250708_094041_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />VIC could extend its gains in the coming days."
    }
  ]
}