{
  "CoinDesk": [
    {
      "title": "Amber International Raises $25.5M to Expand $100M Crypto Reserve Strategy",
      "link": "https://www.coindesk.com/business/2025/07/03/amber-international-raises-255m-to-expand-100m-crypto-reserve-strategy",
      "summary": ""
    },
    {
      "title": "Ondo, Pantera Capital to Invest $250M in Real-World Asset Projects",
      "link": "https://www.coindesk.com/business/2025/07/03/ondo-pantera-capital-to-invest-250m-in-real-world-asset-projects",
      "summary": ""
    },
    {
      "title": "ETH Holds Firm as Strong U.S. Jobs Data Lifts S&P 500 and Nasdaq Composite to Record Highs",
      "link": "https://www.coindesk.com/markets/2025/07/03/eth-holds-firm-as-strong-u-s-jobs-data-lifts-s-and-p-500-and-nasdaq-composite-to-record-highs",
      "summary": ""
    },
    {
      "title": "SEC's Pause of Grayscale Fund Is Likely Temporary",
      "link": "https://www.coindesk.com/news-analysis/2025/07/03/sec-s-pause-of-grayscale-fund-is-likely-temporary",
      "summary": ""
    },
    {
      "title": "Sui Reclaims $3 After Week-Long Rally Sparked by Lion Group’s Treasury Plans",
      "link": "https://www.coindesk.com/markets/2025/07/03/sui-reclaims-usd3-after-week-long-rally-sparked-by-lion-group-s-treasury-plans",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Chinese firm completes first buy in effort to stockpile 10% of BNB",
      "link": "https://cointelegraph.com/news/nano-labs-first-move-toward-1-billion-bnb-treasury?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2QzNjItNGRiMy03OWY2LTgwNjYtZDczMjVhZDYwMjA1.jpg\" /></p><p>SkyBridge Capital’s Anthony Scaramucci has doubts crypto treasuries have legs in the long run, arguing investors will start buying crypto instead of investing in companies that hold it.</p>"
    },
    {
      "title": "Bitcoin must hold above $108K or risk a bearish spiral",
      "link": "https://cointelegraph.com/news/bitcoin-price-hold-108k-bearish-reversal-risk-crypto-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2QzMGItM2M0YS03MTU1LWI0ZmItODYzNzgwYTQ0OWIy.jpg\" /></p><p>A crypto analyst suggests that a drop to $108,000 could mark the beginning of Bitcoin’s fall back below the six-figure price level.</p>"
    },
    {
      "title": "Bitcoin miner production falls in June on power curtailment, weather",
      "link": "https://cointelegraph.com/news/bitcoin-miner-production-falls-june-power-curtailment-weather?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2QzMGMtZGVhZi03ZjA3LWIzNjktNGYzNDIyYWYxMTIx.jpg\" /></p><p>Bitcoin miners strategically curtailed operations in June to avoid costly peak demand charges in Texas, sacrificing short-term production for lower costs.</p>"
    },
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5Nzk0MjMtZWY4ZS03YzYwLWI5MzctYjlkZGY3NWZlOGFk.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "WhiteRock founder to be extradited over $30M ZKasino case — ZachXBT",
      "link": "https://cointelegraph.com/news/whiterock-founder-extraditon-netherlands-zkasino?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDNhZjAtMjEyMC03Nzk4LWFjNjktMDdkMWEyZWY2Y2U3.jpg\" /></p><p>WhiteRock Finance founder Ildar Ilham was reportedly detained in the UAE more than a year after Dutch authorities announced an arrest linked to ZKasino.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "DeFi TVL breaks above $116B as lending roars back",
      "link": "https://cryptoslate.com/defi-tvl-breaks-above-116b-as-lending-roars-back/",
      "summary": "<p>The DeFi market has rebounded at the beginning of July, with total value locked (TVL) rising to $116.416 billion, a level last seen in April. The 24-hour increase of 4.95% reflects rising crypto asset prices and renewed deposit flows into lending protocols, restaking services, and yield-bearing primitives. As Ethereum and Solana continue to absorb most [&#8230;]</p> <p>"
    },
    {
      "title": "TRON DAO Joins EthCC as WAGMI Sponsor, Co-Hosts Events with MetaMask and Arkham",
      "link": "https://cryptoslate.com/tron-dao-joins-ethcc-as-wagmi-sponsor-co-hosts-events-with-metamask-and-arkham/",
      "summary": "<p>Geneva, Switzerland, July 3 2025 — TRON DAO, the community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and decentralized applications (dApps), proudly participated as a WAGMI Sponsor at the Ethereum Community Conference (EthCC), held from June 30 to July 3 in Cannes, France. As Europe’s largest annual Ethereum-focused event, EthCC [&#8230;]</p> <p>"
    },
    {
      "title": "Pantera, Ondo launch $250M fund to drive RWA tokenization",
      "link": "https://cryptoslate.com/pantera-ondo-launch-250m-fund-to-drive-rwa-tokenization/",
      "summary": "<p>Ondo Finance and Pantera Capital have launched a $250 million fund to accelerate investments in tokenized real-world assets (RWAs), Axios reported on July 3. According to the report, the fund, named Ondo Catalyst, will invest in equity stakes and tokens of projects developing tokenized versions of traditional financial assets. Ian De Bode, chief strategy officer [&#8230;]</p> <p>"
    },
    {
      "title": "Post-maintenance mishap on Solana’s Backpack triggers incorrect futures orders, balance reports",
      "link": "https://cryptoslate.com/post-maintenance-mishap-on-solanas-backpack-triggers-incorrect-futures-orders-balance-reports/",
      "summary": "<p>Backpack halted trading for scheduled maintenance at 10 a.m. UTC on July 3 and reopened two hours later, but the restart triggered account errors that forced CEO Armani Ferrante to promise reviews and compensation. Backpack had warned users on X that the platform would go offline at 10 a.m., enter post-only mode at noon, and [&#8230;]</p> <p>"
    },
    {
      "title": "Russian insurance firms unveil investment life policies tied to Bitcoin",
      "link": "https://cryptoslate.com/russian-insurance-firms-unveil-investment-life-policies-tied-to-bitcoin/",
      "summary": "<p>Two major Russian insurance firms, Renaissance Life and BCS Life Insurance, have launched investment life insurance policies (ILIPs) linked to Bitcoin, according to a July 2 local media report. According to the report, the innovative policies allow investors to gain exposure to BlackRock’s iShares Bitcoin Trust (IBIT), the largest Bitcoin ETF by assets under management. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Prepares for Possible Bounce — Support Levels In Focus",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-prepares-bounce-2-20/",
      "summary": "XRP price started a decent upward move from the $2.20 zone. The price is now correcting some gains and might find bids near the $2.220 zone. XRP price started a fresh increase above the $2.220 zone. The price is now trading above $2.220 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.2250 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another decline if it fails to stay above the $2.220 zone. XRP Price Faces Resistance XRP price started a fresh increase after it settled above the $2.20 level, like Bitcoin and Ethereum. The price was able to climb above the $2.220 resistance level. The bulls were able to push the price above the $2.250 level. However, the bears were active near the $2.320 level. A high was formed at $2.310 and the price is now correcting some gains. There was a move below the 23.6% Fib retracement level of the upward move from the $2.148 swing low to the $2.310 high. The price is now trading above $2.220 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.2250 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.2720 level. The first major resistance is near the $2.30 level. The next resistance is $2.320. A clear move above the $2.320 resistance might send the price toward the $2.350 resistance. Any more gains might send the price toward the $2.40 resistance or even $2.420 in the near term. The next major hurdle for the bulls might be $2.50. More Losses? If XRP fails to clear the $2.30 resistance zone, it could start another decline. Initial support on the downside is near the $2.2250 level and the trend line. The next major support is near the $2.20 level or the 61.8% Fib retracement level of the upward move from the $2.148 swing low to the $2.310 high. If there is a downside break and a close below the $2.20 level, the price might continue to decline toward the $2.150 support. The next major support sits near the $2.120 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.2250 and $2.20. Major Resistance Levels – $2.30 and $2.320."
    },
    {
      "title": "Under Stress: Tron Revenue Drops As Nearly $190M Flows Out",
      "link": "https://www.newsbtc.com/news/tron-under-stress-trx-revenue-drops-as-nearly-190m-flows-out/",
      "summary": "TRON’s token TRX has barely budged despite a flurry of on‑chain action. Traders saw a 5% gain over the past week and a measly 0.50% uptick in the last 24 hours. But behind those mild price moves, there’s a storm of activity that could shape how TRX fares in the days ahead. Related Reading: The Silent Bitcoin Accumulation: Public Companies’ Surprising H1 2025 Lead Surge In On‑Chain Activity According to data from Artemis, daily transaction counts shot up to over 9 million, up from 7.5 million the day before. That jump in numbers sent active addresses soaring. On‑chain participants climbed to 2.7 million, marking the highest level since June 6. Based on reports, much of this traffic appears tied to stablecoin transfers rather than new users or fresh investment. The spike in transaction volume doesn’t match TRX’s price action. That gap hints at wallets moving funds out of exchanges, routing payments, or chasing yield elsewhere. Users aren’t rushing to hold TRX for its own sake. They’re using the network as a highway and then driving off into other chains. TRX market cap currently at $26.8 billion. Chart: TradingView Stablecoin Outflows Hit Record High According to Artemis, TRON’s stablecoin supply hit $80 billion in June, setting a new milestone for the network. Since then, about $185 million worth of stablecoins have fled the chain. That outflow marks a sharp reversal in user habits. People who once parked their USDT and other tokens on TRON look to be shifting them to new destinations. The pullback follows a broader rotation in crypto markets where investors chase better rates or lower fees. TRON once drew crowds for its low transaction costs. Now, competing chains and Layer 2 platforms are undercutting its edge. That has cut into TRX’s role as the network’s workhorse token. Revenue And TVL Take A Hit Artemis figures show that TRX’s total revenue plunged to just $114,000 in a single day. That number sits at a four‑year low. Network fees in TRON come from “bandwidth” and “energy,” so when users batch transfers or switch to zero‑fee bridges, fee income collapses fast. Based on data from DeFiLlama, total value locked on TRON protocols fell by 0.50% in 24 hours, a drop from $4.80 billion to $4.85 billion. That’s about $26 million walking out the door. While a half‑percent move might look small, it underlines a trend. Every million dollars that leaves makes it tougher for lending pools and yield farms to keep their rates up. Related Reading: Long-Term Bitcoin Holders Near Pain Point Last Seen In October 2024 Despite the outflows, TRX hasn’t broken key support levels yet. It still trades above areas that buyers defended in late spring. But if TVL keeps sliding and stablecoins continue to exit, we could see more pressure on the token’s price. Featured image from P2P.org, chart from TradingView"
    },
    {
      "title": "Ethereum Price Gathers Strength — Bulls Prepare for Upside Extension",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-gathers-strength-2550/",
      "summary": "Ethereum price started a fresh increase above the $2,450 zone. ETH is now back above $2,550 and might soon aim for more gains. Ethereum started a fresh increase above the $2,550 level. The price is trading above $2,575 and the 100-hourly Simple Moving Average. There is a short-term rising channel forming with support at $2,570 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it remains supported above the $2,520 zone in the near term. Ethereum Price Eyes More Gains Ethereum price started a fresh increase above the $2,450 zone, like Bitcoin. ETH price gained pace for a move above the $2,550 resistance zone and entered a positive zone. The bulls were able to push the price above the $2,620 resistance. However, there was no upside extension. A high was formed near $2,636 and the price corrected some gains. There was a move toward the 23.6% Fib retracement level of the upward move from the $2,373 swing low to the $2,636 high. Ethereum price is now trading above $2,560 and the 100-hourly Simple Moving Average. Besides, there is a short-term rising channel forming with support at $2,570 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,625 level. The next key resistance is near the $2,640 level. The first major resistance is near the $2,650 level. A clear move above the $2,650 resistance might send the price toward the $2,720 resistance. An upside break above the $2,720 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,750 resistance zone or even $2,800 in the near term. Another Decline In ETH? If Ethereum fails to clear the $2,620 resistance, it could start a fresh decline. Initial support on the downside is near the $2,570 level. The first major support sits near the $2,520 zone. A clear move below the $2,520 support might push the price toward the $2,500 support. Any more losses might send the price toward the $2,420 support level in the near term. The next key support sits at $2,350. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,520 Major Resistance Level – $2,620"
    },
    {
      "title": "Dogecoin Bounces Back With 8% Gain—Is $0.26 In Sight?",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-bounces-back-with-8-gain-is-0-26-in-sight/",
      "summary": "Dogecoin has observed a rebound from the support line of a Parallel Channel. Here&#8217;s where the next target could lie, according to an analyst. Dogecoin Found Support At Lower Level Of This Channel In a new post on X, analyst Ali Martinez has talked about how the daily Dogecoin price is currently looking from the perspective of a technical analysis (TA) pattern. The pattern in question is a Parallel Channel, which forms whenever an asset&#8217;s price witnesses consolidation between two parallel trendlines. The upper line of the channel tracks successive highs, and the lower one lows. Related Reading: This Altcoin Looks Like PEPE Before It Exploded, Analyst Says The cryptocurrency breaking out of either of these levels implies a continuation of the trend in that direction. A surge above the channel is a bullish signal, while a fall under it is a bearish one. There are three different types of Parallel Channels. The Ascending variation occurs when the trendlines are sloped upwards. That is, it represents a phase of consolidation to the upside. Similarly, the Descending type involves the asset going down with time. In the context of the current topic, the third and most common variant is of interest. This type signifies a phase of true sideways movement, with the channel being parallel to the time-axis. Now, here is the chart shared by Martinez that shows the Parallel Channel that the 1-day price of Dogecoin has been moving inside for the last few months: As displayed in the above graph, the Dogecoin daily price recently saw a brief retest of the lower level of the Parallel Channel. This line of the pattern is generally considered a level of support, and indeed, it played this role during the recent retest as well by helping the memecoin to turn around. DOGE has since been on the way up. According to the analyst, the cryptocurrency is now targeting the $0.19 level, situated at the midway point of the Parallel Channel. In the event that Dogecoin can clear this level, it&#8217;s possible that the coin may set its sights on the $0.26 mark next. This price corresponds to the upper level of the pattern, which provided resistance to the memecoin on a couple of occasions in May. Related Reading: Bitcoin Short-Term Upper Bound Is $117,000, Glassnode Says From the current exchange rate, a surge to this line would imply an increase of more than 50%. It now remains to be seen how the asset&#8217;s trajectory would look in the near future and whether the lines of the Parallel Channel would play any part. DOGE Price At the time of writing, Dogecoin is floating around $0.172, up over 7% in the last week. Featured image from Dall-E, charts from TradingView.com"
    },
    {
      "title": "Bitcoin Price Coiling Up — Is a Surge Past $110K on Deck?",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-price-coiling-up-110k/",
      "summary": "Bitcoin price started a fresh increase above the $107,500 zone. BTC is now consolidating and might struggle to continue higher above the $110,000 resistance. Bitcoin started a fresh increase above the $108,500 zone. The price is trading above $108,000 and the 100 hourly Simple moving average. There is a short-term rising channel forming with support at $109,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it stays above the $107,850 zone. Bitcoin Price Consolidates Gains Bitcoin price started a fresh increase after it settled above the $105,500 resistance. BTC cleared many hurdles near $107,000 to start a decent increase. The bulls pushed the price in a positive zone above the $108,000 level. The price even spiked above the $110,000 level before the bears appeared. A high was formed near $110,578 and the price is now consolidating gains near the 23.6% Fib retracement level of the upward move from the $105,116 swing low to the $110,578 high. Bitcoin is now trading above $108,000 and the 100 hourly Simple moving average. Besides, there is a short-term rising channel forming with support at $109,500 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $110,000 level. The first key resistance is near the $110,500 level. A close above the $110,500 resistance might send the price further higher. In the stated case, the price could rise and test the $112,000 resistance level. Any more gains might send the price toward the $113,200 level. Downside Correction In BTC? If Bitcoin fails to rise above the $110,000 resistance zone, it could start another decline. Immediate support is near the $109,500 level and the channel’s trend line. The first major support is near the $108,800 level. The next support is now near the $107,850 zone and the 50% Fib retracement level of the upward move from the $105,116 swing low to the $110,578 high. Any more losses might send the price toward the $106,400 support in the near term. The main support sits at $105,000, below which BTC might continue to move down. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $108,800, followed by $107,850. Major Resistance Levels – $110,000 and $110,500."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Senator Lummis’ New Bill Enables Tax-Exempt Bitcoin Spending — But Thresholds Are Too Low",
      "link": "https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Senator-Lummis-at-Bitcoin-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/senator-lummis-new-bitcoin-tax-exemption-bill-is-insufficient-but-its-a-start\" rel=\"nofollow\"> </a></p> <p>Long-time Bitcoin advocate Senator Cynthia Lummis (R-WY) has drafted a bill that allows Bitcoin enthusiasts to spend small amounts of bitcoin without incurring capital gains taxes (which is very cool), but many — including myself — feel that the spending limits in the bill are too low.</p> <p>"
    },
    {
      "title": "Senator Lummis Introduces Digital Asset Tax Legislation",
      "link": "https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/US-Senator-Cynthia-Lummis-Discusses-Bitcoin-Reserve-Stablecoin-Legislation-and-Market-Structure-Bill-at-Bitcoin-2025-Conference.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/senator-lummis-introduces-digital-asset-tax-legislation\" rel=\"nofollow\"> </a></p> <p>The bill proposes a $300 exemption for small Bitcoin and crypto transactions, defers taxes on mining and staking until assets are sold.</p> <p>"
    },
    {
      "title": "Bitcoin Miner Riot Produces 450 Bitcoin In June",
      "link": "https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Miner-Riot-Produces-450-Bitcoin-In-June.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-miner-riot-produces-450-bitcoin-in-june\" rel=\"nofollow\"> </a></p> <p>The company saw a 76% year-over-year increase in production, earned $5.6 million in power credits, and ended the month holding 19,273 Bitcoin.</p> <p>"
    },
    {
      "title": "Bitcoin at UATX: A New Era of Intellectual Sovereignty",
      "link": "https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_A_majestic_depiction_of_the_Texas_State_Ca_0.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/business/bitcoin-at-uatx-a-new-era-of-intellectual-sovereignty\" rel=\"nofollow\"> </a></p> <p>UATX’s Bitcoin Endowment and hands-on curriculum defy academia’s past. Students mine with Antminer S9s — could this shape Bitcoin’s academic future? </p> <p>"
    },
    {
      "title": "Blue Star Capital Secures £1.25M For Bitcoin and Crypto Treasury Expansion",
      "link": "https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Blue-Star-Capital-Secures-1.25M-For-Bitcoin-and-Crypto-Treasury-Expansion.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/blue-star-capital-secures-1-25m-for-bitcoin-and-crypto-treasury-expansion\" rel=\"nofollow\"> </a></p> <p>The funding will be used to expand SatoshiPay’s Bitcoin and crypto treasury and enhance its crypto operations. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Detroit Sues Crypto Real Estate Platform Over Safety, Health Violations",
      "link": "https://decrypt.co/328586/detroit-sues-crypto-real-estate-platform-safety-health-violations",
      "summary": "The city alleges the asset tokenization platform left hundreds of properties in disrepair, even as it promised significant returns."
    },
    {
      "title": "UK and Singapore Forge New AI and Tokenization Pact in London Talks",
      "link": "https://decrypt.co/328583/uk-singapore-ai-tokenization-pact-london-talks",
      "summary": "Officials are exploring cooperation in digital finance, ranging from asset tokenization to artificial intelligence."
    },
    {
      "title": "Japan's Minna Bank Explores Stablecoins on Solana in Fireblocks-Led Study",
      "link": "https://decrypt.co/328372/japans-minna-bank-stablecoins-solana-fireblocks-study",
      "summary": "The study will examine whether stablecoins are suitable for modernizing payments and cross-border finance in Japan."
    },
    {
      "title": "House GOP Declares ‘Crypto Week’ to Advance Landmark Digital Asset Bills",
      "link": "https://decrypt.co/328567/house-gop-crypto-week-advance-landmark-digital-asset-bills",
      "summary": "House Republicans are coordinating a legislative blitz to reshape U.S. crypto regulation and block future state-issued digital currencies."
    },
    {
      "title": "Telegram's Crypto Ecosystem Notches Billion-Dollar Unicorn in The Open Platform",
      "link": "https://decrypt.co/328548/telegram-crypto-ecosystem-billion-dollar-unicorn-open-platform",
      "summary": "A key player in the Telegram-linked The Open Network (TON) crypto ecosystem just hit a $1 billion valuation with its latest funding round."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Trump’s ‘Big Beautiful Bill’ clears Congress after narrow House vote, what could this mean for Bitcoin?",
      "link": "https://cryptobriefing.com/trump-tax-bill-congress-vote/",
      "summary": "<p>The bill's passage may lead to a liquidity squeeze, impacting Bitcoin's price volatility and potentially increasing national debt concerns.</p> <p>"
    },
    {
      "title": "Senator Lummis proposes to exempt small crypto transactions from taxes, ending double taxation for miners and stakers",
      "link": "https://cryptobriefing.com/crypto-tax-reform-innovation-users/",
      "summary": "<p>The proposed tax reform could boost crypto adoption, enhance U.S. competitiveness in digital finance, and simplify tax compliance for users.</p> <p>"
    },
    {
      "title": "TON builder The Open Platform raises $28.5 million, reaches $1 billion valuation in extended Series A",
      "link": "https://cryptobriefing.com/ton-blockchain-funding-unicorn-status/",
      "summary": "<p>The funding and valuation boost for The Open Platform could accelerate global blockchain adoption, leveraging Telegram's extensive user base.</p> <p>"
    },
    {
      "title": "IMF denies Pakistan’s proposal to offer cheap power to Bitcoin, crypto miners",
      "link": "https://cryptobriefing.com/crypto-mining-electricity-pakistan-imf/",
      "summary": "<p>The IMF's rejection highlights challenges in balancing economic growth with sustainable energy policies in developing nations.</p> <p>"
    },
    {
      "title": "Bitcoin could retest $90K as Trump’s Big Beautiful Bill sets stage for liquidity crunch: Arthur Hayes",
      "link": "https://cryptobriefing.com/bitcoin-liquidity-risk-tga-refill/",
      "summary": "<p>A potential liquidity drain from US fiscal policies could temporarily pressure Bitcoin, but long-term bullish trends remain intact.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Celestia defies bears with 16% rally – But will profit-taking kill TIA?",
      "link": "https://ambcrypto.com/celestia-defies-bears-with-16-rally-but-will-profit-taking-kill-tia/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/F8A3934C-7882-4869-916C-0127A73E642D.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TIA has delivered gains for investors but still faces several hurdles."
    },
    {
      "title": "Dogecoin activity on the rise: Will it help DOGE hold $0.19 resistance?",
      "link": "https://ambcrypto.com/dogecoin-activity-on-the-rise-will-it-help-doge-hold-0-19-resistance/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-03T163209.626-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />DOGE rallies off support as whales accumulate and derivatives surge, but usage metrics remain weak."
    },
    {
      "title": "Ethereum-backed stocks are booming – Here’s what’s fueling the surge",
      "link": "https://ambcrypto.com/ethereum-backed-stocks-are-booming-heres-whats-fueling-the-surge/",
      "summary": "<img alt=\"Ethereum-backed stocks are booming - Here’s what’s fueling the surge\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ethereum-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The Ethereum spot ETF inflows have begun to climb higher since June, reflecting increased investor confidence."
    },
    {
      "title": "Ripple CEO confirms, ‘Linqto owns 4.7M shares’ – But denies any direct sale",
      "link": "https://ambcrypto.com/ripple-ceo-confirms-linqto-owns-4-7m-shares-but-denies-any-direct-sale/",
      "summary": "<img alt=\"Ripple CEO confirms, &#039;Linqto owns 4.7M shares&#039; - But denies any direct sale\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ripple-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Linqto's collapse has affected Ripple shareholders drastically."
    },
    {
      "title": "BlackRock’s Bitcoin ETF just outperformed its core S&P 500 fund in revenue",
      "link": "https://ambcrypto.com/blackrocks-bitcoin-etf-just-outperformed-its-core-sp-500-fund-in-revenue/",
      "summary": "<img alt=\"BlackRock’s Bitcoin ETF Outpaces\" class=\"attachment-full size-full wp-post-image\" height=\"961\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/BlackRocks-Bitcoin-ETF-Outpaces.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1708\" />Is Bitcoin replacing traditional assets in elite portfolios?"
    }
  ]
}