{
  "CoinDesk": [
    {
      "title": "Solana's SOL Jumps 5% on Report of Spot ETF Development",
      "link": "https://www.coindesk.com/markets/2025/06/10/solanas-sol-jumps-5-on-report-of-spot-etf-development",
      "summary": ""
    },
    {
      "title": "Ether Roars Past $2,700; Popular Trader Declares ‘Beast Mode’",
      "link": "https://www.coindesk.com/markets/2025/06/10/ether-roars-past-usd2-700-popular-trader-declares-beast-mode",
      "summary": ""
    },
    {
      "title": "Cathie Wood's ARK Invest: Bitcoin Gains Coming Alongside Clear Stress in Housing, Autos",
      "link": "https://www.coindesk.com/markets/2025/06/10/cathie-woods-ark-invest-bitcoin-gains-coming-alongside-clear-stress-in-housing-autos",
      "summary": ""
    },
    {
      "title": "House Ag Committee Advances Market Structure Bill, Other Crypto Actions Pending",
      "link": "https://www.coindesk.com/policy/2025/06/10/house-ag-committee-advances-market-structure-bill-other-crypto-actions-pending",
      "summary": ""
    },
    {
      "title": "Negative Rates Return to Switzerland as U.S. Faces Higher Yields. What Does it Mean for Bitcoin?",
      "link": "https://www.coindesk.com/markets/2025/06/11/negative-rates-are-back-in-switzerland-as-u-s-faces-higher-bond-yields-what-does-it-mean-for-bitcoin",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Franklin Templeton launches &#039;intraday yield&#039; for tokenized assets on Benji",
      "link": "https://cointelegraph.com/news/franklin-templeton-launches-intraday-yield-tokenized-assets-benji?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDQ1YzktNDYxYS03YjkzLTkzMjAtZWQxNzA0MTAwYzg3.jpg\" /></p><p>Yield for assets is often calculated over at least one-day periods, a problem that blockchain composability could address, according to the asset manager.</p>"
    },
    {
      "title": "Funding from crypto falls short in New Jersey gubernatorial primaries",
      "link": "https://cointelegraph.com/news/crypto-funding-new-jersey-gubernatorial-primaries?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzU1NzgtNDE1NS03ZDliLThiZWUtODg4MmNhZjYzOTU4.jpg\" /></p><p>Filings with the New Jersey Election Law Enforcement Commission showed only a few small contributions from individuals tied to crypto companies for various candidates.</p>"
    },
    {
      "title": "House Agriculture Committee advances crypto market structure bill",
      "link": "https://cointelegraph.com/news/house-committee-crypto-market-structure-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5NDA5Y2MtOTM5YS03NjQ1LWI4NTYtOGU4MWE2ODIwYjk4.jpg\" /></p><p>The US House Agriculture Committee voted to advance the CLARITY Act for digital assets as lawmakers in the House Financial Services Committee debated an amendment for developers.</p>"
    },
    {
      "title": "Bitcoin’s &#039;fair value&#039; could be as high as $230K: Bitwise analysts",
      "link": "https://cointelegraph.com/news/bitcoin-fair-value-could-be-as-high-as-230k-bitwise-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVhNDMtMzBmYS03ODY1LWFlYTctOTQxNzJkNGZhNjFl.jpg\" /></p><p>Trump’s tax cuts and soaring US debt fuel Bitcoin’s rise as a hedge against sovereign default risks, potentially pushing BTC price toward $200,000 or more by 2025.</p>"
    },
    {
      "title": "How to use Grok for real-time crypto trading signals",
      "link": "https://cointelegraph.com/news/how-to-use-grok-for-crypto-trading?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVhZGMtNWZlYy03YzZjLWJkMmYtNGFkMzZiNTUwMzE1.jpg\" /></p><p>Grok scans posts and sentiment shifts on X to help crypto traders identify early signals, memes and macro-driven momentum plays.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Fortune 500 blockchain adoption hits 60% as institutions inject $50B into crypto funds in Q1",
      "link": "https://cryptoslate.com/fortune-500-blockchain-adoption-hits-60-as-institutions-inject-50b-into-crypto-funds-in-q1/",
      "summary": "<p>Fortune 500 companies and global asset managers continued to expand blockchain activity and allocations during the first half of 2025, according to Coinbase’s latest State of Crypto report. Six in ten Fortune 500 executives say their firms run on-chain initiatives, and the average number of projects per company jumped to 9.7 from 5.8 year on [&#8230;]</p> <p>"
    },
    {
      "title": "Blockchain Group wins approval for $11B raise to execute aggressive Bitcoin acquisitions",
      "link": "https://cryptoslate.com/blockchain-group-wins-approval-for-11b-raise-to-execute-aggressive-bitcoin-acquisitions/",
      "summary": "<p>The Blockchain Group on June 10 won shareholder approval to raise more than €10 billion ($11 billion) for additional Bitcoin (BTC) purchases effective immediately, formalizing a proposal first aired one day earlier. During an ordinary and extraordinary general meeting, investors holding 39% of voting rights backed every resolution with support exceeding 95%, according to a [&#8230;]</p> <p>"
    },
    {
      "title": "Guggenheim chooses Ripple’s XRPL for latest tokenized commercial paper issuance",
      "link": "https://cryptoslate.com/guggenheim-chooses-ripples-xrpl-for-latest-tokenized-commercial-paper-issuance/",
      "summary": "<p>Guggenheim Partners is bringing its Treasury-backed fixed-income product to the XRP Ledger (XRPL) through a new partnership with Ripple, Bloomberg News reported on June 10. Guggenheim Treasury Services, a subsidiary of the investment giant, will offer tokenized US commercial paper with customized maturity terms of up to 397 days on XRPL. The product is fully [&#8230;]</p> <p>"
    },
    {
      "title": "Alby faces backlash over ‘inactivity fees’ leading to unexpected Bitcoin withdrawals",
      "link": "https://cryptoslate.com/alby-faces-backlash-over-inactivity-fees-leading-to-unexpected-bitcoin-withdrawals/",
      "summary": "<p>Alby, a Bitcoin Lightning Network wallet, is facing mounting criticism after several users reported unexpected withdrawals from their accounts. The deductions, described as inactivity fees, have raised concerns about transparency and custodial risks. Community complaints against Alby The controversy gained traction on June 10 after Yu Xian, co-founder of blockchain security firm SlowMist, disclosed that [&#8230;]</p> <p>"
    },
    {
      "title": "80% of CME crypto futures expire by August",
      "link": "https://cryptoslate.com/80-of-cme-crypto-futures-expire-by-august/",
      "summary": "<p>CME’s Bitcoin futures and options structure has become increasingly condensed and cautious, with the vast majority of notional exposure now expiring within the next four weeks. At the same time, the annualized basis curve has flattened to its narrowest level since April, offering minimal incentive for arbitrage-driven carry trades and limited insight into longer-term market [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana Bounces Back: Bullish Wave Builds Above $155 After Sharp Dip",
      "link": "https://www.newsbtc.com/news/solana/solana-bullish-wave-builds/",
      "summary": "In a recent post on X, crypto analyst Grayhoood observed that Solana (SOL) is currently showing signs of a bullish trend. Over the past 24 hours, the price has climbed by 2.8%, with candlestick charts revealing a noticeable upward trajectory. Solana Stochastics And CCI Signal Short-Term Strength Earlier in the day, SOL briefly dipped to around $151 but managed to recover steadily, reaching a current price of $155.35. Grayhoood pointed out that this short-term strength is consistent with Solana’s 7-day performance, which shows a modest 1.4% increase. However, the longer-term outlook remains volatile, with SOL still down by 3.9% over the past year. Related Reading: Solana Picture Bigger Than $420: Analyst Predicts 140% Surge To New ATHs Grayhoood revealed that technical indicators are suggesting a cautiously optimistic outlook for SOL. As price action continues to show signs of recovery, the Relative Strength Index (RSI) is likely positioned in a neutral zone, indicating the recent uptick. This positioning allows space for further gains, but also signals a potential shift into overbought territory if SOL’s price surges too rapidly. The Stochastic Oscillator and Commodity Channel Index (CCI) also point to short-term bullish momentum, especially with SOL breaking through the $154 resistance level. These indicators suggest that buyers are regaining control. However, Grayhoood cautioned that while momentum appears to be building, the recent price dip observed earlier in the day reveals that sellers are not entirely out of the picture. Recovery Gains Traction, But Yearly Losses Still Weigh In To further reinforce his claim, the analyst pointed to Solana’s moving averages, which currently present a mixed but insightful technical outlook. In the short term, the 7-day and 14-day moving averages hint at a hold or mild buying pressure. This aligns with SOL’s recent bounce from $151 to $155.35, signaling that momentum may be shifting in favor of the bulls. Related Reading: Solana’s Old Hands Are Moving—Is Trouble Brewing? However, when viewed from a broader lens, long-term averages continue to reflect lingering weakness. The 30-day and yearly trends, which show declines of 9.3% and 3.9% respectively, suggest that the larger market remains cautious. These figures reveal that while the recent gains are encouraging, they have not fully reversed the bearish structure seen over the past months. Overall, the analyst believes that despite the volatility seen over the past few weeks, market sentiment is beginning to lean bullish in the short term. Solana’s recent performance, supported by its ability to reclaim key levels and maintain upward momentum, offers a more favorable outlook heading into the near future. If current trends persist and key resistances are successfully challenged, the path may open for a broader shift in sentiment. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "XRP Price: Analyst Says Expect Biblical Move Before Historic Crash – Here Are The Targets",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-biblical-move-before-crash/",
      "summary": "XRP might be gearing up for a bullish run of epic proportions, accompanied by a similar crash of epic proportions. Particularly, a new technical analysis suggests that the XRP price may be preparing for one of its most explosive moves yet, followed by what the analyst calls a historic crash. This analysis comes amidst a backdrop of XRP reclaiming $2.2 in the past 24 hours, with the next outlook on reclaiming $2.3. Echoes of 2017: Hidden Bullish Divergence Reappears In a detailed breakdown shared on the social media platform X, crypto analyst JD (@jaydee_757) drew parallels between the current setup of XRP&#8217;s price action and its 2017–2018 market cycle. Back then, XRP printed a hidden bullish divergence (HBD) on the Stochastic RSI indicator, which acted as a powerful signal for an eventual 20x surge. According to the analyst, XRP appears to be repeating the same structural formation, with a new hidden bullish divergence now confirmed once again on the two-week timeframe. Related Reading: Analysts Are Predicting XRP Price To Climb Above $20 In Unexpected Rally As shown in the two-week candlestick timeframe chart below, XRP has already broken out from a multi-year symmetrical triangle dating back to its peak in 2018. This breakout, paired with the hidden bullish divergence, sets the stage for a biblical price move. JD projects an immediate upside continuation once the current smaller triangle consolidation pattern resolves to the upside. This parabolic upside continuation is likely to push XRP toward levels last seen during its all-time high. In this case, the analyst projected a price move above the double-digit threshold, with a target around $17. Post-Rally Warning: 90% Crash Projection Follows However, JD&#8217;s analysis is not without caution. Just as the 2017 rally ended in a dramatic 94% crash from $3.4 to the $0.2 range, the analyst warned that the anticipated surge could lead to a similar fate. This trajectory is illustrated clearly in the chart above. Related Reading: XRP Price Risks Crash Below $2 As Correction Takes Hold, Here’s Why After the anticipated euphoric move upward is complete, JD projects a sharp reversal toward a designated pink box area on the chart. This region, although not labeled with a specific price, lies well below current levels and may cause XRP to crash from double digits to below $1. Unfortunately, the majority of traders and investors could get rekt if they chase XRP near the peak. This follows similar behavior in 2018, where the parabolic rally was followed by an equally violent sell-off that trapped many traders at the top. As of now, XRP continues to coil within its consolidation triangle, and the breakout direction will likely determine the short-term fate of the cryptocurrency. XRP is currently trading at $2.28, up by 2.4% in the past 24 hours. A convincing break above the $3 mark would be necessary to invalidate the resistance of the current smaller triangle consolidation pattern and confirm the start of a parabolic move. Until then, there&#8217;s still a possibility that XRP will be rejected again at the triangle&#8217;s upper trendline. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Chainlink Cross-Border Play Expands To Hong Kong–Australia Money Movement",
      "link": "https://www.newsbtc.com/altcoin/chainlink-cross-border-play-expands-to-hong-kong-australia-money-movement/",
      "summary": "Chainlink is set to play a major role as Hong Kong’s central bank takes a big step in its digital currency tests. Phase two of the e-HKD pilot will try moving tokenized Hong Kong dollars across borders. The plan is to swap e-HKD for A$DC, an Australian dollar stablecoin. This could cut settlement times from days to seconds. It may also show how central banks can work together with blockchain technology. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Hong Kong And Australia Test Digital Cash According to reports, the project will use Chainlink’s Cross-Chain Interoperability Protocol, or CCIP, to handle transfers. The goal is simple. Move money in real time and make sure both sides get what they expect. Phase two kicks off with Hong Kong authorities and their counterparts in Australia. They will swap e-HKD for A$DC and aim for instant settlement. Based on reports, this setup could serve as a model for other central banks. We’re excited to share that Chainlink is facilitating the secure exchange of a Hong Kong CBDC and an Australian dollar stablecoin as part of an ongoing use case in Phase 2 of the e-HKD+ Pilot Program. Congratulations to participants @Visa, ANZ, China AMC, and Fidelity… pic.twitter.com/ts2C6Vt4Ul — Chainlink (@chainlink) June 9, 2025 Chainlink Tools In Use Chainlink is not just a name in the mix. It brings two big pieces of tech to the table. CCIP handles the cross-chain messages, acting like a bridge between different blockchains. The Digital Transfer Agent, or DTA, deals with compliance. It keeps track of who owns what token and makes sure rules in different countries are met. In May, World Liberty Financial tapped Chainlink for cross-chain stablecoin transfers covering USD1. That earlier deal hinted at what’s possible this time around. Big Names Join The Pilot Visa and ANZ are helping with payment processing for e-HKD and A$DC. Asset managers Fidelity International and ChinaAMC will also take part. Their job is to manage the tokenized funds on both sides. This mix of banks, asset managers and tech firms shows the project is more than a small test. It has real money and real risks involved. Reports disclosed that those risks are managed by a Payment-versus-Payment model. This means funds are only released when both sides confirm they have received the other asset. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Market Moves And Reactions LINK, the token for Chainlink, jumped by 6% after news of the pilot broke. It now trades at $14.70. That rise follows a wider market rally driven by hopes that Bitcoin may hit $110,000 before the week’s end. According to market data, crypto traders often chase big targets. Short-term gains can be tempting. But they can also lead to quick sell-offs if the main story fades. Despite the rally, Bitcoin still tracks the equity swings rather closely. There is a mix of bulls and bears in futures data that suggests some people are not yet convinced this run will last. High volatility can shake out weaker hands at the first sign of trouble. A sudden change in risk sentiment or a fresh macro shock can quickly reverse gains. Featured image from Imagen, chart from TradingView"
    },
    {
      "title": "Dogecoin Primed For Liftoff If It Can Break This Barrier: Key Price Targets",
      "link": "https://www.newsbtc.com/news/dogecoin/dogecoin-liftoff-break-this-barrier-key-price-targets/",
      "summary": "Dogecoin skidded to a low near $0.168 last week before snapping higher to trade around $0.19 on Tuesday morning, up roughly six percent over 24 hours. The rebound unfolded in lock-step with bitcoin’s own recovery from the technically charged $106,800 level to just above $109,000, re-invigorating short-term dip-buyers across the memecoin complex. Dogecoin Needs To Conquer This Price Level Technical analyst Kevin (@Kev_Capital_TA) argues that the Fib defence has restored bullish structure—but only up to a point. “After coming down to the .382 Fib Dogecoin finally found the support it needed along with BTC finding support at 100K,” he wrote. “As it goes for the immediate future of **DOGE it has a lot of work to do. Big resistance at .19-.21 cent range will need to be broken in order to head back up to that .26-.28 level. Indicators on the daily time frame look bullish.” Bitcoin’s behaviour therefore remains pivotal. Spot BTC is hovering near $109,000 this morning and has so far defended the $106,800 pivot flagged by several high-profile analysts, including Michael van de Poppe, as the “linchpin for a potential rally”. Should Bitcoin extend toward the $120,000-$130,000 band, Kevin argues that Dogecoin will decouple from its dependence on the benchmark “when dominance tops and the market sniffs out easing monetary policy.” Crypto pundit Chandler (“@ChandlerCharts”) is less sanguine. Overlaying DOGE’s four-day price against DOGE/BTC, market cap and a relative-strength oscillator, his graphic highlights three prior compression phases—shaded grey—where the memecoin failed to sustain outperformance against Bitcoin. Related Reading: Bloodbath Incoming? Dogecoin Must Hold This Level To Survive “Even if DOGE breaks above its November highs, it won’t feel great if DOGE/BTC ends up way lower than it was at the November highs,” he cautioned. Chandler calculates that with BTC at $107,600, Dogecoin would have to print roughly $0.52 simply to reach a higher high against Bitcoin. “If BTC runs to $120-130k, DOGE needs to be around $0.60+ for holding DOGE to make sense over BTC.” Related Reading: Dogecoin Is Going To $1 With The ‘Next Impulse’, Analyst Predicts That threshold underscores the importance of the $0.19-$0.21 supply zone visible on both analysts’ charts. On Kevin’s canvas it coincides with the 0.618-0.703 Fib cluster; on Chandler’s, it overlaps the upper edge of an eighteen-month value area that has repeatedly rejected upside probes. A decisive close above $0.211 would place the May 11 summit at $0.2597 back in play and, more importantly for bulls. For now, traders are watching two numbers: $106,800 on Bitcoin and $0.21 on Dogecoin. A clean break of the latter would validate Kevin’s bullish roadmap toward $0.26-$0.28 and, by extension, keep alive the possibility of Chandler’s higher-high scenario on the DOGE/BTC cross. Until then, the memecoin’s fate indeed “remains in the hands of BTC’s capability in heading higher.” At press time, DOGE traded at $0.19. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Price Eyes 38% Jump To $3,500 As 50EMA Swims Into View",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-price-eyes-38-jump/",
      "summary": "Crypto analyst Crypto Bullet has raised the possibility of the Ethereum price surging by 38% soon. He alluded to the 50EMA as the only thing holding ETH from witnessing this price surge, but suggested that it could change soon with a breakout on the horizon. Ethereum Price Eyes 38% Jump To $3,500 In an X post, Crypto Bullet predicted that the Ethereum price could record a 38% surge to $3,500. This came following as he highlighted the ongoing battle between ETH and the 50EMA, noting that this indicator was the only thing holding the altcoin back from a parabolic surge. The analyst added that on average, a breakout results in a 38% pump, which puts Ethereum exactly at $3,500. Related Reading: Pundit Says Do Not Ignore Ethereum Amid New All-Time Highs In Major Metric As reported, Crypto Bullet also recently predicted that the Ethereum price could rally to $3,300 as a Morningstar Candle pattern formed. Back then, he noted that ETH was facing tough resistance at $2,500 but affirmed that the resistance would be broken in due time. He indicated that a breakout from that resistance will usher in the rally to $3,300. The Ethereum price has now broken above the $2,500 resistance, which provides a bullish outlook for the largest altcoin by market cap. Based on Crypto Bullet’s prediction, a rally to $3,300 may already be underway, which could then lead ETH to the $3,500 target. In a more recent X post, the crypto analyst commented on the recent break above $2,500. He stated that the Ethereum price is now trying to break the 200-day MA, which is between $3,000 and $3,300, for the fifth time. He indicated that a breakout above the range is likely to happen on this fifth attempt. His accompanying showed that ETH could rally to the $4,000 level if a successful breakout occurs. ETH About To Begin A New Bull Run Crypto analyst Trader Tardigrade predicted that another bull run is about to start for the Ethereum price. He noted that ETH’s daily candle closed above the resistance level at $2,650 yesterday and also opened above this resistance level today. The analyst added that ETH is now moving above it, which signals the start of a new bull run. Related Reading: FTX Repayments About To Dump $5B On The Market, How Will Bitcoin And Ethereum React? His accompanying chart showed that the Ethereum price is breaking out of an ascending triangle, which could send the altcoin above the psychological $3,000 level. Crypto analyst Mikybull Crypto also declared that Ethereum’s breakout will be huge, with ETH still maintaining its current range between $2,400 and $2,600. At the time of writing, the Ethereum price is trading at around $2,670, up over 7% in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Officially Traded Above $100,000 For 30 Consecutive Days For The First Time",
      "link": "https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Officially-Traded-Above-100000-For-30-Consecutive-Days-For-The-First-Time.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time\" rel=\"nofollow\"> </a></p> <p>Bitcoin holds above $100K for 30 days as states, banks, and companies accelerate adoption.</p> <p>"
    },
    {
      "title": "The Trump’s American Bitcoin Merges with Gryphon, Reports 215 BTC on Balance Sheet Since Launch",
      "link": "https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ABTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch\" rel=\"nofollow\"> </a></p> <p>American Bitcoin Corp (ABTC), a newly formed private Bitcoin mining company backed by Eric Trump and Donald Trump Jr., announced in a June 10 SEC filing that it has acquired 215 Bitcoin (BTC) since launching operations on April 1, 2025. The reserve is currently valued at approximately $23 million, showing their drive and commitment to [&#8230;]</p> <p>"
    },
    {
      "title": "Canaan Announces Record Bitcoin Mining Month with Over 109 BTC Mined",
      "link": "https://bitcoinmagazine.com/news/canaan-announces-record-bitcoin-mining-month-with-over-109-btc-mined",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Canaan-Announces-Record-Bitcoin-Mining-Month-with-Over-109-BTC-Mined.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/canaan-announces-record-bitcoin-mining-month-with-over-109-btc-mined\" rel=\"nofollow\"> </a></p> <p>Canaan Inc. reported mining 109 bitcoins in the month of May. Now holding 1,466 BTC.</p> <p>"
    },
    {
      "title": "Quantum BioPharma Boosts Digital Asset Holdings to $5 Million with New Bitcoin Purchase",
      "link": "https://bitcoinmagazine.com/news/quantum-biopharma-boosts-digital-asset-holdings-to-5-million-with-new-bitcoin-purchase",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Quantum-Biopharma-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/quantum-biopharma-boosts-digital-asset-holdings-to-5-million-with-new-bitcoin-purchase\" rel=\"nofollow\"> </a></p> <p>In an expansion of its digital asset portfolio, Quantum BioPharma Ltd. has announced the purchase of an additional $500,000 in Bitcoin and other cryptocurrencies, bringing its total holdings to USD $5,000,000. The Canadian biopharmaceutical company made the move after securing approval from its Board of Directors. “Quantum BioPharma Ltd. is pleased to announce that after [&#8230;]</p> <p>"
    },
    {
      "title": "Robert Mitchnick Discusses BlackRock’s Bitcoin ETF IBIT Success On Bloomberg",
      "link": "https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Robert-Mitchnick-Discusses-BlackRocks-Bitcoin-ETF-IBIT-Success-On-Bloomberg.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/robert-mitchnick-discusses-blackrocks-bitcoin-etf-ibit-success-on-bloomberg\" rel=\"nofollow\"> </a></p> <p>BlackRock’s Head of Digital Assets, Robert Mitchnick, explains the key factors driving the surge in Bitcoin ETFs.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Crypto Market Structure Bill Passes One House Committee, But Faces Steep Climb in Another",
      "link": "https://decrypt.co/324464/crypto-market-structure-clarity-act-passes-house-committee-faces-steep-climb",
      "summary": "The crypto market structure bill needs to pass both the House Agriculture and Financial Services committees to reach a full floor vote."
    },
    {
      "title": "What Is ‘Bitcoin Miner’? This Free iOS and Android Game Pays Real BTC",
      "link": "https://decrypt.co/resources/what-is-bitcoin-miner-free-ios-android-game-pays-real-btc",
      "summary": "Bitcoin Miner turns the crypto mining grind into a colorful mobile game, plus it pays you actual BTC for playing. Here’s what you need to know."
    },
    {
      "title": "AI Sparks Fear and 'Obsolescence' Among UK Film Industry",
      "link": "https://decrypt.co/324433/ai-fear-obsolescence-uk-film-industry",
      "summary": "UK film industry grapples with AI fears as new report warns of job losses and copyright threats, while others see creative opportunities ahead."
    },
    {
      "title": "These Three Meme Coins Are Flashing Bullish Signals: Analysis",
      "link": "https://decrypt.co/324436/these-three-meme-coins-are-flashing-bullish-signals-analysis",
      "summary": "Meme coins are mooning again, and there's at least three tokens that stand out among the pack."
    },
    {
      "title": "Ethereum Governance Tokens Spike as SEC Backs ‘Innovation Exemption’ for DeFi Projects",
      "link": "https://decrypt.co/324427/ethereum-governance-tokens-spike-as-sec-backs-innovation-exemption-for-defi-projects",
      "summary": "Uniswap, Aave, and Sky all started out as platforms on Ethereum."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Pro-Bitcoin Scott Bessent emerges as candidate for next Fed chair",
      "link": "https://cryptobriefing.com/fed-chair-successor-bessent-powell/",
      "summary": "<p>Bessent's potential Fed chair candidacy highlights a shift towards integrating cryptocurrency perspectives in U.S. monetary policy.</p> <p>"
    },
    {
      "title": "Solana ETFs could be approved in 3-5 weeks, SEC signals openness to staking",
      "link": "https://cryptobriefing.com/solana-etf-approval-potential-signals/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional investment in crypto, enhancing market legitimacy and innovation.</p> <p>"
    },
    {
      "title": "Wall Street’s Guggenheim Treasury brings its flagship tokenized debt instrument to XRP Ledger",
      "link": "https://cryptobriefing.com/guggenheim-treasury-launches-tokenized-commercial-paper-xrp-ledger/",
      "summary": "<p>The integration of tokenized debt on the XRP Ledger could accelerate blockchain adoption in traditional finance, enhancing liquidity and efficiency.</p> <p>"
    },
    {
      "title": "Eric Trump-backed American Bitcoin discloses 215 BTC holdings",
      "link": "https://cryptobriefing.com/american-bitcoin-btc-disclosure/",
      "summary": "<p>The strategic focus on Bitcoin accumulation by American Bitcoin could influence market dynamics and drive broader adoption and infrastructure development.</p> <p>"
    },
    {
      "title": "French banking giant Société Générale confirms launch of new stablecoin on Ethereum and Solana",
      "link": "https://cryptobriefing.com/usd-coinvertible-launch-sg-forge/",
      "summary": "<p>Socit Gnrale's stablecoin launch signifies a pivotal shift in traditional banking towards embracing blockchain technology and digital finance.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Uniswap: As UNI surges 14%, can it hold amid liquidity woes?",
      "link": "https://ambcrypto.com/uniswap-as-uni-surges-14-can-it-hold-amid-liquidity-woes/",
      "summary": "<img alt=\"Uniswap\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250610_102454_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Uniswap rebounds as holders surge, treasury strengthens, and derivatives traders stay bullish despite spot market pressure."
    },
    {
      "title": "BlackRock’s Bitcoin fund hits $70B faster than any ETF in history",
      "link": "https://ambcrypto.com/blackrocks-bitcoin-fund-hits-70b-faster-than-any-etf-in-history/",
      "summary": "<img alt=\"BlackRock’s Bitcoin Fund hits records\" class=\"attachment-full size-full wp-post-image\" height=\"918\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BlackRocks-Bitcoin-Fund-hits-records.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1632\" />With this pace, could BlackRock’s Bitcoin ETF really surpass Satoshi Nakamoto as the world’s biggest BTC holder?"
    },
    {
      "title": "BNB transactions jump 275%: Can price break the $675 resistance?",
      "link": "https://ambcrypto.com/bnb-transactions-jump-275-can-price-break-the-675-resistance/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-10T131816.287-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />BNB shows explosive on-chain growth, but resistance and liquidation zones could delay a breakout."
    },
    {
      "title": "SEC’s Paul Atkins pledges DeFi, self-custody support – How this affects Ethereum",
      "link": "https://ambcrypto.com/secs-paul-atkins-pledges-defi-self-custody-support-how-this-affects-ethereum/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/SECPaulAtkins.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Atkins said the agency will consider a conditional “innovation exemption” to drive on-chain products."
    },
    {
      "title": "HYPE rockets 11% as Bitcoin climbs – But what happens if $40 fails again?",
      "link": "https://ambcrypto.com/hype-rockets-11-as-bitcoin-climbs-but-what-happens-if-40-fails-again/",
      "summary": "<img alt=\"HYPE rockets 11% as Bitcoin climbs - But what happens if $40 fails again?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-1-5.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />HYPE’s rising fast - but is a shakeout next?"
    }
  ]
}