{
  "CoinDesk": [
    {
      "title": "Bitcoin ETP With DeFi Yield Goes Live in Europe",
      "link": "https://www.coindesk.com/markets/2025/07/01/bitcoin-etp-with-defi-yield-goes-live-in-europe",
      "summary": ""
    },
    {
      "title": "Robinhood, Kraken-Backed Global Dollar (USDG) Comes to Europe",
      "link": "https://www.coindesk.com/business/2025/07/01/robinhood-kraken-backed-global-dollar-usdg-comes-to-europe",
      "summary": ""
    },
    {
      "title": "XRP, TRX, DOGE Lead Majors With Positive Funding Rates as Bitcoin's Traditionally Weak Quarter Begins",
      "link": "https://www.coindesk.com/markets/2025/07/01/xrp-trx-doge-lead-majors-with-positive-funding-rates-as-bitcoin-s-traditionally-weak-quarter-begins",
      "summary": ""
    },
    {
      "title": "Asia Morning Briefing: Are Distributed Compute Tokens Undervalued Vs CoreWeave?",
      "link": "https://www.coindesk.com/markets/2025/06/30/asia-morning-briefing-are-distributed-compute-tokens-undervalued-vs-coreweave-crwv",
      "summary": ""
    },
    {
      "title": "Senator Seeks to Waive U.S. Taxes on Small-Scale Crypto Activity in Big Budget Bill",
      "link": "https://www.coindesk.com/policy/2025/06/30/senator-seeks-to-waive-us-taxes-on-small-scale-crypto-activity-in-big-budget-bill",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "DOJ charges 4 North Koreans in $1M crypto theft from blockchain startup",
      "link": "https://cointelegraph.com/news/north-korean-it-workers-charged-crypto-theft?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M0ZDItNGU4Mi03ZDllLTkwZmQtMjM5MmZkOGM0NmZi.jpg\" /></p><p>Four North Koreans posed as remote developers for US and Serbian blockchain firms, stealing almost $1 million in crypto to fund the regime’s illicit programs.</p>"
    },
    {
      "title": "Katana’s mainnet debuts with $200M in active DeFi deposits",
      "link": "https://cointelegraph.com/news/katana-defi-layer2-mainnet-launch-200m-productive-tvl?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5N2MwMjktMzRmYS03NmZiLWIzNTUtNDJiYzVjNDNiODNm.jpg\" /></p><p>Katana, a new DeFi-first layer-2 blockchain, launched with over $200 million in productive TVL, offering institutional-grade liquidity strategies and native asset support.</p>"
    },
    {
      "title": "Trump’s Big Beautiful Bill in overtime as senators jam crypto clauses",
      "link": "https://cointelegraph.com/news/trump-big-beautiful-bill-overtime-senators-cram-crypto-amendments?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDg0NDUtMGUxZC03YmRhLTgwODgtODRkZWYxNGM1YWYx.jpg\" /></p><p>US senators are in a marathon vote-a-rama over amendments to Donald Trump’s massive tax and spending bill, with one lawmaker bidding to include tax cuts for crypto.</p>"
    },
    {
      "title": "Major German bank to offer crypto trading by 2026 amid bank ‘FOMO’",
      "link": "https://cointelegraph.com/news/german-banking-giant-to-adopt-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2MzZGUtYzRkMi03NWFkLTk5YzAtMDM1NmIzOGJlMWUy.jpg\" /></p><p>Sparkassen-Finanzgruppe execs once ruled out adopting crypto over concerns of volatility and risk, and the banking giant also blocked customer crypto transactions back in 2015.</p>"
    },
    {
      "title": "Trump-linked American Bitcoin raises $220M for mining, treasury",
      "link": "https://cointelegraph.com/news/trump-linked-american-bitcoin-raises-220m-for-bitcoin-mining-ops-and-treasury?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2MzZDUtMjJmNi03YjI2LTljZmMtMDMwNWYxMjJjMjEw.jpg\" /></p><p>The raise includes a transaction of $10 million where the company accepted Bitcoin instead of cash.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "DEXs capture almost 30% of CEX spot activity in June, setting new record",
      "link": "https://cryptoslate.com/dexs-capture-almost-30-of-cex-spot-activity-in-june-setting-new-record/",
      "summary": "<p>Decentralized exchanges (DEX) processed roughly $385 billion of spot trades in June, equal to almost 30% of the turnover recorded by centralized venues, according to DefiLlama and The Block data. The 30-day DEX figure represents a 12% decline from May, but centralized exchange (CEX) spot volume contracted nearly 30% in the same period. Notably, this [&#8230;]</p> <p>"
    },
    {
      "title": "German banking giant Sparkassen to offer crypto trading to 50 million customers by 2026",
      "link": "https://cryptoslate.com/german-banking-giant-sparkassen-to-offer-crypto-trading-to-50-million-customers-by-2026/",
      "summary": "<p>Germany’s largest banking group, Sparkassen-Finanzgruppe, is preparing to offer crypto trading services to its retail clients by summer 2026, Bloomberg News reported on June 30. The move represents a significant policy shift for Sparkassen, which had previously avoided crypto offerings due to concerns about volatility and risk. According to the report, the bank’s board of [&#8230;]</p> <p>"
    },
    {
      "title": "Circle targets federally regulated trust status to manage stablecoin reserves, offer custody services",
      "link": "https://cryptoslate.com/circle-targets-federally-regulated-trust-status-to-manage-stablecoin-reserves-offer-custody-services/",
      "summary": "<p>Circle applied to charter First National Digital Currency Bank to become a federally regulated trust that would manage USDC reserves and expand custody services for institutional clients. According to a June 30 announcement, Circle applied to the Office of the Comptroller of the Currency (OCC), seeking authority to operate as a national trust bank subject [&#8230;]</p> <p>"
    },
    {
      "title": "Macro conditions keep Bitcoin boxed between $100k and $110k, bulls awaiting catalyst",
      "link": "https://cryptoslate.com/macro-conditions-keep-bitcoin-boxed-between-100k-and-110k-bulls-awaiting-catalyst/",
      "summary": "<p>Bitcoin (BTC) is in a &#8220;waiting game,&#8221; trading between $100,000 and $110,000, with analysts highlighting the need for a macro catalyst to break the top of the channel. The latest &#8220;Bitfinex Alpha&#8221; report noted lighter spot activity, softer taker-buy flow, and profit-taking by wallets that had bought below $80,000 in April as the reasons behind [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum poised for $3,000 with regulatory tailwinds and ETF demand",
      "link": "https://cryptoslate.com/ethereum-poised-for-3000-with-regulatory-tailwinds-and-etf-demand/",
      "summary": "<p>Recent tailwinds such as staking on exchange-traded funds (ETFs) and regulatory clarity may drive Ethereum (ETH) toward $3,000 in the coming weeks, according to a note by MEXC Research. As of press time, ETH was trading at $2,510, up 3% over the past 24 hours. MEXC Research linked the upside scenario to two key drivers: [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana Summer Loading? SOL Eyes $180 Following Staked ETF-Fueled Breakout",
      "link": "https://www.newsbtc.com/news/solana-summer-loading-sol-eyes-180-following-staked-etf-fueled-breakout/",
      "summary": "Solana (SOL) has retested a crucial resistance level after recovering the $150 level over the weekend. The surge, fueled by the upcoming launch of a SOL-based staked exchange-traded fund (ETF), has led some analysts to forecast a rally toward the next key target. Related Reading: Bitcoin Price At $145,000 In September? Bullish Dojis Suggest Upward Move Solana Staked ETFs Coming On Wednesday On Monday, Solana’s price soared to a key resistance level following the introduction of “the first-ever Solana staked crypto ETF in the US.” Rex Shares announced it will launch a Solana-based staked ETF this Wednesday, aiming to offer exposure to SOL and staking rewards. According to the X post, the REX-Osprey ETF will track SOL’s performance while “generating yield through on-chain staking,” starting a “new era of yield-generating crypto exposure.” As a result, Solana climbed to the $160 barrier, which led to nearly $9 million in short positions liquidated on Monday afternoon. Market Watcher Daan Crypto Trades considers Solana “bounced nicely over the weekend” but has yet to turn the Low Timeframe (LTF) trend around. He explained that reclaiming the $159-$167 area is necessary to aim for higher levels. Additionally, the Daily 200-day Moving Average (MA) and Exponential Moving Average (EMA) are currently located within this range. “I would want to see price trade back above that to start targeting the $180-$200 region again,” he detailed. Nonetheless, the trader questioned whether a Solana spot ETF-driven rally will fuel the cryptocurrency’s run. Notably, multiple investment firms, including Grayscale, VanEck, 21Shares, and Bitwise, have filed with the Securities and Exchange Commission (SEC) to launch a spot SOL ETF in the US. According to recent reports, the investment products have a “high likelihood” of being approved in the coming weeks, which has seemingly fueled investors’ expectations of a bullish “Solana Summer.” “The big question is how much demand there will be,” Daan asserted, noting that Ethereum (ETH) sport ETFs, approved in July 2024, had a disappointing launch and “only started seeing decent inflows about a year later.” SOL Ready For Another Breakout? Following the ETF-fueled breakout, analyst Hardy noted Solana’s “Textbook move, clean breakout, clean retest, and pump,” which could trigger a run toward the $200 barrier. Notably, the cryptocurrency saw a remarkable performance over the weekend, reclaiming the $144-$148 crucial area and breaking past the $150 mark. Amid this performance, the analyst highlighted that Solana had broken out of its local downtrend line after reclaiming the $148 resistance and was retesting the breakout zone. He explained that there is “Juicy liquidity sitting above, ready to be taken,” adding that Solana needed to hold the $150 support to continue its bullish run toward the next target. Related Reading: Analyst Reveals Rational Behind XRP Price Reaching $9.5 And $37.5 Meanwhile, analyst Crypto Batman considers that Solana is “setting up very nicely” after the $160 retest. Per"
    },
    {
      "title": "Ethereum At Risk? If $2,200 Cracks, $1,160 May Be Coming",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-risk-2200-cracks-1160-may-be-coming/",
      "summary": "Ethereum currently has strong support at $2,200, but one analyst has pointed out that if the level fails, the next region to watch could be $1,160. On-Chain Data Shows Strong Ethereum Demand Zone Near $2,200 In a new post on X, analyst Ali Martinez has talked about where support lies for Ethereum based on on-chain data. In on-chain analysis, levels are considered as major support/resistance zones if they host the cost basis or acquisition level of a significant part of the ETH supply. The reason behind this lies in the fact that investors are more likely to show some kind of reaction when the retest of their break-even level takes place. This buying/selling is irrelevant to the wider market if only a few holders are having it tested at once, but the story can be different when the retest is of the cost basis of a large amount of them. Related Reading: Dogecoin Under Pressure: Only Top 10 Coin Where Loss-Taking Exceeds Profit Below is the chart shared by the analyst that shows how the different price levels around the current Ethereum spot price are currently looking in terms of the amount of supply that was purchased at them. In the graph, the size of the dot corresponds to the amount of Ethereum supply contained within the associated price range. It would appear that, out of the ranges listed, the $2,218 to $2,396 levels currently have the largest dot, meaning that they host the most supply. More specifically, this range has the cost basis of 6.28 million addresses, who purchased a total of 67.2 million ETH at its levels. Given this fact, it&#8217;s possible that should a retest of the range occur, investors could show a strong reaction. But what kind of reaction would it be, buying or selling? Well, these investors are in profit right now and usually, such holders are more likely to double down on the asset during declines to their acquisition mark, as they may believe the same price level would turn out to be profitable again in the future. As such, the $2,218 to $2,396 range could end up acting as a strong support level for Ethereum. In the scenario that ETH falls below the lower end of the range around $2,200, however, it may have to rely on support elsewhere. Related Reading: XRP Down 3% After SEC Settlement Stalls, But Social Media Turns Bullish From the chart, it&#8217;s apparent that all the ranges below are much smaller in terms of supply. The next major support zone lies all the way down at $1,160, where 35.9 million addresses acquired 21.58 million tokens. Naturally, Ethereum doesn&#8217;t have to slip right through to this zone if $2,200 is lost, but if the data is to go by, it does suggest that the coin could have a harder time regaining footing below it. ETH Price Ethereum is holding above the on-chain demand zone for now as its price is floating around $2,475. Featured image from Dall-E, Sentora.com, chart from TradingView.com"
    },
    {
      "title": "Cardano (ADA) Sideways — Support Intact, But No Spark for a Move Yet",
      "link": "https://www.newsbtc.com/analysis/ada/cardano-ada-sideways-0-5640/",
      "summary": "Cardano price started a fresh decline from the $0.590 zone. ADA is now consolidating and might attempt a fresh increase above the $0.5820 zone. ADA price started a fresh decline below $0.5820 and $0.5750. The price is trading above $0.560 and the 100-hourly simple moving average. There is a key bullish trend line forming with support at $0.5640 on the hourly chart of the ADA/USD pair (data source from Kraken). The pair could start a fresh decline if it dips below the $0.5560 support zone. Cardano Price Fails To Extend Gains In the past few sessions, Cardano saw a fresh decline from the $0.590 zone, unlike Bitcoin and Ethereum. ADA declined below the $0.580 level and trimmed most gains. The bears pushed the price below the 50% Fib retracement level of the upward move from the $0.5567 swing low to the $0.5902 high. The price even spiked below the $0.570 support but stayed above $0.5650. There is also a key bullish trend line forming with support at $0.5640 on the hourly chart of the ADA/USD pair. The trend line is close to the 76.4% Fib retracement level of the upward move from the $0.5567 swing low to the $0.5902 high. Cardano price is now trading above $0.5650 and the 100-hourly simple moving average. On the upside, the price might face resistance near the $0.5735 zone. The first resistance is near $0.5820. The next key resistance might be $0.590. If there is a close above the $0.590 resistance, the price could start a strong rally. In the stated case, the price could rise toward the $0.620 region. Any more gains might call for a move toward $0.6350 in the near term. More Losses In ADA? If Cardano’s price fails to climb above the $0.5820 resistance level, it could start another decline. Immediate support on the downside is near the $0.5640 level and the trend line. The next major support is near the $0.5460 level. A downside break below the $0.5460 level could open the doors for a test of $0.5250. The next major support is near the $0.510 level where the bulls might emerge. Technical Indicators Hourly MACD – The MACD for ADA/USD is gaining momentum in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for ADA/USD is now below the 50 level. Major Support Levels – $0.5640 and $0.5460. Major Resistance Levels – $0.5735 and $0.5820."
    },
    {
      "title": "Bitcoin Market Enters Caution Zone Amid Rising Sell-Side Pressure, Analyst Says",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-market-enters-caution-zone-amid-rising-sell-side-pressure-analyst-says/",
      "summary": "Although Bitcoin (BTC) has recorded slight gains over the past month &#8211; up 3.6% in the last 30 days &#8211; the leading cryptocurrency is experiencing a lack of Apparent Demand, indicating broader market weakness that could lead to a price slump in the near term. Bitcoin Apparent Demand Enters Negative Territory According to a recent CryptoQuant Quicktake post by contributor Crazzyblockk, Bitcoin’s new buyer demand is failing to absorb the combined supply pressure from freshly mined BTC and selling from long-term holders (LTHs). As a result, BTC’s Apparent Demand has turned negative. The analyst noted that the imbalance between buyer demand and excessive supply has created a high-risk environment for a near-term price correction. Notably, the $100,000 level remains an important support for the flagship digital asset. Related Reading: Bitcoin Weak Hands Exit While Smart Money Loads Up – Is A Breakout Near? For the uninitiated, Bitcoin’s Apparent Demand measures the balance between new buying interest and the supply of coins entering the market from miners and LTHs selling. When this metric turns negative, it means that the amount of BTC being sold exceeds new purchases, indicating potential market weakness and downward price pressure. BTC entering negative Apparent Demand territory can be considered a bearish development for two key reasons. First, it directly increases the “for sale” BTC supply, exerting downward pressure on the cryptocurrency’s price. Second, significant selling by LTHs &#8211; often considered seasoned and sophisticated investors &#8211; suggests that experienced players believe the crypto market has likely reached a local top and are exiting before a potential severe market downturn. The analyst added: Consequently, the market is in a vulnerable state. Any price rallies from here will likely struggle to overcome this wave of available supply, and market support may be weaker than anticipated. While not a guarantee, this on-chain signal strongly suggests a period of caution is warranted until demand shows clear signs of recovery. That said, recent on-chain analysis indicates a more optimistic outlook. According to fellow CryptoQuant analyst Avocado_onchain, the 30-day moving average (MA) of Bitcoin Binary Coin Days Destroyed (CDD) shows signs of healthy consolidation rather than a potential local top. Some Positive Signs For BTC While BTC’s Apparent Demand might be drying up, easing global geopolitical tensions could catalyze a rally in risk-on assets, including cryptocurrencies. Further positive macroeconomic developments may also benefit BTC, potentially leading to a cycle top much higher than currently anticipated. Related Reading: Bitcoin May Surprise Bears: $100K–$110K Range Shows Rising Short Interest Another indicator negating the possibility of a major price pullback is the steadily rising short-term holder (STH) floor price, which has surged to as high as $98,000 according to the latest on-chain data. At press time, BTC trades at $107,500, down 0.5% in the past 24 hours. Featured image from Unsplash, charts from CryptoQuant and TradingView.com"
    },
    {
      "title": "XRP Price Surges, Then Cools — Will Bulls Return for Round Two?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-surges-then-cools-2-20/",
      "summary": "XRP price started a steady increase above the $2.220 zone. The price is now correcting gains and might find bids near the $2.20 zone. XRP price started a fresh increase above the $2.220 zone. The price is now trading above $2.180 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.20 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could gain bullish momentum if it clears the $2.280 resistance zone. XRP Price Regains Traction XRP price formed a base above the $2.120 level and started a fresh increase, beating Bitcoin and Ethereum. The price was able to climb above the $2.180 and $2.20 resistance levels. The pair even surged above the $2.30 level. A high was formed at $2.327 and the price is now correcting gains. There was a move below the $2.280 level. It dipped below the 50% Fib retracement level of the upward move from the $2.165 swing low to the $2.327 high. The price is now trading above $2.180 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.20 on the hourly chart of the XRP/USD pair. It is close to the 76.4% Fib retracement level of the upward move from the $2.165 swing low to the $2.327 high. On the upside, the price might face resistance near the $2.280 level. The first major resistance is near the $2.30 level. The next resistance is $2.320. A clear move above the $2.320 resistance might send the price toward the $2.350 resistance. Any more gains might send the price toward the $2.40 resistance or even $2.450 in the near term. The next major hurdle for the bulls might be $2.50. Fresh Decline? If XRP fails to clear the $2.280 resistance zone, it could start another decline. Initial support on the downside is near the $2.220 level. The next major support is near the $2.20 level. If there is a downside break and a close below the $2.20 level, the price might continue to decline toward the $2.150 support. The next major support sits near the $2.120 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.220 and $2.20. Major Resistance Levels – $2.280 and $2.320."
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "German Bank Sparkassen-Finanzgruppe Plans to Offer Bitcoin For Private Customers",
      "link": "https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/German-Bank-Sparkassen-Finanzgruppe-Plans-to-Offer-Bitcoin-For-Private-Customers.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers\" rel=\"nofollow\"> </a></p> <p>Germany's largest savings bank financial group will allow private customers to trade Bitcoin and other cryptocurrencies by 2026, in partnership with DekaBank.</p> <p>"
    },
    {
      "title": "How Institutional Flows and Market Cycles Are Shifting",
      "link": "https://bitcoinmagazine.com/markets/how-institutional-flows-and-market-cycles-are-shifting",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/How-Institutional-Flows-and-Market-Cycles-Are-Shifting.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/how-institutional-flows-and-market-cycles-are-shifting\" rel=\"nofollow\"> </a></p> <p>Is bitcoin going higher or lower? Fundamentals are still strong, and post-halving trends show a predictable pattern.</p> <p>"
    },
    {
      "title": "Are Bitcoin Treasury Companies Ponzi Schemes?",
      "link": "https://bitcoinmagazine.com/takes/are-bitcoin-treasury-companies-ponzis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_Generated_Image_xrkcodxrkcodxrkc-1.jpeg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/are-bitcoin-treasury-companies-ponzis\" rel=\"nofollow\"> </a></p> <p>Financial machines of perpetual motion don’t work but bitcoin treasury companies are certainly trying. Why would this fad be any different?</p> <p>"
    },
    {
      "title": "Vanadi Coffee Shareholders Approve €1 Billion Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/vanadi-coffee-shareholders-approve-e1-billion-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Vanadi-Coffee.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/vanadi-coffee-shareholders-approve-e1-billion-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Shareholders of Vanadi Coffee have approved a plan to invest up to €1 billion in Bitcoin as part of a new strategy to manage the company’s finances. This move puts the small café chain, which runs six locations in Alicante, on track to become the largest publicly listed Bitcoin-holding company in Spain.&#160; According to an [&#8230;]</p> <p>"
    },
    {
      "title": "Strategy Acquires $531.9 Million in Bitcoin, Now Holds 597,325 BTC",
      "link": "https://bitcoinmagazine.com/news/strategy-acquires-531-9-million-in-bitcoin-now-holds-597325-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Strategy-Acquires-531.9-Million-in-Bitcoin-Now-Holds-597325-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/strategy-acquires-531-9-million-in-bitcoin-now-holds-597325-btc\" rel=\"nofollow\"> </a></p> <p>Strategy, formerly Microstrategy, has announced the acquisition of an additional 4,980 Bitcoin for approximately $531.9 million, according to a new SEC Form 8-K filed on June 30, 2025. The average purchase price was $106,801 per Bitcoin, inclusive of fees and expenses. The purchase was funded by an equity raise from June 23–29, 2025, across its [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Ubisoft Adds AI Agents to ‘Captain Laserhawk’ Game That Vote and Govern",
      "link": "https://decrypt.co/327905/ubisoft-adding-ai-agents-captain-laserhawk-game-vote-govern",
      "summary": "Blockchain game Captain Laserhawk: The G.A.M.E. is integrating AI agents that can make governance decisions on behalf of players."
    },
    {
      "title": "Hut 8 Raises $220 Million as Trump-Linked Crypto Projects Forge Deeper Ties With UAE",
      "link": "https://decrypt.co/327944/hut-8-220-million-trump-linked-crypto-projects",
      "summary": "A new Dubai office will house a team focused on trading and comes as the mining firm clinches hundreds of millions of dollars."
    },
    {
      "title": "DOJ Charge Fake North Korean Devs 'Embedding' In Crypto Startups",
      "link": "https://decrypt.co/327942/doj-fake-north-korean-devs-embedding-crypto-startups",
      "summary": "Federal prosecutors claim DPRK agents infiltrated a blockchain startup under false identities, pushing code to drain funds."
    },
    {
      "title": "Rex-Osprey Solana ETF to Debut 'First-Ever' US Crypto Fund With Staking",
      "link": "https://decrypt.co/327872/rex-osprey-solana-etf-debut-first-ever-us-crypto-fund-staking",
      "summary": "Rex Shares and Osprey Funds is set to launch the first U.S. ETF offering direct Solana exposure with staking rewards."
    },
    {
      "title": "Mark Zuckerberg Unveils New Meta AI Lab After Poaching OpenAI Talent",
      "link": "https://decrypt.co/327894/after-poaching-openai-talent-mark-zuckerberg-unveils-new-meta-ai-lab",
      "summary": "Meta is throwing huge bucks to lure away top talent in the high-stakes AI race, prompting the company to give its employees the week off to cool down."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Circle applies for national trust bank license to expand USDC reserve custody",
      "link": "https://cryptobriefing.com/circle-trust-bank-license-tokenized/",
      "summary": "<p>Circle seeks a trust bank license to directly manage USDC reserves and offer custody for tokenized stocks and bonds onchain.</p> <p>"
    },
    {
      "title": "SEC to rule on Grayscale’s proposal to convert Bitcoin, Ether, XRP, and ADA large-cap fund into a spot ETF this week",
      "link": "https://cryptobriefing.com/crypto-etf-approval-grayscale/",
      "summary": "<p>Approval could set a precedent for broader crypto ETF adoption, potentially transforming investment landscapes and regulatory approaches.</p> <p>"
    },
    {
      "title": "Ripple-backed XRP Ledger launches EVM-compatible sidechain to unlock cross-chain DeFi",
      "link": "https://cryptobriefing.com/xrpl-evm-sidechain-cross-chain-defi/",
      "summary": "<p>The launch of the EVM-compatible sidechain on the XRP Ledger could significantly enhance cross-chain DeFi, fostering broader blockchain interoperability.</p> <p>"
    },
    {
      "title": "Backed rolls out tokenized Apple, Microsoft, and Amazon stocks on Bybit and Kraken",
      "link": "https://cryptobriefing.com/kraken-tokenized-stock-trading/",
      "summary": "<p>Kraken's xStocks could revolutionize global equity access, challenging traditional markets and enhancing blockchain's role in finance.</p> <p>"
    },
    {
      "title": "Kazakhstan plans to establish national crypto reserve using seized and state-mined assets",
      "link": "https://cryptobriefing.com/kazakhstan-crypto-asset-reserve/",
      "summary": "<p>Kazakhstan's crypto reserve initiative could enhance financial innovation and regulatory frameworks, potentially influencing global crypto policies.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin faces whale exodus at $108K — Where does this leave retail?",
      "link": "https://ambcrypto.com/bitcoin-faces-whale-exodus-at-108k-where-does-this-leave-retail/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/F655EB17-9F06-4A28-9C9A-8850997CCD4B.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Traders are loading up shorts, whales are vanishing. Will BTC trigger another flush?"
    },
    {
      "title": "PENGU’s 50% price rally – How whale buys, ETF updates are fueling recovery",
      "link": "https://ambcrypto.com/pengus-50-price-rally-how-whale-buys-etf-updates-are-fueling-recovery/",
      "summary": "<img alt=\"PENGU&#039;s 50% price rally - How whale buys, ETF updates are fueling recovery\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/PENGU-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PENGU traders can wait for a minor price dip before buying."
    },
    {
      "title": "Can BSC’s Maxwell upgrade challenge Ethereum’s DeFi dominance?",
      "link": "https://ambcrypto.com/can-bscs-maxwell-upgrade-challenge-ethereums-defi-dominance/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika2-7.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Unpacking BSC’s Maxwell vs. Ethereum’s Glamsterdam."
    },
    {
      "title": "TRON’s KEY metric points to a possible TRX breakout – Assessing odds…",
      "link": "https://ambcrypto.com/trons-key-metric-points-to-a-possible-trx-breakout-assessing-odds/",
      "summary": "<img alt=\"TRX\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-30T160118.387-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TRX trades within a tightening structure as large holders accumulate and retail waits on the sidelines."
    },
    {
      "title": "Solana stalls, whale dumps 240K SOL – Time to worry about the price?",
      "link": "https://ambcrypto.com/solana-stalls-whale-dumps-240k-sol-time-to-worry-about-the-price/",
      "summary": "<img alt=\"Solana\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-22-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Solana faces whale sell pressure, but retail accumulation and futures activity hint at bullish recovery."
    }
  ]
}