{
  "CoinDesk": [
    {
      "title": "XRP Ledger's Ethereum-Compatible Sidechain to Go Live in Q2",
      "link": "https://www.coindesk.com/markets/2025/06/11/xrp-ledger-s-ethereum-compaitable-sidechain-to-go-live-in-q2",
      "summary": ""
    },
    {
      "title": "Ripple's Brad Garlinghouse Says Circle IPO Signals U.S. Stablecoin Regulation Ahead",
      "link": "https://www.coindesk.com/markets/2025/06/10/ripples-brad-garlinghouse-says-circle-ipo-signals-us-stablecoin-regulation-ahead",
      "summary": ""
    },
    {
      "title": "Asia Morning Briefing: Coinbase Premium, Not Bank of Japan Rates, Might be the Metric to Watch for BTC",
      "link": "https://www.coindesk.com/markets/2025/06/10/asia-morning-briefing-coinbase-premium-not-bank-of-japan-rates-might-be-the-metric-to-watch-for-btc",
      "summary": ""
    },
    {
      "title": "Trump's CFTC Pick Says U.S. Can Boost Crypto Innovation and Shield Consumers",
      "link": "https://www.coindesk.com/policy/2025/06/10/trump-s-cftc-pick-says-u-s-can-boost-crypto-innovation-and-shield-consumers",
      "summary": ""
    },
    {
      "title": "Bitcoin Rises to $110K as Altcoins Rally; Traders Skeptical of Breakout",
      "link": "https://www.coindesk.com/markets/2025/06/10/bitcoin-rises-to-110k-as-altcoins-rally-traders-skeptical-of-breakout",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "CFPB’s top enforcer exits with scathing email on Trump: Report",
      "link": "https://cointelegraph.com/news/cfpb-top-enforcer-criticizes-trump-resignation-email?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NjA5MzUtYzZjNy03MTQ4LTk4NzAtMTdjM2I1ODJjZjdh.jpg\" /></p><p>Consumer Financial Protection Bureau acting enforcement director Cara Petersen has quit, saying that she has never “seen the ability to perform our core mission so under attack.”</p>"
    },
    {
      "title": "Fortune 500’s interest in stablecoins triples from last year: Coinbase",
      "link": "https://cointelegraph.com/news/stablecoin-interest-grows-fortune-500-coinbase-survey?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVjMmQtMDBkMy03YzhkLWI2ODgtNWI2MmRmMWQyOGJi.jpg\" /></p><p>Nearly 30% of the 100 executives at a Fortune 500 firm said their company has plans or is interested in stablecoins, up from 8% who said the same last year.</p>"
    },
    {
      "title": "Bitcoin-buying GameStop drops as Q1 revenues miss estimates",
      "link": "https://cointelegraph.com/news/gamestop-drops-q1-revenue-misses-estimates?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVjOTEtNWYwYi03ZTcxLWIyM2MtZTE5MjM1NzY2NmJk.jpg\" /></p><p>GameStop shares slid over 3.5% after-hours on Tuesday, falling to just above $29 after the video game retailer missed revenue estimates for Q1.</p>"
    },
    {
      "title": "Michael Saylor rejects crypto winter fears, says Bitcoin ‘going to $1M’",
      "link": "https://cointelegraph.com/news/strategy-michael-saylor-rejects-crypto-winter-bitcoin-price-prediction?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVjYWYtMjg4MS03MGZhLTlkMWEtYjI2YjZhMzkzOTVi.jpg\" /></p><p>Strategy’s Michael Saylor claims that “all the evidence” indicates Bitcoin is unlikely to face another crypto winter anytime soon.</p>"
    },
    {
      "title": "Bitcoin update to raise data limit on divisive OP_RETURN function",
      "link": "https://cointelegraph.com/news/bitcoin-op-return-data-limit-raise-next-update?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzViYjktYTkxMi03MTdkLWFjMDgtNDVlNzhhNDc2NGU1.jpg\" /></p><p>Bitcoin Core dev Gloria Zhao says the data limit for OP_RETURN will be raised in October, infuriating several Bitcoin users who prefer images, text and audio to stay off the blockchain.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin holding $100k psychological floor amid recent dip signals robust investor sentiment",
      "link": "https://cryptoslate.com/bitcoin-holding-100k-psychological-floor-amid-recent-dip-signals-robust-investor-sentiment/",
      "summary": "<p>On-chain data shows that Bitcoin&#8217;s (BTC) brief slide to $100,000 strengthened rather than weakened market structure, Glassnode said in a June 10 report. Bitcoin is currently trading at $109,500, after an over 4% climb on June 9 to hit a weekly high of $110,600. The report noted that the 9% drawdown following the June 7 [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation releases first 1TS outlining roadmap to tackle security challenges",
      "link": "https://cryptoslate.com/ethereum-foundation-releases-first-1ts-outlining-roadmap-to-tackle-security-challenges/",
      "summary": "<p>The Ethereum Foundation has released the first report in its most comprehensive security initiative to date, which maps the critical risks Ethereum (ETH) must address to support trillions in global on-chain value. The first Trillion Dollar Security (1TS) report outlines what individuals, institutions, and governments require to entrust significantly larger sums to the network. The [&#8230;]</p> <p>"
    },
    {
      "title": "SEC reportedly fast-tracks Solana ETFs: potential approval arrives within 5 weeks",
      "link": "https://cryptoslate.com/sec-reportedly-fast-tracks-solana-etfs-potential-approval-arrives-within-5-weeks/",
      "summary": "<p>The US Securities and Exchange Commission (SEC) asked would-be Solana exchange-traded fund (ETF) sponsors to file amended S-1 Forms within a week, Blockworks reported on June 10, citing three people familiar with the discussions. The sources said that the SEC has informed the issuers that it intends to respond within 30 days of the filings. [&#8230;]</p> <p>"
    },
    {
      "title": "Fortune 500 blockchain adoption hits 60% as institutions inject $50B into crypto funds in Q1",
      "link": "https://cryptoslate.com/fortune-500-blockchain-adoption-hits-60-as-institutions-inject-50b-into-crypto-funds-in-q1/",
      "summary": "<p>Fortune 500 companies and global asset managers continued to expand blockchain activity and allocations during the first half of 2025, according to Coinbase’s latest State of Crypto report. Six in ten Fortune 500 executives say their firms run on-chain initiatives, and the average number of projects per company jumped to 9.7 from 5.8 year on [&#8230;]</p> <p>"
    },
    {
      "title": "Blockchain Group wins approval for $11B raise to execute aggressive Bitcoin acquisitions",
      "link": "https://cryptoslate.com/blockchain-group-wins-approval-for-11b-raise-to-execute-aggressive-bitcoin-acquisitions/",
      "summary": "<p>The Blockchain Group on June 10 won shareholder approval to raise more than €10 billion ($11 billion) for additional Bitcoin (BTC) purchases effective immediately, formalizing a proposal first aired one day earlier. During an ordinary and extraordinary general meeting, investors holding 39% of voting rights backed every resolution with support exceeding 95%, according to a [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Takes a Breather—Consolidation Phase or Bullish Setup?",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-takes-a-breather-2-25/",
      "summary": "XRP price started a fresh increase above the $2.265 zone. The price is now consolidating and might aim for an upward move above the $2.30 resistance. XRP price started a decent upward move above the $2.250 zone. The price is now trading above $2.250 and the 100-hourly Simple Moving Average. There is a bullish trend line forming with support at $2.2750 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair might start another increase if it clears the $2.30 resistance zone. XRP Price Consolidates Gains XRP price formed a base and started a fresh increase from the $2.10 zone, like Bitcoin and Ethereum. There was a move above the $2.150 and $2.20 resistance levels. The bulls even pushed the price above the $2.25 level. Finally, the price tested the $2.320 resistance. A high was formed at $2.3294 and the price is now correcting some gains. There was a move below the 23.6% Fib retracement level of the upward move from the $2.2250 swing low to the $2.3294 high. The price is now trading above $2.250 and the 100-hourly Simple Moving Average. There is also a bullish trend line forming with support at $2.2750 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.30 level. The first major resistance is near the $2.320 level. The next resistance is $2.350. A clear move above the $2.350 resistance might send the price toward the $2.40 resistance. Any more gains might send the price toward the $2.420 resistance or even $2.450 in the near term. The next major hurdle for the bulls might be $2.50. Downside Break? If XRP fails to clear the $2.30 resistance zone, it could start another decline. Initial support on the downside is near the $2.2750 level and the trend line. The next major support is near the $2.250 level and the 76.4% Fib retracement level of the upward move from the $2.2250 swing low to the $2.3294 high. If there is a downside break and a close below the $2.250 level, the price might continue to decline toward the $2.220 support. The next major support sits near the $2.20 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $2.2750 and $2.250. Major Resistance Levels – $2.30 and $2.320."
    },
    {
      "title": "Ethereum Charts Flash Rare Signal Not Seen in Years, Says Analyst",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-charts-rare-signal-not-seen-in-years/",
      "summary": "In his latest macro-technical analysis, crypto strategist Kevin (@Kev_Capital_TA) has flagged a potentially pivotal moment for Ethereum (ETH), arguing that a confluence of rare monthly chart signals—some not seen in years—could be laying the groundwork for durable altcoin outperformance. Speaking in a video posted June 9, the analyst described the current Ethereum setup across multiple timeframes as “something we’ve never seen before,” drawing comparisons to historical signals that preceded major rallies in 2016, 2018, and 2020. Ethereum Primed For Macro Breakout Kevin emphasized that Ethereum now exhibits strong bullish momentum across its USD pair, dominance chart, and ETH/BTC ratio, pointing to a simultaneous alignment of several high-time frame indicators. “These are things that just don’t pop up every day,” he said. “Matter of fact, these are things that have almost never popped up in such confluence throughout history for Ethereum.” The core of Kevin’s thesis hinges on what he calls a “monthly demand candle”—a large, typically green candlestick that emerges after a protracted correction. Ethereum printed such a candle in May 2025 following nearly a year of sideways chop and five months of drawdown. Historically, these demand candles have marked the start of significant uptrends. Kevin cited analogous structures in 2016, 2018, and during the COVID-19 crash in 2020, all of which preceded multi-month rallies. “This may be the most textbook demand candle we’ve ever had,” he noted, adding that “the last time we saw something like this was before ETH ran for nearly a year with barely any major correction.” Related Reading: Pundit Says Do Not Ignore Ethereum Amid New All-Time Highs In Major Metric Supporting the candle analysis is a synchronized bullish turn in several technical indicators. The Market Cipher momentum wave has clipped into the oversold zone and printed a confirmed green dot buy signal. Simultaneously, the VWAP—volume-weighted average price—has crossed above the zero line, and money flow has started to trend upward. Kevin was explicit about the importance of this configuration: “Let me tell you something: this is a big deal.” The monthly RSI, currently sitting at 51, has not yet broken the crucial 70-level that historically marks the onset of parabolic price action. According to Kevin, “ETH has never even broken 70 this cycle. You haven’t seen what’s possible yet for Ethereum—or for altcoins in general. You’ve seen nothing yet.” He also highlighted the return of whale accumulation, measured through a proprietary “whale money flow” indicator. After exiting ETH positions for over a year—from March 2024 to May 2025—whale flows have shown a V-shaped bottom and are now turning up. “We are now starting to see accumulation durably here,” Kevin said. “You keep hearing that BlackRock&#8217;s buying ETH, and I don’t know if that’s reflected in this indicator, but we are definitely seeing whale activity occur on the monthly time frame.” The analyst went further, showing that Ethereum’s stock RSI on the monthly timeframe has not only bottomed out but is now rebounding sharply—a pattern that historically precedes long-duration uptrends. “This is aggressive movement,” he explained, noting that for confirmation, the RSI still needs to cross the 20-level, but emphasized that the current shape of the rebound is stronger than in previous cycles. Ethereum Shows Relative Strength Another key piece of the puzzle is Ethereum’s dominance chart, which tracks ETH’s market cap relative to the rest of the crypto space excluding Bitcoin. Kevin pointed to a potential double bottom on the monthly chart and a newly confirmed MACD momentum shift, the first in over two years. “That’s two years and one month of downtrend finally reversing,” he said. Related Reading: Ethereum Consolidates As Momentum Builds – Analyst Has $3K In Sight For June Finally, the ETH/BTC pair is showing a near-identical structure to Ethereum’s dominance chart. Kevin believes this confluence is key. “Look at that—wow, that’s funny—it looks the same. You find your major low right where you found it in 2020. The monthly indicators are all curling up.” Still, he remained measured in his optimism, noting that macroeconomic conditions—particularly monetary policy—remain essential for confirming the bullish case. “It’s going to take some monetary policy shifting. We still need inflation to come in line. But the market is living four to six months ahead. If the market starts to sniff out that easing is coming, we’ll see that reflected in asset prices before it happens.” Referencing cycle theory and historical post-halving performance, Kevin argued that ETH’s recent relative strength fits both narratives. “Typically, ETH and altcoins start to outperform Bitcoin in"
    },
    {
      "title": "Ethereum Price Eyes $3K Milestone—Momentum Builds as Buyers Return",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-price-eyes-3k/",
      "summary": "Ethereum price started a fresh increase above the $2,650 zone. ETH is now consolidating and eyes more gains above the $2,850 resistance. Ethereum started a fresh increase above the $2,750 level. The price is trading above $2,700 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,750 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh surge if it clears the $2,850 zone in the near term. Ethereum Price Rises Further Ethereum price started a fresh increase after it found support near the $2,500 level, beating Bitcoin. ETH price was able to clear the $2,600 and $2,650 resistance levels. The bulls pushed the price above $2,750. ETH even spiked above $2,800. A high was formed at $2,832 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2,483 swing low to the $2,832 high. Ethereum price is now trading above $2,750 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $2,750 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,820 level. The next key resistance is near the $2,850 level. The first major resistance is near the $2,880 level. A clear move above the $2,880 resistance might send the price toward the $2,920 resistance. An upside break above the $2,920 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $3,000 resistance zone or even $3,120 in the near term. Are Dips Supported In ETH? If Ethereum fails to clear the $2,850 resistance, it could start a fresh decline. Initial support on the downside is near the $2,750 level. The first major support sits near the $2,650 zone and the 50% Fib retracement level of the upward move from the $2,483 swing low to the $2,832 high. A clear move below the $2,650 support might push the price toward the $2,600 support. Any more losses might send the price toward the $2,550 support level in the near term. The next key support sits at $2,500. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,750 Major Resistance Level – $2,850"
    },
    {
      "title": "Toncoin Heading Toward 40% Breakout, Pattern Could Suggest",
      "link": "https://www.newsbtc.com/toncoin-ton/toncoin-ton-toward-40-breakout-pattern-suggest/",
      "summary": "An analyst has pointed out how Toncoin (TON) is currently trading inside a Triangle pattern that could potentially set the stage up for a 40% move. Toncoin Has Been Stuck Inside A Triangle On The Daily Timeframe In a new post on X, analyst Ali Martinez has talked about a pattern that Toncoin has recently been moving inside. The pattern in question is a Triangle from technical analysis (TA), which forms when an asset&#8217;s price observes consolidation between two converging trendlines. Related Reading: Bitcoin Defies Bears: Price Nears $108,000 Despite $250M Exchange Inflows The upper line of the pattern is likely to be a source of resistance in the future, while the lower one is that of support. A breakout of either of these lines can imply a continuation of the trend in that direction. There are a few different types of Triangles in TA. Three popular ones include the Ascending, Descending, and Symmetrical variations. The orientation of the trendlines relative to each other defines which type a particular triangular channel falls under. In an Ascending Triangle, the upper trendline is parallel to the time-axis. This means that as the price travels inside the pattern, its consolidation shrinks toward a net upside. The Descending Triangle involves just the opposite case; the upper line is sloped downward while the lower one is flat. The third variation, the Symmetrical Triangle, has its trendlines at a roughly equal and opposite slope. In this pattern, the price&#8217;s range tightens to a point in a sideways manner. Now, here is the chart shared by the analyst that shows the Triangle pattern that Toncoin has seemingly been trapped within during the past few months: From the graph, it&#8217;s visible that the Triangle that the 1-day price of Toncoin has been following looks similar to a Symmetrical Triangle, but it&#8217;s not a perfect one; there is a slight bias to the downside. The cryptocurrency most recently found support at the lower line and has since climbed toward the midway point between the trendlines. The coin&#8217;s price is now not too far from the apex of the pattern. Generally, breakouts become more likely as consolidation becomes tighter, so it&#8217;s possible that TON may be approaching one. According to the analyst, a breakout, if it happens, could potentially end up leading to a 40% move for Toncoin. Related Reading: Bitcoin &#38; Ethereum Diverge—ETF Flows Just Flipped The Narrative As for which direction a breakout might take the asset in, Symmetrical Triangles usually have both sides at equal probability. Since the Triangle in the current case is slightly angled down, however, an exit below the lower line may be a bit more likely. It now remains to be seen how Toncoin&#8217;s price will develop in the coming days and if the pattern will play any role. TON Price At the time of writing, Toncoin is trading around $3.3, up over 2% in the last seven days. Featured image from Shutterstock.com, charts from TradingView.com"
    },
    {
      "title": "Owning 10,000 XRP? You’re Among Crypto’s Elite, Expert Claims",
      "link": "https://www.newsbtc.com/altcoin/owning-10000-xrp-youre-among-cryptos-elite-expert-claims/",
      "summary": "According to crypto entrepreneur Edoardo Farina, most individual XRP holders could find themselves shut out as inflation and tight budgets squeeze their options. He argues that owning more than 10,000 XRP – which costs about $23,100 at a price of $2.31 per token – has become a barrier for anyone living paycheck to paycheck. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Rich List Data Reveals Concentration Based on reports, there are about 6.55 million XRP wallet addresses in existence. Less than 4% of those wallets contain at least 10,000 XRP. A clear majority, over 5 million addresses, hold 500 XRP or fewer. That gap shows how stacked the system is. More than 166,250 wallets sit in the 10,000–25,000 XRP range. Another 159,566 wallets carry between 5,000 and 10,000 XRP. These figures point to a small group with deep pockets, while the rest trail far behind. Owning more than 10,000 $XRP nowadays is already a luxury few people can afford. — EDO FARINA 🅧 XRP (@edward_farina) June 9, 2025 Inflation Pressures Hit Small Holders Farina warns that rising inflation is forcing ordinary holders to sell just to cover daily needs. He notes, “We’re already seeing people around the world selling their XRP just to buy groceries.” When basic goods cost more each month, people feel they have no choice but to cash out their crypto. It’s a harsh reality. Owning large amounts of XRP has morphed from a luxury into a struggle for survival. Threshold Debate Heats Up He first said 95% of XRP holders risk being priced out. Now he’s raised that warning to 99%. That jump has sparked debate. Some worry it feeds a fear of missing out on a “10,000-XRP club,” while others see it as a wake-up call. Farina questions whether Bitcoin’s rally to about $112,000 really reflects growth, or simply the dollar losing its value. He frames the issue as a tug-of-war between crypto gains and fiat losses. Related Reading: Elon Musk ‘Will Do Anything’ To Make XRP King, Tech Mogul Says Calls For New Income Streams Instead of selling crypto, Farina urges holders to find extra income. He suggests side hustles or online work as ways to avoid cutting into holdings. “If you truly believe XRP has long-term value, selling it now for groceries is exactly what they want you to do,” he said. His advice pushes people to rethink how they earn and where they live. Crypto markets can move on legal news and product launches, not only inflation. Ripple’s ongoing court case and ETF filings could change XRP’s path. Still, Farina’s message taps into a broader concern: the gap between small and large holders may widen as prices climb. Retail investors can still join in. They just need to pace their buys and stay aware of both crypto trends and everyday costs. Featured image from Imagen, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Michael Saylor: The Bear Market Is Not Coming Back And Bitcoin Is Going To $1 Million",
      "link": "https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Michael-Saylor-The-Bear-Market-Is-Not-Coming-Back-And-Bitcoin-Is-Going-To-1-Million.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million\" rel=\"nofollow\"> </a></p> <p>In a Bloomberg interview, Strategy CEO Michael Saylor announces that Bitcoin is not going to zero, it is going to $1 million.</p> <p>"
    },
    {
      "title": "Bitwise Debuts First Ever GameStop Covered Call ETF",
      "link": "https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitwise.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf\" rel=\"nofollow\"> </a></p> <p>Today, Bitwise Asset Management announced the launch of the Bitwise GME Option Income Strategy ETF (IGME), the first-ever covered call ETF centered around GameStop (GME). The fund arrives at a moment where GameStop recently made headlines for its $500 million Bitcoin treasury strategy. Led by Bitwise’s Head of Alpha Strategies Jeff Park, IGME is the [&#8230;]</p> <p>"
    },
    {
      "title": "Economic Bitcoin Nodes: Why You Need To Use Your Node For It To Matter",
      "link": "https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BitcoinEconomicNOdes.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter\" rel=\"nofollow\"> </a></p> <p>Bitcoin nodes are what makes up the Bitcoin network, but without using them to verify your economic activity, they don't impact consensus. </p> <p>"
    },
    {
      "title": "Bitcoin Officially Traded Above $100,000 For 30 Consecutive Days For The First Time",
      "link": "https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Officially-Traded-Above-100000-For-30-Consecutive-Days-For-The-First-Time.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time\" rel=\"nofollow\"> </a></p> <p>Bitcoin holds above $100K for 30 days as states, banks, and companies accelerate adoption.</p> <p>"
    },
    {
      "title": "The Trump’s American Bitcoin Merges with Gryphon, Reports 215 BTC on Balance Sheet Since Launch",
      "link": "https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ABTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch\" rel=\"nofollow\"> </a></p> <p>American Bitcoin Corp (ABTC), a newly formed private Bitcoin mining company backed by Eric Trump and Donald Trump Jr., announced in a June 10 SEC filing that it has acquired 215 Bitcoin (BTC) since launching operations on April 1, 2025. The reserve is currently valued at approximately $23 million, showing their drive and commitment to [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Bank of Korea Governor to Meet Bank Chiefs as Stablecoin Debate Heats Up",
      "link": "https://decrypt.co/324548/bank-korea-governor-bank-chiefs-stablecoin-debate",
      "summary": "The upcoming meeting signals a shift in South Korea's approach to won-backed stablecoins as the new president eyes a regulatory overhaul."
    },
    {
      "title": "Why Strategy’s Bitcoin Buys Could Pose Long-Term Risks Despite Boosting Demand",
      "link": "https://decrypt.co/324540/strategys-bitcoin-buys-risks",
      "summary": "Swiss crypto bank Sygnum sees a potential concentration risk for Bitcoin that could deter central banks from adopting it as a reserve asset."
    },
    {
      "title": "OpenAI CEO Says We've Already Passed the “Superintelligence Event Horizon”",
      "link": "https://decrypt.co/324532/openai-ceo-says-weve-already-passed-the-superintelligence-event-horizon",
      "summary": "Sam Altman believes AI has crossed a key threshold into a new digital era of superintelligence."
    },
    {
      "title": "Bitcoin Steadies Near $110K as Traders Await Inflation Data, Fed Signals",
      "link": "https://decrypt.co/324534/bitcoin-steadies-near-110k-as-traders-await-inflation-data-fed-signals",
      "summary": "Bitcoin is trading close to two-week highs near $110,000 as investors await U.S. inflation data that may shape the Fed’s rate outlook."
    },
    {
      "title": "South Korea Stablecoin Bill to Allow Companies to Issue the Tokens: Report",
      "link": "https://decrypt.co/324507/south-korea-stablecoin-bill-allow-companies-issue-tokens-report",
      "summary": "Newly elected president Lee Jae-myung has been supportive of the industry in a country where crypto is popular."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Pro-Bitcoin Scott Bessent emerges as candidate for next Fed chair",
      "link": "https://cryptobriefing.com/fed-chair-successor-bessent-powell/",
      "summary": "<p>Bessent's potential Fed chair candidacy highlights a shift towards integrating cryptocurrency perspectives in U.S. monetary policy.</p> <p>"
    },
    {
      "title": "Solana ETFs could be approved in 3-5 weeks, SEC signals openness to staking",
      "link": "https://cryptobriefing.com/solana-etf-approval-potential-signals/",
      "summary": "<p>The potential approval of Solana ETFs could significantly boost institutional investment in crypto, enhancing market legitimacy and innovation.</p> <p>"
    },
    {
      "title": "Wall Street’s Guggenheim Treasury brings its flagship tokenized debt instrument to XRP Ledger",
      "link": "https://cryptobriefing.com/guggenheim-treasury-launches-tokenized-commercial-paper-xrp-ledger/",
      "summary": "<p>The integration of tokenized debt on the XRP Ledger could accelerate blockchain adoption in traditional finance, enhancing liquidity and efficiency.</p> <p>"
    },
    {
      "title": "Eric Trump-backed American Bitcoin discloses 215 BTC holdings",
      "link": "https://cryptobriefing.com/american-bitcoin-btc-disclosure/",
      "summary": "<p>The strategic focus on Bitcoin accumulation by American Bitcoin could influence market dynamics and drive broader adoption and infrastructure development.</p> <p>"
    },
    {
      "title": "French banking giant Société Générale confirms launch of new stablecoin on Ethereum and Solana",
      "link": "https://cryptobriefing.com/usd-coinvertible-launch-sg-forge/",
      "summary": "<p>Socit Gnrale's stablecoin launch signifies a pivotal shift in traditional banking towards embracing blockchain technology and digital finance.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin’s $108K breakout: Is retail FOMO driving the market?",
      "link": "https://ambcrypto.com/bitcoins-108k-breakout-is-retail-fomo-driving-the-market/",
      "summary": "<img alt=\"Bitcoin&#039;s $108K breakout: Is retail FOMO driving the market?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-9-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Retail FOMO is rising as whales place high-leverage bets."
    },
    {
      "title": "Bitcoin Open Interest drops by $1B as traders back off: A drop to $106K next?",
      "link": "https://ambcrypto.com/bitcoin-open-interest-drops-by-1b-as-traders-back-off-a-drop-to-106k-next/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-13.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin Open Interest drops by $1 billion, indicating that large scale positions have started to unwind."
    },
    {
      "title": "Aave surges 30% in 4 days: A sustained rally past $300 needs…",
      "link": "https://ambcrypto.com/aave-surges-30-in-4-days-a-sustained-rally-past-300-needs/",
      "summary": "<img alt=\"Aave surges 30% in 4 days: A sustained rally past $300 needs...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/AAVE-Featured-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A price drop toward the $285 zone, just above the former range high, would offer an attractive buying opportunity."
    },
    {
      "title": "Crypto stock winners and losers – MARA, RIOT gain but HOOD loses out",
      "link": "https://ambcrypto.com/crypto-stock-winners-and-losers-mara-riot-gain-but-hood-loses-out/",
      "summary": "<img alt=\"Crypto stock winners and losers - MARA, RIOT gain but HOOD loses out\" class=\"attachment-full size-full wp-post-image\" height=\"853\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Crypto-stocks-rise.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1516\" />Beyond Bitcoin's rise, what pivotal market events are truly reshaping crypto investments?"
    },
    {
      "title": "Why is crypto up today? Bitcoin in a short squeeze as U.S-China talks fuel rally",
      "link": "https://ambcrypto.com/why-is-crypto-up-today-bitcoin-in-a-short-squeeze-as-u-s-china-talks-fuel-rally/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Why-is-crypto-up-today-FI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Experts remain cautious despite the early week Bitcoin pump."
    }
  ]
}