{
  "CoinDesk": [
    {
      "title": "NEAR Surges 3% After Testing Key Support at $2.13",
      "link": "https://www.coindesk.com/markets/2025/07/08/near-surges-3-after-testing-key-support-at-usd2-13",
      "summary": ""
    },
    {
      "title": "Sequans Shares Jump 35% After $384M Debt-Equity Raise to Fund Bitcoin Treasury",
      "link": "https://www.coindesk.com/business/2025/07/08/sequans-shares-jump-35-after-384m-debt-equity-raise-to-fund-bitcoin-treasury",
      "summary": ""
    },
    {
      "title": "Jack Dorsey Unveils Bitchat: Offline, Encrypted Messaging Inspired by Bitcoin",
      "link": "https://www.coindesk.com/tech/2025/07/08/jack-dorsey-unveils-bitchat-offline-encrypted-messaging-inspired-by-bitcoin",
      "summary": ""
    },
    {
      "title": "OpenSea Acquires Rally as It Continues to Pivot to Token Trading",
      "link": "https://www.coindesk.com/business/2025/07/01/opensea-acquires-rally-as-it-continues-to-pivot-to-token-trading",
      "summary": ""
    },
    {
      "title": "ATOM Demonstrates Market Resilience as Crypto Market Heats up",
      "link": "https://www.coindesk.com/markets/2025/07/08/atom-demonstrates-market-resilience-as-crypto-market-heats-up",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Ego Death Capital raises $100M to finance Bitcoin-focused startups",
      "link": "https://cointelegraph.com/news/ego-death-capital-raises-100m-to-finance-bitcoin-focused-startups?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NWZiZDgtNDUyYS03NTcwLThlMzItZDQ3OTg4YWNjZDE2.jpg\" /></p><p>The venture fund has already invested in Bitcoin-focused exchanges, savings platforms and payment solutions.</p>"
    },
    {
      "title": "Which countries secretly own the most Bitcoin — beyond the US and China",
      "link": "https://cointelegraph.com/explained/which-countries-secretly-own-the-most-bitcoin-beyond-the-us-and-china?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9kYTg5OTU5OTY3YWJjNWIzNzBmZTQ4ZGZiNGEzNzU2OS5qcGc=.jpg\" /></p><p>In 2025, governments hold over 463,000 BTC, with the US and China leading, while countries like Bhutan, Iran and the UK quietly build strategic reserves.</p>"
    },
    {
      "title": "Ethereum &#039;mega whales&#039; are stacking harder than pre-95% rally in 2002",
      "link": "https://cointelegraph.com/news/ethereum-mega-whales-stacking-harder-than-pre-95-percent-rally-2002?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWMzMmItZDU3ZS03NzcxLWE1ZDctMjRhMDRmNDJhZTY5.jpg\" /></p><p>Ethereum is eyeing a breakout toward $3,400 as it consolidates within a bull pennant, echoing classic continuation patterns from past rallies.</p>"
    },
    {
      "title": "Blockchain restores women’s power in AI",
      "link": "https://cointelegraph.com/news/blockchain-women-s-power-in-ai?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhjYWUtZGI0OS03YjNmLTk3M2UtNmM0MzFmMzQ3YTBl.jpg\" /></p><p>As AI threatens to deepen gender disparities in the workforce, blockchain technology can be a powerful tool to empower women to reclaim their rightful place in the digital future.</p>"
    },
    {
      "title": "Thailand’s 5-year crypto tax break: What they’re not telling you",
      "link": "https://cointelegraph.com/explained/thailands-5-year-crypto-tax-break-what-theyre-not-telling-you?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8xZGEwMWY1NmI2YzI2MGI5MzhmNzg1NTVlM2M0OGMwMC5qcGc=.jpg\" /></p><p>Thailand’s five-year tax break on crypto capital gains looks like a dream for investors, but the fine print reveals a strategic push for surveillance, platform control and regulatory dominance.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "XRP Ledger’s EVM sidechain sees 1,400 smart contracts in first week",
      "link": "https://cryptoslate.com/xrp-ledger-evm-sidechain-sees-1400-smart-contracts-in-first-week/",
      "summary": "<p>The Ethereum Virtual Machine (EVM)-compatible sidechain of the XRP Ledger is showing early signs of traction among developers, with over 1,400 smart contracts deployed just one week after launch. On July 7, Peersyst confirmed the strong demand in a post stating that nearly 1,400 smart contracts had gone live within the first week. As of [&#8230;]</p> <p>"
    },
    {
      "title": "Scam targets dormant Bitcoin wallets with fake legal notice",
      "link": "https://cryptoslate.com/scams-targets-dormant-bitcoin-wallets-with-fake-legal-notice/",
      "summary": "<p>Analysts at BitMEX Research have raised the alarm about a scam targeting early Bitcoin holders, particularly those with wallets dating back to 2011. According to the firm, the scam appears to exploit long-dormant addresses by injecting false transactions and misleading messages via OP_Return outputs, an optional field in Bitcoin transactions that can carry arbitrary data. [&#8230;]</p> <p>"
    },
    {
      "title": "BlackRock’s IBIT Bitcoin ETF could surpass Satoshi Nakamoto’s holdings by May 2026",
      "link": "https://cryptoslate.com/insights/blackrocks-ibit-bitcoin-etf-could-surpass-satoshi-nakamotos-holdings-by-may-2026/",
      "summary": "<p>BlackRock&#8217;s IBIT Spot Bitcoin ETF has officially crossed 700,000 BTC in assets under management, valued at approximately $76 billion as of July 17. The milestone comes just 18 months after the fund&#8217;s launch in January 2024, marking a rapid accumulation pace that has drawn industry-wide attention. Bloomberg Senior ETF Analyst Eric Balchunas highlighted the achievement [&#8230;]</p> <p>"
    },
    {
      "title": "Truth Social files for ETF holding BTC, ETH, SOL, XRP and CRO",
      "link": "https://cryptoslate.com/truth-social-files-for-etf-holding-btc-eth-sol-xrp-cro/",
      "summary": "<p>Truth Social, the media platform affiliated with US President Donald Trump, has submitted a new application to the US Securities and Exchange Commission (SEC) for a spot crypto exchange-traded fund (ETF). The proposed vehicle, titled the Truth Social Crypto Blue Chip ETF, aims to provide direct exposure to a basket of leading digital assets, including [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet wants to use Bitcoin as collateral to access bank financing",
      "link": "https://cryptoslate.com/metaplanet-wants-to-use-bitcoin-as-collateral-to-access-bank-financing/",
      "summary": "<p>Metaplanet, the Japanese Bitcoin treasury firm, has revealed a bold strategy to convert its growing Bitcoin reserves into capital for acquiring profitable businesses. According to a July 8 Financial Times report, Metaplanet CEO Simon Gerovich said the company is preparing for a second phase where it can use Bitcoin as collateral to access bank financing. [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana’s Pump.Fun Loses Steam With Exit Scam Rumors, LetsBonk.Fun Claims 54% Of Total Market Share",
      "link": "https://www.newsbtc.com/news/solana/solanas-pump-fun-loses-steam/",
      "summary": "Solana meme coin launchpad Pump.fun has lost a significant chunk of its market share to LetsBonk.fun. This comes just ahead of the former’s token generation event, in which the launchpad could raise up to $4 billion. Solana’s Pump.fun Loses Dominance To LetsBonk.fun In an X post, Solana News revealed that Pump.fun has hit a new all-time low with just a 36% market share, while LetsBonk.fun’s market share has surged to 54%. Jup data also confirms this development. At press time, LetsBonk boasts a market share of 48.90%, with a 24-hour trading volume of $539 million. On the other hand, Pump boasts a market share of 39.80%, with a 24-hour trading volume of $438 million. Related Reading: Analyst Says Buying This Meme Coin Is A 3X Leveraged Play If Solana ETFs Go Live This development comes amid Pump.fun’s proposed public token sale, scheduled for July 12. Well-known Solana influencer Lynk has described this token sale as the “final scam” for the meme coin launchpad. The platform has been under heavy criticism for the amount of money that it has extracted from the Solana ecosystem, without incentivizing community members in any way. Some community members had expected Pump.fun to airdrop its token to rewards platform users instead of conducting a public token sale. Lynk shared details of the public sale, with the meme coin launchpad planning to sell the ‘PUMP’ tokens $0.004 each. The token boasts a total supply of 1 trillion, meaning a fully diluted value (FDV) of $4 billion. However, Pump.fun plans to raise around $600 million from the public token sale, as only $150 billion tokens will be available. The meme coin launchpad is expected to also conduct a private sale in order to complete its $1 billion capital raise effort, as earlier reported. LetsBonk.fun To Keep Dominating Pump.fun In an X post, crypto influencer Unipcs, also known as ‘Bonk Guy,’ opined that Pump.fun isn’t done, but that LetsBonk.fun will likely continue to be the industry leader. He predicts that this will be the case for the foreseeable future. He outlined several reasons why he believes this would be the case. Related Reading: Solana Picture Bigger Than $420: Analyst Predicts 140% Surge To New ATHs Firstly, he stated that LetsBonk’s pro-creator, pro-people, pro-Solana ecosystem alignment is a massive strength over Pump.fun. Secondly, Bonk Guy remarked that the strong culture of support within the BONK ecosystem is incredibly hard to replicate by any other platform in a short period. Furthermore, the crypto influencer remarked that Pump.fun had a lot of momentum as a tokenless protocol, especially with a token generation event (TGE). However, LetsBonk.fun was able to flip the platform during this period. As such, Bonk Guy believes that it is hard to see Pump.fun sustainably recover the kind of market share it once had after the TGE event. He also suggested that a “non-negligible amount of activity on Pump.fun is inorganic with a lot os users farming on the platform, hoping that there was going to be an airdrop. As such, the influencer believes that the traffic will dry up once the TGE is over. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "TRUMP Meme Coin Plants Flag On TRON Network—Details",
      "link": "https://www.newsbtc.com/altcoin/trump-meme-coin-plants-flag-on-tron-network-details/",
      "summary": "Meme coin TRUMP made waves when it launched on Solana on January 17, 2025, issuing 200 million tokens out of a planned supply of 1 billion. Related Reading: Bitcoin Meets Heartbreak In Drake’s Latest Track—Details According to trading data, its price shot from under $10 to a whopping $80 within hours, pushing its fully diluted valuation to nearly $75 billion. But by July 2025, TRUMP had tumbled back to $8.60, a 90% drop from its peak. Its circulating market cap now sits around $1.70 billion, with a fully diluted value of about $8.60 billion. Cross Chain Push Into Tron Based on reports from the project’s official X account, TRUMP plans its first expansion beyond Solana by launching on the Tron blockchain. This move is designed to tap Tron’s large user base and faster transaction speeds. Tron boasts over 100 million accounts and sub‑second confirmations, which the TRUMP team believes could fuel a fresh wave of buyers and traders. $TRUMP on #TRON is coming. Stay tuned! pic.twitter.com/S5WfV8APvU — TrumpMeme (@GetTrumpMemes) July 7, 2025 Volatile Price Swings Define TRUMP TRUMP’s rollercoaster debut underlines extreme volatility. After the initial frenzy in January, the coin’s price plummeted by 88% from $80 to $8.60. That slide erased roughly $65 billion in valuation. Today’s price reflects speculative trading rather than any long‑term adoption. Investors who rode the peak saw massive gains briefly, then steep losses just as quickly. Justin Sun’s Big Stake On May 20, 2025, Tron founder Justin Sun tweeted that he is TRUMP’s largest holder. He reportedly owns nearly $19 million worth of tokens after a $75 million investment in Trump’s World Liberty Financial platform. Sun’s position comes with perks. He won a “private dinner” alongside the top 220 token holders, securing a seat at US President Donald Trump’s Virginia golf club. Critics say that kind of setup blurs the line between crypto hype and pay‑to‑play politics. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 Central Control Raises Warnings Two Trump‑affiliated companies, CIC Digital LLC and Fight Fight Fight LLC, control 80% of TRUMP’s token supply. Those tokens are locked under a three‑year vesting schedule. Analysts warn that when insiders hold such large shares, they can sway prices at will. That level of centralization runs counter to crypto’s promise of open and fair systems. Senators Richard Blumenthal, Elizabeth Warren, and Jeff Merkley have called for new rules to curb how politicians and their allies can launch or endorse digital coins. They argue that projects like TRUMP could be used for personal gain or campaign boosts, creating a need for clearer boundaries. Traders And Regulators Brace For Tron Launch As TRUMP eyes a Tron debut, traders and regulators alike will watch closely. The move could spark a fresh surge in trading volume. Yet the same factors that drove its initial spike—viral hype, insider perks, and a heavy token concentration—could just as easily lead to another steep plunge. Featured image from Bankless Times, chart from TradingView"
    },
    {
      "title": "Breakout or Breakdown? XRP $2.35 Test Could Decide Its Next Move",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-next-move-hinges-on-2-35/",
      "summary": "XRP is showing mixed signals across timeframes, leaving traders on edge as the price approaches the key $2.35 level. While a recent breakout from a falling wedge on the 3-day chart suggests a bullish reversal, the 4-hour chart reveals signs of slowing momentum and a possible rising wedge. With buyers and sellers locked in a battle, $2.35 could be the tipping point that decides whether XRP surges higher or slips into a near-term correction. XRP Breaks Out Of Falling Wedge On 3-Day Chart In an X post, LSplayQ highlighted a key technical development on the XRP 3-day price chart, pointing to a breakout from a falling wedge pattern. This type of pattern is commonly associated with bullish reversals, signaling that market sentiment may be shifting in favor of the bulls. Related Reading: XRP Silent Accumulation: A Falling Wedge On The Verge Of Explosion Following the breakout, XRP is currently trading around $2.26, and according to LSplayQ, the move suggests that buyers are stepping back in to reclaim control. The price action marks a significant shift after an extended period of downward compression within the wedge. If the bullish momentum continues, LSplayQ notes that XRP could target a breakout level near $2.72, which represents an upside potential of roughly 20% from the current price. That said, LSplayQ also warns of the risk of a pullback if XRP fails to hold above the wedge breakout level. In such a scenario, the price could retest the $2.10 zone as a potential support. Overall, the technical outlook leans bullish, as long as XRP maintains its position above the breakout level. Rising Wedge Pattern Signals Caution Ahead In a post on X, The Crypto Bushman pointed out that XRP is pushing higher on the 4-hour chart, but warned that seasoned traders are keeping a close eye on what lies beneath the surface. Related Reading: XRP Price Pops and Drops — Can Bulls Regain Control? According to the analyst, the price is currently trading above both the 20- and 50-day EMAs, which typically signals short-term strength. However, the overall structure appears to be forming a rising wedge, a pattern often linked to potential reversals. At the same time, momentum is beginning to fade, with the MACD flattening and volume tapering off, which Bushman describes as classic signs of a potential trap move. The Crypto Bushman emphasized that a failure to break cleanly above $2.35 could lead to the setup rolling over. In that case, the $2.25 zone becomes a critical level to watch for a possible breakdown and shift in sentiment. On the flip side, a strong breakout backed by volume could fuel another leg up toward $2.50 if buying pressure returns decisively. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Sees $6 Billion In Tokenized Funds As Big Players Jump In",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-sees-6-billion-in-tokenized-funds-as-big-players-jump-in/",
      "summary": "Ethereum’s smart-contract platform has crossed a major line. According to data shared by Token Terminal on X, the total value of tokenized assets on Ethereum now tops $6 billion. That figure covers products from asset managers, fund houses and blockchain firms. It proves institutions are treating on‑chain finance as more than a tech demo. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 Top Firms Drive Token Growth BlackRock leads the pack. The world’s largest asset manager holds the biggest share of tokenized AUM on Ethereum. Close behind are Franklin Templeton, WisdomTree, Superstate, Apollo and Ondo Finance. Franklin Templeton focused on parts of its US Government Money Fund. WisdomTree launched funds you can buy through a mobile app. Superstate and Apollo each add smaller but steady sums. Based on reports, these six names together make up most of the $6 billion milestone. Tokenized AUM on @ethereum is at an all-time high World&#8217;s biggest financial services firms &#38; asset managers are tokenizing assets on Ethereum pic.twitter.com/5Xl4XXYQ3O — Token Terminal 📊 (@tokenterminal) July 6, 2025 Adoption Speed Since Mid-2023 The climb didn’t happen in a day. Adoption started slowly around mid‑2023. It rose further in early 2024. Then by January 2025, the line on the stacked chart shot straight up. That jump comes as BlackRock and Franklin Templeton pour in fresh tokens. Faster trades and fewer middlemen are big draws. Trades that once took days can now settle in minutes or seconds. That kind of speed appeals to big investors, who want clarity and a clear audit trail. This push into tokenized finance shows a shift in how big firms manage money. Ethereum still faces questions about scaling. If gas fees jump again, trading costs could rise sharply. Related Reading: Bitcoin Meets Heartbreak In Drake’s Latest Track—Details On Rules &#38; New Fund Types Regulators in the US, Europe and Asia have yet to set clear rules. A clampdown in one region might push firms toward other chains or private blockchains. Competition from Solana, Avalanche and new networks is already heating up. With $6 billion on‑chain, tokenized assets are past the trial stage. More firms will likely join once rules firm up and scaling solutions roll out. Markets could see new fund types, cross‑border trades and on‑chain yield tools. For now, Ethereum holds the lead. Yet the next hurdles—fee pressure, rule making and rival chains—will test whether it can keep growing. Featured image from Meta, chart from TradingView"
    },
    {
      "title": "2025’s Biggest Bitcoin Bull Trigger Is Still Hidden, Expert Reveals",
      "link": "https://www.newsbtc.com/bitcoin-news/2025-biggest-bitcoin-bull-trigger-still-hidden/",
      "summary": "In a conversation with The Bitcoin Economy podcast, Bloomberg Intelligence ETF analyst James Seyffart argued that the next, and potentially largest, leg of institutional demand for spot-Bitcoin exchange-traded funds will not come from pension funds, endowments, or sovereign wealth managers. Instead, it will arise when the country’s fragmented network of registered investment advisers (RIAs) finally gains full discretionary clearance to recommend Bitcoin ETFs to ordinary clients. “The biggest bull case for the ETFs has been the unlocking of RIAs in 2025,” Seyffart said. “Right now the vast majority of the assets are stuck in that middle ground where, if a client specifically asks to buy a Bitcoin ETF, the adviser can act—but the adviser cannot initiate the recommendation.” The Biggest Bull Case For Bitcoin In 2025 Seyffart broke the compliance bottleneck into a traffic-light schema that most financial advisers will recognise. A red-light firm bars Bitcoin entirely; a yellow-light firm permits unsolicited purchases (“If you come to me and ask for it, I can do it”); and a green-light firm allows the adviser to solicit an allocation (“I can recommend that you put two percent of your portfolio in Bitcoin”). Related Reading: Bitcoin’s Liquidity Lifeline Just Got Cut—What You Need To Know Wire-house broker–dealers—which still custody trillions of dollars—largely remain in the red or yellow camps, paralysed by multi-year due-diligence committees. Independent RIAs, by contrast, “were the early adopters,” Seyffart noted, because they “don’t have to wait for a due-diligence team of a bunch of people sitting in New York.” Yet even among independents, most advisers outsource portfolio construction to centralised model portfolios; until those models flag Bitcoin ETFs as eligible holdings, discretionary uptake will stay muted. Seyffart’s focus on 2025 is calendrical, not calendrical: the first full-calendar year after launch gives compliance teams twelve months of daily NAV history—often a hard requirement before a new ETF can graduate from yellow to green status. “Usually it can take two to three years before an ETF gets approved,” he said, but the extraordinary size and liquidity of the spot-Bitcoin cohort is already accelerating that cycle. Crucially, the next Form 13F reporting deadline on 15 August 2025 will reveal second-quarter holdings as of 30 June. Seyffart expects the data to confirm that “a lot more RIAs have come online and [are] buying this for their clients,” providing the first concrete measure of green-light conversions. Related Reading: Bitcoin In For Another 460% Run? This Rare Fiat Signal Just Returned If the gatekeeping retreats, model-portfolio architects can incorporate Bitcoin’s historically uncorrelated returns into strategic-allocation frameworks. That in turn would grant advisers legal cover to solicit Bitcoin exposure, unleashing a flywheel of inflows. Seyffart cautioned that the same compliance teams will demand iron-clad fiduciary justifications—volatility, custody and tax treatment remain live concerns—but he argued that the ETFs now provide a wrapper familiar to any wealth platform. Seyffart’s thesis is that the moment a critical mass of compliance committees flips from yellow to green—allowing advisers to recommend Bitcoin rather than merely transact it—flows could dwarf everything seen to date. Whether that inflection arrives in the next 12 months will determine, in his view, “the biggest bull case for Bitcoin.” At press time, BTC traded at $108,250. Featured image created with DALL.E, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "KULR Secures $20M Bitcoin-Backed Credit Facility from Coinbase Credit",
      "link": "https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Secures-20M-Bitcoin-Backed-Credit-Facility-from-Coinbase-Credit.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit\" rel=\"nofollow\"> </a></p> <p>The deal sets up a multi-draw loan facility worth up to $20 million to expand its Bitcoin holdings.</p> <p>"
    },
    {
      "title": "Sequans Closes $384 Million Investment To Launch Bitcoin Treasury Initiative",
      "link": "https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Sequans-Closes-384-Million-Investment-To-Launch-Bitcoin-Treasury-Initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a fabless semiconductor company focusing on 5G/4G IoT semiconductor technology, has officially closed a $384 million strategic investment to kick off its Bitcoin treasury initiative. The deal combines $195 million in equity financing and $189 million in secured convertible debentures, reflecting growing institutional appetite for Bitcoin. The Offering included the sale of over [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet Enters ‘Bitcoin Gold Rush’ with Plans to Buy 210,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Metaplanet-Enters-Bitcoin-Gold-Rush-with-Plans-to-Buy-210000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027\" rel=\"nofollow\">Metaplanet Enters &#8216;Bitcoin Gold Rush&#8217; with Plans to Buy 210,000 BTC by 2027</a></p> <p>Japan’s top bitcoin treasury firm aims to grow its holdings to 210,000 BTC by 2027 and wants to use its growing reserves to buy cash-generating businesses.</p> <p>"
    },
    {
      "title": "Ego Death Capital Closes $100 Million Raise to Scale Bitcoin Companies",
      "link": "https://bitcoinmagazine.com/news/ego-death-capital-closes-100-million-raise-to-scale-bitcoin-companies",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/EGO-DEATH-CAPITAL.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ego-death-capital-closes-100-million-raise-to-scale-bitcoin-companies\" rel=\"nofollow\"> </a></p> <p>Ego Death Capital has closed its second fund, totaling $100 million, to invest exclusively in software companies building businesses on the Bitcoin protocol. The firm is positioning itself as a lead Series A investor in an ecosystem where scalable, Bitcoin-native firms are beginning to achieve positive cash flow. &#8220;We&#8217;re in Bitcoin, investing in true companies [&#8230;]</p> <p>"
    },
    {
      "title": "U.S. Court Brings Coin Center’s Tornado Cash Appeal To A Close",
      "link": "https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Tornado-Cash-Trial.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/u-s-court-brings-coin-centers-tornado-cash-appeal-to-a-close\" rel=\"nofollow\"> </a></p> <p>Coin Center’s appeal to the U.S. Treasury Department’s Office of Foreign Asset Control (OFAC) regarding Tornado Cash is now over.</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Crypto Treasury ReserveOne Eyes Nasdaq Listing Via $1 Billion SPAC Deal",
      "link": "https://decrypt.co/329083/reserveone-eyes-nasdaq-listing-1-billion-spac-deal",
      "summary": "The company’s board of directors includes names from Coinbase, Binance, and Trump’s first administration."
    },
    {
      "title": "CRYPTO DIPS THEN RECOVERS, PUMPFUN PLANS TOKEN SALE, TARIFF HEADLINES RETURN",
      "link": "https://decrypt.co/videos/interviews/fklwKOPc/crypto-dips-then-recovers-pumpfun-plans-token-sale-tariff-headlines-return",
      "summary": "Crypto dips on tariff letters, then recovers. ETH outperforms, altcoins weak after PumpFun news. PumpFun plans $600m token sale, $4b valuation. Trump admin to publish crypto report on July 22. US government deposits $218k ETH to Coinbase. Robinhood speaking to US on tokenised shares. Truth Social files for Blue Chip crypto ETF. US drops appeal in Tornado Cash lawsuit. Strategy to raise $4.2b equity to buy BTC. Semler Scientific buys $20m BTC. Bit Digital pivots to ETH treasury, stock pumps. Tokenized assets on ETH hit $5b. Metaplanet to use BTC as collateral for M&amp;A. XRP CEO to testify before senate on legislation. SEC asks firms to amend SOL ETF applications. HK crypto stocks soar on stablecoin momentum. BBVA opens BTC, ETH trading for Spanish retail. El Salvador bought $800k BTC last week"
    },
    {
      "title": "Bitcoin Volatility Hovers Near Historical Low, but 'Beware the Quiet,' Analysts Warn",
      "link": "https://decrypt.co/329046/bitcoin-volatility-hovers-near-historical-low-but-beware-the-quiet-analysts-warn",
      "summary": "The QCP Capital analysts warned that Q3-Q4 could bring \"fireworks\" as ETF inflows create a supply squeeze."
    },
    {
      "title": "Robinhood CEO Wants 'Thousands' of Private Companies Tokenized on Platform",
      "link": "https://decrypt.co/329075/robinhood-ceo-thousands-private-companies-tokenized",
      "summary": "OpenAI denounced Robinhood’s offering of its private stock as a crypto token, but the trading app wants to add thousands more to its roster."
    },
    {
      "title": "UK Jails Duo for $2M Fake Crypto Consultancy Scam",
      "link": "https://decrypt.co/329067/uk-jails-duo-for-2m-fake-crypto-consultancy-scam",
      "summary": "The scheme involved the pair cold-calling 65 victims and convincing them to invest in a fake crypto consultancy firm."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "ProShares’ XRP futures ETF listed on DTCC under ticker UXRP",
      "link": "https://cryptobriefing.com/proshares-xrp-etf-dtcc-listing/",
      "summary": "<p>The listing of ProShares' XRP futures ETF on DTCC suggests growing institutional interest and potential market expansion for crypto ETFs.</p> <p>"
    },
    {
      "title": "Amplifi partners with AIAPE to expand AI agent capabilities",
      "link": "https://cryptobriefing.com/amplifi-aiape-ai-agent-partnership-crypto-trading/",
      "summary": "<p>This partnership could enhance AI-driven trading efficiency, potentially reshaping digital asset markets and influencing future AI integrations.</p> <p>"
    },
    {
      "title": "Cardano Foundation unveils blockchain-based tool to simplify audit compliance and enhance financial reporting",
      "link": "https://cryptobriefing.com/blockchain-esg-compliance-cardano-reeve/",
      "summary": "<p>Cardano's blockchain tool could revolutionize audit compliance, boosting transparency and trust across various sectors and enhancing ESG efforts.</p> <p>"
    },
    {
      "title": "Trump’s Truth Social files S-1 for Crypto Blue Chip ETF holding BTC, ETH, XRP, SOL, and CRO",
      "link": "https://cryptobriefing.com/crypto-blue-chip-etf-launch/",
      "summary": "<p>The launch of a crypto ETF by Truth Social could significantly influence mainstream adoption and regulatory perspectives on digital assets.</p> <p>"
    },
    {
      "title": "Government-backed Sequans secures $384M to kick off Bitcoin treasury initiative, stock jumps 60% pre-market",
      "link": "https://cryptobriefing.com/sequans-bitcoin-treasury-initiative/",
      "summary": "<p>Sequans' Bitcoin initiative may boost its financial resilience and shareholder value, potentially influencing other tech firms to explore crypto.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Solana active addresses hit new high – So why is SOL still falling?",
      "link": "https://ambcrypto.com/solana-active-addresses-hit-new-high-so-why-is-sol-still-falling/",
      "summary": "<img alt=\"Solana active addresses hit new high - So why is SOL still falling?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250708_123742_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SOL active addresses surge, but price slips despite on-chain spike."
    },
    {
      "title": "MSTR stock dips 2% – Is Strategy’s Bitcoin bet still paying off?",
      "link": "https://ambcrypto.com/mstr-stock-dips-2-is-strategys-bitcoin-bet-under-pressure/",
      "summary": "<img alt=\"MSTR stock slides\" class=\"attachment-full size-full wp-post-image\" height=\"734\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/MSTR-stock-slides.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1305\" />Everyone’s watching MSTR’s next move, will $14B in Bitcoin gains be enough to silence critics?"
    },
    {
      "title": "1,140 ETH moved after 10 years – Will Ethereum prices react?",
      "link": "https://ambcrypto.com/1140-eth-moved-after-10-years-will-ethereum-prices-react/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-08T114601.648-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite headline moves, Ethereum’s on-chain data reflects bullish signals and rising community engagement."
    },
    {
      "title": "Bitcoin miners stock up, BTC slows: History points to what’s coming next",
      "link": "https://ambcrypto.com/bitcoin-miners-stock-up-btc-slows-history-points-to-whats-coming-next/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-32.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />What will miners do next? Hold or sell?"
    },
    {
      "title": "Fidelity’s Solana ETF delay raises concerns – ‘No approvals until fall’",
      "link": "https://ambcrypto.com/fidelitys-solana-etf-delay-raises-concerns-no-approvals-until-fall/",
      "summary": "<img alt=\"SOL ETF\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/SolanaSOLETFFI.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Analysts expect temporary pause on crypto ETF summer - Details."
    }
  ]
}