{
  "CoinDesk": [
    {
      "title": "Securitize, Redstone Pilot ‘Trusted Single Source Oracle’ to Secure Tokenized Fund NAVs",
      "link": "https://www.coindesk.com/tech/2025/07/01/securitize-redstone-pilot-trusted-single-source-oracle-to-secure-tokenized-fund-navs",
      "summary": ""
    },
    {
      "title": "Circle's Valuation Not Stretched, Says Citi, Starting Coverage With Buy Rating",
      "link": "https://www.coindesk.com/markets/2025/07/01/circles-valuation-not-stretched-says-citi-starting-coverage-with-buy-rating",
      "summary": ""
    },
    {
      "title": "Crypto Investors Lost $2.5B to Hacks and Scams in the First Half of 2025: Certik",
      "link": "https://www.coindesk.com/business/2025/07/01/crypto-investors-lost-usd2-5b-to-hack-and-scams-in-the-first-half-of-2025",
      "summary": ""
    },
    {
      "title": "Dollar Index Suffers Worst Crash Since 1991; Bitcoin's 'Stochastic' Points to Possible Drop Below $100K: Technical Analysis",
      "link": "https://www.coindesk.com/markets/2025/07/01/dollar-index-suffers-worst-crash-since-1991-bitcoin-s-stochastic-points-to-renewed-drop-below-usd100k-technical-analysis",
      "summary": ""
    },
    {
      "title": "Bitcoin Network Hashrate Declined in June as Miners Reacted to Recent Heatwave: JPMorgan",
      "link": "https://www.coindesk.com/markets/2025/07/01/bitcoin-network-hashrate-declined-in-june-as-miners-reacted-to-recent-heatwave-jpmorgan",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "UK’s Smarter Web Company adds $24.7M in Bitcoin, now holds 773 BTC",
      "link": "https://cointelegraph.com/news/uk-smarter-web-adds-24m-bitcoin-brings-holdings-773-btc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M1ZjUtMjVkZi03MWFhLWEyYzktYTRlZWZmOTJiZThm.jpg\" /></p><p>The Smarter Web Company has boosted its Bitcoin treasury with an additional $24.7 million BTC purchase as part of its 10-year strategy.</p>"
    },
    {
      "title": "Deutsche Bank to launch crypto custody accounts in 2026: Report",
      "link": "https://cointelegraph.com/news/deutsche-bank-crypto-custody-accounts-2026?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M1YjQtNmVkYS03MGNmLTg3MGUtNTRlNzQ5YmYwMDAx.jpg\" /></p><p>Deutsche Bank reportedly plans to launch a crypto custody service in 2026 with Bitpanda and Taurus, expanding its digital asset initiatives in Europe.</p>"
    },
    {
      "title": "Bitcoin due to copy S&amp;P 500 to hit new all-time high in July: Forecast",
      "link": "https://cointelegraph.com/news/bitcoin-due-to-copy-sp-500-hit-new-all-time-high-in-july-forecast?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M1OTItZThiMi03MDljLTkyZGUtZjEyOTBmZWZhMjcw.jpg\" /></p><p>Bitcoin has never lost more than 10% by the July monthly candle close, while stocks have enjoyed straight gains since 2015; will history repeat?</p>"
    },
    {
      "title": "Elon Musk’s xAI raises $10B as Trump threatens to unleash DOGE on him",
      "link": "https://cointelegraph.com/news/musk-xai-raises-10b-trump-feud-reignites?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M1OTAtMzFlNS03MjYyLTg3YTgtNzI1YTIzNGE3MzZl.jpg\" /></p><p>Elon Musk’s xAI secures $10 billion to expand its operations as his clash with US President Donald Trump over government spending heats up again.</p>"
    },
    {
      "title": "Bitcoin targets $200K as profit metrics enter ‘cautiously optimistic’ zone",
      "link": "https://cointelegraph.com/news/bitcoin-targets-200k-btc-profit-metrics-cautiously-optimistic-zone?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2M1NDgtY2E5Yy03NmE1LTgwZTMtMzczZDFhN2ZjMGU5.jpg\" /></p><p>Bitcoin’s high profitability signals a possible correction in the short term amid increasing calls for $200,00 BTC price later in 2025.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "South Korea halts CBDC plans, shifting focus to bank-led stablecoins",
      "link": "https://cryptoslate.com/south-korea-halts-cbdc-plans-shifting-focus-to-bank-led-stablecoins/",
      "summary": "<p>Local reports indicate that South Korea’s central bank has suspended its central bank digital currency (CBDC) pilot program, pivoting the nation’s focus toward a private, bank-led stablecoin initiative. The Bank of Korea (BOK) halted its &#8220;Project Han River,&#8221; following mounting pressure from commercial banking partners who cited prohibitive costs and the absence of a viable [&#8230;]</p> <p>"
    },
    {
      "title": "Connecticut closes door on Bitcoin, mandates strict disclosure for crypto firms",
      "link": "https://cryptoslate.com/connecticut-bans-bitcoin-use-for-state-investment/",
      "summary": "<p>Connecticut has taken a firm stance against government involvement in digital assets like Bitcoin. On June 30, Governor Ned Lamont signed a new bill into law that bans state agencies from investing in crypto, including Bitcoin. The legislation, known as House Bill 7082, also prevents state entities from accepting these assets as payment for any [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin ETFs add $2.9B in last week of June ending month strong",
      "link": "https://cryptoslate.com/insights/bitcoin-etfs-add-2-9b-in-last-week-of-june-ending-month-strong/",
      "summary": "<p>Spot Bitcoin ETFs added $2.92 billion in net inflows between June 23 and June 30, capping off the strongest eight-day streak since mid-May. After slowing inflows in early June, the market appears to have re-engaged with ETFs as geopolitical uncertainty flared again in the Middle East and broader risk appetite improved. The bulk of the [&#8230;]</p> <p>"
    },
    {
      "title": "Supreme Court confirms IRS right to access customer data from crypto exchanges without warrant",
      "link": "https://cryptoslate.com/supreme-court-confirms-irs-right-to-access-customer-data-from-crypto-exchanges-without-warrant/",
      "summary": "<p>The United States Supreme Court has allowed a lower court ruling to stand, granting the Internal Revenue Service broad authority to access customer data from cryptocurrency exchanges. On Monday, the court denied a petition for a writ of certiorari in Harper v. Faulkender, docket number 24-922, ending a legal challenge that questioned the constitutionality of [&#8230;]</p> <p>"
    },
    {
      "title": "SEC set for summer crypto ETF approval wave including XRP, ADA and SOL amid $6B investment surge",
      "link": "https://cryptoslate.com/landmark-6-billion-influx-boosts-bitcoin-and-ethereum-etfs/",
      "summary": "<p>June 2025 was a landmark month for US spot Bitcoin and Ethereum exchange-traded funds (ETFs), as they collectively secured nearly $6 billion in fresh inflows. This impressive performance marks one of their strongest showings this year, reflecting heightened institutional interest in crypto. According to SoSoValue data, Bitcoin-focused ETFs attracted the lion&#8217;s share of the funds, [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Shopping Spree: Strategy Continues Accumulation With $530M Purchase",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-shopping-spree-strategy-continues-accumulation-with-530m-purchase/",
      "summary": "Strategy (previously MicroStrategy), the leading corporate holder of Bitcoin (BTC), is on the verge of reaching a significant milestone as it approaches the acquisition of 600,000 tokens. In its latest move, the company purchased 4,980 Bitcoin between June 23 and June 29 for an average price of $106,801 each, totaling approximately $531.9 million. This latest purchase has brought the company’s total Bitcoin holdings to 597,325, acquired for around $42.4 billion. Strategy Shares Surge 4.7% Despite Bitcoin&#8217;s price remaining relatively stable at around $107,000 and $107,500 over the past 24 hours, Strategy&#8217;s shares, MSTR, increased by 4.7% to $402.07 on Monday, reflecting investor confidence in the company&#8217;s financial moves. The value of Strategy&#8217;s Bitcoin holdings now stands at roughly $64 billion. Related Reading: Wave 3 Ignites As XRP Breaks Structure—Analyst Says ‘Fireworks Ahead’ Funding for these latest acquisitions came through the sale of stock under various at-the-market offerings. Benchmark analyst Mark Palmer noted that the company&#8217;s Bitcoin yield, which measures the change in the ratio of its Bitcoin holdings to total shares outstanding, was 19.7% between January 1 and June 29. Strategy&#8217;s Chairman, Michael Saylor, who is often regarded as one of Bitcoin&#8217;s most vocal advocates, hinted at the recent purchase in a social media post over the weekend. He stated, “In 21 years, you’ll wish you’d bought more,” alongside a chart illustrating the performance of Strategy’s Bitcoin portfolio since its initial investment in late 2020, which shows the aggressive purchases that have increased over the past year. Bitcoin Price Hovers Around $107,000 Interestingly, the company had made a smaller purchase of 245 Bitcoins between June 16 and June 22, considerably less than its usual massive acquisitions. For context, Strategy had previously acquired 10,100 Bitcoins in just six days during the period from June 9 to June 15. This shows that while the company often makes large purchases, it can also vary its acquisition strategy based on market conditions. Over the past month, the market’s leading cryptocurrency has seen a notable volatility spike with prices failing to tackle its current record price of $111,800 reached during last month’s rally. Related Reading: Solana Forms Bullish Flag On Daily Chart — Breakout Imminent? Since, Bitcoin has managed to endure subsequent price drops, with the most recent plunging BTC toward the $98,000 zone. However, the cryptocurrency has managed to record a 2.4% recovery on the weekly time frame, currently consolidating at $107,000. Originally founded as an enterprise software firm, Strategy has transformed into a leveraged play on Bitcoin, allowing investors to gain exposure to cryptocurrency without directly owning it. Since August 2020, the company has consistently increased its Bitcoin reserves by selling stock and debt. This has prompted criticism from analysts who believe this could be dangerous if the Bitcoin price drops below the firm’s average buying price. Featured image from DALL-E, chart from TradingView.com"
    },
    {
      "title": "Ethereum Just Got Its MicroStrategy—Tom Lee Bets On Soaring ETH Price",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-microstrategy-tom-lee-bets-eth-price/",
      "summary": "Nearly three years after the Merge formally switched Ethereum to proof-of-stake on 15 September 2022, a publicly listed Bitcoin miner is adopting the network’s native token as its primary treasury asset. BitMine Immersion Technologies (NYSE American: BMNR) on 30 June priced a $250 million private placement of 55,555,556 new shares at $4.50 each and appointed Fundstrat co-founder Tom Lee as chairman. The company’s SEC filing and press release make the purpose explicit: all net proceeds will be used to acquire and stake ether, a move management likens to Michael Saylor’s now-legendary Bitcoin strategy at MicroStrategy. Tom Lee Goes Full MicroStrategy On Ethereum Speaking hours later on CNBC’s Squawk Box, Lee framed the pivot as a logical response to the explosive growth of stablecoins, most of which settle on Ethereum. “Stablecoins, which is the ChatGPT of crypto, because it’s viral adoption by consumers, businesses, banks and now even Visa,” he said, underscoring why a treasury heavy in ETH could become strategically indispensable. Ethereum’s proof-of-stake design means that large holders who validate blocks “secure the fidelity of stablecoins,” Lee continued. “When Goldman issues a stablecoin and JP Morgan [issues] it on Ethereum as a layer-one blockchain, they’re going to want to secure it by staking Ethereum.” Related Reading: Top Analyst Predicts Major Ethereum Rally Toward $4,000 As Shorts Hit All-Time Highs Lee tied the long-term upside to macro numbers the US Treasury itself has started to cite. Stablecoins today hover around $250 billion; Treasury Secretary Scott Bessent recently suggested the figure could hit $2 trillion—a potential ten-fold expansion that, in Lee’s words, would “insure dollar dominance.” Because Ethereum already underpins more than half of stable-value tokens, a multi-trillion-dollar stablecoin market would translate directly into rising transaction fees for the network and, by extension, higher staking rewards for BitMine’s planned validator clusters. The private-placement syndicate reads like a who’s-who roster from both TradFi and crypto: MOZAYYX led the round, joined by Founders Fund, Pantera, FalconX, Republic Digital, Kraken, Galaxy Digital, Digital Currency Group, Diametric Capital and Occam Crest. Closing is expected on or about 3 July, subject to NYSE American approval. BitMine, headquartered in Las Vegas, will immediately deploy the ETH position into staking, giving the miner a yield-bearing balance-sheet asset while reinforcing Ethereum’s security budget. “One of the key performance metrics for BitMine going forward is to increase the value of ETH held per share,” chief executive Jonathan Bates said in the statement. For investors, the comparison with MicroStrategy is unavoidable but imperfect. Saylor’s company amassed bitcoin under a proof-of-work regime that offers no native yield; BitMine’s ether can generate income through both staking rewards and potential capital-markets transactions collateralized by those staked coins. Related Reading: Strong Ethereum Accumulation Detected: LTH Buying Heavy During June Consolidation Yet both strategies share a central bet: that a scarce digital asset sitting at the core of global finance will appreciate faster than cash alternatives on a corporate balance sheet. Whether BitMine achieves MicroStrategy-level returns will depend on execution, regulatory clarity for staking, and—most of all—Ethereum’s price path. What is clear, however, is that corporate treasuries are beginning to see ether not merely as “gas” for decentralized applications but as a strategic reserve asset in its own right. From a market-structure vantage, the new treasury model could translate into meaningful price torque for Ether if it scales. MicroStrategy’s serial purchases have now absorbed nearly 600,000 BTC—around 2.8 percent of the 21 million-coin cap—and coincided with Bitcoin’s ascent from roughly $11,000 in August 2020, when the company made its first buy, to more than $107,000 today, a near-ten-fold move. BitMine’s opening salvo—$250 million, or about 100,000 ETH at current prices—represents barely 0.08 percent of Ethereum’s 122 million-coin supply, yet roughly 28 percent of that supply is already locked in staking contracts while net issuance has turned negative post-EIP-1559, shrinking the freely tradable float. If even a handful of additional balance sheets emulate this “ETH-as-reserve” playbook, the resulting demand shock could replicate the supply-squeeze dynamics that propelled Bitcoin into six-figure territory. At press time, Ether traded at $2,459. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Analyst Calls For Bitcoin Crash As Price Pulls Above $108,000 — Details",
      "link": "https://www.newsbtc.com/news/bitcoin/analyst-call-bitcoin-crash/",
      "summary": "The past weekend was favorable for Bitcoin as the price was able to rebound from last week’s lows and go on to reclaim $108,000 ahead of the new week. This has boosted market sentiment once again, prompting investors to return to the table. However, as the price continues to sit in the green, one crypto analyst has sounded the alarm that the Bitcoin price may be headed for another crash toward the support area close to $100,000. Why A Bitcoin Price Crash Is Imminent In the TradingView analysis, the crypto analyst reveals the reason why the Bitcoin price could dump back downwards is because of mounting resistance. This is because, as the leading cryptocurrency moves toward new all-time highs, there is the possibility of a pushback before it is able to continue its rally. Related Reading: Bitcoin Consolidating Below $108,000 But Eyes $115,000 Target In this case, the crypto analyst does expect the Bitcoin price to keep rising. But they see a lot of resistance for the digital asset just above $109,000. More specifically, at $109,500, which is still a ways away from the $112,000 needed to create a new all-time high, the cryptocurrency is expected to meet new resistance and dump back downward. This stiff resistance opens up an opportunity for market shooters to enter into the trade. According to the chart, it is possible for the Bitcoin price to actually move toward the low $100,000s. Currently, there is major support at $102,500, and if the digital asset does lose its footing, this is likely where the bulls will stage their recovery once more. Sweeping For Liquidity At Lower Ranges Another crypto analyst, Riscora, has supported this move with their own analysis, also predicting that a pullback is possible from here. This still boils down to mounting resistance as the Bitcoin price moves toward the possibility of reaching a new all-time high, and budding liquidity rises at the lower levels. Related Reading: TD Sequential Flashes Buy: Dogecoin Ready For Rebound To $0.21 The analyst explains that as liquidity has now been taken in the higher levels, after Bitcoin hit $108,000, there is bound to be a correction. This time around, they expect the correction to be much deeper given the recent bullish impulse move. The target from her sis a move back into the $107,000 territory, before moving further downward to take on the $106,400 support. Despite the expectation of a price dip, the analyst warns that the Bitcoin price remains overall bullish from here. As the crypto market ushers in the month of July, which is usually bullish for Bitcoin, it is possible that the cryptocurrency does put in a new all-time high this month, seeing as there is less than a 5% move left to beat its current $111,900 peak. Featured image from Dall.E, chart from TradingView.com"
    },
    {
      "title": "Solana Summer Loading? SOL Eyes $180 Following Staked ETF-Fueled Breakout",
      "link": "https://www.newsbtc.com/news/solana-summer-loading-sol-eyes-180-following-staked-etf-fueled-breakout/",
      "summary": "Solana (SOL) has retested a crucial resistance level after recovering the $150 level over the weekend. The surge, fueled by the upcoming launch of a SOL-based staked exchange-traded fund (ETF), has led some analysts to forecast a rally toward the next key target. Related Reading: Bitcoin Price At $145,000 In September? Bullish Dojis Suggest Upward Move Solana Staked ETFs Coming On Wednesday On Monday, Solana’s price soared to a key resistance level following the introduction of “the first-ever Solana staked crypto ETF in the US.” Rex Shares announced it will launch a Solana-based staked ETF this Wednesday, aiming to offer exposure to SOL and staking rewards. According to the X post, the REX-Osprey ETF will track SOL’s performance while “generating yield through on-chain staking,” starting a “new era of yield-generating crypto exposure.” As a result, Solana climbed to the $160 barrier, which led to nearly $9 million in short positions liquidated on Monday afternoon. Market Watcher Daan Crypto Trades considers Solana “bounced nicely over the weekend” but has yet to turn the Low Timeframe (LTF) trend around. He explained that reclaiming the $159-$167 area is necessary to aim for higher levels. Additionally, the Daily 200-day Moving Average (MA) and Exponential Moving Average (EMA) are currently located within this range. “I would want to see price trade back above that to start targeting the $180-$200 region again,” he detailed. Nonetheless, the trader questioned whether a Solana spot ETF-driven rally will fuel the cryptocurrency’s run. Notably, multiple investment firms, including Grayscale, VanEck, 21Shares, and Bitwise, have filed with the Securities and Exchange Commission (SEC) to launch a spot SOL ETF in the US. According to recent reports, the investment products have a “high likelihood” of being approved in the coming weeks, which has seemingly fueled investors’ expectations of a bullish “Solana Summer.” “The big question is how much demand there will be,” Daan asserted, noting that Ethereum (ETH) sport ETFs, approved in July 2024, had a disappointing launch and “only started seeing decent inflows about a year later.” SOL Ready For Another Breakout? Following the ETF-fueled breakout, analyst Hardy noted Solana’s “Textbook move, clean breakout, clean retest, and pump,” which could trigger a run toward the $200 barrier. Notably, the cryptocurrency saw a remarkable performance over the weekend, reclaiming the $144-$148 crucial area and breaking past the $150 mark. Amid this performance, the analyst highlighted that Solana had broken out of its local downtrend line after reclaiming the $148 resistance and was retesting the breakout zone. He explained that there is “Juicy liquidity sitting above, ready to be taken,” adding that Solana needed to hold the $150 support to continue its bullish run toward the next target. Related Reading: Analyst Reveals Rational Behind XRP Price Reaching $9.5 And $37.5 Meanwhile, analyst Crypto Batman considers that Solana is “setting up very nicely” after the $160 retest. Per"
    },
    {
      "title": "Ethereum At Risk? If $2,200 Cracks, $1,160 May Be Coming",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-risk-2200-cracks-1160-may-be-coming/",
      "summary": "Ethereum currently has strong support at $2,200, but one analyst has pointed out that if the level fails, the next region to watch could be $1,160. On-Chain Data Shows Strong Ethereum Demand Zone Near $2,200 In a new post on X, analyst Ali Martinez has talked about where support lies for Ethereum based on on-chain data. In on-chain analysis, levels are considered as major support/resistance zones if they host the cost basis or acquisition level of a significant part of the ETH supply. The reason behind this lies in the fact that investors are more likely to show some kind of reaction when the retest of their break-even level takes place. This buying/selling is irrelevant to the wider market if only a few holders are having it tested at once, but the story can be different when the retest is of the cost basis of a large amount of them. Related Reading: Dogecoin Under Pressure: Only Top 10 Coin Where Loss-Taking Exceeds Profit Below is the chart shared by the analyst that shows how the different price levels around the current Ethereum spot price are currently looking in terms of the amount of supply that was purchased at them. In the graph, the size of the dot corresponds to the amount of Ethereum supply contained within the associated price range. It would appear that, out of the ranges listed, the $2,218 to $2,396 levels currently have the largest dot, meaning that they host the most supply. More specifically, this range has the cost basis of 6.28 million addresses, who purchased a total of 67.2 million ETH at its levels. Given this fact, it&#8217;s possible that should a retest of the range occur, investors could show a strong reaction. But what kind of reaction would it be, buying or selling? Well, these investors are in profit right now and usually, such holders are more likely to double down on the asset during declines to their acquisition mark, as they may believe the same price level would turn out to be profitable again in the future. As such, the $2,218 to $2,396 range could end up acting as a strong support level for Ethereum. In the scenario that ETH falls below the lower end of the range around $2,200, however, it may have to rely on support elsewhere. Related Reading: XRP Down 3% After SEC Settlement Stalls, But Social Media Turns Bullish From the chart, it&#8217;s apparent that all the ranges below are much smaller in terms of supply. The next major support zone lies all the way down at $1,160, where 35.9 million addresses acquired 21.58 million tokens. Naturally, Ethereum doesn&#8217;t have to slip right through to this zone if $2,200 is lost, but if the data is to go by, it does suggest that the coin could have a harder time regaining footing below it. ETH Price Ethereum is holding above the on-chain demand zone for now as its price is floating around $2,475. Featured image from Dall-E, Sentora.com, chart from TradingView.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "German Bank Sparkassen-Finanzgruppe Plans to Offer Bitcoin For Private Customers",
      "link": "https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/German-Bank-Sparkassen-Finanzgruppe-Plans-to-Offer-Bitcoin-For-Private-Customers.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/german-bank-sparkassen-finanzgruppe-plans-to-offer-bitcoin-for-private-customers\" rel=\"nofollow\"> </a></p> <p>Germany's largest savings bank financial group will allow private customers to trade Bitcoin and other cryptocurrencies by 2026, in partnership with DekaBank.</p> <p>"
    },
    {
      "title": "How Institutional Flows and Market Cycles Are Shifting",
      "link": "https://bitcoinmagazine.com/markets/how-institutional-flows-and-market-cycles-are-shifting",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/How-Institutional-Flows-and-Market-Cycles-Are-Shifting.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/how-institutional-flows-and-market-cycles-are-shifting\" rel=\"nofollow\"> </a></p> <p>Is bitcoin going higher or lower? Fundamentals are still strong, and post-halving trends show a predictable pattern.</p> <p>"
    },
    {
      "title": "Are Bitcoin Treasury Companies Ponzi Schemes?",
      "link": "https://bitcoinmagazine.com/takes/are-bitcoin-treasury-companies-ponzis",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Gemini_Generated_Image_xrkcodxrkcodxrkc-1.jpeg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/takes/are-bitcoin-treasury-companies-ponzis\" rel=\"nofollow\"> </a></p> <p>Financial machines of perpetual motion don’t work but bitcoin treasury companies are certainly trying. Why would this fad be any different?</p> <p>"
    },
    {
      "title": "Vanadi Coffee Shareholders Approve €1 Billion Bitcoin Treasury Strategy",
      "link": "https://bitcoinmagazine.com/news/vanadi-coffee-shareholders-approve-e1-billion-bitcoin-treasury-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Vanadi-Coffee.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/vanadi-coffee-shareholders-approve-e1-billion-bitcoin-treasury-strategy\" rel=\"nofollow\"> </a></p> <p>Shareholders of Vanadi Coffee have approved a plan to invest up to €1 billion in Bitcoin as part of a new strategy to manage the company’s finances. This move puts the small café chain, which runs six locations in Alicante, on track to become the largest publicly listed Bitcoin-holding company in Spain.&#160; According to an [&#8230;]</p> <p>"
    },
    {
      "title": "Strategy Acquires $531.9 Million in Bitcoin, Now Holds 597,325 BTC",
      "link": "https://bitcoinmagazine.com/news/strategy-acquires-531-9-million-in-bitcoin-now-holds-597325-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Strategy-Acquires-531.9-Million-in-Bitcoin-Now-Holds-597325-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/strategy-acquires-531-9-million-in-bitcoin-now-holds-597325-btc\" rel=\"nofollow\"> </a></p> <p>Strategy, formerly Microstrategy, has announced the acquisition of an additional 4,980 Bitcoin for approximately $531.9 million, according to a new SEC Form 8-K filed on June 30, 2025. The average purchase price was $106,801 per Bitcoin, inclusive of fees and expenses. The purchase was funded by an equity raise from June 23–29, 2025, across its [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Feds Charge Man With $1.7M Scheme to Convert Fake Checks Into Bitcoin",
      "link": "https://decrypt.co/327970/feds-charge-man-with-1-7m-scheme-to-convert-fake-checks-into-bitcoin",
      "summary": "The alleged scheme involved laundering the proceeds of counterfeit checks and business email compromise scams into Bitcoin."
    },
    {
      "title": "Bitget Wallet Launches Crypto-Linked Mastercard in Partnership with Immersve",
      "link": "https://decrypt.co/327952/bitget-wallet-launches-crypto-linked-mastercard-in-partnership-with-immersve",
      "summary": "The card will initially launch in the UK and the European Union, before rolling out later in Latin America, Australia and New Zealand."
    },
    {
      "title": "Australia’s Swyftx to Acquire Caleb &#038; Brown in Record $66M Plus ANZ Crypto Deal",
      "link": "https://decrypt.co/327941/australias-swyftx-acquires-caleb-brown-record-anz-crypto-deal",
      "summary": "Swyftx is acquiring Caleb &#038; Brown in the largest crypto M&#038;A deal in ANZ as it seeks a foothold in the U.S. to target high-net-worth clients."
    },
    {
      "title": "Trump Threatens to Turn DOGE Against Former Chief Elon Musk",
      "link": "https://decrypt.co/327947/trump-threatens-doge-elon-musk",
      "summary": "Trump has escalated his feud with Musk, suggesting DOGE scrutinize the billions in subsidies supporting the business magnate's companies."
    },
    {
      "title": "Ubisoft Adds AI Agents to ‘Captain Laserhawk’ Game That Vote and Govern",
      "link": "https://decrypt.co/327905/ubisoft-adding-ai-agents-captain-laserhawk-game-vote-govern",
      "summary": "Blockchain game Captain Laserhawk: The G.A.M.E. is integrating AI agents that can make governance decisions on behalf of players."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "World.fun rolls out new launch model with debut of AI Shark Tank",
      "link": "https://cryptobriefing.com/ai-shark-tank-world-launch/",
      "summary": "<p>World.fun launches new platform for AI-powered simulations, kicking off with AI Shark Tank and a token model based on real user interaction.</p> <p>"
    },
    {
      "title": "Germany’s largest bank Deutsche Bank plans to roll out crypto custody service next year",
      "link": "https://cryptobriefing.com/deutsche-bank-crypto-custody-service/",
      "summary": "<p>Deutsche Bank's crypto custody service could accelerate institutional adoption of digital assets, enhancing trust and regulatory compliance.</p> <p>"
    },
    {
      "title": "Circle applies for national trust bank license to expand USDC reserve custody",
      "link": "https://cryptobriefing.com/circle-trust-bank-license-tokenized/",
      "summary": "<p>Circle seeks a trust bank license to directly manage USDC reserves and offer custody for tokenized stocks and bonds onchain.</p> <p>"
    },
    {
      "title": "SEC to rule on Grayscale’s proposal to convert Bitcoin, Ether, XRP, and ADA large-cap fund into a spot ETF this week",
      "link": "https://cryptobriefing.com/crypto-etf-approval-grayscale/",
      "summary": "<p>Approval could set a precedent for broader crypto ETF adoption, potentially transforming investment landscapes and regulatory approaches.</p> <p>"
    },
    {
      "title": "Ripple-backed XRP Ledger launches EVM-compatible sidechain to unlock cross-chain DeFi",
      "link": "https://cryptobriefing.com/xrpl-evm-sidechain-cross-chain-defi/",
      "summary": "<p>The launch of the EVM-compatible sidechain on the XRP Ledger could significantly enhance cross-chain DeFi, fostering broader blockchain interoperability.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "How OppiWallet’s virtual and physical cards eliminate the crypto-to-fiat hassle",
      "link": "https://ambcrypto.com/how-oppiwallets-virtual-and-physical-cards-eliminate-the-crypto-to-fiat-hassle/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"521\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Screenshot-2025-07-01-144027.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"928\" />OppiWallet today highlighted how its dual virtual and physical cards eliminate the barriers between crypto [&#8230;]"
    },
    {
      "title": "Can XRP make a Q3 comeback, rattle Ethereum’s dominance? Mapping…",
      "link": "https://ambcrypto.com/can-xrp-make-a-q3-comeback-rattle-ethereums-dominance-mapping/",
      "summary": "<img alt=\"Can XRP make a Q3 comeback, rattle Ethereum&#039;s dominance? Mapping...\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Ritika.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Ripple vs Ethereum: Funding rates rise, ratio rebounds at support."
    },
    {
      "title": "Gate surpasses 30 million global users, accelerating its rise as the next-generation crypto exchange",
      "link": "https://ambcrypto.com/gate-surpasses-30-million-global-users-accelerating-its-rise-as-the-next-generation-crypto-exchange/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"515\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Screenshot-2025-07-01-142202.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"929\" />Gate, a globally leading cryptocurrency trading platform, has officially surpassed 30 million registered users, marking [&#8230;]"
    },
    {
      "title": "Bitcoin easily absorbs LTH exits – Is MicroStrategy’s 3% BTC share the reason?",
      "link": "https://ambcrypto.com/bitcoin-easily-absorbs-lth-exits-is-microstrategys-3-btc-share-the-reason-why/",
      "summary": "<img alt=\"Bitcoin easily absorbs LTH exits - Is MicroStrategy’s 3% BTC share the reason why?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-6.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />LTH distribution, MSTR accumulation, and seasonal strength: All signs point to a breakout hidden in plain sight."
    },
    {
      "title": "Cats Fishing: Status Network’s first mobile fishing game turns lore and occult mysteries into playable myth",
      "link": "https://ambcrypto.com/cats-fishing-status-networks-first-mobile-fishing-game-turns-lore-and-occult-mysteries-into-playable-myth/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1372\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/james-wheeler-HJhGcU_IbsQ-unsplash.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Cats Fishing reimagines mobile gameplay as Status Network&#8217;s first open-world mobile fishing game, transforming a [&#8230;]"
    }
  ]
}