{
  "CoinDesk": [
    {
      "title": "Spot Crypto ETF Filings for XRP, SOL, DOGE Among Those With Overwhelming SEC Approval Odds: Bloomberg",
      "link": "https://www.coindesk.com/markets/2025/06/20/spot-crypto-etf-filings-for-xrp-sol-doge-among-those-with-overwhelming-sec-approval-odds-bloomberg",
      "summary": ""
    },
    {
      "title": "Bitcoin Quickly Plunges Below $103K, With Volatility Burst Spurring $450M in Crypto Liquidations",
      "link": "https://www.coindesk.com/markets/2025/06/20/bitcoin-quickly-plunges-below-103k-with-volatility-burst-spurring-450m-in-crypto-liquidations",
      "summary": ""
    },
    {
      "title": "Trumps May Have Sold Platform Stake as U.S. Stablecoins See Wave of Good News",
      "link": "https://www.coindesk.com/policy/2025/06/20/as-u-s-stablecoins-see-wave-of-good-news-trumps-may-have-sold-platform-stake",
      "summary": ""
    },
    {
      "title": "Peter Schiff Says He 'Gets Bitcoin' But Not USD-Pegged Stablecoins, Floats Gold-Backed Token Plan",
      "link": "https://www.coindesk.com/markets/2025/06/20/peter-schiff-says-he-gets-bitcoin-but-not-usd-pegged-stablecoins-floats-gold-backed-token-plan",
      "summary": ""
    },
    {
      "title": "Semler Scientific Investors Cheered by New Hire, Lofty Bitcoin Acquisition Goals",
      "link": "https://www.coindesk.com/markets/2025/06/20/semler-scientific-investors-cheered-by-new-hire-lofty-bitcoin-acquisition-goals",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Here’s what happened in crypto today",
      "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg\" /></p><p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>"
    },
    {
      "title": "Thai SEC opens consultation period for token issuance rules",
      "link": "https://cointelegraph.com/news/thai-sec-proposes-new-rules-crypto-token-insider-trading?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhlZmEtYmIwNy03NzFmLThjMTItZTY0OWJiZTQ0YzZk.jpg\" /></p><p>The consultation period comes as Thailand seeks to clarify regulations for the crypto industry.</p>"
    },
    {
      "title": "Bitcoin’s $96B open interest shows role leverage plays in rallies, but there is a risk",
      "link": "https://cointelegraph.com/news/bitcoin-leverage-use-sends-oi-to-96b-but-there-s-a-catch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhkYjQtYjVhNC03Y2Y2LWEwYTQtMzdhNDZiYmY1Y2Qy.jpg\" /></p><p>Bitcoin’s $96 billion in derivatives open interest fuels BTC price momentum near all-time highs, but rising leverage use raises the risk of liquidations and market volatility.</p>"
    },
    {
      "title": "Norway’s government explores crypto mining ban amid energy supply concerns",
      "link": "https://cointelegraph.com/news/norway-government-crypto-mining-ban-energy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhkYjYtMDdmNC03NWJhLTk3MmMtNDBlYjYwMzFlYjk3.jpg\" /></p><p>A temporary ban could be imposed as early as autumn based on an investigation into crypto miners’ energy consumption.</p>"
    },
    {
      "title": "Crypto Biz: AI money rush could reshape digital asset industry",
      "link": "https://cointelegraph.com/news/ai-vs-crypto-venture-capital-decentralized-future?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDIvMDE5NGQ1NzgtNmJhYi03YzE4LWIwYzUtNjI5MmJkNGVmZTdk.jpg\" /></p><p> moderated an AI funding panel at the Web Summit conference in Vancouver, Canada.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Alex Mashinsky forfeits rights to Celsius assets amid ongoing bankruptcy process",
      "link": "https://cryptoslate.com/alex-mashinsky-forfeits-rights-to-celsius-assets-amid-ongoing-bankruptcy-process/",
      "summary": "<p>Alex Mashinsky, the former CEO of Celsius, has agreed to surrender all rights to assets tied to the collapsed crypto lender. According to newly filed court documents, Mashinsky and entities associated with him, including AM Ventures Holdings Inc., Koala1 LLC, and Koala3 LLC, will be excluded from any future distributions under the Celsius bankruptcy plan. The [&#8230;]</p> <p>"
    },
    {
      "title": "Bloomberg analysts revise ETF approval odds to ‘90% or higher’ as SEC requests amended filings",
      "link": "https://cryptoslate.com/bloomberg-analysts-revise-etf-approval-odds-to-90-or-higher-as-sec-requests-amended-filings/",
      "summary": "<p>Bloomberg analysts have sharply increased the likelihood of U.S. regulators approving a new wave of cryptocurrency exchange-traded funds, pointing to a friendlier stance from the Securities and Exchange Commission (SEC). Bloomberg senior ETF analysts Eric Balchunas and James Seyffart said on June 20 that they now see a &#8220;90% or higher&#8221; chance that a broad [&#8230;]</p> <p>"
    },
    {
      "title": "Coinbase secures MiCA approval, shifts headquarters to Luxembourg",
      "link": "https://cryptoslate.com/coinbase-secures-mica-approval-shifts-headquarters-to-luxembourg/",
      "summary": "<p>Coinbase, the largest US-based exchange, has taken a major step in its global expansion by securing approval under the European Union’s Markets in Crypto-Assets (MiCA) regulation, according to a June 20 statement. The exchange confirmed that Luxembourg’s financial watchdog, the Commission de Surveillance du Secteur Financier (CSSF), granted it the necessary license to operate across the [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin falls to monthly lows triggering $464 million in liquidations amid global market jitters",
      "link": "https://cryptoslate.com/bitcoins-falls-to-monthly-lows-triggering-464-million-in-liquidations-amid-global-market-jitters/",
      "summary": "<p>Bitcoin (BTC) fell to its lowest price this month on June 20, triggering $464 million in liquidations across cryptocurrency markets as geopolitical jitters and heavy selling pressure rattled traders. Bitcoin dropped to a low of $102,225, reversing the gains recorded earlier in the day after failing to break through resistance above $106,000. Data from Coinglass [&#8230;]</p> <p>"
    },
    {
      "title": "Standard Chartered forecasts surge tokenizing real-world assets beyond stablecoins",
      "link": "https://cryptoslate.com/standard-chartered-forecasts-surge-tokenizing-real-world-assets-beyond-stablecoins/",
      "summary": "<p>Standard Chartered projected that tokenization of real-world assets (RWAs) beyond stablecoins could accelerate significantly over the next five years, driven by regulatory progress and a sharper focus on high-impact use cases, according to a June 20 report shared with . The bank’s report, titled “RWA Tokenisation — A Growth Opportunity,” highlighted that while stablecoins remain [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Solana Analyst Sees $123 And $116 As Mid-Zone Support Levels – Here’s Why",
      "link": "https://www.newsbtc.com/news/solana/solana-analyst-sees-123-and-116-as-mid-zone-support-levels-heres-why/",
      "summary": "Solana is currently testing a critical demand zone near the $150 level after enduring weeks of persistent selling pressure and a broader shift in market sentiment. The asset is now trading roughly 20% below its May high of $185, with recent attempts at recovery facing strong resistance. Despite holding above major support for now, the overall structure suggests that downside risk remains if market conditions don’t improve soon. Related Reading: Ethereum Analyst Eyes High Timeframe Close – Range Break Above $2,800 Could Be Violent Top analyst Efloud shared a technical analysis on X, highlighting the importance of tracking Solana’s response to broader Bitcoin dynamics. He noted that if Bitcoin (BTC) continues to consolidate sideways while Bitcoin dominance (BTC.D) rises, altcoins like SOL may struggle. In that case, Solana could continue retracing to find stronger support at mid-zones, particularly around the $123 and $116 levels. These price zones have previously acted as solid support/resistance areas and could serve as key inflection points should bearish momentum persist. A breakdown toward these targets would likely coincide with increasing BTC.D and continued investor caution in the altcoin market. Until then, SOL remains vulnerable within a fragile technical structure, and traders will closely watch for either a rebound or deeper correction in the coming days. Solana Holds Key Support As Analysts Eye Bullish Scenarios Solana is currently trading about 50% down from its all-time highs, with the explosive momentum seen at the end of 2024 now replaced by more subdued price action. The asset’s underperformance has left investors cautious, but many analysts remain optimistic about Solana’s potential once a new altcoin rally begins. For now, the focus is on holding critical demand zones that could determine whether SOL is gearing up for a recovery or further downside. According to Efloud, if Bitcoin continues consolidating sideways while Bitcoin dominance rises, Solana may find support at several mid-zones, particularly around $123 and $116. The $140 region has historically acted as a strong support/resistance flip, and a deviation around this level—losing it briefly before regaining it with strength—could present a short-term buying opportunity. Efloud notes that this scenario doesn’t necessarily imply that SOL must drop to those levels, but current market conditions—aside from Bitcoin—lack strong pair structures. If SOL can decisively break above the $168 resistance, a new leg upward could be triggered, with $230 potentially acting as the next major resistance zone. On the SOL/BTC pair, Efloud is watching for a reclaim of the 0.0015 level or a pullback toward 0.00115 for confirmation. Another key support sits at 0.000988 sats. Despite the current cooling, the structure may still offer solid opportunities for new entrants. If these levels hold and macro conditions improve, SOL could be setting the stage for a sustainable rally, ultimately leading to new all-time highs. Related Reading: Ethereum Mirrors Bitcoin 2017-2021 Pattern – $4,000 Is The Trigger Point Weekly Chart Analysis – Holding the Line Near Key Support Solana is currently trading at $148.33 on the weekly timeframe, showing a 3% decline over the past seven days. The price has dropped roughly 20% from its May high of around $185 and is now testing the critical $140–$150 support zone. This level has repeatedly acted as a pivot point in the past and could define SOL’s short-term trajectory. The chart shows that Solana has been unable to reclaim the 50-week moving average (currently near $170), which now acts as key resistance. A decisive weekly close above this level would open the door for a bullish continuation toward $185 and possibly $200. However, failure to hold above the 100-week moving average around $132 could lead to further downside pressure, with $123 and $116 as the next demand zones to watch—levels identified by analyst Efloud in his mid-zone scenario. Related Reading: Bitcoin Consolidates as Realized Profits Stay Low – No Signs Of Major Sell-Off Yet Volume has declined steadily over the past three weeks, signaling reduced participation, but also suggesting that aggressive selling is fading. If bulls manage to reclaim $160 with conviction, the structure remains favorable. For now, SOL remains in a consolidation phase, awaiting either a breakout or further correction as broader crypto market conditions unfold. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "Bitcoin Price Deviates From Global M2 Money Supply, Is The Bull Run Over?",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-deviates-from-global-m2/",
      "summary": "Crypto analyst Colin has highlighted the Bitcoin price’s deviation from the Global M2 money supply, raising concerns that the bull run may be over. The analyst quickly addressed concerns, noting how such deviations usually happen at some point but don’t invalidate the macro trend. Analyst Highlights Bitcoin Price’s Deviation From Global M2 Money Supply In an X post, Colin revealed that the Bitcoin price has deviated from the global M2 money supply. He noted that this deviation was short-term in an otherwise broad correlation. The analyst added that this current deviation is similar to the position that BTC was in February 2025. Related Reading: Will The Bitcoin Price Move Above $110,000 Again? Global M2 Money Supply Shows What’s Next Colin remarked that this development doesn’t mean the M2 is broken, just as it wasn’t broken back in February. Instead, he claimed that it just means that market participants haven’t zoomed out enough and are allowing for the non-correlated periods. The analyst added that non-correlation between the Bitcoin price and global M2 money supply happens 20% of the time. He then alluded to the regular chart, which shows the strong correlation between the Bitcoin price and the global M2 money supply. Colin explained that the M2 is “directionally predictive” for BTC and that it is not 1:1 price-related. The analyst further remarked that the M2 does not predict a specific BTC price. Instead, the global M2 money supply only predicts the market direction, with about 80% accuracy. Colin added that the Bitcoin price has its y-axis while the M2 is on a different y-axis. He also opined that the M2 may decouple from BTC near the cycle top. Although the analyst didn’t provide a timeline for when the cycle top will be, his analysis indicates that the cycle top is not yet in and the bull run isn’t over. Money Supply Shows No Need To Worry About BTC Price In an X post, market expert Raoul Pal suggested that the Bitcoin price’s correlation with the money supply shows that there is no need to worry about the current price action. He remarked that if 89% of BTC’s price action is explained by global liquidity, then by definition, almost all “news” and “narrative” is noise. Related Reading: Brace For Impact: Bitcoin Price Primed For Deep Correction Below $90,000 This suggests that the current geopolitical risks, heightened by the Israel-Iran conflict, are unlikely to impact the Bitcoin price as much as expected. Trading firm QCP Capital recently noted that the flagship crypto has yet to show full-blown panic, which shows how much the asset has matured. The firm remarked that BTC’s resilient price action appears underpinned by continued institutional accumulation, with companies like Strategy and Metaplanet buying the dip. The Bitcoin ETFs also continue to record positive flows. At the time of writing, the Bitcoin price is trading at around $104,700, down in the last 24 hours, according to data from CoinMarketCap. Featured image from Getty Images, chart from Tradingview.com"
    },
    {
      "title": "TON Holds The Line: Consolidation Break Could Trigger Fresh Momentum",
      "link": "https://www.newsbtc.com/toncoin-ton/ton-eye-fresh-momentum/",
      "summary": "Toncoin (TON) has been quietly building strength, defending the $2.80–$2.95 support zone with remarkable consistency. After weeks of consolidation, the recent break above a falling trendline has caught traders&#8217; attention, hinting at a possible shift in momentum. As TON coils just above this key structure, the stage may be set for a breakout — one that could ignite fresh upside if bullish pressure continues to build. Buyers Defend Key Levels On The Chart In a recent post on X, Alts King pointed out that TON is showing notable strength as it continues to hold above the $2.80–$2.95 support zone. This range has acted as a reliable floor for several weeks, with buyers consistently stepping in to defend it. Related Reading: TON Bullish Pattern Signals Breakout Ahead — 40% Rally Loading? Furthermore, Alts King further observed that a falling trendline, which has long constrained TON’s price action, has now been broken. This technical breakout could mark the early stages of a trend reversal, opening the door for a more sustained bullish move. Looking forward, Alts King believes that if the support zone continues to hold firm, TON may be setting up for a potential rally toward the $6.87 level. To validate this bullish thesis, Alts King recommends watching for the formation of higher highs and higher lows on shorter timeframes. These structural patterns are key indicators of healthy upward movement and would confirm growing confidence among market participants as TON tries to shift out of its consolidation phase. Resistance Zones That May Test TON Momentum To $6.87 As TON begins to show signs of renewed strength, its path toward the $6.87 target isn’t without resistance. One of the first major hurdles lies around $3.04, a support level turned into resistance during the last sell-off. Price action near this range has already shown hesitation in the past, making it a critical level for bulls to reclaim convincingly. Related Reading: Toncoin Open Interest Spikes 33%—Will History Repeat With A Pullback? Above that, the $4.54 level could serve as the next challenge. This zone aligns with prior swing highs and consolidations seen on the daily chart, where TON was previously rejected before resuming downward movement. Breaking through this level would require strong volume and confirmation, especially as traders may look to take profits from lower entries near the $2.80 support base. Finally, before TON can reach the anticipated $6.87 resistance, it must clear the psychological barrier around $6.00, which also coincides with a rounded top structure observed during a prior rally. This level may attract selling pressure from short-term traders aiming to lock in gains. However, only with sustained bullish momentum and the formation of higher highs can TON overcome these layers of resistance and build a real case for a breakout beyond $6.87. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "Ethereum Prepares For A Decisive Move: ETH/BTC Setup Could Trigger Altseason",
      "link": "https://www.newsbtc.com/news/ethereum-prepares-for-a-decisive-move-eth-btc-setup-could-trigger-altseason/",
      "summary": "Ethereum is approaching a critical test as price action tightens, setting the stage for a decisive move above key demand. After weeks of volatile yet controlled trading, bulls are attempting to reclaim higher ground, but momentum remains limited. At the same time, bears have repeatedly failed to drive ETH below the $2,400 level, reinforcing it as a strong support zone for now. With global markets under pressure from geopolitical tensions and macro uncertainty, Ethereum’s next move could define the direction of the broader altcoin market. Related Reading: Ethereum Analyst Eyes High Timeframe Close – Range Break Above $2,800 Could Be Violent Top analyst M-log1 believes the ETH/BTC pair is the most important chart to monitor in the coming days. According to his view, a breakout—either to the upside or downside—will determine the fate of altcoins across the board. The setup has reached an inflection point after multiple tests of the lower support band, with bulls continuing to defend it against breakdown attempts. This consolidation phase, combined with suppressed volatility and rising macro tension, makes Ethereum’s current structure one of the most significant technical formations in crypto right now. All eyes are now on ETH/BTC as traders prepare for what could be a defining moment in the altcoin cycle. Ethereum Builds Pressure As Breakout Nears Ethereum continues to trade within a narrow range that began in early May, hovering between the $2,400 and $2,800 levels. This prolonged consolidation comes at a time of growing geopolitical instability, as the conflict in the Middle East escalates and macroeconomic uncertainty grips global markets. While many investors had anticipated an altseason by now, that rotation of capital into altcoins has yet to materialize. All eyes remain on Ethereum to serve as the catalyst for that next leg higher. M-log1 believes the ETH/BTC pair holds the most important signal in the coming days. “This is probably the most important chart you want to keep an eye on,” he stated, highlighting that whichever direction ETH/BTC breaks could determine the fate of the altcoin market. The chart has repeatedly tested the lower support range, with bulls successfully defending that level on at least eight occasions. According to M-log1, this persistent defense suggests that bears are losing momentum, and a breakout to the upside is more likely. “I am 80/20 in favor of the upside,” he said, citing the market’s inability to break lower as a sign of underlying strength. Related Reading: Ethereum Mirrors Bitcoin 2017-2021 Pattern – $4,000 Is The Trigger Point ETH Tests Weekly Moving Averages Ethereum (ETH) is currently trading at $2,550, maintaining its position above all major weekly moving averages—50, 100, and 200. This level marks a key technical pivot as price consolidates between $2,450 and $2,680 after a strong recovery from its April low near $1,500. Despite multiple attempts to break higher, ETH continues to face resistance just below the $2,700 mark, showing that sellers remain active near historical supply zones. Importantly, the recent weekly candles have held the 100-week and 200-week simple moving averages as support. This indicates structural strength, especially considering the broader macro uncertainty driven by Middle East tensions and tighter U.S. monetary policy. Volume remains steady, with no signs of panic selling, further supporting the idea that ETH is stabilizing. Related Reading: Bitcoin Consolidates as Realized Profits Stay Low – No Signs Of Major Sell-Off Yet The current compression in price around key moving averages typically precedes a larger directional move. A confirmed weekly close above $2,700 could open the door to a rapid push toward the psychological $3,000 level. Conversely, losing the $2,400 support would likely trigger a short-term correction back toward the 50-week SMA near $2,289. Featured image from Dall-E, chart from TradingView"
    },
    {
      "title": "XRP Price In 2026? Pattern From 2017 Reveals How It Will Happen",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-2026-pattern-with-2017/",
      "summary": "The XRP price is currently trading well below $3; however, a crypto expert believes that in less than two years, this popular altcoin could enter the double-digit territory, marking a historic moment in crypto. The analyst has forecasted a potential surge to $27, pointing to a re-emerging pattern from 2017. With over six months left before 2026 begins, the expert has outlined a clear roadmap of how XRP could reach this bullish target if it completely mirrors the historic fractal. XRP Price Prediction For 2026 A new technical analysis by X (formerly Twitter) market expert Egrag Crypto suggests that XRP has yet to see its biggest breakout. The trajectory of the analyst’s chart mirrors the same technical path that XRP followed before hitting its 2018 peak and current all-time high of $3.84. Related Reading: XRP To End 7-Month Consolidation After 700% Surge – Is A Major Move Coming? Egrag Crypto highlights that XRP is on the verge of an explosive rally that may extend into 2026, with current market behavior echoing the conditions and buildup that preceded its 2017 breakout. Notably, the analyst’s price chart shows that the XRP monthly candle structure went through six candles of consolidation before it launched into a parabolic rise in late 2017. Now, the cryptocurrency has consolidated for seven monthly candles, highlighted by the green triangle in the chart. If the eight completes, the analyst expects a dramatic “KABOOM phase” to follow—one that could propel XRP to price levels not seen before. The bullish projections point to a possible blow-off top somewhere between $22 and $27, aligning with the highest blue arc on the chart. Currently, XRP is trading at $2.15, meaning a surge to $27 would represent a whopping 1,156% in less than two years. With July 2025 highlighted as the potential trigger month, Egrag Crypto believes that the breakout could extend its momentum toward the end of 2025 and peak in 2026. The formation, known as the RGB Arcs, presents a visual roadmap of this projected bullish path—reinforcing the possibility that XRP is preparing to repeat history—only bigger. XRP To Reach $4 Before $27 Target In his analysis, Egrag Crypto’s chart spanned from 2013 through 2017, connecting XRP’s peaks to a series of colored parabolic curves. The red arcs in the chart represented the macro support line, while the green arc marked historical resistance levels—reached in 2018, and now projected for 2025-2026. Related Reading: XRP Price Enters Perfect Setup After Buy Retest – Next Stop $3.7 Notably, the analyst predicts that XRP’s first breakout zone lies between $4 and $5. Once this target is hit, the cryptocurrency is expected to move into the upper green and blue arcs, positioning it for a stronger surge toward the forecasted $27 peak. Egrag Crypto has described this initial target as a measured move, where the final outcome is solely based on historical price patterns rather than pure speculation. He urges the broader XRP community to remain strong and patient until the cryptocurrency progresses toward these levels. Featured image from Shutterstock, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Norway Plans to Temporarily Ban New Bitcoin & Crypto Mining Centers to Conserve Energy",
      "link": "https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/NBX-Acquires-Bitcoin-Becomes-First-Public-Bitcoin-Treasury-Company-in-Norway.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/norway-plans-to-temporarily-ban-new-bitcoin-crypto-mining-centers-to-conserve-energy\" rel=\"nofollow\">Norway Plans to Temporarily Ban New Bitcoin &amp; Crypto Mining Centers to Conserve Energy</a></p> <p>Norway’s government will temporarily block the development of new Bitcoin and cryptocurrency mining facilities starting this year, prioritizing energy for other industries.</p> <p>"
    },
    {
      "title": "A Seed Phrase Isn’t Self Custody, It’s A Liability.",
      "link": "https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/seedlessheader.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/a-seed-phrase-isnt-self-custody-its-a-liability\" rel=\"nofollow\"> </a></p> <p>Seed phrases were an improvement a decade ago. They’re long overdue for an upgrade.</p> <p>"
    },
    {
      "title": "Is the 4-Year Bitcoin Cycle Over? Rational Root Explains Why This Time Might Not Be Different",
      "link": "https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Is-the-4-Year-Bitcoin-Cycle-Over-Rational-Root-Explains.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/markets/is-4-year-bitcoin-cycle-over-rational-root\" rel=\"nofollow\"> </a></p> <p>Rational Root joins Pro to debate whether the 4-year Bitcoin cycle is breaking down in the age of ETFs, passive flows, and institutions.</p> <p>"
    },
    {
      "title": "What Happens to Bitcoin When Quantum Computers Arrive?",
      "link": "https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ChaincodeReportHeader-fotor-20250620123039.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/what-happens-to-bitcoin-when-quantum-computers-arrive\" rel=\"nofollow\"> </a></p> <p>A high level overview of the recent report by Chaincode Labs on the threat quantum computing poses to Bitcoin. </p> <p>"
    },
    {
      "title": "Coinbase Secures MiCA License to Serve 450 Million Europeans",
      "link": "https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Coinbase.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/coinbase-secures-mica-license-to-serve-450-million-europeans\" rel=\"nofollow\"> </a></p> <p>Coinbase has obtained its Markets in Crypto Assets (MiCA) license from Luxembourg&#8217;s Commission de Surveillance du Secteur Financier (CSSF), marking a significant regulatory milestone that enables them to offer its complete range of services across all 27 European Union member states. The license allows Coinbase to serve approximately 450 million Europeans under a unified regulatory [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Nakamoto Holdings Rakes in $51.5 Million for Publicly Traded Bitcoin Treasury",
      "link": "https://decrypt.co/326316/nakamoto-holdings-51-5-million-publicly-traded-bitcoin-treasury",
      "summary": "The Bitcoin holdings company's merger partner KindlyMD closed the $51.5 million fundraise with private investors on Friday."
    },
    {
      "title": "Public Keys: Circle and Coinbase Get GENIUS Bump, Bitcoin Treasuries on Shaky Ground?",
      "link": "https://decrypt.co/326330/public-keys-circle-coinbase-genius-bump-bitcoin-treasuries-shaky-ground",
      "summary": "Circle skyrockets on stablecoin optimism while Bitcoin treasury firms face valuation challenges in this week's public markets roundup."
    },
    {
      "title": "Bitcoin, Dogecoin Targeted as Norway Eyes Ban on New Crypto Mining Operations",
      "link": "https://decrypt.co/326280/bitcoin-dogecoin-targeted-norway-eyes-ban-new-crypto-mining-operations",
      "summary": "The government said it will \"explore the possibility of temporarily prohibiting the establishment of new data centers in Norway that extract cryptocurrency.\""
    },
    {
      "title": "Texas Sheriffs Crack Bitcoin ATM With Power Tools to Retrieve $32,000",
      "link": "https://decrypt.co/326308/texas-sheriffs-crack-bitcoin-atm-with-power-tools-to-retrieve-32000",
      "summary": "Jasper County Sheriff Chuck Havard told that authorities have likely accessed the machines before."
    },
    {
      "title": "Bitcoin Cools, But Forks Are on Fire as BCH and BSV Torch the Charts: Analysis",
      "link": "https://decrypt.co/326281/bitcoin-cools-forks-fire-bch-bsv-torch-charts-analysis",
      "summary": "While Bitcoin dozes near $103K, Bitcoin Cash and Bitcoin SV are on the rise, upstaging the flagship coin as traders chase double-digit gains."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "XRP joins Solana and Litecoin in top ETF approval tier",
      "link": "https://cryptobriefing.com/spot-crypto-etf-approval-tier/",
      "summary": "<p>The increased likelihood of crypto ETF approvals could significantly boost market legitimacy and attract institutional investment.</p> <p>"
    },
    {
      "title": "Why your business should start accepting Bitcoin today",
      "link": "https://cryptobriefing.com/accepting-bitcoin-payments-business/",
      "summary": "<p>Accepting Bitcoin can lower fees, reduce fraud risks, and simplify global payments as more consumers look to pay with crypto in 2024.</p> <p>"
    },
    {
      "title": "Reddit considers using World ID to verify redditors: Semafor",
      "link": "https://cryptobriefing.com/reddit-world-id-verification-anonymity/",
      "summary": "<p>Reddit's potential use of World ID could enhance user trust and compliance with regulations while balancing privacy and authenticity concerns.</p> <p>"
    },
    {
      "title": "Coinbase secures MiCA license, unlocks access to all 27 EU countries",
      "link": "https://cryptobriefing.com/coinbase-mica-license-eu/",
      "summary": "<p>Coinbase's MiCA license enhances EU crypto market integration, boosting institutional trust and potentially accelerating regional blockchain innovation.</p> <p>"
    },
    {
      "title": "Fed’s Waller says rate cut could come as soon as July",
      "link": "https://cryptobriefing.com/fed-rate-cut-july-outlook/",
      "summary": "<p>A potential rate cut in July could signal a shift in monetary policy, impacting economic growth, inflation expectations, and market dynamics.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Is ETH undervalued? Here’s why 15x stablecoin surge could benefit Ethereum!",
      "link": "https://ambcrypto.com/is-eth-undervalued-heres-why-15x-stablecoin-surge-could-benefit-ethereum/",
      "summary": "<img alt=\"Is ETH undervalued? Here&#039;s why 15x stablecoin surge could benefit Ethereum!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/EthereumFII-1.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Will the stablecoin market surge push ETH's value higher?"
    },
    {
      "title": "All the reasons why Ethereum could outperform Bitcoin in Q3!",
      "link": "https://ambcrypto.com/all-the-reasons-why-ethereum-could-outperform-bitcoin-in-q3/",
      "summary": "<img alt=\"Ethereum ETH\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika1-12.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A $750 million bet, whale surge, and momentum - ETH vs BTC heats up!"
    },
    {
      "title": "SPX’s 11% drop: Is this the calm before a major rebound?",
      "link": "https://ambcrypto.com/spxs-11-drop-is-this-the-calm-before-a-major-rebound/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Abdul_20250620_091815_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SPX’s sharp decline could reverse into a major rally."
    },
    {
      "title": "Bitcoin’s price, miners, and THIS volatility indicator – All the details!",
      "link": "https://ambcrypto.com/bitcoins-price-miners-and-this-volatility-indicator-all-the-details/",
      "summary": "<img alt=\"Bitcoin&#039;s price, miners, and THIS volatility indicator - All the details!\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-2-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Bitcoin's correlation with BTC miners has been falling sharply."
    },
    {
      "title": "PENDLE – Institutions, whales, and what the SEC’s moves mean for DeFi",
      "link": "https://ambcrypto.com/pendle-institutions-whales-and-what-the-secs-moves-mean-for-defi/",
      "summary": "<img alt=\"PENDLE - Institutions, whales, and what the SEC&#039;s moves mean for DeFi\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Erastus-2025-06-20T104742.962-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PENDLE’s institutional inflows and growing network activity could be key."
    }
  ]
}