{
  "CoinDesk": [
    {
      "title": "Polygon's Sandeep Nailwal Takes Over as Foundation CEO Amid Strategic Shakeup",
      "link": "https://www.coindesk.com/tech/2025/06/11/polygons-sandeep-nailwal-takes-over-as-foundation-ceo-amid-strategic-shakeup",
      "summary": ""
    },
    {
      "title": "VivoPower to Deploy $100M in XRP on Flare, Add Ripple USD for Treasury Operations",
      "link": "https://www.coindesk.com/business/2025/06/11/vivopower-to-deploy-usd100m-in-xrp-on-flare-add-ripple-usd-for-treasury-operations",
      "summary": ""
    },
    {
      "title": "Crypto Exchange Bullish Files for U.S. IPO as Digital Asset Enthusiasm Mounts: FT",
      "link": "https://www.coindesk.com/markets/2025/06/11/crypto-exchange-bullish-files-for-us-ipo-as-digital-asset-enthusiasm-mounts-ft",
      "summary": ""
    },
    {
      "title": "XRP Consolidates Near $2.28 Amid Slew of Wins for Ripple, XRPL",
      "link": "https://www.coindesk.com/markets/2025/06/11/xrp-consolidates-near-228-amid-slew-of-wins-for-ripple-xrpl",
      "summary": ""
    },
    {
      "title": "Dogecoin Jumps 5% as V-Shaped Recovery Shows Rising Demand",
      "link": "https://www.coindesk.com/markets/2025/06/11/dogecoin-jumps-5-as-v-shaped-recovery-shows-rising-demand",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Sandeep Nailwal takes charge of Polygon Foundation as first CEO",
      "link": "https://cointelegraph.com/news/sandeep-nailwal-takes-control-of-polygon-foundation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVlNWYtYjUwNi03ZGY1LTlhMWItODkyYjRjNWRhOWNm.jpg\" /></p><p>Polygon co-founder Sandeep Nailwal assumes full executive control, marking a move away from decentralized governance.</p>"
    },
    {
      "title": "MEXC launches $100M user protection fund to cover platform breaches",
      "link": "https://cointelegraph.com/news/mexc-launches-100m-user-protection-fund?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVlMDQtMzQ5Ni03N2ExLTk0MWYtNGE3NjVhODVlYTJl.jpg\" /></p><p>MEXC introduces a $100 million fund to protect users from platform breaches, hacks and technical failures, with real-time wallet transparency.</p>"
    },
    {
      "title": "How high can Bitcoin price go?",
      "link": "https://cointelegraph.com/news/how-high-can-bitcoin-price-go?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5Mzk3NTgtMjY5Mi03MTI3LTk1YWUtYmJjMzU4ZTM4NGRk.jpg\" /></p><p>Bitcoin reached $110,000 on June 11, prompting predictions for a further rally to new all-time highs, including $1 million BTC price calls.</p>"
    },
    {
      "title": "PancakeSwap launches one-click crosschain swaps to simplify DeFi UX",
      "link": "https://cointelegraph.com/news/pancakeswap-one-click-crosschain-swaps-simplify-defi-ux?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5MzkwOWYtMzA5OS03YjM3LWE3ZWItZTdlZTJlMzk5NzFh.jpg\" /></p><p>PancakeSwap now offers one-click crosschain swaps with Across Protocol, aiming to reduce bridge risk and improve DeFi user experience across Arbitrum, Base and BNB Chain.</p>"
    },
    {
      "title": "Crypto asset reserve bill lands in Ukraine’s parliament",
      "link": "https://cointelegraph.com/news/crypto-reserve-bill-ukraine-s-parliament?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzVkYmYtYTg0Ni03MmRmLWFkNzktOGUyMWEyOWQxOTQ0.jpg\" /></p><p>Although the bill would allow the National Bank of Ukraine to acquire crypto assets like Bitcoin as part of state reserves, it would not require the bank to do so.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "XRP Ledger will be compatible with Ethereum smart contracts via sidechain launch summer 2025",
      "link": "https://cryptoslate.com/xrp-ledger-will-be-compatible-with-ethereum-smart-contracts-via-sidechain-launch-in-2025/",
      "summary": "<p>After years of testing, the XRP Ledger will finally launch its Ethereum Virtual Machine-compatible sidechain in the second quarter of 2025. Ripple Chief Technology Officer David Schwartz confirmed the timeline at the Apex 2025 event, a move that integrates Ethereum’s smart contract capabilities into the XRPL ecosystem. The development aims to expand XRP’s utility beyond [&#8230;]</p> <p>"
    },
    {
      "title": "Digital Asset Market Clarity Act moves to House floor with bipartisan backing",
      "link": "https://cryptoslate.com/digital-asset-market-clarity-act-moves-to-house-floor-with-bipartisan-backing/",
      "summary": "<p>A legislative proposal to establish a regulatory framework for digital assets in the United States, the Digital Asset Market Clarity Act, has advanced through two key House committees with bipartisan support. The bill, also known as H.R. 3633, cleared the House Financial Services Committee with a 32-19 vote and the House Agriculture Committee with a 47-6 [&#8230;]</p> <p>"
    },
    {
      "title": "FTX continues to exclude Nigeria and China in remaining creditor repayments but includes Payoneer",
      "link": "https://cryptoslate.com/ftx-continues-to-exclude-nigeria-and-china-in-remaining-creditor-repayments-but-includes-payoneer/",
      "summary": "<p>FTX, the bankrupt crypto exchange, has added Payoneer to its creditors&#8217; repayment options, according to a June 10 statement. The new company would serve as an additional asset distribution channel, alongside BitGo and Kraken. Payoneer operates a global payments platform across more than 190 countries and territories. Under the agreement, Payoneer will help distribute funds [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin holding $100k psychological floor amid recent dip signals robust investor sentiment",
      "link": "https://cryptoslate.com/bitcoin-holding-100k-psychological-floor-amid-recent-dip-signals-robust-investor-sentiment/",
      "summary": "<p>On-chain data shows that Bitcoin&#8217;s (BTC) brief slide to $100,000 strengthened rather than weakened market structure, Glassnode said in a June 10 report. Bitcoin is currently trading at $109,500, after an over 4% climb on June 9 to hit a weekly high of $110,600. The report noted that the 9% drawdown following the June 7 [&#8230;]</p> <p>"
    },
    {
      "title": "Ethereum Foundation releases first 1TS outlining roadmap to tackle security challenges",
      "link": "https://cryptoslate.com/ethereum-foundation-releases-first-1ts-outlining-roadmap-to-tackle-security-challenges/",
      "summary": "<p>The Ethereum Foundation has released the first report in its most comprehensive security initiative to date, which maps the critical risks Ethereum (ETH) must address to support trillions in global on-chain value. The first Trillion Dollar Security (1TS) report outlines what individuals, institutions, and governments require to entrust significantly larger sums to the network. The [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Eyes New Highs As Price Retests $109,000, But Analyst Warns Of Potential Pullback",
      "link": "https://www.newsbtc.com/news/bitcoin/bitcoin-eyes-new-highs-as-price-retests-109000-but-analyst-warns-of-potential-pullback/",
      "summary": "Bitcoin (BTC) is trying to reclaim a crucial area amid its recent price recovery, which could propel the flagship crypto toward new highs. Some analysts suggested that BTC is preparing for the “final resistance,” while others warned that it still risks a potential pullback to lower levels. Related Reading: Solana Triangle Formation Breakout Targets Rally To $164 – Is A Recovery Around The Corner? Bitcoin Rally Eyes Next Resistance Bitcoin has finally regained significant bullish momentum after printing a massive daily candle on Monday. The flagship crypto recently lost its post-all-time high (ATH) range of $106,800-$109,700, sparking concern among some investors. Amid the recent market pullbacks, which began in late May, the flagship crypto also registered some volatility, losing key levels as support and hitting a one-month low near the $100,000 level last week. However, BTC reclaimed the $105,000 mark over the weekend before surging above the $106,800 crucial resistance on Monday. Following this performance, analyst Rekt Capital stated that Bitcoin has successfully retested the $104,400 re-accumulation range high resistance as new support for four weeks. He highlighted that BTC was “rebounding from this new support base in an effort to transition into Price Discovery again.” Additionally, Bitcoin ended its two-week downtrend, recording a Daily Close around the $110,500 area. Per the analyst, BTC “has skipped through the $106,600-$109,443 Daily Range entirely,” and is “once again positioning itself like in late May for a retest” of the range’s high as support, which propelled the price to its ATH last month. A daily close above the $109,443 level would set up BTC for a revisit of the “final Daily resistance,” around the $111,723 mark, before a new ATH. The analyst also affirmed that reclaiming the “final weekly resistance” of $108,900 as support would also add to BTC’s momentum. BTC In A &#8216;Dangerous Area&#8217;? Analyst Crypto Jelle suggested that turning the $108,000 price area into support could send Bitcoin to the price discovery phase, potentially targeting the $120,000 mark. He noted that previous unsuccessful breakout attempts failed to reclaim this level, but that the cryptocurrency is currently holding this area. Based on a multi-month pattern, Jelle also reaffirmed its $140,000-$150,000 target for BTC’s cycle top. The analyst highlighted a major inverted Head and Shoulders pattern forming since the end of 2024. According to"
    },
    {
      "title": "Bitcoin Back At $109,000, But HODLer Profit-Taking Down 89%",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-109000-but-hodler-profit-taking-down-89/",
      "summary": "On-chain data shows the veterans of the Bitcoin market are taking 89% less profits compared to the May peak, despite prices being similar now. Bitcoin Realized Profit For 1Y+ Hands Is Relatively Low Right Now In a new post on X, the on-chain analytics firm Glassnode has talked about the latest trend in the Realized Profit of the seasoned hands on the Bitcoin network. The &#8220;Realized Profit&#8221; refers to an indicator that measures, as its name implies, the amount of profit that the BTC investors are realizing through their selling. The metric works by going through the transfer history of each coin being transacted or &#8216;sold&#8217; on the chain to see what price it was moved at prior to this. If the previous selling value is less than the current price for any token, then that particular token&#8217;s sale is contributing to profit realization. Related Reading: Toncoin Heading Toward 40% Breakout, Pattern Could Suggest The amount of profit realized in the sale is naturally equal to the difference between the two prices. The Realized Profit sums up this value for all tokens being transferred to find the total for the network as a whole. In the context of the current topic, the Realized Profit of the entire userbase isn&#8217;t of interest, but just that of a specific part of it: the 1+ year holders. These are the investors who have been holding onto their coins since more than a year, without having involved them in a transaction even once. Statistically, the longer an investor holds onto their tokens, the less likely they become to sell them in the future. As such, this part of the userbase with its significant holding time would include the resolute diamond hands of the market. Now, here is the chart shared by Glassnode that shows the trend in the Bitcoin Realized Profit for these HODLers over the last few months: As displayed in the above graph, the Bitcoin Realized Profit of the 1+ year investors observed a huge spike in late May. This sharp profit-taking spree from these seasoned hands came as BTC surged to $110,000 following its post all-time high (ATH) pullback. Shortly after the selloff from this cohort, BTC started on a decline. During the past day, though, the asset has appeared to have finally shoved off this bearish momentum, as it has once more returned above the $109,000 mark. This time, however, there hasn&#8217;t been any significant reaction from the diamond hands. Currently, the 24-hour simple moving average (SMA) of the group&#8217;s Realized Profit sits at $13.6 million, which is 89% down compared to the $126 million peak from last month. Related Reading: Bitcoin Defies Bears: Price Nears $108,000 Despite $250M Exchange Inflows It&#8217;s possible that the veterans of the market think there is more to come in the latest Bitcoin rally, so they are choosing to HODL strong. BTC Price At the time of writing, Bitcoin is floating around $109,100, up more than 2% in the last seven days. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Ethereum Flashes Golden Cross On Daily Chart – Is A New ATH Within Reach?",
      "link": "https://www.newsbtc.com/ethereum-news/ethereum-flashes-golden-cross-on-daily-chart-is-a-new-ath-within-reach/",
      "summary": "Ethereum (ETH), the second-largest cryptocurrency by market cap, may finally be awakening from its slumber. It recently flashed a bullish golden cross on the daily chart &#8211; a signal that has many crypto analysts forecasting a potential new all-time high (ATH) in the near future. Ethereum Flashes Bullish Golden Cross In an X post published today, crypto analyst Titan of Crypto noted that ETH has formed a golden cross on its daily chart. He shared the following chart and remarked that bullish momentum appears to be building for Ethereum. To explain, a golden cross is a bullish technical pattern that occurs when a short-term moving average (MA) &#8211; typically the 50-day &#8211; crosses above a long-term MA like the 200-day. It signals a potential shift in momentum and is often seen as an indicator of a sustained upward trend. Related Reading: Ethereum Market Shows Signs Of Overheating Near $2,500 – Is A Short-Term Pullback Coming? Meanwhile, seasoned crypto analyst Ali Martinez commented on ETH’s recent price action. He noted that Ethereum has broken resistance on the 4-hour chart and could be setting up for a move as high as $2,920 in the coming days. Fellow market commentator Ted Pillows echoed a similar view. He stated that ETH is currently trading at a local range high, pushing against a key resistance level at $2,800. Pillows suggested that the digital asset might reach $4,000 later this month. Multiple technical indicators and market structure patterns are also hinting at near-term upside for ETH. For instance, crypto trader Merlijn The Trader observed a hidden bullish divergence on the 12-hour chart. A hidden bullish divergence occurs when price forms a higher low, while a momentum indicator &#8211; such as RSI or MACD &#8211; forms a lower low. This setup suggests that although momentum appears weak, the underlying trend remains intact, and a price continuation to the upside is likely. In a similar vein, digital assets analyst Crypto Caesar pointed out that Ethereum’s Wyckoff Accumulation pattern is “still playing out perfectly.” He shared a chart predicting that ETH may hit a new all-time high by August 2025. All Indicators Point To Further Upside Beyond the technical patterns, other on-chain and market indicators continue to support the bullish thesis. For instance, even after gaining over 11% in the past two weeks, Ethereum’s funding rates remain relatively neutral &#8211; a sign that the rally may still have room to grow. Related Reading: Ethereum Stuck Between Retail Sell-Off And Whale Accumulation, Analyst Explains Additionally, ETH is eyeing a potential breakout to $3,500, with its price projected to surge above the crucial 50-day exponential moving average (EMA). At press time, ETH trades at $2,740, up 6.8% in the past 24 hours. Featured image from Unsplash, charts from X and TradingView.com"
    },
    {
      "title": "Tron Booms With Fresh $1B in USDT, Yet Lending TVL Nosedives, What’s Next?",
      "link": "https://www.newsbtc.com/news/tron-trx/tron-booms-with-fresh-1b-in-usdt-yet-lending-tvl-nosedives-whats-next/",
      "summary": "Tron (TRX) has experienced positive price action recently, aligning with the upward trend seen across the broader cryptocurrency market. In the past 24 hours, TRX climbed approximately 3.9%, reaching a trading value of $0.294. Despite these recent gains, Tron remains significantly below its all-time high of $0.43, set in December 2024, representing roughly a 31.8% decrease from that peak. This upward trajectory coincides with notable stablecoin activity on the Tron network, particularly involving Tether&#8217;s USDT token. Recently, a substantial minting event involving USDT occurred, signaling increased liquidity and potential market demand. Related Reading: TRON Surges Past 8 Million Daily Transactions as TRX Holds Above $0.27 Significant USDT Minting Event on Tron Amr Taha, an analyst from CryptoQuant&#8217;s QuickTake Platform, highlighted a significant event occurring on the Tron blockchain involving Tether&#8217;s stablecoin, USDT. According to Taha’s report titled &#8220;Tether Treasury mints $1 billion USDT on TRON prior to Bitcoin reaching $110,000,&#8221; the Tether Treasury recently issued 1 billion new USDT tokens on the Tron blockchain on June 9, 2025. This mint represents the largest single issuance of USDT on Tron for the month so far, emphasizing the network&#8217;s increasing relevance for stablecoin transactions. Taha noted that two primary factors likely drove this sizable minting event. First, it points toward elevated market demand for stablecoins, particularly within Tron’s ecosystem, known for low transaction fees and high-speed transfers. Second, the minting could signal significant institutional activity or preparations for substantial over-the-counter (OTC) crypto trades. Historically, such minting events tend to precede increased trading activity as investors leverage newly injected liquidity into the markets. The introduction of additional stablecoin liquidity typically boosts overall cryptocurrency market conditions, potentially providing support during periods when traditional financial markets are less robust. Divergent Trends: Rising TRX Price and Declining TVL Meanwhile, separate on-chain analysis by CryptoQuant contributor Joao Wedson noted a sharp decrease of nearly $2 billion in the total value locked (TVL) within lending protocols on Tron. This recent drop in TVL contrasts notably with the rising price of TRX, marking a divergence that raises intriguing questions for investors. Wedson pointed out that historically, reduced TVL in lending platforms on Tron has correlated with upward price movements for TRX, as previously observed in early 2024. Related Reading: Analyst Explains Reason Behind Tron Price Sluggishness — Are TRX Bears Now In Control? However, the current scenario, where TRX’s value continues to climb despite significant reductions in lending protocol engagement, may hint at underlying shifts in investor strategies or possible structural changes within the network&#8217;s financial ecosystem. Featured image created with dALL-E, Chart from TradingView"
    },
    {
      "title": "Why Bitcoin’s Calm Rally Could Be a Setup for a Massive Breakout, Analyst Reveals",
      "link": "https://www.newsbtc.com/bitcoin-news/why-bitcoin-calm-rally-could-be-a-setup-for-a-massive-breakout-analyst-reveals/",
      "summary": "Bitcoin has returned to an upward trajectory, with the asset posting a 1.7% gain in the last 24 hours to reach $109,505. This marks a 4% increase in the past week, placing the cryptocurrency less than 2% below its all-time high of $111,000 set last month. The move follows a period of subdued market activity, with recent gains occurring in a relatively quiet trading environment. Analysts have looked into on-chain indicators for signals of whether the current price action is sustainable or approaching overheated levels. Particularly, unlike previous rallies driven by sharp price spikes and speculative retail demand, the latest growth appears more measured. This has prompted the assessment of metrics such as Binary Coin Days Destroyed (CDD), MVRV ratio, and exchange premium indexes to gauge underlying investor behavior and sentiment. Related Reading: BlackRock’s Bitcoin ETF Becomes Fastest Ever To Reach $70 Billion AUM Bitcoin Long-Term Holders and US Demand Drive Quiet Accumulation According to an analysis published on CryptoQuant’s QuickTake platform by contributor Avocado Onchain, Bitcoin’s current rally is taking shape under relatively stable conditions. The analyst points to a declining 30-day moving average of Binary CDD, a metric that tracks the spending behavior of long-term holders. The decrease suggests that these holders are not yet exiting the market, indicating a continued confidence in the asset’s potential for further gains. Another notable indicator cited in the analysis is the Coinbase Premium Index, which measures the difference between Bitcoin prices on US-based Coinbase and other global exchanges. This premium is increasing and nearing levels observed during Bitcoin’s prior peaks in March and December 2024. While elevated premiums can be a warning sign of overheating, Avocado notes that the Korea Premium Index remains low, suggesting muted activity from retail traders in Asia. This balance implies that institutional buying pressure, particularly from US-based investors, could be driving the recent momentum. In addition, the MVRV ratio, a comparison of Bitcoin’s market value to its realized value, has been rising gradually without any sharp jumps. This suggests that the market has not entered an extreme greed phase, further reinforcing the idea that the current uptrend may have more room to run. Avocado wrote: In summary, rather than anticipating a correction, the current indicators suggest that Bitcoin may have further room to grow, and this could be a time to carefully monitor the potential for continued upside. Whale Activity and Institutional Inflows Signal Market Confidence In a separate post, another CryptoQuant contributor known as Crypto Dan highlighted consistent buying activity from larger market players. His report notes that the Coinbase Premium has been climbing steadily since April 21, indicating increased demand from US investors. This trend, combined with observations of whale accumulation, points to a strengthening market foundation despite the absence of exuberant price behavior. Related Reading: Why The Bitcoin Price Could See Another 70%-170% Jump From Here The analyst further noted that such patterns are characteristic of post-correction recovery phases in Bitcoin’s historical price cycles. So far, the combination of long-term holder conviction, institutional demand, and subdued retail activity suggests the rally may be advancing on more stable footing than prior surges. Featured image created with DALL-E, Chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Michael Saylor: The Bear Market Is Not Coming Back And Bitcoin Is Going To $1 Million",
      "link": "https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Michael-Saylor-The-Bear-Market-Is-Not-Coming-Back-And-Bitcoin-Is-Going-To-1-Million.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/michael-saylor-the-bear-market-is-not-coming-back-and-bitcoin-is-going-to-1-million\" rel=\"nofollow\"> </a></p> <p>In a Bloomberg interview, Strategy CEO Michael Saylor announces that Bitcoin is not going to zero, it is going to $1 million.</p> <p>"
    },
    {
      "title": "Bitwise Debuts First Ever GameStop Covered Call ETF",
      "link": "https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitwise.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitwise-debuts-first-ever-gamestop-covered-call-etf\" rel=\"nofollow\"> </a></p> <p>Today, Bitwise Asset Management announced the launch of the Bitwise GME Option Income Strategy ETF (IGME), the first-ever covered call ETF centered around GameStop (GME). The fund arrives at a moment where GameStop recently made headlines for its $500 million Bitcoin treasury strategy. Led by Bitwise’s Head of Alpha Strategies Jeff Park, IGME is the [&#8230;]</p> <p>"
    },
    {
      "title": "Economic Bitcoin Nodes: Why You Need To Use Your Node For It To Matter",
      "link": "https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/BitcoinEconomicNOdes.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/technical/economic-bitcoin-nodes-why-you-need-to-use-your-node-for-it-to-matter\" rel=\"nofollow\"> </a></p> <p>Bitcoin nodes are what makes up the Bitcoin network, but without using them to verify your economic activity, they don't impact consensus. </p> <p>"
    },
    {
      "title": "Bitcoin Officially Traded Above $100,000 For 30 Consecutive Days For The First Time",
      "link": "https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitcoin-Officially-Traded-Above-100000-For-30-Consecutive-Days-For-The-First-Time.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-officially-traded-above-100000-for-30-consecutive-days-for-the-first-time\" rel=\"nofollow\"> </a></p> <p>Bitcoin holds above $100K for 30 days as states, banks, and companies accelerate adoption.</p> <p>"
    },
    {
      "title": "The Trump’s American Bitcoin Merges with Gryphon, Reports 215 BTC on Balance Sheet Since Launch",
      "link": "https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/ABTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-trumps-american-bitcoin-merges-with-gryphon-reports-215-btc-on-balance-sheet-since-launch\" rel=\"nofollow\"> </a></p> <p>American Bitcoin Corp (ABTC), a newly formed private Bitcoin mining company backed by Eric Trump and Donald Trump Jr., announced in a June 10 SEC filing that it has acquired 215 Bitcoin (BTC) since launching operations on April 1, 2025. The reserve is currently valued at approximately $23 million, showing their drive and commitment to [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Connecticut Flips State Bitcoin Reserve Trend, Bans All Government Crypto Investments",
      "link": "https://decrypt.co/324574/connecticut-flips-state-bitcoin-reserve-trend-bans-all-government-crypto-investments",
      "summary": "Connecticut's comprehensive law overhauls digital asset regulations while 31 other states weigh Bitcoin reserve proposals."
    },
    {
      "title": "CLARITY Act Clears Two House Committees, Heads to House Floor for Vote",
      "link": "https://decrypt.co/324561/clarity-act-clears-two-house-committees",
      "summary": "Two House committees have advanced the CLARITY Act, setting the stage for a floor vote that could shift primary crypto oversight."
    },
    {
      "title": "Elite Footballers Named in $3.4 Million Crypto Fraud Case",
      "link": "https://decrypt.co/324558/elite-footballers-named-3-4-million-crypto-fraud-case",
      "summary": "A Barcelona court has launched a criminal probe into crypto firm Shirtum after star footballers allegedly promoted a failed NFT scheme."
    },
    {
      "title": "Bullish Files for IPO as Trump's Crypto Pivot Drives Demand: FT",
      "link": "https://decrypt.co/324553/bullish-files-for-ipo-as-trumps-crypto-pivot-drives-demand-ft",
      "summary": "Peter Thiel-backed crypto exchange Bullish is pursuing a public listing and follows last week's successful debuts from the crypto industry."
    },
    {
      "title": "Bank of Korea Governor to Meet Bank Chiefs as Stablecoin Debate Heats Up",
      "link": "https://decrypt.co/324548/bank-korea-governor-bank-chiefs-stablecoin-debate",
      "summary": "The upcoming meeting signals a shift in South Korea's approach to won-backed stablecoins as the new president eyes a regulatory overhaul."
    }
  ],
  "CryptoBriefing": [],
  "AMBcrypto": [
    {
      "title": "PENGU memecoin rebounds 14%, but traders, is there a catch?",
      "link": "https://ambcrypto.com/pengu-memecoin-rebounds-strongly-but-traders-is-there-a-catch/",
      "summary": "<img alt=\"Pudgy Penguins [PENGU]\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Gladys-14.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PENGU is up 14.1% over the past week; breaking out of a descending channel as analyst eye a rally to $0.025 ."
    },
    {
      "title": "India Blockchain Tour 2025 by Octaloop: Web3, by the people, for the people",
      "link": "https://ambcrypto.com/india-blockchain-tour-2025-by-octaloop-web3-by-the-people-for-the-people/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"520\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Screenshot-2025-06-11-142010.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"930\" />From Telegram chats to town halls, India’s Web3 energy is grassroots- and it’s growing rapidly. [&#8230;]"
    },
    {
      "title": "PEPE: Analyzing if James Wynn’s $13.9M bet could push prices higher",
      "link": "https://ambcrypto.com/pepe-analyzing-if-james-wynns-13-9m-bet-could-push-prices-higher/",
      "summary": "<img alt=\"PEPE\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/829A5E9B-A379-4BF1-B194-FFBE22117691.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />PEPE could make big moves soon. But how?"
    },
    {
      "title": "Solana’s price test: Bulls and bears clash as SOL eyes $200, what’s next?",
      "link": "https://ambcrypto.com/solanas-price-test-bulls-and-bears-clash-as-sol-eyes-200-whats-next/",
      "summary": "<img alt=\"solana\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-11-1.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Big moves are happening in tandem to price volatility and bullish breakout potential above $200."
    },
    {
      "title": "Assessing Neiro’s 31% surge: Before you bet on more, check out….",
      "link": "https://ambcrypto.com/assessing-neiros-31-surge-before-you-bet-on-more-check-this/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/NEIRO-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Neiro bulls defended the 61.8% Fibonacci retracement level at $0.000393, and attempted to drive another impulse move higher."
    }
  ]
}