{
  "CoinDesk": [
    {
      "title": "Bears Lose $400M to Liquidations, Largest Since May, as BTC, ETH, SOL Spike Higher",
      "link": "https://www.coindesk.com/markets/2025/07/10/bears-lose-400m-to-liquidations-largest-since-may-as-btc-eth-sol-spike-higher",
      "summary": ""
    },
    {
      "title": "Asia Morning Briefing: Nvidia’s Rally to $4 Trillion Might Have Helped BTC, But Correlation Is Waning",
      "link": "https://www.coindesk.com/markets/2025/07/10/asia-morning-briefing-nvidias-rally-to-4-trillion-might-have-helped-btc-but-correlation-is-waning",
      "summary": ""
    },
    {
      "title": "U.S. Digital Assets Tax Policy Getting Hearing During 'Crypto Week'",
      "link": "https://www.coindesk.com/policy/2025/07/09/u-s-digital-assets-tax-policy-getting-hearing-during-crypto-week",
      "summary": ""
    },
    {
      "title": "Bitcoin Tops $111K, on Brink of Breaking Record High; Ether's 6% Jump Leads Major Cryptos",
      "link": "https://www.coindesk.com/markets/2025/07/09/bitcoin-tops-111k-on-brink-of-breaking-record-high-ethers-6-jump-leads-major-cryptos",
      "summary": ""
    },
    {
      "title": "Revolut Seeks $1B in New Funding at $65B Valuation: FT",
      "link": "https://www.coindesk.com/business/2025/07/09/revolut-seeks-1b-in-new-funding-at-65b-valuation-ft",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Many see stablecoins soaring to $2T in ‘handful’ of years: Ripple CEO",
      "link": "https://cointelegraph.com/news/stablecoin-markets-reach-2-trillion-in-a-few-years-ripple-ceo?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2YyMDUtMTdlOS03MDQ4LTg2NGUtMmI4MGQxMzZhOGEz.jpg\" /></p><p>Ripple CEO Brad Garlinghouse says the growth behind the stablecoin market has been “profound” as it announced BNY Mellon as the firm’s stablecoin custodian for RLUSD.</p>"
    },
    {
      "title": "NFTs back? Snoop Dogg’s Telegram ‘gifts’ sell out in 30 minutes",
      "link": "https://cointelegraph.com/news/snoop-dogg-nft-collection-telegram-ton-blockchain-sold-out?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2YxYzAtZGIxOS03ZDcyLWE4YzYtMmU2MDQ1ZTk4ODkw.jpg\" /></p><p>The NFT lead at the TON blockchain said Snoop Dogg’s sold-out NFT launch could “be the start of a new NFT Narrative.”</p>"
    },
    {
      "title": "‘See you at $150K,’ says Bitcoin bull after BTC taps new highs",
      "link": "https://cointelegraph.com/news/bitcoin-price-btc-bull-150k-target-new-highs-crypto-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2YxYzctNTJkZi03OTliLWJlNjYtY2RiMzk3NDNlNDI5.jpg\" /></p><p>Economist Timothy Peterson said that if Bitcoin hadn’t reclaimed its all-time high, the market might have had to wait until October for the next opportunity.</p>"
    },
    {
      "title": "Binance founder’s family office backs BNB treasury firm eyeing IPO",
      "link": "https://cointelegraph.com/news/binance-cz-family-office-bnb-treasury-company-us-ipo?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2YxYWMtMmFmMC03NzNmLTk3ZDItYTZiZDI3NThlYzFh.jpg\" /></p><p>Binance founder Changpeng Zhao’s investment firm is backing the creation of a company that will buy and hold BNB with plans to go public in the US.</p>"
    },
    {
      "title": "BONK news update: Will LetsBonk’s surging popularity push the altcoin above $0.000026?",
      "link": "https://cointelegraph.com/news/bonk-news-update-will-letsbonk-s-surging-popularity-push-the-altcoin-above-dollar0-000026?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VmYjctZjc4ZC03M2RkLTk3N2YtNDZjOTczOTZjM2Yy.jpg\" /></p><p>BONK is facing profit-booking near $0.000026, but the pullback is likely to find buyers near $0.000020.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Ethereum regains $2,700 amid lowest long/short ratio in two years and ETF cash floods",
      "link": "https://cryptoslate.com/ethereum-regains-2700-amid-lowest-long-short-ratio-in-two-years-and-etf-cash-floods/",
      "summary": "<p>Ethereum (ETH) reclaimed the $2,700 threshold one day after spot exchange-traded funds (ETFs) listed in the US tracking the asset surpassed $4.5 billion in cumulative net inflows on July 8, according to Farside Investors&#8217; data. As of press time, Ethereum is priced at $2,723.98, up by 4.1% in the past 24 hours. ETH lost the [&#8230;]</p> <p>"
    },
    {
      "title": "Rex-Osprey spot Solana ETF doubles cumulative inflows to $41M on July 8",
      "link": "https://cryptoslate.com/rex-osprey-spot-solana-etf-doubles-cumulative-inflows-to-41m-on-july-8/",
      "summary": "<p>The first US-listed spot Solana exchange-traded fund (ETF) received $21 million of net inflows on July 8, lifting its running total to $41.2 million, based on Farside Investors’ data. The one-day addition to the Rex-Osprey’s Solana + Staking ETF (SSK) 104% of the $20.2 million raised over the previous three trading sessions, effectively doubling net [&#8230;]</p> <p>"
    },
    {
      "title": "Greece recovers part of funds stolen in Bybit hack as its first crypto asset seizure",
      "link": "https://cryptoslate.com/greece-recovers-part-of-funds-stolen-in-bybit-hack-as-its-first-crypto-asset-seizure/",
      "summary": "<p>Greek authorities carried out the country’s first-ever crypto seizure after tracing funds linked to the record-breaking $1.4 billion hack of crypto exchange Bybit earlier this year. The Hellenic Anti-Money Laundering Authority issued a freezing order on a suspect wallet following a months-long investigation aided by blockchain analytics firm Chainalysis. The operation targeted funds allegedly stolen [&#8230;]</p> <p>"
    },
    {
      "title": "SEC Crypto Task Force head warns assets remain securities regardless of tokenization",
      "link": "https://cryptoslate.com/sec-crypto-task-force-head-warns-assets-remain-securities-regardless-of-tokenization/",
      "summary": "<p>Hester Peirce, head of the US Securities and Exchange Commission&#8217;s (SEC) Crypto Task Force, said that putting securities on a blockchain &#8220;does not have magical abilities to transform the nature of the underlying asset.&#8221; In a July 9 statement, Peirce emphasized that tokenized shares, notes, or entitlements &#8220;are still securities,&#8221; requiring issuers, intermediaries, and traders [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin hits fresh all-time high above $112k as traders parse new US tariff shock",
      "link": "https://cryptoslate.com/bitcoin-hits-fresh-all-time-high-above-112k-as-traders-parse-new-us-tariff-shock/",
      "summary": "<p>Bitcoin (BTC) reached a new all-time high of $112,040 on July 9, edging above the previous intraday peak of $111,917.37 recorded on May 22, TradingView data shows. The breakout arrived hours after President Donald Trump dispatched formal tariff letters to seven nations, unveiling duties of up to 30% that take effect Aug. 1. According to [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "XRP Price Flashes Strength — Bulls Looking for Continuation",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-price-flashes-strength-2-40/",
      "summary": "XRP price started a fresh increase above the $2.320 zone. The price is now showing positive signs and might climb above the $2.45 resistance. XRP price started a fresh increase above the $2.350 zone. The price is now trading above $2.320 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2.380 on the hourly chart of the XRP/USD pair (data source from Kraken). The pair could start another increase if it stays above the $2.350 zone. XRP Price Rallies Over 5% XRP price started a fresh increase after it settled above the $2.30 level, beating Bitcoin and Ethereum. The price was able to climb above the $2.350 resistance level. The recent move was positive and the bulls pushed the price above the $2.40 level. A high was formed at $2.437 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $2.250 swing low to the $2.437 high. The price is now trading above $2.350 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2.380 on the hourly chart of the XRP/USD pair. On the upside, the price might face resistance near the $2.4350 level. The first major resistance is near the $2.450 level. A clear move above the $2.450 resistance might send the price toward the $2.50 resistance. Any more gains might send the price toward the $2.550 resistance or even $2.60 in the near term. The next major hurdle for the bulls might be near the $2.750 zone. Another Decline? If XRP fails to clear the $2.450 resistance zone, it could start another decline. Initial support on the downside is near the $2.380 level and the trend line zone. The next major support is near the $2.350 level or the 50% Fib retracement level of the upward move from the $2.250 swing low to the $2.437 high. If there is a downside break and a close below the $2.350 level, the price might continue to decline toward the $2.320 support. The next major support sits near the $2.2650 zone. Technical Indicators Hourly MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $2.380 and $2.350. Major Resistance Levels – $2.4350 and $2.450."
    },
    {
      "title": "Cardano Charts Just Did Something They’ve Never Done Before",
      "link": "https://www.newsbtc.com/altcoin/cardano-charts-just-did-something-theyve-never-done-before/",
      "summary": "Cardano has slipped about 1.54% in the past day, but signs are pointing toward a turn in its fortunes. Traders have spotted a rare weekly golden cross on the ADA/USD chart. That happens when a shorter moving average crosses above a longer one. It can signal that buyers are gaining the upper hand after months of sideways action. Related Reading: Ethereum Sees $6 Billion In Tokenized Funds As Big Players Jump In First Ever Weekly Golden Cross According to analyst Mr. Brownstone, Cardano just logged its first‑ever weekly golden cross, with the 50‑week moving average climbing above the 200‑week line. ADA is trading at $0.60, under both its 50‑day MA at $0.66 and its 200‑day MA at $0.64. That gap means bulls need more firepower to push price back above key levels. Still, the weekly signal has many calling a bullish move ahead. Anyone else notice that Cardano just had it&#8217;s first Weekly Golden Cross ever? 📈🚀 pic.twitter.com/d7gvWQfN1Z — Mr Brownstone (@GunsRoses1987) July 9, 2025 Price Levels To Watch Based on examination from MasterAnanda, ADA will likely need to reclaim its 34‑period EMA and the 200‑day MA before a real uptrend can take hold. Many traders use those levels as checkpoints. If ADA closes above $0.64, it could draw new buyers in. On the flip side, a drop under $0.59 might trigger more selling pressure. Whales Return To Accumulate Analyst Ali Martinez has noted that large holders scooped up about 120 million ADA over the past two weeks. These addresses, each holding between 1 million and 10 million ADA, now control roughly 5.5 billion ADA—worth around $3.3 billion at current prices. When big wallets pile in, it often suggests confidence that prices will head higher. But it can also lead to quick flips if whales decide to take profits. Whales bought over 120 million Cardano $ADA in the last two weeks! pic.twitter.com/HOjvzB6fqd — Ali (@ali_charts) July 8, 2025 Cardano: Forecasts And Sentiment Several price targets have emerged in recent weeks. Some analysts expect ADA to climb to $1.33, while others think $10 is within reach this cycle. Price prediction by CoinCodex points to a 25% rise to $0.74 by August 8, 2025. Right now, technical indicators lean bearish, and the Fear &#38; Greed Index sits at 59 (Neutral). Cardano has seen 14 out of the last 30 days end in green, with volatility around 7.54%, according to the price prediction site. Related Reading: 2% Of All XRP Is In His Hands — But Who Is He? Outlook And Next Steps Cardano’s weekly golden cross is a bullish sign, but price still needs to clear shorter‑term hurdles. Traders looking for confirmation may wait for ADA to close above $0.66 on the daily chart. Those already in position might set a stop‑loss below $0.59 to guard against a rejection. With whale activity back on the rise and long‑term targets ranging from $1.33 to $10, Cardano is once again on investors’ radar. However, broader market trends—especially moves in Bitcoin—will likely dictate whether ADA’s momentum can stick. Featured image from Meta, chart from TradingView"
    },
    {
      "title": "Ethereum Bulls Roar — $3K Beckons After 5% Spike",
      "link": "https://www.newsbtc.com/analysis/eth/ethereum-bulls-roar-3k/",
      "summary": "Ethereum price started a fresh increase above the $2,720 zone. ETH is now consolidating gains and might aim for a fresh move above $2,800. Ethereum started a fresh increase above the $2,650 level. The price is trading above $2,720 and the 100-hourly Simple Moving Average. There is a key parabolic curve forming with support at $2,750 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it remains supported above the $2,720 zone in the near term. Ethereum Price Rallies Above $2,700 Ethereum price started a fresh increase above the $2,650 zone, beating Bitcoin. ETH price gained pace for a move above the $2,720 resistance zone and entered a positive zone. The price even tested the $2,800 resistance. A high was formed at $2,795 and the price is now consolidating gains. It is stable above the 23.6% Fib retracement level of the upward move from the $2,516 swing low to the $2,795 high. Ethereum price is now trading above $2,720 and the 100-hourly Simple Moving Average. Besides, there is a key parabolic curve forming with support at $2,750 on the hourly chart of ETH/USD. On the upside, the price could face resistance near the $2,800 level. The next key resistance is near the $2,840 level. The first major resistance is near the $2,880 level. A clear move above the $2,880 resistance might send the price toward the $2,910 resistance. An upside break above the $2,910 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $2,980 resistance zone or even $3,000 in the near term. Are Downsides Supported In ETH? If Ethereum fails to clear the $2,800 resistance, it could start a fresh decline. Initial support on the downside is near the $2,750 level. The first major support sits near the $2,720 zone. A clear move below the $2,720 support might push the price toward the $2,650 support or the 50% Fib retracement level of the upward move from the $2,516 swing low to the $2,795 high. Any more losses might send the price toward the $2,550 support level in the near term. The next key support sits at $2,500. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 zone. Major Support Level – $2,720 Major Resistance Level – $2,800"
    },
    {
      "title": "Bitcoin Breakout Alert — Price Turns Green as Bulls Step In",
      "link": "https://www.newsbtc.com/analysis/btc/bitcoin-breakout-alert-112k/",
      "summary": "Bitcoin price started a fresh increase above the $108,500 zone. BTC is now up over 3% and showing positive signs above the $110,000 level. Bitcoin started a fresh increase above the $108,500 zone. The price is trading above $110,500 and the 100 hourly Simple moving average. There was a break above a bearish trend line with resistance at $108,800 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to rise if it clears the $112,000 resistance zone. Bitcoin Price Eyes More Gains Bitcoin price started a fresh increase after it cleared the $108,500 resistance zone. BTC gained pace for a move above the $108,800 and $109,500 resistance. Besides, there was a break above a bearish trend line with resistance at $108,800 on the hourly chart of the BTC/USD pair. The bulls even pumped the pair above the $110,000 resistance zone. It opened the doors for a move toward the $112,000 level. A high was formed at $112,000 and the price is now consolidating gains. It tested the 23.6% Fib retracement level of the upward move from the $107,500 swing low to the $112,000 high. Bitcoin is now trading above $109,500 and the 100 hourly Simple moving average. Immediate resistance on the upside is near the $111,600 level. The first key resistance is near the $112,000 level. The next resistance could be $112,500. A close above the $112,500 resistance might send the price further higher. In the stated case, the price could rise and test the $115,000 resistance level. Any more gains might send the price toward the $116,000 level. The main target could be $118,000. Downside Correction In BTC? If Bitcoin fails to rise above the $112,000 resistance zone, it could start a downside correction. Immediate support is near the $110,800 level. The first major support is near the $109,750 level or the 50% Fib retracement level of the upward move from the $107,500 swing low to the $112,000 high. The next support is now near the $109,200 zone. Any more losses might send the price toward the $108,500 support in the near term. The main support sits at $107,500, below which BTC might continue to move down. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $110,800, followed by $109,750. Major Resistance Levels – $112,000 and $115,000."
    },
    {
      "title": "Bitcoin 30-Day Average Funding Rate Drops – Bullish Setup Takes Shape",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-30-day-average-funding-rate-drops-bullish-setup-takes-shape/",
      "summary": "Bitcoin continues to consolidate just below its all-time high of $112K, holding firmly above key support at $105K despite repeated bearish attempts to push the price lower. This tight trading range reflects market uncertainty, yet the structure favors bulls as long as support levels remain intact. Related Reading: Ethereum Turns Key Resistance Into Support – Momentum Builds For Range Breakout Meanwhile, macroeconomic conditions are evolving rapidly. The US Congress recently passed President Donald Trump’s “big, beautiful” economic package ahead of the self-imposed July 4 deadline, signaling a new phase of fiscal stimulus marked by tax cuts and aggressive spending. Combined with strong job reports, these factors suggest inflation may soon accelerate — a trend that historically supports Bitcoin as a hedge against fiat devaluation. On the market sentiment side, funding rates provide a crucial clue. According to top analyst On-Chain Mind, the 30-day average of Bitcoin perpetual funding rates is currently very low. This reflects a lack of excessive greed and typically marks a favorable setup for bullish continuation. Historically, periods of low funding rates have preceded major upward moves, especially when paired with strong macro tailwinds. With economic pressure building and Bitcoin still in a bullish structure, the coming days could define the next major move for the world’s largest cryptocurrency. Calm Before The Breakout: Bitcoin Gains Strength Above $107K Bitcoin is up more than 3% since the start of July, holding firmly above the $107,000 local low despite repeated resistance at the $110,000 level. This sustained strength signals underlying buyer support and growing momentum as BTC continues to consolidate just below all-time highs. The $110K resistance remains a critical ceiling — once breached, analysts expect a strong move into price discovery as bullish momentum builds. So far, the market has digested a wave of macroeconomic and geopolitical developments. Global trade dynamics — including rising tariffs, export restrictions, and deglobalization trends — continue to shape sentiment. Yet, compared to the sharp volatility seen earlier this year, both Bitcoin and US equities appear more resilient. This suggests that much of the uncertainty has already been priced in, reducing the downside risk for risk assets like BTC. A key technical factor reinforcing the bullish case is the low 30-day average of funding rates. This indicator reflects a neutral-to-cautiously optimistic market environment — a stark contrast to overheated bullish phases that often precede corrections. Calm periods like this often set the stage for explosive moves, particularly when supply squeezes and strong demand meet a macro environment ripe for risk-taking. With BTC coiling tightly and sentiment balanced, a breakout could be imminent. Related Reading: ERC-20 Stablecoin Supply Hits All-Time High At $121B – Liquidity On The Rise BTC Holds Steady as Bulls Eye $109,300 Breakout The 4-hour chart shows Bitcoin (BTC) consolidating within a tight range, holding above the key support at $107,000 and testing resistance around $109,300. This price level has consistently acted as a local ceiling, with several failed breakout attempts in late June and early July. However, the bulls continue to defend higher lows, signaling strength and setting the stage for a potential breakout. The 50, 100, and 200 simple moving averages (SMAs) are stacked close together and gradually trending upward, suggesting the consolidation phase could soon transition into a more directional move. Volume remains low, which often precedes a volatility spike, especially near key resistance levels. Related Reading: Ethereum Risks Downside If Resistance Holds: $2,700 Level Is Critical The $103,600 support remains the crucial line in the sand for bulls. A breakdown below that level would invalidate the short-term bullish structure and likely lead to a deeper retrace. On the upside, a daily close above $109,300 with volume confirmation could trigger a rally toward price discovery above the all-time high. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bitcoin Hits New All Time High at $112,000 As Corporations Buy Record Amounts of BTC",
      "link": "https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-at-112000-as-corporations-buy-record-amounts-of-btc",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Bitcoin-Hits-New-All-Time-High-at-112000-As-Corporations-Buy-Record-Amounts-of-BTC.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitcoin-hits-new-all-time-high-at-112000-as-corporations-buy-record-amounts-of-btc\" rel=\"nofollow\"> </a></p> <p>Bitcoin's ATH signals a new era of institutional adoption, with major players like BlackRock, Strategy, and Smarter Web Company expanding their commitment to the digital asset.</p> <p>"
    },
    {
      "title": "Donald Trump Jr. Invests $4 Million in Bitcoin Treasury Company Thumzup Media",
      "link": "https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Donald-Trump-Jr.-Invests-4-Million-in-Bitcoin-Treasury-Company-Thumzup-Media.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/donald-trump-jr-invests-4-million-in-bitcoin-treasury-company-thumzup-media\" rel=\"nofollow\"> </a></p> <p>The social media firm, which reported just $151 in revenue last quarter, has drawn Trump Jr.’s interest after adopting a Bitcoin treasury strategy.</p> <p>"
    },
    {
      "title": "Myths Busted And Conflicts of Interest Noted at Senate Banking Crypto Market Structure Hearing",
      "link": "https://bitcoinmagazine.com/news/myths-busted-and-conflicts-of-interest-noted-at-senate-banking-crypto-market-structure-hearing",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Crypto-Market-Structure-Hearing-July-9-2025.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/myths-busted-and-conflicts-of-interest-noted-at-senate-banking-crypto-market-structure-hearing\" rel=\"nofollow\"> </a></p> <p>U.S. senators and crypto specialists propose stipulations for digital asset market structure legislation while highlighting the reality of illicit financing on public blockchains and noting the Trump family’s crypto dealings.</p> <p>"
    },
    {
      "title": "Emirates Signs A Deal To Integrate Bitcoin And Crypto Payments",
      "link": "https://bitcoinmagazine.com/news/emirates-signs-a-deal-to-integrate-bitcoin-and-crypto-payments",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/05/Dubai-just-became-the-first-government-in-the-world-to-allow-people-to-pay-for-public-services-using-cryptocurrency-thanks-to-a-new-partnership-with-Crypto.com_.-.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/emirates-signs-a-deal-to-integrate-bitcoin-and-crypto-payments\" rel=\"nofollow\"> </a></p> <p>Emirates has signed a memorandum of understanding with Crypto.com to integrate Bitcoin and crypto payments into its booking systems, marking a significant step toward mainstream adoption of Bitcoin in the travel industry. The agreement, signed in the presence of Emirates Chairman Sheikh Ahmed bin Saeed Al Maktoum, will enable customers to pay for flights using [&#8230;]</p> <p>"
    },
    {
      "title": "KULR Expands Bitcoin Mining Operations to 750 PH/s, Targets 1.25 EH/s by Late Summer",
      "link": "https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Expands-Bitcoin-Mining-Operations-to-750-PHs-Targets-1.25-EHs-by-Late-Summer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-expands-bitcoin-mining-operations-to-750-ph-s-targets-1-25-eh-s-by-late-summer\" rel=\"nofollow\"> </a></p> <p>KULR Technology Group, Inc., a Bitcoin-first company focused on sustainable energy solutions, announced today the successful deployment of 3,570 Bitmain S19 XP 140T mining machines in Asuncion, Paraguay. This new infrastructure brings KULR’s total Bitcoin mining capacity to 750 petahash per second (PH/s), with a goal of reaching 1.25 exahash per second (EH/s) by late [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Trump’s Truth Social Teases Upcoming Utility Token, Shills ‘Patriot’ Subscription",
      "link": "https://decrypt.co/329448/trumps-truth-social-teases-upcoming-utility-token-shills-patriot-subscription",
      "summary": "The social platform founded by Donald Trump is rolling out a loyalty rewards system with plans for a utility token."
    },
    {
      "title": "DeFi Lender Deploys $1M for Student Loans to the Philippines, Indonesia—But at What Cost?",
      "link": "https://decrypt.co/329244/pencil-finance-crypto-rails-student-loans-philippines-indonesia",
      "summary": "The launch positions education lending as a new use case for tokenized real-world assets, combining investor yield with social impact."
    },
    {
      "title": "Judge Recommends Dropping Logan Paul’s Ex-Assistant From 'CryptoZoo' Lawsuit",
      "link": "https://decrypt.co/329446/judge-logan-pauls-ex-assistant-cryptozoo-investor-lawsuit",
      "summary": "Logan Paul’s former assistant Danielle Strobel’s early token access and equity stake weren’t enough to establish jurisdiction, a judge found."
    },
    {
      "title": "Emirates Airline Adding Crypto Payments, Years After Teasing Bitcoin Plans",
      "link": "https://decrypt.co/329404/emirates-airline-adding-crypto-payments-years-after-teasing-bitcoin-plans",
      "summary": "Emirates is working with Crypto.com to enable cryptocurrency payments, three years after first announcing a Bitcoin integration."
    },
    {
      "title": "Bitcoin Treasury Firm Thumzup Considering Dogecoin, XRP Buys as Trump Jr. Invests",
      "link": "https://decrypt.co/329427/bitcoin-treasury-firm-thumzup-considering-dogecoin-xrp-trump-jr-invests",
      "summary": "Publicly traded Thumzup is considering whether it should stash more cryptocurrencies beyond Bitcoin, including Dogecoin, Solana, and XRP."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Ben ‘BitBoy’ Armstrong faces six charges for harassing phone calls, released after arrest",
      "link": "https://cryptobriefing.com/bitboy-legal-troubles-armstrong-arrest/",
      "summary": "<p>The ongoing legal issues surrounding Ben Armstrong highlight the potential reputational risks and legal challenges for crypto influencers.</p> <p>"
    },
    {
      "title": "SEC pushes back decision on in-kind creations and redemptions for BlackRock Ethereum ETF",
      "link": "https://cryptobriefing.com/sec-ethereum-etf-decision-delay/",
      "summary": "<p>The SEC's delay in approving in-kind processes for crypto ETFs may slow innovation and market efficiency in the digital asset space.</p> <p>"
    },
    {
      "title": "Bitcoin hits $112K new ATH after breaking past key resistance",
      "link": "https://cryptobriefing.com/bitcoin-hits-new-all-time-high-at-112k/",
      "summary": "<p>The surge in Bitcoin's value highlights increased institutional interest and regulatory optimism, but also underscores heightened market volatility.</p> <p>"
    },
    {
      "title": "Donald Trump Jr.-backed Thumzup to acquire Ether, XRP, Solana following board approval",
      "link": "https://cryptobriefing.com/bitcoin-treasury-strategy-trump-investment/",
      "summary": "<p>Thumzup's crypto expansion, despite financial losses, highlights a growing trend of Trump-affiliated ventures embracing digital assets.</p> <p>"
    },
    {
      "title": "Linda Yaccarino steps down as CEO of Elon Musk’s X ahead of Grok 4 launch",
      "link": "https://cryptobriefing.com/x-ceo-transition-grok-launch/",
      "summary": "<p>Yaccarino's departure may impact X's strategic direction, especially as it expands into AI and financial services, potentially altering its market position.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Solana price prediction this week – Everything you should know!",
      "link": "https://ambcrypto.com/solana-price-prediction-this-week-everything-you-should-know/",
      "summary": "<img alt=\"Solana\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Solanapriceprediction-1.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Any sustained dip below SOL's realized price of $131 would invalidate its bullish structure."
    },
    {
      "title": "9 best free Bitcoin (BTC) and Litecoin (LTC) cloud mining platforms to watch in 2025",
      "link": "https://ambcrypto.com/9-best-free-bitcoin-btc-and-litecoin-ltc-cloud-mining-platforms-to-watch-in-2025/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"550\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Screenshot-2025-07-10-082146.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"929\" />Cryptocurrency mining doesn’t have to be technical, expensive, or difficult. Thanks to cloud mining, you [&#8230;]"
    },
    {
      "title": "TRUMP faces crucial test! – A move to $10 will depend on…",
      "link": "https://ambcrypto.com/trump-faces-crucial-test-a-move-to-10-will-depend-on/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Evans-2025-07-09T140935.718-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />TRUMP’s outlook grows uncertain as whale moves, rising inflows, and leverage build pressure."
    },
    {
      "title": "Bitcoin ignores historic dollar breakdown: How long can this calm last?",
      "link": "https://ambcrypto.com/bitcoin-ignores-historic-dollar-breakdown-how-long-can-this-calm-last/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-09T132720.468-1.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite the DXY breakdown, Bitcoin’s muted response signals hesitation amid mixed on-chain signals."
    },
    {
      "title": "Fartcoin whales jump ship: Will $0.93 be next?",
      "link": "https://ambcrypto.com/fartcoin-whales-jump-ship-will-0-93-be-next/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-34.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Are whales signaling the end for Fartcoin’s current cycle by rotating into SPX, BONK, and PENGU?"
    }
  ]
}