{
  "CoinDesk": [
    {
      "title": "Bitcoin-Based Stablecoin Network Plasma Raises Deposit Cap to $1B, Gets Filled in 30 Minutes",
      "link": "https://www.coindesk.com/markets/2025/06/12/bitcoin-based-stablecoin-network-plasma-raises-deposit-cap-to-1b-gets-filled-in-30-minutes",
      "summary": ""
    },
    {
      "title": "XRP Slides 4% After Failing to Break $2.33 Resistance Level Thrice",
      "link": "https://www.coindesk.com/markets/2025/06/12/xrp-slides-4-after-failing-to-break-233-resistance-level-thrice",
      "summary": ""
    },
    {
      "title": "Dogecoin Drops 7% After Brief Rally Amid Rising Hopes of a DOGE ETF",
      "link": "https://www.coindesk.com/markets/2025/06/12/dogecoin-drops-7-after-brief-rally-amid-rising-hopes-of-a-doge-etf",
      "summary": ""
    },
    {
      "title": "Bitcoin, Dogecoin, Ether Could See Profit-Taking Even as Macro Conditions Improve",
      "link": "https://www.coindesk.com/markets/2025/06/12/bitcoin-dogecoin-ether-could-see-profit-taking-even-as-macro-conditions-improve",
      "summary": ""
    },
    {
      "title": "Bitcoin at $200K by Year-End is Now Firmly in Play, Analyst Says After Muted U.S. Inflation Data",
      "link": "https://www.coindesk.com/markets/2025/06/12/usd200k-bitcoin-by-year-end-is-now-firmly-in-play-analyst-says-after-muted-u-s-may-inflation-data",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin must avoid sub-$100K wick as traders digest 55% China tariffs",
      "link": "https://cointelegraph.com/news/bitcoin-must-avoid-sub-100k-wick-traders-55-china-tariffs?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2RmMzUtOTlkYi03ZTk5LWIzZWQtNDM0ZTFhYzQyZjM0.jpg\" /></p><p>BTC price requirements are clear as consolidation below all-time highs continues — can Bitcoin bulls stick to the plan and avoid falling back below $100,000?</p>"
    },
    {
      "title": "Alchemy Pay taps Backed to expand access to tokenized ETFs, stocks",
      "link": "https://cointelegraph.com/news/alchemy-pay-tokenized-etf-rwa-launch?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzYzMmQtMGE1Mi03MmQ0LTkwY2QtYTYxNGZiOTAyOGQ2.jpg\" /></p><p>Alchemy Pay is preparing to launch 55 US tokenized ETFs and stocks on multiple networks, including Solana, via Backed’s xStocks.</p>"
    },
    {
      "title": "DeFi Development to refile $1B Solana plan after SEC filing snag",
      "link": "https://cointelegraph.com/news/defi-development-corp-sec-solana-fundraise-setback?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzYyNzktMDY1MS03NzAxLWFhNmItNTA1YWQyYmRhOTli.jpg\" /></p><p>Formerly only a real estate financing company, DeFi Development Corp started buying Solana to become a Solana treasury company as well, currently holding over 609,000 tokens.</p>"
    },
    {
      "title": "Michael Saylor shares how COVID-19 chaos drove him to Bitcoin",
      "link": "https://cointelegraph.com/news/michael-saylor-war-currency-spurred-invest-in-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzQ2ZDUtMGZhNi03NDRkLWJlMWItM2JhM2M4NmFjYmU5.jpg\" /></p><p>Michael Saylor says pandemic-era lockdowns and unabated money printing pushed him to convert his company’s massive cash reserves into Bitcoin.</p>"
    },
    {
      "title": "US Bancorp studying stablecoins as crypto custody arm sees revival",
      "link": "https://cointelegraph.com/news/us-bancorp-studying-stablecoins-crypto-custody-sees-revival?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzYyMzAtMTQ1YS03NTcwLWI2ZjktNDU2OGM2NTllZDkw.jpg\" /></p><p>U.S. Bancorp CEO Gunjan Kedia says her bank is looking into stablecoins as its crypto custody business bounces back after struggling under Biden.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitwise CIO calls Bitcoin ‘best horse in the race’ to explain accelerated corporate buys",
      "link": "https://cryptoslate.com/bitwise-cio-calls-bitcoin-best-horse-in-the-race-to-explain-accelerated-corporate-buys/",
      "summary": "<p>Bitwise CIO Matt Hougan said the &#8220;megatrend&#8221; of public companies adding Bitcoin (BTC) to treasury reserves will continue accelerating as the movement is still in its early stages. Hougan made the statement during a June 10 interview on CNBC, where he highlighted that 79 listed firms now hold roughly $57 billion worth of Bitcoin as of [&#8230;]</p> <p>"
    },
    {
      "title": "GameStop’s plan to raise another $1.75B fuels speculation of further Bitcoin acquisitions",
      "link": "https://cryptoslate.com/gamestops-plan-to-raise-another-1-75b-fuels-speculation-of-further-bitcoin-acquisitions/",
      "summary": "<p>GameStop Corp. plans to raise $1.75 billion through a private offering of convertible senior notes due 2032, as the company explores digital asset investments, including potential Bitcoin acquisitions, under its updated investment strategy, according to a June 11 press release. The zero-coupon notes will be offered to qualified institutional buyers under Rule 144A of the [&#8230;]</p> <p>"
    },
    {
      "title": "Bank of America eyes dollar-pegged stablecoin amid Senate fast-tracking GENIUS Act",
      "link": "https://cryptoslate.com/bank-of-america-eyes-dollar-pegged-stablecoin-amid-senate-fast-tracking-genius-act/",
      "summary": "<p>Bank of America CEO Brian Moynihan confirmed the lender plans to issue a dollar-pegged stablecoin and is working on an internal build conducted alongside other industry participants, Reuters reported on June 11. However, Moynihan added that any progress in a potential launch would be contingent on forthcoming federal rules. He also told investors the bank [&#8230;]</p> <p>"
    },
    {
      "title": "Bitcoin dips as Trump finalizes tariff deals with China",
      "link": "https://cryptoslate.com/bitcoin-dips-as-trump-finalizes-tariff-deals-with-china/",
      "summary": "<p>Bitcoin (BTC) and the wider market experienced a minor pullback after President Donald Trump announced the finalization of a new tariff arrangement with China, pending a formal sign-off by him and President Xi Jinping. Trump announced on Truth Social that the accord grants the US &#8220;55% tariffs&#8221; on Chinese goods, versus 10% levied on US [&#8230;]</p> <p>"
    },
    {
      "title": "Senate’s 68-30 cloture vote speeds GENIUS Act toward simple majority passage",
      "link": "https://cryptoslate.com/senates-68-30-cloture-vote-speeds-genius-act-toward-simple-majority-passage/",
      "summary": "<p>The Senate voted 68-30 on June 11 to invoke cloture on the Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act, ending the filibuster option and moving the bill toward a final floor vote that will require a simple majority. Majority Leader John Thune, who controls the chamber’s schedule, started the 30-hour post-cloture clock [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Bitcoin Options Traders Expect Quiet—But On-Chain Data Suggests Chaos",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-options-traders-expect-on-chain-chaos/",
      "summary": "The Bitcoin Options traders have been pricing in low implied volatility, but on-chain data shows a setup ripe for amplified price swings. Bitcoin Options ATM IV Has Been Trending Lower In its latest weekly report, the analytics firm Glassnode has talked about how the volatility risk associated with Bitcoin looks from the perspective of on-chain analysis. Related Reading: Ethereum To $3,400? On-Chain Shows No Big Hurdles Ahead The indicator shared by Glassnode is the Realized Supply Density, which tells us about how concentrated the cryptocurrency&#8217;s supply is around the current spot price. When the value of this metric is high, it means the investors have participated in a large amount of buying at or near the asset&#8217;s latest price. &#8220;In such environments, even modest price fluctuations can affect a broad swath of investors, often amplifying market sensitivity and, in turn, volatility potential,&#8221; explains the analytics firm. Below is the chart for the indicator shared by in the report. As is visible in the graph, the Bitcoin Realized Supply Density has gone through an uplift during the past few weeks, which suggests accumulation has taken place around the current spot price. &#8220;This concentration raises the probability of outsized reactions to price movements, increasing volatility risk in the near term,&#8221; notes Glassnode. While on-chain data may hint that volatility could go up in the future, it would appear the traders on the Options market don&#8217;t quite think the same, as the At-The-Money Implied Volatility (ATM IV) has been going down. The IV is a metric that represents the traders&#8217; expectations of how volatile Bitcoin will be over a given period, based on the pricing of Options contracts. The ATM version of the indicator specifically calculates this expectation based on Options closest to the latest spot price. Related Reading: Bitcoin Back At $109,000, But HODLer Profit-Taking Down 89% Here is a chart that shows the trend in the Bitcoin Options ATM IV across different expiration timeframes: From the above graph, it&#8217;s apparent that the Bitcoin Options ATM IV has been going down for all major tenors, an indication that the traders don&#8217;t expect high volatility for the cryptocurrency in the near future. &#8220;Historically, such complacency in volatility pricing has often served as a counter-trend signal, preceding periods of heightened volatility,&#8221; says the analytics firm. With on-chain data suggesting increased volatility risk and this signal forming at the same time, it now remains to be seen how Bitcoin would develop in the coming days. BTC Price At the time of writing, Bitcoin is trading around $108,800, up more than 3.5% in the last week. Featured image from Dall-E, Glassnode.com, chart from TradingView.com"
    },
    {
      "title": "Ethereum Prepares For Massive Run After $2,800 Reclaim – ‘Up Only’ Ahead?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-prepares-for-massive-run-after-2800-reclaim-up-only-ahead/",
      "summary": "As Ethereum (ETH) attempts to reclaim its January 2025 price range, the cryptocurrency has been holding a recently recovered level, leading some analysts to suggest another 10% surge before new highs. Related Reading: Bitcoin Eyes New Highs As Price Retests $109,000, But Analyst Warns Of Potential Pullback Ethereum Breakout Eyes $3,100 Ethereum has reclaimed the key $2,800 barrier for the first time since February, nearing the $2,900 level on Wednesday morning. The King of Altcoins had been trading between the $2,475-$2,680 range since its May breakout, unable to turn the range’s upper boundary into support. During last week’s retracement, ETH dropped to the $2,400 support before bouncing over the weekend. The crypto market’s recovery saw Ethereum surge toward the key resistance, finally breaking past it at the start of the week and hitting a three-month high of $2,879 today. Following this performance, Analyst Carl Runefelt from The Moon Show noted that the cryptocurrency had broken out of an ascending triangle formation and now targets the $3,100 resistance. The analyst previously highlighted ETH’s triangle pattern, which began forming at the start of last month’s recovery rally. During that period, the price compressed between the support and resistance lines, with the latter situated around the $2,700 mark. He forecasted a 15% surge toward the $3,100 level if the altcoin reclaimed the crucial resistance level. Based on this, Ethereum could climb another 10.7% if it holds its current range. Runefelt also pointed out another bullish formation in ETH’s trading pair against Bitcoin (BTC). According to the ETH/BTC chart, Ethereum also formed a bullish pennant pattern during the May rally. Amid this week’s recovery, the cryptocurrency has broken out of the formation’s upper boundary, eyeing a 30% surge toward the 0.03300 mark. ETH To Repeat History? Market Watcher Kaleo highlighted the resemblance between ETH’s performance between 2020 and 2025. According to the analyst, there are “a lot of similarities on the chart to where we are now vs. where we were in 2020.” As he explained, in the Spring of 2020, Ethereum experienced a major sell-off, fueled by the COVID-19 crash, which sent its price below a key higher timeframe (HFT) support. However, once the ascending trendline was reclaimed as support, ETH was “up only for the next 20 months.” Kaleo detailed the recent sell-off, caused by the Trump Tariffs scare, sent the altcoin below its multi-year ascending support trendline, adding that “ETH is currently on the verge of reclaiming that line.” Related Reading: Solana Triangle Formation Breakout Targets Rally To $164 – Is A Recovery Around The Corner? The analyst suggested that if history repeats, investors could see “another great ETH bull run and accompanying alt season.” Meanwhile, analyst DonAlt affirmed that ETH’s chart looks “pretty good” amid its HTF range reclaim. To him, a new all-time high (ATH) is likely if the $3,800 resistance is reclaimed, while the rally’s invalidation level is a close below the $2,200 mark. As of this writing, ETH trades at $2,803, a 6.7% increase in the daily timeframe. Featured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
      "title": "Bitcoin Nears All-Time High as Whale Behavior Suggests Further Upside",
      "link": "https://www.newsbtc.com/bitcoin-news/bitcoin-nears-all-time-high-as-whale-behavior-suggests-further-upside/",
      "summary": "Bitcoin continues to show signs of recovery as its price rebounds from a brief correction last week. At the time of writing, the crypto is trading at $109,693, reflecting a 0.4% increase over the past 24 hours. Despite this upward movement, the current price remains roughly 2% below its all-time high of over $111,000, recorded last month. This ongoing strength in price performance has been accompanied by notable on-chain signals, particularly from large holders. CryptoQuant contributor Crypto Dan recently analyzed the current market structure and behavior of Bitcoin whales. Related Reading: Bitcoin Recovers From $100K Dip While On-Chain Data Shows Rising Miner Activity Bitcoin Whale Behavior Suggests Further Upside In his latest analysis, Dan observed that despite Bitcoin hovering near record levels, there is little evidence of the profit-taking behavior typically observed during previous market tops. According to him, whales are not engaging in mass selloffs, suggesting that these investors expect the rally to continue. Dan emphasized that these large holders are likely waiting for more pronounced market euphoria and higher valuations before initiating substantial sell activity, a pattern often seen near the final stages of a bull market. Bitcoin &#8211; Near All-Time Highs but No Profit-Taking “Whales show no intention of taking profits at this price level and are likely to wait for higher prices, where significant market overheating and a bubble form, before making their moves.” – By @DanCoinInvestor pic.twitter.com/W5PtrHo0Q5 — CryptoQuant.com (@cryptoquant_com) June 11, 2025 Whale Exchange Activity Indicates Similar Move Further reinforcing the current sentiment, another CryptoQuant analyst, Darkfost, highlighted a significant trend in Binance whale behavior. According to Darkfost, historical data shows that when Bitcoin approaches or breaches its all-time high, there is typically a sharp rise in exchange inflows, driven by whales seeking to take profits. This pattern was visible during earlier cycle peaks, where inflows reached $5.3 billion in early 2024, and even higher levels of $8.45 billion and $7.24 billion in previous cycles. A strong bullish signal from Binance whales! “Today, however, inflows are just around $3 billion and are continuing to decline, suggesting that these whales prefer to keep holding.” – By @Darkfost_Coc Full analysis ⤵️https://t.co/T1FlLnM4nK pic.twitter.com/O3XrqhAyEc — CryptoQuant.com (@cryptoquant_com) June 11, 2025 In contrast, recent inflows to Binance remain substantially lower. Darkfost reports current inflows hovering around $3 billion, and more importantly, on a declining trajectory. This divergence from historical patterns suggests that whales are refraining from selling at current levels. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Their reduced activity implies an expectation that higher prices may lie ahead, and that they are positioning for potentially greater returns later in the cycle. This restraint from large holders is seen as an important signal, especially given the influence whale movements can have on market liquidity and price action. Featured image created with DALL-E, Chart from TradingView"
    },
    {
      "title": "TRX Price Up As Tron Rolls Out The Red Carpet For Trump-Backed Stablecoin",
      "link": "https://www.newsbtc.com/altcoin/trx-price-up-as-tron-rolls-out-the-red-carpet-for-trump-backed-stablecoin/",
      "summary": "Tron’s blockchain just added a USD1 stablecoin from World Liberty Financial Inc. That move put the spotlight back on TRX. And traders are paying attention to what comes next. Related Reading: Relentless Bitcoin Accumulation: Strategy Snaps Up 1,045 More BTC Significant Price Movement According to trading data, TRX climbed 6% on Tuesday. It broke above the $0.2875 level on the daily chart before hitting resistance at $0.2980. A clean break past that hurdle could send the token toward $0.3230, the 50% Fibonacci retracement level. Currently, TRX trades around $0.2920, sitting between support at $0.2808 and the 23.6% Fib mark of $0.2645. The first USD1 has officially been minted on TRON — a small step for USD1, a giant leap for stablecoins!https://t.co/KMLg8NcXw8 — H.E. Justin Sun 🍌 (@justinsuntron) June 11, 2025 High-Profile Stablecoin Launch Based on reports from World Liberty Financial Inc., the new USD1 stablecoin is now live on Tron. The issuer has ties to US President Donald Trump, and Justin Sun—Tron’s founder and the largest holder of the Trump Token meme coin—called the launch a “giant leap for stablecoins.” Sun also joined a White House dinner for top Trump Token holders. This link to big names has drawn fresh eyes to Tron’s ecosystem. On-Chain Growth Signals According to DeFiLlama, the total value locked on Tron reached over $5 billion. On June 6, the network saw 4.50 million returning user addresses. Those stats suggest people keep coming back to DeFi apps on Tron, but it’s worth watching whether those funds stay in place or chase higher yields on other chains. Bullish Bets in Derivatives Based on CoinGlass data, TRX derivatives open interest rose by 8.25% over the past 24 hours to $329 million. The weighted funding rate open interest rose to 0.0098%, indicative that bullish long positions are greater than shorts. Short liquidations in the past day were almost double that of longs, which settled a bearish bet wave. Technical analysis supports this positive perspective. The RSI on the daily chart is inching up to the overbought region, indicating heightened buying pressure. A recent MACD crossover drove histogram bars into positive territory, which means momentum has favored the buyers. Related Reading: Bitcoin To $1 Million? Michael Saylor Laughs Off Crypto Winter Fears Meanwhile, traders will keep a close eye on Bitcoin’s moves too. A pullback there could drag altcoins lower, while a fresh rally could lift TRX even more. For now, the combination of a big-name stablecoin launch, rising TVL, swelling open interest and positive technical signals gives Tron fans reason to watch for a potential breakout. Featured image from Getty Images, chart from TradingView"
    },
    {
      "title": "Ethereum Price Tests Ascending Channel Resistance – Breakout Or Breakdown?",
      "link": "https://www.newsbtc.com/news/ethereum/ethereum-price-tests-ascending-channel-resistance-breakout-or-breakdown/",
      "summary": "Ethereum pushed above the $2,820 mark yesterday, strengthening the bullish case for a breakout after weeks of consolidation. The move has created renewed optimism among traders who expect ETH to rally beyond its current range and begin a new upward leg. Despite lingering global tensions, markets are responding positively to growing speculation that a trade deal between the US and China may soon be finalized, offering a temporary boost to risk assets across the board. Related Reading: Ethereum Approaches Decisive Level – Trading Around 200 DMA Resistance Ethereum’s recent strength comes at a critical moment, as price approaches the upper boundary of its current ascending channel. Top analyst M-log1 shared a technical analysis highlighting this structure, stating that ETH needs to break out of this current channel. Until then, price action may remain contained within the structure, with limited upside unless a decisive breakout occurs. As Ethereum pushes toward resistance, all eyes are on volume and confirmation signals that could mark the start of a broader trend. For bulls, breaking above the ascending channel could signal the beginning of a strong move toward $3,000 and beyond. Until then, Ethereum remains at a key inflection point in its cycle. Ethereum Holds The Key To Altseason Ts Bulls Eye Breakout Ethereum is now at the center of the market’s attention, as its next move could determine whether a true altseason begins. While Bitcoin continues to lead, Ethereum’s ability to reclaim higher price levels—particularly above the $2,800 mark—will be critical in confirming the start of a broader altcoin rally. So far, positive sentiment and rising price action suggest momentum is building, with ETH pushing into resistance and forming a constructive setup. Bulls have regained control in recent sessions, but the challenge now lies in escaping the current structure. M-log1 highlighted that Ethereum remains trapped in an ascending channel, a pattern that often leads to slow grinding moves until a breakout or breakdown occurs. “If we want anything significant to happen,” he noted, “then ETH needs to leave this ascending channel.” Failing to do so increases the probability of a revisit to the lower end of the range, though M-log1 clarified that this isn’t a certainty—just a probability to keep in mind. On a positive note, Ethereum’s moving averages continue to trend upward and support price from below, providing a favorable technical backdrop. As long as these levels hold and bulls remain active, the breakout scenario remains the dominant outlook. If ETH can decisively flip $2,800 into support and break above the channel structure, it could unleash a wave of capital rotation into altcoins. Until then, Ethereum holds the spotlight—and its next move will likely shape the direction of the entire market heading into summer. Related Reading: Ethereum Still Rangebound Below $2,735 Level – No Clear Breakout Yet Ethereum Breaks Above Resistance But Faces Retest At Key Level Ethereum is currently trading at $2,771 on the daily chart after briefly breaking above the critical $2,800 resistance zone. This level has capped price action multiple times since early May, making this breakout attempt a significant development. However, today’s rejection from a high of $2,834 suggests that ETH is not yet ready to confirm a clean breakout and may be entering a short-term retest phase. The $2,750–$2,800 zone, now acting as immediate resistance, aligns closely with the 200-day simple moving average (SMA) at $2,654.52 — a historically important level that often dictates medium-term trend direction. ETH’s recent surge above all major moving averages, including the 50-day ($2,333.32) and 100-day ($2,085.42) SMAs, reflects growing bullish momentum and a strong trend structure. Related Reading: Ethereum Weekly Structure Tightens – Tower Top Pattern In Play? If Ethereum holds above the 200-day SMA on a retest and reclaims $2,800 with follow-through, the path toward $3,000 becomes more realistic. On the other hand, failure to hold this area could result in a slide back toward the $2,600–$2,650 support zone. Volume has picked up, indicating interest, but confirmation will come from sustained price above resistance. For now, ETH remains in a promising position — but the next few candles will be key. Featured image from Dall-E, chart from TradingView"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "F Street Announced Goal Of Accumulating $10 Million In Bitcoin",
      "link": "https://bitcoinmagazine.com/news/f-street-announced-goal-of-accumulating-10-million-in-bitcoin",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/F-Street-Announced-Goal-Of-Accumulating-10-Million-In-Bitcoin.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/f-street-announced-goal-of-accumulating-10-million-in-bitcoin\" rel=\"nofollow\"> </a></p> <p>F Street plans adding Bitcoin to its corporate treasury and wants to establish public proof of reserves for stakeholders. </p> <p>"
    },
    {
      "title": "Bitdeer Mined 196 Bitcoin Worth Over $21 Million In May",
      "link": "https://bitcoinmagazine.com/news/bitdeer-mined-196-bitcoin-worth-over-21-million-in-may",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Bitdeer.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bitdeer-mined-196-bitcoin-worth-over-21-million-in-may\" rel=\"nofollow\"> </a></p> <p>Bitdeer Technologies Group, a global leader in Bitcoin mining and infrastructure, has released its unaudited operational update for May 2025, highlighting robust expansion in hashrate capacity, ongoing infrastructure development, and an entrance into AI services.&#160; “In May 2025, we continued to deploy our SEALMINER mining rigs to our sites in Texas, U.S., Norway, and Bhutan, [&#8230;]</p> <p>"
    },
    {
      "title": "Skull, $5 million; Banana, $6 million; Freedom, Priceless",
      "link": "https://bitcoinmagazine.com/culture/skull-5-million-banana-6-million-freedom-priceless",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/result_banana.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/culture/skull-5-million-banana-6-million-freedom-priceless\" rel=\"nofollow\"> </a></p> <p>Freedom. Decentralization. Unity.<br /> And without a certificate of authenticity, all Justin Sun gifted Ross Ulbricht was a 1/1 print of the original art.</p> <p>"
    },
    {
      "title": "The CLARITY Act Heads To House Floor For Vote With Protection For Noncustodial Tools Intact",
      "link": "https://bitcoinmagazine.com/news/the-clarity-act-heads-to-house-floor-for-vote-with-protection-for-noncustodial-tools-intact",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/The-Capitol-Building-CLARITY-Act.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/the-clarity-act-heads-to-house-floor-for-vote-with-protection-for-noncustodial-tools-intact\" rel=\"nofollow\"> </a></p> <p>The section of the CLARITY Act (H.R. 3633) that protects Bitcoin and crypto users’ right to use noncustodial wallets as well as developers’ right to create such tools without being subject to The Bank Secrecy Act (BSA) will remain in the bill as it gets voted on in the House.</p> <p>"
    },
    {
      "title": "Stripe Acquires Startup Privy To Expand Bitcoin Strategy",
      "link": "https://bitcoinmagazine.com/news/stripe-acquires-startup-privy-to-expand-bitcoin-strategy",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/06/Stripe-Acquires-Startup-Privy-To-Expand-Bitcoin-Strategy.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/stripe-acquires-startup-privy-to-expand-bitcoin-strategy\" rel=\"nofollow\"> </a></p> <p>Privy joins Stripe to build a Bitcoin and crypto wallet infrastructure. </p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Philippines Enacts Sweeping Crypto Rules, Mandates Licensing and Capital Requirements",
      "link": "https://decrypt.co/324797/philippines-crypto-rules-licensing-capital-requirements",
      "summary": "The new SEC framework imposes minimum capital, local incorporation, and strict data rules on crypto firms operating in the Philippines."
    },
    {
      "title": "US Senators Probe Stablecoin Plans by Facebook Parent Meta",
      "link": "https://decrypt.co/324791/us-senators-probe-stablecoin-plans-meta",
      "summary": "Senators Warren and Blumenthal are demanding answers from Meta over renewed stablecoin plans, warning of risks to competition and privacy."
    },
    {
      "title": "Australian Woman Hit With Ten-Year Ban Over $9.6 Million Crypto Scheme",
      "link": "https://decrypt.co/324774/australian-woman-ten-year-ban-9-6-million-crypto-scheme",
      "summary": "ASIC has banned Glenda Rogan for misleading conduct after she allegedly transfered client funds into blacklisted crypto platform."
    },
    {
      "title": "Startup DIMO Launches DePIN Venture in Japan to Help Automakers Monetize Vehicle Data",
      "link": "https://decrypt.co/324771/startup-dimo-launches-depin-venture-in-japan-to-help-automakers-monetize-vehicle-data",
      "summary": "The decentralized physical infrastructure platform wants to scale and improve data infrastructure for vehicles in Japan."
    },
    {
      "title": "Disney, Universal, DreamWorks Sue Midjourney, Call It a 'Bottomless Pit of Plagiarism'",
      "link": "https://decrypt.co/324768/disney-universal-dreamworks-sue-midjourney",
      "summary": "Hollywood studios are accusing Midjourney of rampant copyright infringement, citing unauthorized use of iconic characters."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "Why is Bitcoin down today? US-China trade deal fails to impress, Israel-Iran conflict threat rises",
      "link": "https://cryptobriefing.com/bitcoin-down-us-china-trade-tensions/",
      "summary": "<p>Geopolitical tensions and unimpressive trade deals highlight Bitcoin's vulnerability to global instability, affecting its market resilience.</p> <p>"
    },
    {
      "title": "Fintech giant Stripe to acquire crypto wallet provider Privy following $1.1B stablecoin deal",
      "link": "https://cryptobriefing.com/stripe-acquires-privy-enhancing-services/",
      "summary": "<p>Stripe's acquisition of Privy signals a significant step towards enhancing global digital financial infrastructure and streamlining crypto adoption.</p> <p>"
    },
    {
      "title": "Bitcoin rally could resume as tariff fears ease and CPI cools, says analyst",
      "link": "https://cryptobriefing.com/bitcoin-rally-potential-inflation-tariff-ease/",
      "summary": "<p>Eased tariff tensions and cooling inflation may boost Bitcoin, potentially prompting Fed rate cuts and renewed retail crypto interest.</p> <p>"
    },
    {
      "title": "Nasdaq-listed Interactive Strength plans to invest $500M in Fetch.ai’s FET token to build an AI-focused crypto treasury",
      "link": "https://cryptobriefing.com/ai-focused-crypto-treasury-investment/",
      "summary": "<p>This move highlights a growing trend of public companies investing in AI-driven digital assets, potentially reshaping corporate finance.</p> <p>"
    },
    {
      "title": "Pro-Bitcoin Scott Bessent emerges as candidate for next Fed chair",
      "link": "https://cryptobriefing.com/fed-chair-successor-bessent-powell/",
      "summary": "<p>Bessent's potential Fed chair candidacy highlights a shift towards integrating cryptocurrency perspectives in U.S. monetary policy.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Bitcoin: Here are the clues for what’s beyond BTC ATH; first, look for…",
      "link": "https://ambcrypto.com/bitcoin-here-are-the-clues-for-whats-beyond-btc-ath-first-look-for/",
      "summary": "<img alt=\"Here&#039;s the on-chain data shows Bitcoin holders remain confident of further gains\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The dissimilarities to November 2024 were encouraging for Bitcoin bulls."
    },
    {
      "title": "Bitcoin is booming in Kenya’s largest slum – Here’s why",
      "link": "https://ambcrypto.com/bitcoin-is-booming-in-kenyas-largest-slum-heres-why/",
      "summary": "<img alt=\"Kenya Bitcoin\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Kenya-Bitcoin.jpg\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Kenya's crypto bill could affect growing BTC adoption because of a few reasons."
    },
    {
      "title": "DeFi revival? Uniswap blasts past $88 billion in volume as UNI targets $12",
      "link": "https://ambcrypto.com/defi-revival-uniswap-blasts-past-88-billion-in-volume-as-uni-targets-12/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Uniswap-Featured.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />The highest monthly trading volume and the bullish reaction from the $6-demand zone gave Uniswap investors hope."
    },
    {
      "title": "Bank of Japan’s policy shift could help Bitcoin, says BitMEX’s Arthur Hayes",
      "link": "https://ambcrypto.com/bank-of-japans-policy-shift-could-help-bitcoin-says-bitmexs-arthur-hayes/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"648\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/BOJs-June-meeting-and-Bitcoin-rally.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1152\" />Could Japan’s next monetary move send Bitcoin soaring?"
    },
    {
      "title": "Has Ethereum’s bullish breakout hit a roadblock at the supply zone?",
      "link": "https://ambcrypto.com/has-ethereums-bullish-breakout-hit-a-roadblock-at-the-supply-zone/",
      "summary": "<img alt=\"Has Ethereum&#039;s bullish breakout hit a roadblock at the supply zone?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/06/Ethereum-Featured-2.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />A bullish breakout coming up next for ETH?"
    }
  ]
}