{
  "CoinDesk": [
    {
      "title": "BioSig, Streamex to Raise $1.1B for Gold Tokenization Initiative on Solana",
      "link": "https://www.coindesk.com/business/2025/07/08/biosig-streamex-to-raise-11b-for-gold-tokenization-initiative-on-solana",
      "summary": ""
    },
    {
      "title": "Are Jerome Powell’s Days as Federal Reserve Chair Numbered?",
      "link": "https://www.coindesk.com/markets/2025/07/06/are-jerome-powell-s-days-as-federal-reserve-chair-numbered",
      "summary": ""
    },
    {
      "title": "BTC-Only VC Ego Death Capital Closes $100M Fund for Projects Building on Bitcoin",
      "link": "https://www.coindesk.com/business/2025/07/08/btc-only-vc-ego-death-capital-closes-100m-fund-for-projects-building-on-bitcoin",
      "summary": ""
    },
    {
      "title": "NEAR Surges 3% After Testing Key Support at $2.13",
      "link": "https://www.coindesk.com/markets/2025/07/08/near-surges-3-after-testing-key-support-at-usd2-13",
      "summary": ""
    },
    {
      "title": "Sequans Shares Jump 35% After $384M Debt-Equity Raise to Fund Bitcoin Treasury",
      "link": "https://www.coindesk.com/business/2025/07/08/sequans-shares-jump-35-after-384m-debt-equity-raise-to-fund-bitcoin-treasury",
      "summary": ""
    }
  ],
  "Cointelegraph": [
    {
      "title": "Bitcoin price gained 72% and 84% the last two times BTC holders did this",
      "link": "https://cointelegraph.com/news/bitcoin-price-rallied-72-84-the-last-two-times-btc-hodlers-did-this?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDcvMDE5N2VhODYtNWFkYy03NmJkLTg2NWQtZjY2OWQ5MjU1N2Nm.jpg\" /></p><p>Bitcoin's long-term investors now hold 80% of all BTC in circulation, which could trigger the next leg higher into price discovery, if history repeats.</p>"
    },
    {
      "title": "Ego Death Capital raises $100M to finance Bitcoin-focused startups",
      "link": "https://cointelegraph.com/news/ego-death-capital-raises-100m-to-finance-bitcoin-focused-startups?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5NWZiZDgtNDUyYS03NTcwLThlMzItZDQ3OTg4YWNjZDE2.jpg\" /></p><p>The venture fund has already invested in Bitcoin-focused exchanges, savings platforms and payment solutions.</p>"
    },
    {
      "title": "Which countries secretly own the most Bitcoin — beyond the US and China",
      "link": "https://cointelegraph.com/explained/which-countries-secretly-own-the-most-bitcoin-beyond-the-us-and-china?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9kYTg5OTU5OTY3YWJjNWIzNzBmZTQ4ZGZiNGEzNzU2OS5qcGc=.jpg\" /></p><p>In 2025, governments hold over 463,000 BTC, with the US and China leading, while countries like Bhutan, Iran and the UK quietly build strategic reserves.</p>"
    },
    {
      "title": "Ethereum &#039;mega whales&#039; are stacking harder than pre-95% rally in 2002",
      "link": "https://cointelegraph.com/news/ethereum-mega-whales-stacking-harder-than-pre-95-percent-rally-2002?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWMzMmItZDU3ZS03NzcxLWE1ZDctMjRhMDRmNDJhZTY5.jpg\" /></p><p>Ethereum is eyeing a breakout toward $3,400 as it consolidates within a bull pennant, echoing classic continuation patterns from past rallies.</p>"
    },
    {
      "title": "Blockchain restores women’s power in AI",
      "link": "https://cointelegraph.com/news/blockchain-women-s-power-in-ai?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img alt=\" \" src=\"https://images.cointelegraph.com/images/528_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDYvMDE5NzhjYWUtZGI0OS03YjNmLTk3M2UtNmM0MzFmMzQ3YTBl.jpg\" /></p><p>As AI threatens to deepen gender disparities in the workforce, blockchain technology can be a powerful tool to empower women to reclaim their rightful place in the digital future.</p>"
    }
  ],
  "CryptoSlate": [
    {
      "title": "Bitcoin ETFs now drive over 30% of spot BTC volume as overall trading slumps",
      "link": "https://cryptoslate.com/insights/bitcoin-etfs-now-drive-over-30-of-spot-btc-volume-as-overall-trading-slumps/",
      "summary": "<p>Spot Bitcoin exchange-traded funds (ETFs) have rapidly established themselves as a dominant force in the market, now representing more than 30% of the total BTC spot trading volume. This shift highlights how traditional financial products have swiftly captured the market as institutional and retail investors increasingly turn to regulated avenues for Bitcoin exposure. However, this [&#8230;]</p> <p>"
    },
    {
      "title": "XRP Ledger’s EVM sidechain sees 1,400 smart contracts in first week",
      "link": "https://cryptoslate.com/xrp-ledger-evm-sidechain-sees-1400-smart-contracts-in-first-week/",
      "summary": "<p>The Ethereum Virtual Machine (EVM)-compatible sidechain of the XRP Ledger is showing early signs of traction among developers, with over 1,400 smart contracts deployed just one week after launch. On July 7, Peersyst confirmed the strong demand in a post stating that nearly 1,400 smart contracts had gone live within the first week. As of [&#8230;]</p> <p>"
    },
    {
      "title": "Scam targets dormant Bitcoin wallets with fake legal notice",
      "link": "https://cryptoslate.com/scams-targets-dormant-bitcoin-wallets-with-fake-legal-notice/",
      "summary": "<p>Analysts at BitMEX Research have raised the alarm about a scam targeting early Bitcoin holders, particularly those with wallets dating back to 2011. According to the firm, the scam appears to exploit long-dormant addresses by injecting false transactions and misleading messages via OP_Return outputs, an optional field in Bitcoin transactions that can carry arbitrary data. [&#8230;]</p> <p>"
    },
    {
      "title": "BlackRock’s IBIT Bitcoin ETF could surpass Satoshi Nakamoto’s holdings by May 2026",
      "link": "https://cryptoslate.com/insights/blackrocks-ibit-bitcoin-etf-could-surpass-satoshi-nakamotos-holdings-by-may-2026/",
      "summary": "<p>BlackRock&#8217;s IBIT Spot Bitcoin ETF has officially crossed 700,000 BTC in assets under management, valued at approximately $76 billion as of July 17. The milestone comes just 18 months after the fund&#8217;s launch in January 2024, marking a rapid accumulation pace that has drawn industry-wide attention. Bloomberg Senior ETF Analyst Eric Balchunas highlighted the achievement [&#8230;]</p> <p>"
    },
    {
      "title": "Truth Social files for ETF holding BTC, ETH, SOL, XRP and CRO",
      "link": "https://cryptoslate.com/truth-social-files-for-etf-holding-btc-eth-sol-xrp-cro/",
      "summary": "<p>Truth Social, the media platform affiliated with US President Donald Trump, has submitted a new application to the US Securities and Exchange Commission (SEC) for a spot crypto exchange-traded fund (ETF). The proposed vehicle, titled the Truth Social Crypto Blue Chip ETF, aims to provide direct exposure to a basket of leading digital assets, including [&#8230;]</p> <p>"
    }
  ],
  "NewsBTC": [
    {
      "title": "Pundit Explains Why XRP Stands To Gain Big From Ripple’s RLUSD",
      "link": "https://www.newsbtc.com/xrp-news/why-xrp-stands-to-gain-big-from-ripple-rlusd/",
      "summary": "Ripple’s dollar-pegged stablecoin, Ripple USD (RLUSD), has spent the past six months quietly becoming one of the fastest-growing assets in the $160 billion stable-value sector, even though almost all of its issuance still sits on a rival network, not the XRP Ledger. That dichotomy—95 percent of the $455 million supply now lives on Ethereum—was the starting point for a lively weekend exchange on X between XRP pundit “Crypto Eri” and sceptics who questioned whether Ripple’s plans would ever benefit the XRP Ledger (XRPL) itself. XRP’s Hidden Advantage? “Ripple is a long-game player,” Eri wrote. “Its public statements to integrate smart contracts on the mainnet will eventually position RLUSD on XRPL as a more competitive stablecoin, with faster and cheaper settlements than Ethereum.” The remark landed just days after Ripple switched on its EVM-compatible sidechain, bringing full Ethereum-style smart-contract functionality to XRPL on 30 June 2025. More than 1,400 contracts were deployed in the first week, according to developer telemetry, and the bridge is already live to 80 other chains through Axelar. Related Reading: XRP Set To Shock The Crypto Market With 30% Share, Analyst Predicts On-chain data underscore the stakes. RLUSD’s circulating supply rose by 47 percent in June alone to $455 million, the fastest pace among major stablecoins, with roughly $390 million now native to Ethereum after a four-fold expansion since January. Only about $65 million remains on XRPL. That imbalance prompted one user to tell Eri that RLUSD’s utility “impacts ETH more than XRP.” She conceded the point—“correct, for now”—but argued demand would migrate once XRPL’s programmability and liquidity deepen. Ripple’s strategy hinges on more than code. On 2 June the company applied to the US Office of the Comptroller of the Currency for a national trust-bank charter. A parallel filing by its subsidiary, Standard Custody &#38; Trust, seeks a Federal Reserve master account so that RLUSD reserves can eventually sit at the central bank rather than a correspondent institution. The timing aligns with the pending GENIUS Act, bipartisan legislation that for the first time would impose a single federal regime on payment-stablecoin issuers. While the bill’s $10 billion-asset threshold means RLUSD could remain under New York oversight for now, the application positions Ripple to graduate into federal supervision voluntarily—a move CEO Brad Garlinghouse has called a “new (and unique!) benchmark for trust in the stablecoin market.” Eri underscored the charter angle in her post: “The national banking license application, aligned with the GENIUS Act, secures a Federal Reserve master account … enhancing trust, expanding crypto financial and payment services, and removing the patchwork of state licenses, enabling continued scalability at lower cost.” Related Reading: XRP Price Risks Breakdown To Next Support Level, Why $2.28 Is Important If the charter is granted and RLUSD begins to migrate on-demand to XRPL, two flywheels favor the native token, analysts say. First, RLUSD remittances on XRPL would pay transaction fees in XRP, turning every dollar of stablecoin volume into incremental demand for the asset Ripple still holds in large quantities. Second, the EVM sidechain lets decentralized-finance builders tap RLUSD liquidity without leaving XRP’s low-cost consensus layer, potentially reversing the flow of users and liquidity that has so far moved toward Ethereum. “These calculated steps in the $$$$$-dollar stablecoin market give the digital asset XRP enormous potential, but require more time to unfold,” Eri argues. For now, RLUSD’s growth is still driven by Ethereum’s DeFi economy, and sceptics like user “sammie” insist “it’s always going to be like this.” Eri’s final reply was succinct: “Let’s see. I know we’ll be touching base often!” That brevity captures both the promise and the uncertainty ahead. Technical rails are in place; regulatory applications are filed. Whether capital, compliance, and market demand will converge quickly enough to shift billions of RLUSD onto XRPL—and in turn lift XRP’s utility—remains the multi-billion-dollar question. At press time, XRP traded at $2.27. Featured image created with DALL.E, chart from TradingView.com"
    },
    {
      "title": "Snaky Way Presale Live: AI Meme Coin $AKE Gears Up for Bull Run",
      "link": "https://www.newsbtc.com/news/snaky-way-presale-live-ai-meme-coin-ake-gears-up-for-bull-run/",
      "summary": "If you’ve been around crypto long enough, you know the signs. Bitcoin wakes up. Ethereum starts stretching. Suddenly, the air feels different. Whispers of the next bull run are back. And as always, the early birds are hunting for that next moonshot. While most eyes are glued to the usual suspects, a slithery new player is wriggling into the spotlight – and no, it’s not another dog coin. Snaky Way ($AKE), a meme coin with actual utility, is now in the presale phase and turning heads. Packed with AI-powered buybacks, multichain access, and a play-to-earn game, Snaky Way is shaping up to be a meme coin with real staying power. The crypto presale is now live, and early buyers are already scooping up $AKE at just $0.0000942. Let&#8217;s dive in – but watch your step, there might be a snake lurking nearby. What Is Snaky Way ($AKE) and Why Is It Different? Snaky Way ($AKE) is part meme coin, part AI bot, and part arcade. That’s already three more things than most of the best meme coins offer. The token at the center of it all is $AKE – yes, like ‘snake’ without the ‘sn.’ It’s crawling onto seven blockchains, including Ethereum, Polygon, and Arbitrum, so you can dodge gas fees like a ninja. But here’s the real twist: they’ve embedded an AI agent into the smart contract that automatically buys back tokens when the price starts to dip. Think of it like a tiny, caffeinated trader living in your token. It watches the price 24/7. When panic sellers show up, it steps in and buys the dip – automatically. That helps smooth out those gut-wrenching price dumps that meme coins are famous for. Oh, and there&#8217;s a snake-themed game coming too. Win matches, earn $AKE, and spend tokens on in-game gear and tournaments. So instead of just hoping the token moons, you’re actually doing something with it. Imagine if Flappy Bird paid your rent – it’s a bit like that, just less flapping and more slithering. Why Buy $AKE Right Now? Right now, you can snag $AKE for just $0.0000942. That’s couch-cushion money. But we&#8217;ve all seen what happens when a meme coin catches fire. Just ask early $DOGE or $SHIB holders, who are looking at returns of over 30,000% and 800,000%, respectively, since listing. The presale is already gaining momentum with $164K raised and climbing. This isn’t just a hobby project with vibes and a dream. The team’s got a roadmap, audits, and tokenomics that actually make sense. Only 3% of tokens go to the team, and they’re vesting. That’s a far cry from the usual 20%+ cash grabs you see all over new crypto launches. They’re setting aside 30% of the supply for early buyers and using 29% for marketing, which, let’s be real, is the lifeblood of meme coins. Even the best altcoins need eyeballs to grow. The rest goes to liquidity, staking rewards, and community goodies. Speaking of staking, early $AKE holders are seeing annual returns north of 10,000% right now. That number will shrink as more people join, but hey, it’s not every day that your meme coin offers rewards that look like lottery numbers. With strong tokenomics, multichain support, and a game that gives the coin purpose beyond ‘number go up,’ Snaky Way is sliding into some serious potential. Don’t Sleep on the Snake The Snaky Way ($AKE) presale is live, and the stars are lining up. You’ve got meme appeal, gaming utility, and a smart AI system keeping price dips in check. It’s weirdly serious for a meme coin, and that’s exactly why it might surprise everyone when the market starts heating up again. Meme coins usually come down to hype and timing. Snaky Way brings something new to the table: a reason to stay. And if history repeats itself, the next bull run might just crown a new reptilian king. As always, remember this is not financial advice, and do your own research (DYOR) before investing in crypto."
    },
    {
      "title": "Solana’s Pump.Fun Loses Steam With Exit Scam Rumors, LetsBonk.Fun Claims 54% Of Total Market Share",
      "link": "https://www.newsbtc.com/news/solana/solanas-pump-fun-loses-steam/",
      "summary": "Solana meme coin launchpad Pump.fun has lost a significant chunk of its market share to LetsBonk.fun. This comes just ahead of the former’s token generation event, in which the launchpad could raise up to $4 billion. Solana’s Pump.fun Loses Dominance To LetsBonk.fun In an X post, Solana News revealed that Pump.fun has hit a new all-time low with just a 36% market share, while LetsBonk.fun’s market share has surged to 54%. Jup data also confirms this development. At press time, LetsBonk boasts a market share of 48.90%, with a 24-hour trading volume of $539 million. On the other hand, Pump boasts a market share of 39.80%, with a 24-hour trading volume of $438 million. Related Reading: Analyst Says Buying This Meme Coin Is A 3X Leveraged Play If Solana ETFs Go Live This development comes amid Pump.fun’s proposed public token sale, scheduled for July 12. Well-known Solana influencer Lynk has described this token sale as the “final scam” for the meme coin launchpad. The platform has been under heavy criticism for the amount of money that it has extracted from the Solana ecosystem, without incentivizing community members in any way. Some community members had expected Pump.fun to airdrop its token to rewards platform users instead of conducting a public token sale. Lynk shared details of the public sale, with the meme coin launchpad planning to sell the ‘PUMP’ tokens $0.004 each. The token boasts a total supply of 1 trillion, meaning a fully diluted value (FDV) of $4 billion. However, Pump.fun plans to raise around $600 million from the public token sale, as only $150 billion tokens will be available. The meme coin launchpad is expected to also conduct a private sale in order to complete its $1 billion capital raise effort, as earlier reported. LetsBonk.fun To Keep Dominating Pump.fun In an X post, crypto influencer Unipcs, also known as ‘Bonk Guy,’ opined that Pump.fun isn’t done, but that LetsBonk.fun will likely continue to be the industry leader. He predicts that this will be the case for the foreseeable future. He outlined several reasons why he believes this would be the case. Related Reading: Solana Picture Bigger Than $420: Analyst Predicts 140% Surge To New ATHs Firstly, he stated that LetsBonk’s pro-creator, pro-people, pro-Solana ecosystem alignment is a massive strength over Pump.fun. Secondly, Bonk Guy remarked that the strong culture of support within the BONK ecosystem is incredibly hard to replicate by any other platform in a short period. Furthermore, the crypto influencer remarked that Pump.fun had a lot of momentum as a tokenless protocol, especially with a token generation event (TGE). However, LetsBonk.fun was able to flip the platform during this period. As such, Bonk Guy believes that it is hard to see Pump.fun sustainably recover the kind of market share it once had after the TGE event. He also suggested that a “non-negligible amount of activity on Pump.fun is inorganic with a lot os users farming on the platform, hoping that there was going to be an airdrop. As such, the influencer believes that the traffic will dry up once the TGE is over. Featured image from Adobe Stock, chart from Tradingview.com"
    },
    {
      "title": "TRUMP Meme Coin Plants Flag On TRON Network—Details",
      "link": "https://www.newsbtc.com/altcoin/trump-meme-coin-plants-flag-on-tron-network-details/",
      "summary": "Meme coin TRUMP made waves when it launched on Solana on January 17, 2025, issuing 200 million tokens out of a planned supply of 1 billion. Related Reading: Bitcoin Meets Heartbreak In Drake’s Latest Track—Details According to trading data, its price shot from under $10 to a whopping $80 within hours, pushing its fully diluted valuation to nearly $75 billion. But by July 2025, TRUMP had tumbled back to $8.60, a 90% drop from its peak. Its circulating market cap now sits around $1.70 billion, with a fully diluted value of about $8.60 billion. Cross Chain Push Into Tron Based on reports from the project’s official X account, TRUMP plans its first expansion beyond Solana by launching on the Tron blockchain. This move is designed to tap Tron’s large user base and faster transaction speeds. Tron boasts over 100 million accounts and sub‑second confirmations, which the TRUMP team believes could fuel a fresh wave of buyers and traders. $TRUMP on #TRON is coming. Stay tuned! pic.twitter.com/S5WfV8APvU — TrumpMeme (@GetTrumpMemes) July 7, 2025 Volatile Price Swings Define TRUMP TRUMP’s rollercoaster debut underlines extreme volatility. After the initial frenzy in January, the coin’s price plummeted by 88% from $80 to $8.60. That slide erased roughly $65 billion in valuation. Today’s price reflects speculative trading rather than any long‑term adoption. Investors who rode the peak saw massive gains briefly, then steep losses just as quickly. Justin Sun’s Big Stake On May 20, 2025, Tron founder Justin Sun tweeted that he is TRUMP’s largest holder. He reportedly owns nearly $19 million worth of tokens after a $75 million investment in Trump’s World Liberty Financial platform. Sun’s position comes with perks. He won a “private dinner” alongside the top 220 token holders, securing a seat at US President Donald Trump’s Virginia golf club. Critics say that kind of setup blurs the line between crypto hype and pay‑to‑play politics. Related Reading: XRP Could Hit $35 If It Captures A Quarter Of Remittance Market By 2029 Central Control Raises Warnings Two Trump‑affiliated companies, CIC Digital LLC and Fight Fight Fight LLC, control 80% of TRUMP’s token supply. Those tokens are locked under a three‑year vesting schedule. Analysts warn that when insiders hold such large shares, they can sway prices at will. That level of centralization runs counter to crypto’s promise of open and fair systems. Senators Richard Blumenthal, Elizabeth Warren, and Jeff Merkley have called for new rules to curb how politicians and their allies can launch or endorse digital coins. They argue that projects like TRUMP could be used for personal gain or campaign boosts, creating a need for clearer boundaries. Traders And Regulators Brace For Tron Launch As TRUMP eyes a Tron debut, traders and regulators alike will watch closely. The move could spark a fresh surge in trading volume. Yet the same factors that drove its initial spike—viral hype, insider perks, and a heavy token concentration—could just as easily lead to another steep plunge. Featured image from Bankless Times, chart from TradingView"
    },
    {
      "title": "Breakout or Breakdown? XRP $2.35 Test Could Decide Its Next Move",
      "link": "https://www.newsbtc.com/analysis/xrp/xrp-next-move-hinges-on-2-35/",
      "summary": "XRP is showing mixed signals across timeframes, leaving traders on edge as the price approaches the key $2.35 level. While a recent breakout from a falling wedge on the 3-day chart suggests a bullish reversal, the 4-hour chart reveals signs of slowing momentum and a possible rising wedge. With buyers and sellers locked in a battle, $2.35 could be the tipping point that decides whether XRP surges higher or slips into a near-term correction. XRP Breaks Out Of Falling Wedge On 3-Day Chart In an X post, LSplayQ highlighted a key technical development on the XRP 3-day price chart, pointing to a breakout from a falling wedge pattern. This type of pattern is commonly associated with bullish reversals, signaling that market sentiment may be shifting in favor of the bulls. Related Reading: XRP Silent Accumulation: A Falling Wedge On The Verge Of Explosion Following the breakout, XRP is currently trading around $2.26, and according to LSplayQ, the move suggests that buyers are stepping back in to reclaim control. The price action marks a significant shift after an extended period of downward compression within the wedge. If the bullish momentum continues, LSplayQ notes that XRP could target a breakout level near $2.72, which represents an upside potential of roughly 20% from the current price. That said, LSplayQ also warns of the risk of a pullback if XRP fails to hold above the wedge breakout level. In such a scenario, the price could retest the $2.10 zone as a potential support. Overall, the technical outlook leans bullish, as long as XRP maintains its position above the breakout level. Rising Wedge Pattern Signals Caution Ahead In a post on X, The Crypto Bushman pointed out that XRP is pushing higher on the 4-hour chart, but warned that seasoned traders are keeping a close eye on what lies beneath the surface. Related Reading: XRP Price Pops and Drops — Can Bulls Regain Control? According to the analyst, the price is currently trading above both the 20- and 50-day EMAs, which typically signals short-term strength. However, the overall structure appears to be forming a rising wedge, a pattern often linked to potential reversals. At the same time, momentum is beginning to fade, with the MACD flattening and volume tapering off, which Bushman describes as classic signs of a potential trap move. The Crypto Bushman emphasized that a failure to break cleanly above $2.35 could lead to the setup rolling over. In that case, the $2.25 zone becomes a critical level to watch for a possible breakdown and shift in sentiment. On the flip side, a strong breakout backed by volume could fuel another leg up toward $2.50 if buying pressure returns decisively. Featured image from Getty Images, chart from Tradingview.com"
    }
  ],
  "Bitcoin Magazine": [
    {
      "title": "Bow Valley Credit Union in Canada turns on Bitcoin purchases for Albertans",
      "link": "https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Leonardo_Phoenix_10_an_orange_bull_running_through_an_Alberta_3.webp\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/bow-valley-credit-union-in-canada-turns-on-bitcoin-purchases-for-albertans\" rel=\"nofollow\"> </a></p> <p>BVCU’s Bitcoin Gateway, with Balance Custody and Bull Bitcoin API, simplifies buying bitcoin. “Facilitates institutional adoption,” says Francis Pouliot. </p> <p>"
    },
    {
      "title": "KULR Secures $20M Bitcoin-Backed Credit Facility from Coinbase Credit",
      "link": "https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/KULR-Secures-20M-Bitcoin-Backed-Credit-Facility-from-Coinbase-Credit.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/kulr-secures-20m-bitcoin-backed-credit-facility-from-coinbase-credit\" rel=\"nofollow\"> </a></p> <p>The deal sets up a multi-draw loan facility worth up to $20 million to expand its Bitcoin holdings.</p> <p>"
    },
    {
      "title": "Sequans Closes $384 Million Investment To Launch Bitcoin Treasury Initiative",
      "link": "https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Sequans-Closes-384-Million-Investment-To-Launch-Bitcoin-Treasury-Initiative.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/sequans-closes-384-million-investment-to-launch-bitcoin-treasury-initiative\" rel=\"nofollow\"> </a></p> <p>Sequans Communications, a fabless semiconductor company focusing on 5G/4G IoT semiconductor technology, has officially closed a $384 million strategic investment to kick off its Bitcoin treasury initiative. The deal combines $195 million in equity financing and $189 million in secured convertible debentures, reflecting growing institutional appetite for Bitcoin. The Offering included the sale of over [&#8230;]</p> <p>"
    },
    {
      "title": "Metaplanet Enters ‘Bitcoin Gold Rush’ with Plans to Buy 210,000 BTC by 2027",
      "link": "https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/Metaplanet-Enters-Bitcoin-Gold-Rush-with-Plans-to-Buy-210000-BTC-by-2027.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/metaplanet-enters-bitcoin-gold-rush-with-plans-to-buy-210000-btc-by-2027\" rel=\"nofollow\">Metaplanet Enters &#8216;Bitcoin Gold Rush&#8217; with Plans to Buy 210,000 BTC by 2027</a></p> <p>Japan’s top bitcoin treasury firm aims to grow its holdings to 210,000 BTC by 2027 and wants to use its growing reserves to buy cash-generating businesses.</p> <p>"
    },
    {
      "title": "Ego Death Capital Closes $100 Million Raise to Scale Bitcoin Companies",
      "link": "https://bitcoinmagazine.com/news/ego-death-capital-closes-100-million-raise-to-scale-bitcoin-companies",
      "summary": "<p><a href=\"https://bitcoinmagazine.com\" rel=\"nofollow\"> </a><br /> <img src=\"https://bitcoinmagazine.com/wp-content/uploads/2025/07/EGO-DEATH-CAPITAL.jpg\" style=\"display: block; margin: 1em auto;\" /><br /> <a href=\"https://bitcoinmagazine.com/news/ego-death-capital-closes-100-million-raise-to-scale-bitcoin-companies\" rel=\"nofollow\"> </a></p> <p>Ego Death Capital has closed its second fund, totaling $100 million, to invest exclusively in software companies building businesses on the Bitcoin protocol. The firm is positioning itself as a lead Series A investor in an ecosystem where scalable, Bitcoin-native firms are beginning to achieve positive cash flow. &#8220;We&#8217;re in Bitcoin, investing in true companies [&#8230;]</p> <p>"
    }
  ],
  "Decrypt": [
    {
      "title": "Trump Media Files for 'Crypto Blue Chip' ETF Holding Bitcoin, Ethereum, Solana and XRP",
      "link": "https://decrypt.co/329081/trump-media-files-blue-chip-etf-bitcoin-ethereum-solana-xrp",
      "summary": "Trump Media and Technology Group is looking to launch another Truth Social-branded crypto ETF for Bitcoin, Ethereum, XRP, and more."
    },
    {
      "title": "Crypto Treasury ReserveOne Eyes Nasdaq Listing Via $1 Billion SPAC Deal",
      "link": "https://decrypt.co/329083/reserveone-eyes-nasdaq-listing-1-billion-spac-deal",
      "summary": "The company’s board of directors includes names from Coinbase, Binance, and Trump’s first administration."
    },
    {
      "title": "CRYPTO DIPS THEN RECOVERS, PUMPFUN PLANS TOKEN SALE, TARIFF HEADLINES RETURN",
      "link": "https://decrypt.co/videos/interviews/fklwKOPc/crypto-dips-then-recovers-pumpfun-plans-token-sale-tariff-headlines-return",
      "summary": "Crypto dips on tariff letters, then recovers. ETH outperforms, altcoins weak after PumpFun news. PumpFun plans $600m token sale, $4b valuation. Trump admin to publish crypto report on July 22. US government deposits $218k ETH to Coinbase. Robinhood speaking to US on tokenised shares. Truth Social files for Blue Chip crypto ETF. US drops appeal in Tornado Cash lawsuit. Strategy to raise $4.2b equity to buy BTC. Semler Scientific buys $20m BTC. Bit Digital pivots to ETH treasury, stock pumps. Tokenized assets on ETH hit $5b. Metaplanet to use BTC as collateral for M&amp;A. XRP CEO to testify before senate on legislation. SEC asks firms to amend SOL ETF applications. HK crypto stocks soar on stablecoin momentum. BBVA opens BTC, ETH trading for Spanish retail. El Salvador bought $800k BTC last week"
    },
    {
      "title": "Bitcoin Volatility Hovers Near Historical Low, but 'Beware the Quiet,' Analysts Warn",
      "link": "https://decrypt.co/329046/bitcoin-volatility-hovers-near-historical-low-but-beware-the-quiet-analysts-warn",
      "summary": "The QCP Capital analysts warned that Q3-Q4 could bring \"fireworks\" as ETF inflows create a supply squeeze."
    },
    {
      "title": "Robinhood CEO Wants 'Thousands' of Private Companies Tokenized on Platform",
      "link": "https://decrypt.co/329075/robinhood-ceo-thousands-private-companies-tokenized",
      "summary": "OpenAI denounced Robinhood’s offering of its private stock as a crypto token, but the trading app wants to add thousands more to its roster."
    }
  ],
  "CryptoBriefing": [
    {
      "title": "ProShares’ XRP futures ETF listed on DTCC under ticker UXRP",
      "link": "https://cryptobriefing.com/proshares-xrp-etf-dtcc-listing/",
      "summary": "<p>The listing of ProShares' XRP futures ETF on DTCC suggests growing institutional interest and potential market expansion for crypto ETFs.</p> <p>"
    },
    {
      "title": "Amplifi partners with AIAPE to expand AI agent capabilities",
      "link": "https://cryptobriefing.com/amplifi-aiape-ai-agent-partnership-crypto-trading/",
      "summary": "<p>This partnership could enhance AI-driven trading efficiency, potentially reshaping digital asset markets and influencing future AI integrations.</p> <p>"
    },
    {
      "title": "Cardano Foundation unveils blockchain-based tool to simplify audit compliance and enhance financial reporting",
      "link": "https://cryptobriefing.com/blockchain-esg-compliance-cardano-reeve/",
      "summary": "<p>Cardano's blockchain tool could revolutionize audit compliance, boosting transparency and trust across various sectors and enhancing ESG efforts.</p> <p>"
    },
    {
      "title": "Trump’s Truth Social files S-1 for Crypto Blue Chip ETF holding BTC, ETH, XRP, SOL, and CRO",
      "link": "https://cryptobriefing.com/crypto-blue-chip-etf-launch/",
      "summary": "<p>The launch of a crypto ETF by Truth Social could significantly influence mainstream adoption and regulatory perspectives on digital assets.</p> <p>"
    },
    {
      "title": "Government-backed Sequans secures $384M to kick off Bitcoin treasury initiative, stock jumps 60% pre-market",
      "link": "https://cryptobriefing.com/sequans-bitcoin-treasury-initiative/",
      "summary": "<p>Sequans' Bitcoin initiative may boost its financial resilience and shareholder value, potentially influencing other tech firms to explore crypto.</p> <p>"
    }
  ],
  "AMBcrypto": [
    {
      "title": "Solana’s DeFi milestone: TVL soars to $17.5B with new protocol leaders",
      "link": "https://ambcrypto.com/solanas-defi-milestone-tvl-soars-to-17-5b-with-new-protocol-leaders/",
      "summary": "<img alt=\" \" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Samyukhtha-16.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />JTO, KMNO, and Jupiter drive the surge as retail and yield farmers fuel the flywheel."
    },
    {
      "title": "Solana active addresses hit new high – So why is SOL still falling?",
      "link": "https://ambcrypto.com/solana-active-addresses-hit-new-high-so-why-is-sol-still-falling/",
      "summary": "<img alt=\"Solana active addresses hit new high - So why is SOL still falling?\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Abdul_20250708_123742_0000.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />SOL active addresses surge, but price slips despite on-chain spike."
    },
    {
      "title": "MSTR stock dips 2% – Is Strategy’s Bitcoin bet still paying off?",
      "link": "https://ambcrypto.com/mstr-stock-dips-2-is-strategys-bitcoin-bet-under-pressure/",
      "summary": "<img alt=\"MSTR stock slides\" class=\"attachment-full size-full wp-post-image\" height=\"734\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/MSTR-stock-slides.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1305\" />Everyone’s watching MSTR’s next move, will $14B in Bitcoin gains be enough to silence critics?"
    },
    {
      "title": "1,140 ETH moved after 10 years – Will Ethereum prices react?",
      "link": "https://ambcrypto.com/1140-eth-moved-after-10-years-will-ethereum-prices-react/",
      "summary": "<img alt=\"Ethereum\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Erastus-2025-07-08T114601.648-min.png\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />Despite headline moves, Ethereum’s on-chain data reflects bullish signals and rising community engagement."
    },
    {
      "title": "Bitcoin miners stock up, BTC slows: History points to what’s coming next",
      "link": "https://ambcrypto.com/bitcoin-miners-stock-up-btc-slows-history-points-to-whats-coming-next/",
      "summary": "<img alt=\"\" class=\"attachment-full size-full wp-post-image\" height=\"1080\" src=\"https://ambcrypto.com/wp-content/uploads/2025/07/Gladys-32.webp\" style=\"float: left; margin: 0 15px 15px 0;\" width=\"1920\" />What will miners do next? Hold or sell?"
    }
  ]
}